{
    "41ev7": "MD2",
    "5-S-B": "MD4 from File",
    "6wtIW": "MD2 (Message-Digest Algorithm 2) is a cryptographic hash function that takes an input and produces a 128-bit (16-byte) hash value. It was developed by Ronald Rivest in 1989 as a successor to MD1. MD2 is optimized for 8-bit computers and is relatively simple compared to other hash functions. However, MD2 has been shown to be vulnerable to collision attacks, and is no longer considered secure for cryptographic purposes. MD2 is still used in some applications, but is being phased out in favor of more secure hash functions such as SHA-256 and SHA-3.",
    "70PnM": "MD4",
    "7gKzt": "MD4 (Message-Digest Algorithm 4) is a cryptographic hash function that takes an input and produces a 128-bit (16-byte) hash value. It was developed by Ronald Rivest in 1990 as a successor to MD2 and MD3. However, MD4 has been shown to be vulnerable to collision attacks, and is no longer considered secure for cryptographic purposes. MD4 is still used in some applications, but is being phased out in favor of more secure hash functions such as SHA-256 and SHA-3.",
    "AWqXD": "MD5",
    "E88Ej": "Click here to encrypt your input text",
    "ECm8j": "Click here to encrypt your input text",
    "IP8-V": "MD2 from Text",
    "IPtV": "MD4 from Text",
    "P56UK": "Click here to encrypt your input text",
    "PJNze": "Click here to encrypt your input text",
    "REFy8": "Click here to encrypt your input text",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "All Tools",
    "eNNrM": "MD2 from File",
    "g0QB9": "The MD5 message-digest algorithm is a widely used hash function producing a 128-bit hash value. MD5 was designed by Ronald Rivest in 1991 to replace an earlier hash function MD4,[3] and was specified in 1992 as RFC 1321. MD5 can be used as a checksum to verify data integrity against unintentional corruption. Historically it was widely used as a cryptographic hash function; however it has been found to suffer from extensive vulnerabilities. It remains suitable for other non-cryptographic purposes, for example for determining the partition for a particular key in a partitioned database, and may be preferred due to lower computational requirements than more recent Secure Hash Algorithms.[4]",
    "gh9zA": "SHA-1 or Secure Hash Algorithm 1 is a cryptographic algorithm which takes an input and produces a 160-bit (20-byte) hash value.",
    "gh9zA.sha224": "SHA-224 is a cryptographic hash function that takes an input and produces a 224-bit (28-byte) hash value. It is part of the SHA-2 family of hash functions, which also includes SHA-256, SHA-384, and SHA-512. SHA-224 is designed to be more secure than its predecessor, SHA-1, which has been shown to be vulnerable to collision attacks. SHA-224 is widely used in digital signatures, message authentication codes, and other applications where data integrity is critical.",
    "gh9zA.sha256": "SHA-256 is a cryptographic hash function that takes an input and produces a 256-bit (32-byte) hash value. It is part of the SHA-2 family of hash functions, which also includes SHA-224, SHA-384, and SHA-512. SHA-256 is designed to be more secure than its predecessor, SHA-1, which has been shown to be vulnerable to collision attacks. SHA-256 is widely used in digital signatures, message authentication codes, and other applications where data integrity is critical.",
    "gh9zA.sha384": "SHA-384 is a cryptographic hash function that takes an input and produces a 384-bit (48-byte) hash value. It is part of the SHA-2 family of hash functions, which also includes SHA-224, SHA-256, SHA-512, SHA-512/224, and SHA-512/256. SHA-384 is designed to be more secure than its predecessor, SHA-1, which has been shown to be vulnerable to collision attacks. SHA-384 is widely used in digital signatures, message authentication codes, and other applications where data integrity is critical.",
    "gh9zA.sha512": "SHA-512 is a cryptographic hash function that takes an input and produces a 512-bit (64-byte) hash value. It is part of the SHA-2 family of hash functions, which also includes SHA-224, SHA-256, SHA-384, SHA-512/224, and SHA-512/256. SHA-512 is designed to be more secure than its predecessor, SHA-1, which has been shown to be vulnerable to collision attacks. SHA-512 is widely used in digital signatures, message authentication codes, and other applications where data integrity is critical.",
    "gwo79": "SHA1 from File",
    "gwo79.sha224": "SHA224 from File",
    "gwo79.sha256": "SHA256 from File",
    "gwo79.sha384": "SHA384 from File",
    "gwo79.sha512": "SHA512 from File",
    "jjhid": "this is hello, world",
    "m0105": "Codec",
    "m0106": "Converter",
    "m0107": "Generator",
    "m0108": "Formatter",
    "m0109": "Docs Center",
    "o3poi": "SHA1 from Text",
    "o3poi.sha224": "SHA224 from Text",
    "o3poi.sha256": "SHA256 from Text",
    "o3poi.sha384": "SHA384 from Text",
    "o3poi.sha512": "SHA512 from Text",
    "pl8S6": "Click here to encrypt your input text",
    "qjQvD": "Click here to encrypt your input text",
    "vQq9v": "MD5 from Text",
    "vhgr3": "Click here to select a file and directly encrypt it.",
    "vu10K": "MD5 from File",
    "wqp_4": "Click here to select a file and directly encrypt it.",
    "y_2Q1": "Encode and Decode",
    "y_2Q2": "Symmetric Crypto",
    "y_2Q3": "Asymmetric Crypto",
    "y_2Q4": "China National Algorithms",
    "y_2Q5": "Web Auth",
    "y_BN6": "Digest Algorithm"
}