{
    "JSON-Advantages-011": "JSON, как правило, меньше по размеру и быстрее анализируется, чем XML, что делает его идеальным для связи клиент-сервер, где пропускная способность и скорость имеют решающее значение.",
    "JSON-Basics-001": "Что такое JSON?",
    "JSON-Beautifier-Online": "Онлайн-форматер и валидатор JSON",
    "JSON-Beautify-007": "Что такое украшение JSON?",
    "JSON-Beautify-Def-008": "Украшение JSON — это процесс форматирования данных JSON в более удобочитаемую форму с правильными отступами и разрывами строк, что упрощает анализ и отладку.",
    "JSON-Beautify-Example-009": "До: '{\\\"ключ\\\":\\\"значение\\\",\\\"массив\\\":[1,2,3]}', После: '{\\n \\\"ключ\\\": \\\"значение\\\", \\n \\\"массив\\\": [\\n 1,\\n 2,\\n 3\\n ]\\n}'",
    "JSON-Def-002": "JSON (нотация объектов JavaScript) — это легкий текстовый формат обмена данными, который легко читать и писать людям, а машинам легко анализировать и генерировать.",
    "JSON-Path-013": "Что такое путь JSON?",
    "JSON-Path-Example-015": "$.store.book[0].title выбирает название первой книги в объекте JSON с магазином, содержащим массив книг.",
    "JSON-Path-Explanation-014": "JSON Path — это язык запросов, аналогичный XPath для XML, позволяющий извлекать данные из документов JSON, используя нотацию, подобную пути.",
    "JSON-Path-Guide": "JSONPath — XPath для JSON.",
    "JSON-Purpose-003": "Он в основном используется для передачи данных между сервером и веб-приложением в качестве альтернативы XML, со встроенной поддержкой JavaScript через методы JSON.parse() и JSON.stringify().",
    "JSON-Syntax-004": "Каков основной синтаксис JSON?",
    "JSON-Syntax-Reference": "Веб-документы MDN в формате JSON",
    "JSON-Value-Types-006": "Значения могут быть строками, числами, логическими значениями, массивами (заключенными в квадратные скобки).",
    "JSON-vs-XML-010": "Чем JSON отличается от XML?",
    "JSON-vs-XML-Article": "Сравнение JSON и XML",
    "XML-Advantages-012": "XML обеспечивает большую гибкость структуры и поддерживает пространства имен, что может быть полезно для сложных структур документов и обеспечения совместимости между системами."
}