[{"Id":"all","Label":["cPS6q","All Tools"],"SubCategories":[]},{"Id":"codec","Label":["m0105","Codec"],"SubCategories":[{"Id":"codec.Digest_Algorithm","Label":["y_BN6","Digest Algorithm"],"Icon":"segmented-control","ChildrenIdSet":["_"],"ChildrenSetByInit":[{"Id":"md5","Label":["AWqXD","MD5"],"Description":["g0QB9","The MD5 message-digest algorithm is a widely used hash function producing a 128-bit hash value. MD5 was designed by Ronald Rivest in 1991 to replace an earlier hash function MD4,[3] and was specified in 1992 as RFC 1321. MD5 can be used as a checksum to verify data integrity against unintentional corruption. Historically it was widely used as a cryptographic hash function; however it has been found to suffer from extensive vulnerabilities. It remains suitable for other non-cryptographic purposes, for example for determining the partition for a particular key in a partitioned database, and may be preferred due to lower computational requirements than more recent Secure Hash Algorithms.[4]"]},{"Id":"sha1","Label":["TtyeA","SHA1"],"Description":["gh9zA","SHA-1 or Secure Hash Algorithm 1 is a cryptographic algorithm which takes an input and produces a 160-bit (20-byte) hash value."]},{"Id":"sha256","Label":["TtyeA.sha256","SHA256"],"Description":["gh9zA.sha256","SHA-256 is a cryptographic hash function that takes an input and produces a 256-bit (32-byte) hash value. It is part of the SHA-2 family of hash functions, which also includes SHA-224, SHA-384, and SHA-512. SHA-256 is designed to be more secure than its predecessor, SHA-1, which has been shown to be vulnerable to collision attacks. SHA-256 is widely used in digital signatures, message authentication codes, and other applications where data integrity is critical."]},{"Id":"sha512","Label":["TtyeA.sha512","SHA512"],"Description":["gh9zA.sha512","SHA-512 is a cryptographic hash function that takes an input and produces a 512-bit (64-byte) hash value. It is part of the SHA-2 family of hash functions, which also includes SHA-224, SHA-256, SHA-384, SHA-512/224, and SHA-512/256. SHA-512 is designed to be more secure than its predecessor, SHA-1, which has been shown to be vulnerable to collision attacks. SHA-512 is widely used in digital signatures, message authentication codes, and other applications where data integrity is critical."]}]},{"Id":"codec.Encode_and_Decode","Label":["y_2Q1","Encode and Decode"],"Icon":"widget-button","ChildrenIdSet":["_"],"ChildrenSetByInit":[]},{"Id":"codec.Symmetric_Crypto","Label":["y_2Q2","Symmetric Crypto"],"Icon":"exchange","ChildrenIdSet":["_"],"ChildrenSetByInit":[]},{"Id":"codec.Asymmetric_Crypto","Label":["y_2Q3","Asymmetric Crypto"],"Icon":"exchange","ChildrenIdSet":["_"],"ChildrenSetByInit":[]},{"Id":"codec.SM_Algorithm","Label":["y_2Q4","China National Algorithms"],"Icon":"lock","ChildrenIdSet":["_"],"ChildrenSetByInit":[]},{"Id":"codec.Web_Auth","Label":["y_2Q5","Web Auth"],"Icon":"shield","ChildrenIdSet":["_"],"ChildrenSetByInit":[]}]},{"Id":"convertor","Label":["m0106","Converter"],"SubCategories":[]},{"Id":"generator","Label":["m0107","Generator"],"SubCategories":[]},{"Id":"formatter","Label":["m0108","Formatter"],"SubCategories":[]},{"Id":"docs","Label":["m0109","Docs Center"],"SubCategories":[]}]