{
    "": "Nachricht: {0}",
    "-8l11": "Kopiert",
    "-DqwwR": "Vorgang abgeschlossen.",
    "-GJ_72": "Zum ausgewählten Arbeitsbereich {0} gewechselt",
    "-Jx4J": "Lokales Konto",
    "-Rj3y": "Themen",
    "-XZnW": "Zurück",
    "-Yo129I": "Textwerkzeuge",
    "-nE6n": "SQL verschönern",
    "01do0y": "Kannada",
    "04SSf": "Passwort vergessen?",
    "07naT": "Fehler: {0}",
    "07ui6": "Mehr Info",
    "0Ceqru": "Base64 ist eine Notation zur Kodierung beliebiger Bytedaten mithilfe eines eingeschränkten Satzes von Symbolen, die bequem von Menschen verwendet und von Computern verarbeitet werden können.",
    "0MO3jj": "MD5 (Message-Digest 5) ist eine weit verbreitete Hash-Funktion. Es wurde in einer Vielzahl von Sicherheitsanwendungen eingesetzt und wird auch häufig zur Überprüfung der Integrität von Dateien verwendet. Allerdings ist MD5 nicht kollisionssicher und eignet sich nicht für Anwendungen wie SSL/TLS-Zertifikate oder digitale Signaturen, die auf dieser Eigenschaft basieren.",
    "0PgZ_": "Übersetzung",
    "0gvcN": "Willkommen auf der Übersichtsseite, sie befindet sich noch in der Entwicklung.",
    "0gywa": "Der Arbeitsbereich wurde nicht gefunden. Sie werden zur Indexseite des Arbeitsbereichs weitergeleitet.",
    "0pfdz7": "Usbekisch",
    "123e4567": "Was ist Base64?",
    "13pmE": "Unterstütze uns",
    "1507oa": "Bengali",
    "1JOFP": "Öffnen Sie „Mein Arbeitsbereich“.",
    "1NTgQ": "Arbeitsbereich öffnen",
    "1Npez": "Bitte geben Sie den Pfad an",
    "1Tuab": "Kopiert",
    "1X8x7": "Beispiel",
    "1X8x7q": "JSON Verschönern",
    "1Xe8x7": "CSS-Verschönerung",
    "1YmJc": "Wählen Sie eine der Optionen als Ihre bevorzugte Sprache:",
    "1a2b3c4d": "Warum Base64 verwenden?",
    "1a3Sc": "Laden abbrechen",
    "1bd": "Arbeitsablauf",
    "1e3e5n": "Hausa",
    "1h6jH": "Achtung, die Ausgabe ist leer!",
    "1j62a": "Tun Sie dies zu einem anderen Zeitpunkt",
    "1jj0ri": "japanisch",
    "1k_44": "Dieser Vorgang dekodiert Daten aus einer ASCII-Base64-Zeichenfolge zurück in ihr Rohformat.",
    "1th2nw": "Singhalesisch",
    "1yIQu": "Sie können versuchen, Ihre Aktion erneut zu verarbeiten, oder auf die Schaltfläche unten klicken, um den Fehler zu verwerfen.",
    "20nmcv": "Latein",
    "22XLF": "Noch nicht fertig",
    "23fgh456": "Geschichte von Base64",
    "24vLI": "Erstellt",
    "27j7sy": "Shona",
    "2D9a6": "Passwort vergessen?",
    "2D9qdk6": "Ist es sicher genug?",
    "2IF6A": "Es sieht so aus, als ob beim Forge-Save-Speicher ein Problem aufgetreten ist",
    "2JyFN": "Ergebnis in die Zwischenablage kopieren",
    "2Ocbey": "Ausführung",
    "2RhAT": "Es sieht so aus, als ob beim Fake-Abrufprozess ein Problem aufgetreten ist",
    "2Ruh6": "Erstellen Sie ein neues lokales Konto",
    "2S5ap": "Vollbildmodus umschalten",
    "2Ul6y": "XML verschönern",
    "2Y1mR": "Klartext",
    "2bcde3fg": "Nachteile von Base64",
    "2bqHk": "Lade von der Datei",
    "2e4fb7": "Igbo",
    "2giYv": "Testpasswort: {0}",
    "2khdsv": "Paschtu",
    "2lehqwp": "Vietnamesisch",
    "2lhcqwp": "Türkisch",
    "2lhqqwp": "Indonesisch",
    "2lhqqwqp": "malaiisch",
    "2lhqwwp": "Thailändisch",
    "2qdin8": "Bitte den Bestätigungscode eingeben",
    "2tib5m": "Schwedisch",
    "2ybu7j": "norwegisch",
    "30eo2v": "Gujarati",
    "32D9a6": "Ein Konto erstellen",
    "33RXi": "Der Antrag wurde aufgrund unbefriedigender Parameter abgelehnt.",
    "346qid": "Russisch",
    "34wxyz56": "Wie kodiere/dekodiere ich Base64 in JavaScript?",
    "39dsCt": "Wenn dies der Fall ist, erhalten Sie eine aktuelle Benachrichtigung von den App-Diensten.",
    "3ii2tt": "Schottisches Gälisch",
    "3umnB": "Unbekanntes Token",
    "441oja": "georgisch",
    "44Ntqw-": "Abwicklung der Operation.",
    "46bksi": "litauisch",
    "4K_vhq": "Duplizieren Sie diese Registerkarte",
    "4PIqD": "Code-Review",
    "4UYIJ": "Noch nicht fertig.",
    "4cGA_": "Daten für Systemeinstellungen werden abgerufen...",
    "4hijk5lm": "Größenzunahme: Kodierte Daten sind etwa 33 % größer als die ursprünglichen Binärdaten.",
    "4kKe4": "Ihr Passwort",
    "4tqb4x": "ungarisch",
    "4vdfwf": "OK",
    "4wlih": "Der Antrag wurde aufgrund unbefriedigender Parameter abgelehnt.",
    "52OiQ": "{0} Mal kopiert",
    "54cwb": "Die System-Websocket-API hat einen Fehler festgestellt: {0}",
    "56ibcj": "Vietnamesisch",
    "58HQX": "Wenn Sie den Wert nicht kennen, wenden Sie sich bitte an Ihren Administrator, um weitere Einzelheiten zu erfahren. Diese finden Sie in seinen Einstellungen.",
    "5BOhl": "Einladungscode",
    "5Ih2u": "Tools-Navigator",
    "5NCPT": "Dunkler Modus",
    "5NJeGsu1": "Mit E-Mail können Sie ganz einfach Ihren Posteingang organisieren, Nachrichten verfassen und senden und den Überblick über Ihre Korrespondenz behalten. Bisher wird es nur als Kommunikationstool zwischen Benutzern und unserem Team verwendet.",
    "5NJeddqGsu1": "Dieser Abschnitt enthält Computermaterialien, Wiki-Artikel, Benutzerhandbücher und mehr.",
    "5NJedqddqGsu1": "Dieser Abschnitt enthält Computerressourcen, die zum Erstellen eigener Projekte verwendet werden können.",
    "5Perd": "Leider ist die Funktion „Smart Editor verwenden“ noch nicht verfügbar. Wir arbeiten noch an der Umsetzung. Vielen Dank für Ihre Geduld.",
    "5ZBYR": "Zurück",
    "5dF7o": "Aktualisierung",
    "5e6f7g8h": "Base64 wird verwendet, wenn Binärdaten über textbasierte Protokolle wie E-Mail oder JSON übertragen oder an Stellen eingebettet werden müssen, an denen nur Text zulässig ist.",
    "5eXVS": "Skriptinhalt",
    "5ggegx": "Koreanisch",
    "5lW8qp": "Zeigen Sie ein Beispiel für dieses Tool",
    "5q-Zxqa": "Skriptmanager",
    "5qPOJL": "Um LafTools zu unterstützen, sollten Sie in Erwägung ziehen, entweder unserem Repository auf GitHub einen Stern zu geben oder über ein monatliches Abonnement ein Upgrade auf unsere professionelle Version durchzuführen. Wir würden uns über Ihre Hilfe sehr freuen und versprechen, dass LafTools mit den gesammelten Mitteln noch besser wird.",
    "5qV5Sf": "Entfernen Sie diesen Datensatz aus der Liste",
    "5rg5mt": "Madagassisch",
    "5srFq": "LafTools",
    "5v8jl7": "Hmong",
    "6AumW": "Standardaktion",
    "6ClPV": "Erstellen",
    "6hsnqWe": "Obwohl LafTools kostenlos und Open Source ist, erfordert die Wartung dennoch viel Zeit und Energie. Insbesondere benötigen wir Mittel, um bestimmte Cloud-APIs zu bezahlen. Wenn Sie LafTools schätzen, denken Sie bitte darüber nach, uns zu unterstützen.",
    "6j13s3": "isländisch",
    "6nopqrst": "Keine Verschlüsselung: Base64 ist keine Verschlüsselungsmethode; Es ist leicht zu entschlüsseln und bietet keine Sicherheit.",
    "6qT9d-N": "Für das Notebook stellt LafTools nicht nur einen Shell-Befehlsmanager bereit, sondern wird in naher Zukunft auch leistungsstarke Notiztools wie MarkDown, Latex, {0} usw. hinzufügen.",
    "6ulj8i": "Nepali",
    "6yOXx": "Unbekannter Name",
    "71x7x": "Quellcode auf GitHub",
    "78abcdef": "JavaScript bietet integrierte Funktionen wie btoa() und atob() für die Base64-Kodierung bzw. -Dekodierung.",
    "78ijk9lm": "Base64 wurde erstmals in RFC 1421 (1993) definiert und später in RFC 4648 (2006) standardisiert.",
    "7MOO1": "Anmelden",
    "7dm0d8": "Traditionelles Chinesisch",
    "7g5w22": "norwegisch",
    "7k56u3": "galizisch",
    "7q40W": "Der Administrator konnte nicht initialisiert werden",
    "7u4vzu": "slowakisch",
    "7x3f6": "Neuer Tab – 1",
    "82r0C": "Verwalten Sie Ihre TODO-Liste und erledigen Sie Ihre Aufgaben effizienter.",
    "83dNp": "Die Erweiterungs-ID konnte nicht geladen werden. (REF: 1dl1f)",
    "8LdRj": "Überblick",
    "8LdRjq": "Berechnen",
    "8LdevRj": "Service",
    "8M1wY": "Lokales Terminal",
    "8eeL1Kk": "Um",
    "8mn_qa": "Abrufen der Daten von Terminaldiensten...",
    "8qzWJu": "Leider unterstützen wir derzeit noch keine Geräte mit kleinem Bildschirm. Bitte nutzen Sie den PC, um diese Seite zu besuchen.",
    "8veXac": "Zeit ist die wertvollste Ressource, gehen Sie mit Bedacht damit um.",
    "97um9v": "hawaiisch",
    "9Xv8-": "Als Notiz speichern",
    "9_qaj": "Verlassen Sie dieses Formular",
    "9e4fcl": "Tamilisch",
    "9eZHM": "Hoppla! Es scheint, dass wir auf einige Warnungen oder Fehler stoßen.",
    "9gqo8x": "lettisch",
    "9i0j1k2l": "Es wird auch zum direkten Einbetten kleiner Bilder als Daten-URLs in HTML oder CSS verwendet.",
    "9m85mf": "Sesotho",
    "9qy1xn": "Portugiesisch",
    "9tbbkt": "finnisch",
    "9zCSc": "Keine verfügbaren Arbeitsbereiche",
    "A69UZ": "Variablen",
    "AVUvu": "Base62 ist eine Notation zum Kodieren beliebiger Bytedaten mithilfe eines eingeschränkten Satzes von Symbolen, die bequem von Menschen verwendet und von Computern verarbeitet werden können. Die hohe Zahlenbasis führt zu kürzeren Zeichenfolgen als beim Dezimal- oder Hexadezimalsystem.",
    "AW9N8": "Eingabebereich",
    "AfPC0": "Ihr Klartext-Passwort",
    "Ahrjc": "Das Verzeichnis existiert nicht. Möchten Sie es erstellen?",
    "AkXgF": "In Bearbeitung: {0} %",
    "Apx8D": "Wie setze ich mein Passwort manuell zurück?",
    "B0s0z": "Zweck dieser Seite:",
    "BGd7P9": "Dieser Vorgang kodiert Rohdaten in eine ASCII-Base64-Zeichenfolge.",
    "BGd7dP9": "Dieser Vorgang kodiert Rohdaten in eine ASCII-{0}-Zeichenfolge.",
    "BGdd7dP9": "Dieser Vorgang kodiert Rohdaten in eine ASCII-{0}-Zeichenfolge.",
    "BLAKE2-021": "BLAKE2 ist eine weitere moderne Alternative, die im Vergleich zu SHA-2 höhere Geschwindigkeiten bietet und gleichzeitig ein hohes Sicherheitsniveau beibehält. Es bietet mehrere Varianten, darunter BLAKE2b und BLAKE2s.",
    "BLAKE2_Info-023": "BLAKE2-Info",
    "BShq3M": "Probleme",
    "BW3bpT": "Die Datei wird von der Festplatte gelesen...",
    "Bd9h-": "Füge es zu meiner Lieblingssammlung hinzu",
    "BuihG": "Systemeinstellungen",
    "CASef": "Okay, der Vorgang wird ausgelöst.",
    "CEv8B": "Möchten Sie diesen Eintrag wirklich entfernen? Wenn ja, klicken Sie erneut auf diese Schaltfläche.",
    "CFg8B": "Die Größe muss zwischen 0 und 512 liegen",
    "CVUl0": "LafTools",
    "CWoqhy": "Exts-Liste nach ausgewählter CategoryID",
    "CfZAX": "Die Datei {0} wurde ausgewählt. Wir laden sie in den Kerndienst hoch.",
    "CidOqAZ": "Als Gründer von LafTools bin ich so berührt, dass Sie bereit sind, uns zu unterstützen. Wir haben gute Leute in unserem Team, die hart daran arbeiten, LafTools kontinuierlich zu verbessern.",
    "Cide2w": "Um zu sehen, ob bei der Ausführung Ihrer Aktion ein Problem auftritt.",
    "DIQFq": "Bitte überprüfen Sie, ob der URL-Parameter ordnungsgemäß angegeben wurde. Offenbar verfügen Sie nicht über die Berechtigung zum Ausfüllen dieses Formulars. Standardmäßig wird die folgende Meldung in der Ausgabe des Dienstes angezeigt, wenn dieser gerade gestartet wurde.",
    "DIweGq": "Sichern Sie Ihre LafTools",
    "DTTPW": "Status zurücksetzen",
    "DVoKw": "Melden Sie sich von diesem System ab",
    "DadYp": "Echtzeit-Entprellung",
    "DqFI5": "Die Ebenen müssen größer als 0 sein",
    "DrXAq": "Willkommen bei LafTools!",
    "DrbEr": "Das von Ihnen angegebene Passwort ist leer. Bitte überprüfen Sie es und versuchen Sie es erneut.",
    "DtlAc": "Laden von Systemressourcen",
    "Dxlw0": "Vollständig",
    "E62ej": "Shell-Befehle filtern",
    "E6F9B": "Fügen Sie es dem Workflow hinzu",
    "EEQkeW": "Der MD6-Algorithmus (Message-Digest 6) ist eine kryptografische Hash-Funktion. Es verwendet eine Merkle-Baumstruktur, um eine umfangreiche parallele Berechnung von Hashes für sehr lange Eingaben zu ermöglichen.",
    "ERK7E": "Wenn Sie bei der Verwendung von LafTools auf ein Problem stoßen oder Vorschläge haben, können Sie uns jederzeit per E-Mail oder GitHub kontaktieren. Wir helfen Ihnen gerne weiter.",
    "EgBXL": "Wählen Sie Tags aus oder stellen Sie sie bereit.",
    "Ewvgo": "Noch nicht angefangen.",
    "ExqvX": "Hotkeys-Liste",
    "Eyq856": "Wir sind noch nicht fertig – wir sind bestrebt, die neuesten und besten Funktionen bereitzustellen, und wir werden weiterhin Updates veröffentlichen, um sicherzustellen, dass Sie das bestmögliche Erlebnis haben.",
    "F-OUm": "Schnelle Einrichtung für LafTools",
    "F0CCF": "HotKeys-Liste",
    "F4uS2": "Neue Datei",
    "FBVyc": "Bitte geben Sie den Bestätigungscode erneut ein",
    "FDlRI": "Benennen Sie diese neue Registerkarte und klicken Sie, um sie zu bestätigen.",
    "FOyHW": "Überall suchen",
    "FQzhg": "Leere Eingabe ignorieren",
    "FYRoL": "Einrückt und verschönert Cascading Style Sheets (CSS)-Code.",
    "FhVWl": "Verschlüsseln Sie Ihr Passwort",
    "FjYbR": "Ausgabe",
    "Fv-zz": "Ergebnis kopieren",
    "Fy217": "Konfigurieren Sie den Texttransformator",
    "Fzp3t": "Bieten Sie Mehrwert",
    "G3MJN": "Ausgabebereich anzeigen",
    "G9QVo": "Registerkarten verwalten",
    "GR7jK": "Typ",
    "Ggob_": "Stornieren",
    "H-Ae75": "Bitte bestätigen Sie Ihr lokales Passwort.",
    "H-qA75": "Bitte geben Sie ein lokales Passwort ein.",
    "H8fQ4": "Wechseln Sie in den Hell- oder Dunkelmodus",
    "HEAhr": "Nach der Übersetzung erscheint hier das Ergebnis.",
    "HIc3c": "Vollendet",
    "HNDat": "Um Änderungen vorzunehmen, klicken Sie bitte auf die Schaltfläche „{0}“. Andernfalls klicken Sie auf „{1}“, um Ihre Änderungen zu übernehmen. Viel Spaß mit dieser Toolbox!",
    "Hflf2": "Aus Gründen der Cybersicherheit würden wir Ihnen nicht dabei helfen, Ihr Passwort über APIs oder Seiten hier zurückzusetzen, es sei denn, Sie aktualisieren die systemgeschützte Datei manuell.",
    "HjvV3": "Wir werden seine Dateien auf der Festplatte nicht löschen, sondern diesen Eintrag einfach aus der Liste entfernen.",
    "HyIC_": "Schrägstrichtaste (/)",
    "HyIC_d": "Schrägstrichtaste (/)",
    "I8FLi": "Jetzt ist es an der Zeit, Ihren Administrator einzurichten. Bitte legen Sie das Passwort so komplex wie möglich fest, damit Sie unhöfliche Angreifer verwirren können.",
    "IAC0A": "Suchwerkzeuge",
    "ICefi": "Abgesagt",
    "IKqqATS": "Aktuelle Seitendaten aktualisieren",
    "IOOrz": "(Wäre es schädlich für Ihr System? Wir glauben nicht, solange Sie die vom System gespeicherte Konfigurationsdatei ändern können, bedeutet das, dass Sie alles über LafTools-Datendateien lesen können.)",
    "IWUH5": "Beispiel anzeigen",
    "IaSyO": "Stornieren",
    "IfsGO": "Favoriten",
    "IfsdGO": "Favoriten",
    "ImUmf": "Neu",
    "J-3KA": "Bitte geben Sie einen Namen für dieses Skript an, der hilfreicher wäre.",
    "J164i": "z.B. Kopieren Sie Dateien auf den Remote-Server",
    "J2xoL": "Bitte sehen Sie sich den Fehler an: {0}",
    "JA_Bp": "Bitte geben Sie zunächst einen Namen für das neue Tag ein.",
    "JQEVK": "Code",
    "JQLmS": "Größe angepasst",
    "JQLmSq": "Vollendet.",
    "JTBRh": "LafTools hat den Passwortwert in der lokalen Datei gespeichert, aber keine Sorge, wir haben einen Einweg-Passwortverschlüsselungsmechanismus eingeführt, das heißt, dass niemand das Passwort der Klartextversion lesen kann. Um das Passwort zurückzusetzen, folgen Sie bitte den unten aufgeführten Anweisungen, um Ihr Passwort manuell zurückzusetzen.",
    "JYqxz2": "Willkommen bei LafTools, dies ist eine Insider-Version.",
    "JdqiUE8": "Dieser Vorgang dekodiert Daten aus einer ASCII-Zeichenfolge (mit einem Alphabet Ihrer Wahl, einschließlich Voreinstellungen) zurück in ihre Rohform.",
    "JdqidUE8": "Dieser Vorgang dekodiert Daten aus einer ASCII-Zeichenfolge (mit einem Alphabet Ihrer Wahl, einschließlich Voreinstellungen) zurück in ihre Rohform.",
    "JfFHw": "Holen Sie sich eine Workspace-Info-Anfrage",
    "JiUE8": "Dieser Vorgang dekodiert Daten aus einer ASCII-{0}-Zeichenfolge zurück in ihr Rohformat.",
    "K1qJZI": "Willkommen bei LafTools, Ihre Exzellenz.",
    "KGS2-": "Sobald Sie die oben genannten Schritte abgeschlossen haben, können Sie sich mit Ihrem neuen Passwort bei Ihrem System anmelden. Wenn Sie nicht auf das Dateisystem zugreifen konnten, bitten Sie Ihren Administrator oder IT-Support, diese Datei zu erstellen. Wenn die Datei bereits vorhanden ist, löschen Sie sie und erstellen Sie eine neue.",
    "KIc63": "Funktion noch nicht unterstützt",
    "KYh1N": "Alle Notizen",
    "KcqrRr": "Referenz",
    "KcrRr": "Code-Implementierungsdaten abrufen",
    "KmEUF": "Geben Sie einen schnellen Überblick über die aktuellen Systemtools.",
    "Kw4OJr": "Terminal",
    "Kyd9H": "Quellcode auf GitHub",
    "L-p-Y": "Kopieren Sie den Inhalt des aktuellen Shell-Befehls in die Zwischenablage",
    "L3zEM": "Beispiel anzeigen",
    "L42mxa": "Bitte geben Sie in diesem Feld Ihren Quelltext ein.",
    "L49kCq": "Bitte geben Sie in diesem Formular das Sperrkennwort ein und bestätigen Sie es, um Ihre LafTools zu sichern.",
    "L71q_N": "Das von Ihnen angegebene Passwort ist leer. Bitte überprüfen Sie es und versuchen Sie es erneut.",
    "L9bQku": "{0} dekodieren",
    "L9qbQku": "{0} dekodieren",
    "LAc1m": "Die App-Ansicht wurde aktualisiert.",
    "LFdvM": "Nicht eingeloggt",
    "LM715": "Abrufen der i18n-Konfiguration von der lokalen Server-API",
    "LPJrV": "Ergebnis kopieren",
    "LU9Jj": "Base85 (auch Ascii85 genannt) ist eine Notation zur Kodierung beliebiger Bytedaten. Normalerweise ist es effizienter als Base64.<br><br>Dieser Vorgang dekodiert Daten aus einer ASCII-Zeichenfolge (mit einem Alphabet Ihrer Wahl, einschließlich Voreinstellungen). Base85 wird häufig in den PostScript- und PDF-Dateiformaten von Adobe verwendet.",
    "LWaeFqd": "Wechseln Sie zu Ihrer bevorzugten Sprache",
    "Le71_N-": "Das von Ihnen angegebene Passwort stimmt nicht mit dem bestätigten überein. Bitte überprüfen Sie es und versuchen Sie es erneut.",
    "LnJ4H": "Beachten Sie, dass das lokale Konto nicht mit dem auf unserer Website registrierten Benutzer identisch ist. Ersteres ist nur auf Ihrem PC definiert, während letzteres für die Cloud-Synchronisierung verwendet werden kann.",
    "LqWaFd": "Systemeinstellungen",
    "M3qytc": "Kodieren Sie {0}",
    "M3ytc": "Zu Base64",
    "M4ywN1": "Rechner, Kalender, Uhr, Wetter und mehr.",
    "M6MrW": "Gut",
    "M7jct": "Wechseln Sie in den Vollbildmodus",
    "MD2-Advantages-011": "Welche Vorteile bietet die Verwendung von MD2?",
    "MD2-AlgorithmDetails-010": "Details zum MD2-Algorithmus",
    "MD2-Applications-018": "Welche Anwendungen haben MD2 verwendet oder verwenden es noch?",
    "MD2-Breakdown-016": "Im Laufe der Zeit wurden kryptografische Schwachstellen in MD2 entdeckt und stärkere Alternativen wie SHA-256 und SHA-3 werden nun für alle Anwendungen empfohlen, die sicheres Hashing erfordern.",
    "MD2-CollisionSecurity-015": "MD2 gilt als schwach gegen moderne kryptografische Angriffe. Seine Hash-Größe (128 Bit) ist nach heutigen Maßstäben klein, was ihn anfällig für Kollisionsangriffe macht.",
    "MD2-Def-002": "MD2 (Message-Digest Algorithm 2) ist eine kryptografische Hash-Funktion, die 1989 von Ronald Rivest entwickelt wurde. Sie erzeugt einen 128-Bit-Hash-Wert für jede gegebene Eingabenachricht.",
    "MD2-DigitalSignature-Risks-021": "Risiken bei der Verwendung von MD2 für digitale Signaturen",
    "MD2-Disadvantages-014": "Welche Nachteile und Sicherheitsbedenken gibt es bei MD2?",
    "MD2-FAQ-001": "Was ist MD2?",
    "MD2-HistoricalUse-020": "In der Vergangenheit wurde MD2 bei Dateiintegritätsprüfungen und Softwareaktualisierungen verwendet, obwohl diese Anwendungen größtenteils auf sicherere Hash-Funktionen wie SHA-256 und SHA-512 umgestiegen sind.)",
    "MD2-History-004": "Wie wurde MD2 entwickelt und welche Geschichte hat es?",
    "MD2-Implementation-013": "Es wurde umfassend implementiert und auf verschiedenen Plattformen und Sprachen standardisiert, was bedeutet, dass die Integration von MD2 in bestehende Systeme relativ einfach sein kann.",
    "MD2-InsecurityExamples-017": "Beispiele für MD2-Sicherheitsaufschlüsselung",
    "MD2-Operation-007": "Wie funktioniert die MD2-Operation?",
    "MD2-Origin-005": "MD2 wurde ursprünglich als Verbesserung gegenüber MD1 entwickelt und behebt einige Schwächen des früheren Algorithmus. Aufgrund seiner relativen Einfachheit und Geschwindigkeit erfreute es sich damals großer Beliebtheit.",
    "MD2-PKI-019": "MD2 wurde einst in der Public Key Infrastructure (PKI) für digitale Signaturen verwendet, ist jedoch aufgrund seiner Anfälligkeit für Angriffe inzwischen veraltet. Mit MD2 signierte Zertifikate werden von den meisten Systemen nicht mehr als vertrauenswürdig eingestuft.",
    "MD2-Process-008": "MD2 füllt die Eingabenachricht auf ein Vielfaches von 16 Bytes auf und verarbeitet sie dann durch eine Reihe von Exklusiv-ODER-Operationen, Bitrotationen und Additionen. Die endgültige Ausgabe ist ein 128-Bit-Hashwert.",
    "MD2-Purpose-003": "Der Zweck von MD2 besteht darin, die Datenintegrität sicherzustellen, indem ein einzigartiger digitaler Fingerabdruck generiert wird, der zur Überprüfung der Originalität und Authentizität der Daten verwendet werden kann.",
    "MD2-Rounds-009": "Der Algorithmus verwendet einen Vier-Runden-Prozess mit spezifischen Operationen, die an einer 128-Bit-Zustandsvariablen ausgeführt werden. Jede Runde nimmt Blöcke der aufgefüllten Nachricht auf und aktualisiert den Status, bis die gesamte Nachricht verarbeitet ist.",
    "MD2-Speed-012": "MD2 galt zu seiner Zeit als schnell und bietet in einigen Szenarien immer noch eine akzeptable Leistung, sodass es für Umgebungen geeignet ist, in denen die Rechenressourcen begrenzt sind.",
    "MD2-Successors-006": "Es wurde jedoch durch stärkere Algorithmen wie MD5 und SHA-1 ersetzt, die zur gleichen Familie von Hash-Funktionen gehören, aber verbesserte Sicherheitsfunktionen bieten.",
    "MD4-Advantages-011": "Welche Vorteile bietet die Verwendung von MD4?",
    "MD4-AlgorithmDetails-010": "Details zum MD4-Algorithmus",
    "MD4-Applications-018": "Welche Anwendungen haben MD4 verwendet oder verwenden es noch?",
    "MD4-Breakdown-016": "Die Designfehler des Algorithmus haben zu praktischen Angriffen geführt, die einfache Hash-Kollisionen und sogar teilweise Preimage-Angriffe ermöglichen, sodass MD4 heute für jeden sicheren kryptografischen Anwendungsfall ungeeignet ist.",
    "MD4-CollisionSecurity-015": "MD4 weist mehrere kryptografische Schwächen auf, darunter die Anfälligkeit für Kollisionsangriffe. Dies bedeutet, dass zwei verschiedene Eingaben dieselbe Hash-Ausgabe erzeugen können, was sie für Anwendungen, die Kollisionsresistenz oder eine starke Nachrichtenintegrität erfordern, unsicher macht.",
    "MD4-Def-002": "MD4 (Message-Digest Algorithm 4) ist eine kryptografische Hash-Funktion, die 1990 von Ronald Rivest entwickelt wurde. Sie erzeugt einen 128-Bit-Hash-Wert für jede gegebene Eingabenachricht.",
    "MD4-DigitalSignature-Risks-021": "Risiken bei der Verwendung von MD4 für digitale Signaturen",
    "MD4-Disadvantages-014": "Welche Nachteile und Sicherheitsbedenken gibt es bei MD4?",
    "MD4-FAQ-001": "Was ist MD4?",
    "MD4-HistoricalUse-019": "In der Vergangenheit wurde MD4 für digitale Signaturen, Dateiintegritätsprüfungen und Software-Updates verwendet. Aufgrund ihrer Schwachstellen sind diese Anwendungen jedoch weitgehend auf sicherere Alternativen wie SHA-256 und SHA-3 umgestiegen.",
    "MD4-History-004": "Wie wurde MD4 entwickelt und welche historische Bedeutung hat es?",
    "MD4-Implementation-013": "Es wurde weithin auf verschiedenen Plattformen und Sprachen implementiert und standardisiert und ermöglicht eine einfache Integration in bestehende Systeme, obwohl dieser Vorteil durch seine Sicherheitsbedenken in modernen Kontexten aufgewogen wird.",
    "MD4-InsecurityExamples-017": "Beispiele für MD4-Sicherheitsaufschlüsselung",
    "MD4-LegacySystems-020": "MD4 ist möglicherweise noch in älteren Systemen vorhanden, von seiner Verwendung wird jedoch in allen Kontexten abgeraten, in denen Sicherheit ein Problem darstellt. Moderne Standards empfehlen MD4 nicht mehr für kryptografische Zwecke.",
    "MD4-Operation-007": "Wie funktioniert der MD4-Betrieb?",
    "MD4-Origin-005": "MD4 war eine Weiterentwicklung von MD2 und MD3 und sollte eine schnellere Leistung bei gleichzeitiger Beibehaltung der Sicherheitseigenschaften bieten. Es zeigte sich jedoch, dass MD4 mehrere Sicherheitslücken aufweist.",
    "MD4-Process-008": "MD4 verarbeitet die Eingabenachricht, indem es sie auf ein Vielfaches von 512 Bits auffüllt und in 16-Wort-Blöcke unterteilt. Der Algorithmus verarbeitet diese Blöcke dann in vier Verarbeitungsrunden, die bitweise Operationen, modulare Additionen und nichtlineare Funktionen umfassen.",
    "MD4-Purpose-003": "Der Zweck von MD4 besteht darin, die Datenintegrität sicherzustellen, indem ein digitaler Fingerabdruck fester Größe generiert wird, der zur Überprüfung der Authentizität und Integrität der Originaldaten verwendet werden kann.",
    "MD4-Rounds-009": "Nachdem alle Blöcke verarbeitet wurden, wird der resultierende interne Zustand in den endgültigen 128-Bit-Hashwert umgewandelt.",
    "MD4-Speed-012": "MD4 war ursprünglich darauf ausgelegt, schneller als seine Vorgänger zu sein, was es zum Zeitpunkt seiner Einführung für Anwendungen beliebt machte, die schnelles Hashing erforderten.",
    "MD4-Successors-006": "Trotz seiner Mängel legte MD4 den Grundstein für nachfolgende Hash-Funktionen wie MD5 und SHA-1, die zwar ihr Design verbesserten, aber im Laufe der Zeit auch einige ihrer Schwachstellen übernahmen.",
    "MD5-Advantages-012": "Welche Vorteile bietet die Verwendung von MD5?",
    "MD5-AlgorithmDetails-011": "Details zum MD5-Algorithmus",
    "MD5-Alternatives-019": "Welche Alternativen zu MD5 gibt es für sicheres Hashing?",
    "MD5-Applications-024": "Welche anderen Anwendungen verwenden oder haben MD5 verwendet?",
    "MD5-Breakdown-017": "Im Laufe der Zeit wurden in MD5 mehrere kryptografische Schwachstellen entdeckt, und Forscher haben praktische Beispiele für die Entstehung von Kollisionen gezeigt, die seine Integrität und Sicherheit weiter gefährden.",
    "MD5-Collision-016": "MD5 ist anfällig für Kollisionsangriffe, was bedeutet, dass zwei verschiedene Eingaben dieselbe Hash-Ausgabe erzeugen können. Dies macht es für Anwendungen wie digitale Signaturen oder Passwortspeicherung unsicher.",
    "MD5-CollisionExample-007": "MD5-Kollisionsbeispiel",
    "MD5-DataIntegrity-026": "Es wurde auch häufig verwendet, um die Integrität von Daten während der Übertragung und Speicherung zu überprüfen, beispielsweise wenn rsync für die Dateisynchronisierung oder die Prüfsummenbildung großer Datensätze verwendet wurde.",
    "MD5-Def-002": "MD5 (Message-Digest Algorithm 5) ist eine weit verbreitete kryptografische Hash-Funktion, die eine Eingabenachricht nimmt und einen 128-Bit-Hash-Wert fester Größe erzeugt.",
    "MD5-DigitalSignature-Risks-027": "Risiken bei der Verwendung von MD5 für digitale Signaturen",
    "MD5-Disadvantages-015": "Welche Nachteile und Sicherheitsbedenken gibt es bei MD5?",
    "MD5-FAQ-001": "Was ist MD5?",
    "MD5-FileChecksum-005": "MD5 wird häufig zur Überprüfung der Dateiintegrität beim Herunterladen von Software oder großen Dateien verwendet. Es generiert eine Prüfsumme, die mit der von der Quelle bereitgestellten verglichen werden kann, um sicherzustellen, dass die heruntergeladene Datei nicht manipuliert wurde.",
    "MD5-Future-028": "Ist MD5 heute noch relevant?",
    "MD5-InsecurityExamples-018": "Beispiele für MD5-Sicherheitsaufschlüsselung",
    "MD5-Operation-008": "Wie funktioniert der MD5-Betrieb?",
    "MD5-PKI-025": "MD5 wird in der Public Key Infrastructure (PKI) zum Erstellen digitaler Signaturen verwendet, obwohl seine Verwendung aus Sicherheitsgründen weitgehend abgelehnt wurde. Mit MD5 signierte Zertifikate werden von den meisten modernen Systemen nicht mehr als vertrauenswürdig eingestuft.",
    "MD5-PasswordHashing-006": "Früher wurde es auch beim Passwort-Hashing verwendet, gilt heute aber aufgrund seiner Kollisionsanfälligkeit und der einfachen Knackbarkeit als unsicher. Moderne Systeme sind auf stärkere Alternativen wie bcrypt oder Argon2 umgestiegen.",
    "MD5-Process-009": "MD5 funktioniert, indem es die Eingabenachricht in Blöcke zerlegt und jeden Block mehrere Verarbeitungsrunden durchläuft, die logische Funktionen, modulare Arithmetik und bitweise Operationen umfassen. Das Ergebnis wird verkettet, um den endgültigen 128-Bit-Hash-Wert zu erzeugen.",
    "MD5-Purpose-003": "Sein Zweck besteht darin, die Datenintegrität sicherzustellen, indem für alle Daten ein eindeutiger digitaler Fingerabdruck erstellt wird. Wenn sich auch nur ein einziges Bit in den Originaldaten ändert, wird der MD5-Hash völlig anders sein.",
    "MD5-Relevance-029": "MD5 gilt für kryptografische Zwecke nicht mehr als sicher, insbesondere für neue Anwendungen, die Kollisionsresistenz oder starke Nachrichtenintegrität erfordern. Es kann jedoch immer noch in Legacy-Systemen oder nicht-kryptografischen Anwendungen zu finden sein, bei denen Geschwindigkeit Vorrang vor Sicherheit hat.",
    "MD5-Rounds-010": "Der Algorithmus besteht aus vier Hauptphasen, die auf einem internen 128-Bit-Zustand ausgeführt werden, der mit Konstanten initialisiert wird. Insgesamt gibt es 64 Verarbeitungsrunden, wobei jede Runde den internen Status basierend auf den Eingabenachrichtenblöcken transformiert.",
    "MD5-Speed-013": "MD5 ist relativ schnell, weshalb es für Anwendungen beliebt ist, bei denen schnelles Hashing unerlässlich ist.",
    "MD5-Standardization-014": "Es wurde weitgehend standardisiert und in verschiedenen Programmiersprachen und Plattformen implementiert, sodass es leicht in bestehende Systeme und Tools integriert werden kann.",
    "MD5-Summary-031": "Zusammenfassend: Welche wichtigen Punkte sollte ich mir bei MD5 merken?",
    "MD5-Summary-Point1-032": "MD5 ist eine schnelle, aber unsichere kryptografische Hash-Funktion, die anfällig für Kollisionsangriffe ist.",
    "MD5-Summary-Point2-033": "Sein Hauptzweck bestand darin, die Datenintegrität sicherzustellen und einige kryptografische Vorgänge durchzuführen, wurde jedoch größtenteils durch stärkere Alternativen wie SHA-256 und BLAKE2 ersetzt.",
    "MD5-Summary-Point3-034": "Während MD5 möglicherweise in älteren Systemen oder in nicht sicherheitsrelevanten Szenarien auftritt, ist es wichtig, es nicht für neue Projekte zu verwenden, die kryptografische Sicherheit erfordern.",
    "MD5-Transition-030": "Da neuere, sicherere Algorithmen wie SHA-256 und BLAKE2 allgemein verfügbar und besser verständlich werden, wird empfohlen, in allen Kontexten, in denen Sicherheit ein Problem darstellt, von MD5 abzuweichen.",
    "MD5-Usage-004": "Wie wird MD5 in der Praxis eingesetzt?",
    "MD6-AlgorithmDetails-010": "Details zum MD6-Algorithmus",
    "MD6-ComparisonSHA3-020": "Wie schneidet MD6 im Vergleich zu SHA-3 (Keccak) ab?",
    "MD6-Def-002": "MD6 (Message-Digest Algorithm 6) ist eine kryptografische Hash-Funktion, die 2008 von Ronald Rivest entwickelt wurde. Sie ist eine Weiterentwicklung der MD-Familie und bietet variable Ausgabegrößen von 128 bis 512 Bit.",
    "MD6-FAQ-001": "Was ist MD6?",
    "MD6-FutureDevelopments-028": "Sind für MD6 zukünftige Entwicklungen oder Verbesserungen geplant?",
    "MD6-FutureUnknown-029": "Derzeit gibt es keine öffentlich zugänglichen Informationen über die laufende Entwicklung oder Pläne zur Verbesserung des MD6-Algorithmus. Die kryptografische Forschung entwickelt sich ständig weiter und es können neue Algorithmen entstehen, um auf neue Bedrohungen oder Anforderungen zu reagieren.",
    "MD6-History-004": "Wie wurde MD6 entwickelt und was führte zu seiner Entstehung?",
    "MD6-Operation-007": "Wie funktioniert der MD6-Betrieb?",
    "MD6-Origin-005": "MD6 wurde als Reaktion auf die Schwachstellen in MD5 und SHA-1 entwickelt, die damals weit verbreitet waren. Ziel war es, eine sicherere Alternative mit größerer Flexibilität hinsichtlich der Ausgabegröße bereitzustellen.",
    "MD6-PKI-Alternatives-027": "Für PKI- und digitale Signaturanwendungen werden stattdessen häufig Standards wie RSA/SHA-256 oder ECDSA mit SHA-2- oder SHA-3-Varianten verwendet. Diese wurden umfangreichen Analysen unterzogen und haben Vertrauen innerhalb der kryptografischen Gemeinschaft aufgebaut.",
    "MD6-PKI-Considerations-026": "Obwohl MD6 eine stärkere Sicherheit bieten sollte als frühere Hash-Funktionen wie MD5, wurde es aufgrund seiner relativen Neuheit und mangelnden Akzeptanz in der breiten kryptografischen Community nicht allgemein für PKI- oder digitale Signaturschemata übernommen.",
    "MD6-Process-008": "MD6 verarbeitet Eingabenachrichten über eine Reihe von Komprimierungsfunktionen, die in einer baumartigen Struktur angewendet werden. Der Algorithmus kann parallel arbeiten, was zu seiner Leistung bei größeren Eingaben beiträgt.",
    "MD6-Purpose-003": "MD6 zielt darauf ab, robuste Sicherheitsfunktionen und eine verbesserte Leistung im Vergleich zu seinen Vorgängern bereitzustellen, wodurch es für eine Vielzahl von Anwendungen geeignet ist, die kollisionssicheres Hashing und Nachrichtenintegritätsprüfungen erfordern.",
    "MD6-Rounds-009": "Jeder Knoten im MD6-Baum durchläuft mehrere Runden von Mischoperationen, die modulare Addition, bitweises XOR und nichtlineare Permutationen umfassen. Der endgültige Stammknotenwert stellt den Hash-Digest der Eingabenachricht dar.",
    "MD6-SecurityUpgrade-006": "Das Design von MD6 basiert auf dem Konzept des baumbasierten Hashings, wodurch es einen besseren Schutz vor Preimage- und Kollisionsangriffen als frühere MD-Algorithmen bietet und gleichzeitig einen höheren Durchsatz für große Datensätze bietet.",
    "MD6-StayingCurrent-030": "Bei der Auswahl einer Hash-Funktion für jede Anwendung ist es wichtig, über die neuesten Forschungsergebnisse und Empfehlungen von Kryptografieexperten auf dem Laufenden zu bleiben, insbesondere da sich die Landschaft der kryptografischen Sicherheit im Laufe der Zeit weiterentwickelt.",
    "MD6-UseInPKI-025": "Kann MD6 für Public Key Infrastructure (PKI) oder digitale Signaturen verwendet werden?",
    "MD6-vs-SHA3-Adoption-023": "SHA-3 wurde als offizieller NIST-Standard übernommen und erfreut sich aufgrund seiner robusten Sicherheit und Leistung großer Beliebtheit. Obwohl MD6 theoretisch sicher ist, hat es nicht den gleichen Grad an Akzeptanz oder Standardisierung erfahren.",
    "MD6-vs-SHA3-DiffDesign-021": "MD6 und SHA-3 sind beide auf Sicherheit ausgelegt, verwenden jedoch unterschiedliche Hashing-Techniken. MD6 verwendet ein baumbasiertes Design für verbesserte Parallelität, während SHA-3 auf der Schwammkonstruktion basiert.",
    "MD6-vs-SHA3-Flexibility-022": "MD6 bietet variable Ausgabelängen, was für Anwendungen vorteilhaft sein kann, die benutzerdefinierte Hash-Größen erfordern. SHA-3 unterstützt auch variable Ausgabelängen, obwohl seine häufigste Variante, SHAKE, noch mehr Flexibilität bei Ausgaben beliebiger Länge bietet.",
    "MN2lT": "Die Länge des Passworts darf nicht weniger als 6 betragen",
    "Ma5mv": "Schalten Sie die Sichtbarkeit der Symbolleisten-Registerkarten um",
    "Mq9pdpT": "Listen Sie alle relevanten Ressourcen für das von Ihnen ausgewählte Funktionsmenü auf.",
    "Mq9ppT": "Sehen Sie sich schnell den Status Ihrer Dienste an",
    "MrgmU": "Bestätigen",
    "NMLOn": "Dateipfad kopieren",
    "NMLOn1": "Arbeitsbereich öffnen",
    "NNfJo": "Daten aus Datei laden",
    "Nq1IR": "Erweiterungs-VM kann nicht geladen werden",
    "Nqc0LqwX": "Wenn Sie der Meinung sind, dass in diesem Prozess eine Schwachstelle vorliegt, können Sie uns jederzeit per E-Mail oder GitHub kontaktieren, wir würden diese gerne dringend verbessern.",
    "O02-W": "Lädt nicht...",
    "O94Yx": "An",
    "OO0qPN": "Beispiel geladen",
    "OQWm4": "Melde einen technischen Fehler",
    "OSHOI": "Startseite",
    "OSqZQM": "Lokales Passwort",
    "OeO0PeN": "Okay, das Beispiel wird im Eingabeeditor angezeigt.",
    "OeOQY": "MACHEN",
    "OpPFe": "Wenn Ihnen LafTools gefällt, teilen Sie es bitte mit Ihren Freunden und geben Sie uns einen Stern, danke!",
    "Opcty": "Dateien",
    "OqqGx2qg": "Die statischen Ressourcen werden geladen, bitte warten...",
    "OrCt5": "Weiterleitung zur Werkbank...",
    "Ot6EP": "Polnische Werkzeuge",
    "P4ROa": "Ausgaberegion",
    "PM_N5": "Sitzung – {0}",
    "PUxuU": "Daten für Sprachpakete werden abgerufen...",
    "PapkF": "Wenn Sie Fragen oder Anregungen zu LafTools haben, können Sie uns diese gerne mitteilen. Wir sind stets auf der Suche nach Möglichkeiten, unser Produkt zu verbessern und unseren Benutzern das bestmögliche Erlebnis zu bieten. Sie können uns unter work7z@outlook.com kontaktieren. Vielen Dank, dass Sie LafTools verwenden!",
    "PpCHA": "Frageschlüssel(?)",
    "PqazM-": "Bitte verwenden Sie zunächst die folgenden Formularsteuerelemente, um Ihr Passwort zu verschlüsseln",
    "QL9Sn": "Im Moment scheint keine Beschreibung verfügbar zu sein.",
    "QLKzF": "Es ist vollgepackt mit Funktionen, die sowohl auf die Bedürfnisse von Anfängern als auch von erfahrenen Entwicklern zugeschnitten sind, was es zu einem unverzichtbaren Werkzeug im Arsenal jedes Programmierers macht.",
    "QM2Ob": "Aktuelle Tools",
    "QM2Oq": "Aktuelle Notizen",
    "QRAdA": "Englisch zu Chinesisch",
    "QhdpH": "Gemeinschaftsausgabe",
    "QzlA3": "Ein Fehler ist aufgetreten",
    "R12bq": "Listen Sie Registerkarten auf, die nicht angezeigt werden",
    "RNBze0": "Werkzeuge",
    "RNeBze0": "Geöffnete Tabs",
    "RNewBze0": "Werkzeugkonfiguration",
    "RO4ZP": "Ein Fehler ist aufgetreten",
    "RPVRl": "Es scheint, dass diese Erweiterung nicht mit der aktuellen Version von LafTools kompatibel ist. Bitte erwägen Sie die Installation der neuesten Version, um diese Erweiterung zu unterstützen, oder kontaktieren Sie uns, indem Sie ein Problem auf GitHub melden.",
    "RhqzcdD": "Systemeinstellungen",
    "RjCO3": "Arbeitsbereichsliste",
    "S4MMV": "Hoppla! Beim Laden der Datei sind einige Probleme aufgetreten.",
    "SAnnQ": "Laden der Datei {0}",
    "SBsDz": "Einrichtung für Ihr Admin-Konto.",
    "SGs7B": "Richten Sie Ihre LafTools schnell ein",
    "SHA-256-020": "SHA-256 (Secure Hash Algorithm) ist eine weit verbreitete Alternative, die eine höhere Sicherheit als MD5 bietet. Es generiert einen größeren 256-Bit-Hashwert und ist Teil der SHA-2-Familie.",
    "SHA-2_Info-022": "SHA-2-Info",
    "SHA3-NISTStandard-024": "SHA-3-Standardisierung",
    "SMqD13": "Geben Sie ein, um zu filtern",
    "SPem9": "Dieses Feld ist noch nicht fertig.",
    "SQAw7": "Ausgangssprache",
    "SYSq1": "Beispiel",
    "SZgXb": "Lokales Passwort einrichten",
    "SdGcT": "Anderer Teil",
    "Sm9tq": "Bitte geben Sie hier Ihr Kontopasswort ein",
    "Sm9tqq": "Bitte geben Sie ein Passwort ein, um Ihre LafTools zu entsperren",
    "Spcfdee": "Heller oder dunkler Modus",
    "TBPqy7": "Sprache",
    "TD7DA": "Sprachen",
    "TNoePE": "LafTools-Cloud",
    "Ttrqqet": "Schreiben und speichern Sie Ihre Gedanken hier!",
    "TwFcr": "Zielsprache",
    "TyqvWY3": "Lokale Datei",
    "U2ZNl": "Erfahren Sie mehr auf Wikipedia",
    "U4qqq9": "Entfernen Sie diese Registerkarte aus der Liste",
    "U7zP2": "Bitte geben Sie hier den Benutzernamen für Ihr Konto ein",
    "UF_Dp": "Es ist ein Fehler aufgetreten: {0}, Ablehnungszeit ist {1}",
    "UZ2Ig": "Neues lokales Konto",
    "Ugpng": "Favorit",
    "Uzqjy": "Implementierung",
    "V6U_f": "Nutzungsbedingungen",
    "V6XEO": "Geben Sie den Benutzernamen oder die E-Mail-Adresse ein",
    "VAZq8r": "Es ermöglicht Entwicklern, verschiedene Befehle auszuführen, beispielsweise das Ausführen von Skripts, das Installieren von Paketen und das Navigieren im Dateisystem – und das alles direkt im Editor.",
    "VEfeqZG": "Anmerkungen",
    "VI6VT": "Geschichte",
    "VOsZc": "Melde Probleme",
    "VSZ": "Klicken Sie, um erneut auszulösen",
    "VZtqg6": "Erstellen Sie ein neues Skriptformular",
    "Vaf2y": "Der Tab-Name darf nicht leer sein.",
    "VeY9K": "Nutzungsbedingungen",
    "VgG5y": "Klicken Sie hier, um den Status Ihrer Erweiterung zu aktualisieren",
    "VjZCv": "Echtzeitkonvertierung",
    "WPrTW": "Offizielle Website",
    "WXo6D": "Erfrischt",
    "WYCVL": "Schnelle Einrichtung",
    "X4L_Z": "Erweiterungs-VM wird nicht bereitgestellt.",
    "X6Fq4j": "Nach Jahren engagierter Entwicklung und Verfeinerung sind wir zuversichtlich, dass LafTools Ihr Programmiererlebnis erheblich verbessern kann, indem es Ihren Arbeitsablauf komfortabler und effizienter macht.",
    "XKpI0": "Klicken Sie, um Ihren Text im Eingabebereich zu verarbeiten",
    "XLWoR": "Wählen Sie Ihr bevorzugtes aus und fahren Sie fort",
    "XQxJB": "Meine Arbeitsbereiche",
    "X_HGx": "LafTools ist eine vielseitige Toolbox, die für verschiedene Anforderungen entwickelt wurde. Es ist vollständig Open Source und gewährleistet Transparenz und Sicherheit. Trotz seiner schlanken Laufzeit bietet es vollständige Plattformunterstützung, einschließlich ARMv8, und native KI-Unterstützung ähnlich wie ChatGPT. LafTools ist hochgradig in eine produktive Benutzeroberfläche integriert und wird kontinuierlich mit neuen Tools aktualisiert. Es kann über das Web und mit Docker verwendet werden und bietet zusätzliche Ressourcen wie Notizen und Handbücher.",
    "XeXF77": "Einstellungen",
    "XikdD": "Einen Moment bitte, wir haben es fast geschafft!",
    "Y5GAC": "Dein Benutzername",
    "Y9mQ2": "Bitte geben Sie hier den Benutzernamen für Ihr Konto ein",
    "YAAU3q": "Lokales Passwort",
    "YHCjT": "LafTools unterstützt globale Hell- und Dunkelthemen und ist insbesondere für Nachtschicht-Codierer nützlich.",
    "YNwKz": "Nicht unterstützte Sprache: {0}, standardmäßig wird Englisch verwendet.",
    "YOYTp": "Schnelle Einrichtung",
    "YPPPL": "Schalten Sie die Sichtbarkeit der Symbolleisten-Registerkarten um",
    "YQN9u": "Beim Laden von {0} ist ein Fehler aufgetreten. Bitte überprüfen Sie die folgenden Details.",
    "Y_k0z": "Passwort vergessen?",
    "Ye3TXses": "Zum Konfigurieren, ob die Transformation automatisch ausgeführt wird, wenn der Eingabetext geändert wird.",
    "Ylq2X": "Fehler Korrektur",
    "YquQqTXq": "Autostart?",
    "YrTdq": "Alle",
    "YrVq683": "Post",
    "YrVqdd683": "Anleitungen",
    "Z2QTU": "Um",
    "Z3rhY": "Nachricht",
    "Z7ALO": "Zum ausgewählten Arbeitsbereich gewechselt",
    "Z7OTt": "Die von Ihnen ausgewählte Datei ist zu groß. Bitte wählen Sie eine Datei mit weniger als 30 MB aus.",
    "ZAGva": "Möchten Sie diesen Arbeitsbereich wirklich löschen?",
    "ZAKaFq": "Mein Cloud-Konto",
    "ZW1Dgz": "Keine verfügbare Nachricht",
    "ZWJ79W5LR": "JavaScript verschönern",
    "ZXRGC": "Bitte sehen Sie sich den Fehler an: {0}",
    "ZbD3F": "{0}, erstellt vom LafTools-Team",
    "Zk7JI": "Es wird noch nicht unterstützt",
    "ZrbduC": "Alle Fenster schließen",
    "ZrbuC": "Tab schließen",
    "_5OqeG": "Deaktivieren Sie es",
    "_LFF3": "Sollten Sie bei der Verwendung von LafTools auf ein Problem stoßen oder Vorschläge haben, können Sie uns jederzeit per E-Mail oder GitHub kontaktieren. Wir sind bereit, es zu verbessern.",
    "_trez": "Text austauschen",
    "_trqL": "Daten für Systemressourcen werden abgerufen...",
    "_z3lR": "Code aktualisieren",
    "a3yqoz": "persisch",
    "a3z-3k12": "IP-Adress-Tools",
    "a4jbpq": "Tschechisch",
    "a4r9t": "Kann Base45 jede Base45-codierte Zeichenfolge unabhängig von ihrer Herkunft dekodieren?",
    "a4s6x": "Wie funktioniert Base32?",
    "a8b7z": "Daher ist ein Auffüllen nur erforderlich, wenn die letzte zu kodierende Bitgruppe nicht durch 40 Bit teilbar ist (da 8 Base32-Zeichen 40 Bit darstellen). Das Auffüllen besteht aus null bis sechs „=“-Zeichen am Ende der codierten Zeichenfolge.",
    "aCkOP": "Ausfahrt",
    "aHAfR": "Daten für {0} werden abgerufen...",
    "aSOpr": "Datenmodellgenerator",
    "ab9c0d1e": "Zu den primären Vorgängen gehören die Kodierung (Konvertierung der Binärdatei in Base64) und die Dekodierung (Konvertierung der Base64-Datei zurück in die Binärdatei).",
    "abc12345": "Base64 ist ein Codierungsschema, das Binärdaten als Folge von ASCII-Zeichen darstellt.",
    "abcdef12": "Wie funktioniert Base64?",
    "about_LafTools_toolbox": "Über LafTools",
    "adpgq": "Neuen Arbeitsbereich erstellen",
    "ah-C4": "Neue Notiz",
    "aj3nhd": "Deutsch",
    "aked6": "Verweise",
    "aked61": "Einführung",
    "asElV": "Entfernen",
    "az4uS2": "Sind Sie sicher, dass Sie sich von diesem System abmelden? Beachten Sie, dass Sie zur Anmeldeseite weitergeleitet werden.",
    "azpNX": "Vollendet.",
    "b0qjSL": "Bitte geben Sie das Verzeichnis {1} ein und erstellen Sie eine Datei {2}. Geben Sie Ihr verschlüsseltes Passwort als gesamten Dateiinhalt ein.",
    "b6sx9b": "Philippinisch",
    "b8g2k": "Nutzungsszenarien für Base32",
    "bP_6qG": "Tipps zum Vergessen Ihres Passworts",
    "bT4R6": "Neue Registerkarte",
    "bVlBN": "Chinesisch nach Englisch",
    "bcdef01a": "Base64 funktioniert, indem es Binärdaten in Gruppen von 6 Bits aufteilt und jede Gruppe einem bestimmten Zeichen aus einem Alphabet von 64 Zeichen (A-Za-z0-9+/) zuordnet.",
    "bhojei1": "Traditionelles Chinesisch",
    "bjZyW": "Übersetzen",
    "bors14": "Türkisch",
    "bp_-b": "Um die LafTools vollständig zu verwalten, müssen Sie zu Beginn des Einrichtungsvorgangs Ihren Administrator einrichten. Wir haben Ihre Identifizierung anhand des URL-Parameter-Tokens überprüft. Seien Sie versichert, dass niemand sonst Ihre Root-Berechtigung einrichten kann, es sei denn, er oder sie erhält das Setup-Token.",
    "bqqrij": "Suaheli",
    "c0eCw": "Übersetzen Sie Ihren Text in jede gewünschte Sprache.",
    "c0v2p": "Allgemeine Operationen mit Base32",
    "c1p3b": "Kopieren Sie nach der Integration die bereitgestellte Vorlage in Ihr C++-Programm und ersetzen Sie den Platzhalter durch den tatsächlich codierten Wert, bevor Sie das Programm ausführen.",
    "c1p4b": "Jede Dezimalzahl wird dann in eine eindeutige Folge von fünf Base85-Zeichen umgewandelt. Wenn am Ende weniger als vier Bytes übrig sind, kann Auffüllen angewendet werden.",
    "c2tpr": "Die Apache Commons Codec-Bibliothek bietet Base32-Kodierungs- und Dekodierungsfunktionen in Java.",
    "c2vw9k": "Obwohl Base45 nicht so weit verbreitet ist wie Base64 oder Base32, gibt es Open-Source-Bibliotheken für mehrere Sprachen.",
    "c5m1b": "Eine weitere Variante, Base58Flickr, unterscheidet sich geringfügig im Zeichensatz. Es ersetzt „+“ durch „,“ und „/“ durch „-“ und passt sich so den URL-Anforderungen von Flickr an.",
    "c5meku": "Sundanesisch",
    "c5p1b": "Polsterung wird nicht verwendet; Die Länge der codierten Ausgabe hängt direkt von der Größe der Eingabedaten ab.",
    "c6p4n": "Kopieren Sie nach der Installation der Bibliothek die bereitgestellte Vorlage in Ihr Python-Skript und führen Sie es aus. Die Bibliothek bietet integrierte Funktionen zum Konvertieren zwischen Bytes und Base45-codierten Strings.",
    "c6p9b": "Wenn die Länge der Eingabedaten nicht durch 8 teilbar ist, wird keine Auffüllung verwendet. Stattdessen wird jede nicht vollständige Gruppe unabhängig behandelt.",
    "c7Uoqqe": "Bevor Sie LafTools verwenden, geben Sie bitte Ihr lokales Passwort ein und bestätigen Sie es wie folgt.",
    "c8me6b": "Benutzerdefinierte Base62-ähnliche Schemata können auf bestimmte Anwendungen zugeschnitten sein, basieren jedoch im Allgemeinen auf dem gleichen Prinzip der Verwendung eines größeren Zeichensatzes als Base64 oder Base32.",
    "c9j5k": "Laden Sie den Header „base32.h“ und die entsprechende Implementierung herunter und fügen Sie ihn in Ihr Projekt ein.",
    "c9j5v": "Installieren Sie es über Composer, indem Sie „composer require christian-riesen/base32“ zu Ihrem Projekt hinzufügen.",
    "c9q7w": "Warum wurde Base45 erstellt?",
    "cNQp_": "Ressourcen",
    "cPS6q": "Alle Werkzeuge",
    "cQqwI8r": "Laden des Status des Terminaldienstes",
    "cbaq54321": "Nein, Base64 ist keine Komprimierungstechnik, es ändert nur die Darstellung der Daten, nicht deren Größe.",
    "cdefg234": "Am Ende werden Füllzeichen (=) hinzugefügt, um sicherzustellen, dass die Länge der codierten Daten ein Vielfaches von 4 Zeichen ist.",
    "cfYYN": "Entdecke mehr",
    "ciZV2": "Base32 ist eine Notation zum Kodieren beliebiger Bytedaten mithilfe eines eingeschränkten Satzes von Symbolen, die bequem von Menschen verwendet und von Computern verarbeitet werden können. Es verwendet einen kleineren Zeichensatz als Base64, normalerweise das Großbuchstabenalphabet und die Zahlen 2 bis 7.",
    "ciZV21": "Base45 ist eine Notation zur Kodierung beliebiger Bytedaten mithilfe eines eingeschränkten Satzes von Symbolen, die bequem von Menschen verwendet und von Computern verarbeitet werden können. Die hohe Zahlenbasis führt zu kürzeren Zeichenfolgen als beim Dezimal- oder Hexadezimalsystem. Base45 ist für die Verwendung mit QR-Codes optimiert.",
    "ciZV2deq1": "Base58 (ähnlich Base64) ist eine Notation zur Kodierung beliebiger Bytedaten. Der Unterschied zu Base64 besteht darin, dass leicht falsch lesbare Zeichen (z. B. l, I, 0 und O) entfernt werden, um die Lesbarkeit für den Menschen zu verbessern. Base58 wird häufig in Kryptowährungen (Bitcoin, Ripple usw.) verwendet.",
    "cj1pd": "Aktualisierungsvorgang",
    "cjzqj9": "bosnisch",
    "cmxzpg": "Malayalam",
    "coM2I": "Verwenden Sie den Smart Editor",
    "crD7I": "Um zu konfigurieren, ob die Transformation den leeren Eingabetext ignorieren soll, dessen Länge Null ist.",
    "cuRCb": "Kategorie nicht gefunden.",
    "cuRCqb": "Kategorie existiert nicht",
    "cxqhqa": "Myanmar (burmesisch)",
    "d-l2l": "Bestätigen",
    "d-qPr": "Unbekanntes Layout: {0}",
    "d1x7v": "Ein weiteres Beispiel ist Git, wo Hash-Objekte manchmal im Base32-Format gespeichert werden, um Probleme mit Zeilenenden und Dateinamenbeschränkungen zu vermeiden. Außerdem verwendet HashiCorp Vault Base32 zur Schlüsselableitung.",
    "d2w4e": "Ähnlich wie andere Basiskonvertierungssysteme wandelt Base62 Eingabebytes in eine große Ganzzahl um und drückt sie dann als Kombination von Zeichen aus seinem 62-Zeichensatz aus.",
    "d2w6e": "Klonen/laden Sie das Repository herunter und fügen Sie die bereitgestellte Header-Datei in Ihr Projekt ein. Kompilieren und verknüpfen Sie die Quelldateien gemäß der Projektdokumentation.",
    "d3w2e": "Base58 funktioniert, indem es Eingabebytes in eine große Ganzzahl umwandelt und diese Ganzzahl dann als Kombination von Zeichen aus seinem 58-Zeichensatz (A-Z, a-z, 1-9) ausdrückt.",
    "d5KZH": "Vielen Dank, dass Sie LafTools verwenden!",
    "d5LAU": "Lizenziert unter AGPLv3",
    "d5fmq2": "Italienisch",
    "d5hit": "Sitzung – {0}",
    "d5x1rl": "Spanisch",
    "d6g0w": "Dieses Snippet kann in jeder Python-Umgebung ausgeführt werden, einschließlich Skripten, interaktiven Sitzungen oder innerhalb einer größeren Anwendung.",
    "d6y9k": "Wenn nicht genügend Bytes vorhanden sind, um die letzte Gruppe zu füllen, wird keine Auffüllung verwendet. Stattdessen werden die verbleibenden Bits verarbeitet und den entsprechenden Zeichen zugeordnet.",
    "d7w2e": "Base85 funktioniert, indem es die Eingabedaten in Gruppen von vier Bytes aufteilt und jede Gruppe in eine Dezimalzahl zwischen 0 und 2^32-1 umwandelt.",
    "d8w1b": "Sie können dies mit pip tun, indem Sie „pip install base45“ oder „python -m pip install base45“ ausführen.",
    "d9w7m": "Da es außerdem nur Großbuchstaben verwendet, kann es nicht alle möglichen Kombinationen der Groß-/Kleinschreibung als zusätzliche Sicherheitsmaßnahme nutzen, wie dies bei Base64 manchmal bei der Groß-/Kleinschreibung beim Dekodieren der Fall ist.",
    "dCFIC": "Code hübscher",
    "dCFIwC": "Code-Generator",
    "dGKMx": "Ausgabe",
    "dGVUB": "Netzwerk-Tools",
    "dV5Eq": "Arbeitsbereichsliste aktualisieren",
    "dWbBm": "C# enthält die Klasse „System.Convert“ mit den integrierten Methoden ToBase64String und FromBase64String, mit denen Sie Base64-Daten kodieren und dekodieren können. Die Eingabezeichenfolge wird zunächst mithilfe der UTF-8-Kodierung in ein Byte-Array konvertiert und anschließend entsprechend kodiert und dekodiert.",
    "dk122q": "Verwalten Sie Ihre Arbeitsabläufe, um mehrere Tools miteinander zu kombinieren.",
    "dkarh": "Okay, Toolbox hat das Verzeichnis geöffnet. Wenn kein Popup-Fenster angezeigt wird, prüfen Sie bitte, ob Ihre Plattform diese Funktion unterstützt oder ob sich das Verzeichnis auf dem Server befindet.",
    "dkjk12": "Das ist ein Test",
    "dkkq12": "Konfigurieren Sie Ihr Werkzeug in dieser Registerkarte.",
    "dl4kr": "Passwort vergessen?",
    "dpRY4": "Wörterbuch",
    "dqTqyvWY": "Schubladenmenü",
    "dsdpA_eJ": "Größe anpassen",
    "dtjdt4": "Kasachisch",
    "dxLQq": "Root-Berechtigung",
    "dzjTo": "Bitte geben Sie hier Ihr Kontopasswort ein",
    "e--gB": "Die Erweiterungs-ID wird nicht angegeben.",
    "e4Cd8t": "Base85",
    "e5c7r": "Base32 ist ein Binär-zu-Text-Codierungsschema, das Daten in einer ASCII-Zeichenfolge mithilfe einer Teilmenge von 32 Zeichen darstellt. Es ist so konzipiert, dass es für Menschen lesbar und URL-sicher ist.",
    "e5rycw": "Kirgisisch",
    "e8Crq": "Bitte füllen Sie das untenstehende Feld mit Benutzername und Passwort aus, um fortzufahren.",
    "e8x2v": "Base45 funktioniert, indem es die Eingabedaten in Gruppen zu je 5 Bytes aufteilt. Anschließend wandelt es jede Gruppe in eine Dezimalzahl um und ordnet sie einem entsprechenden Zeichen aus seinem 45-Zeichensatz zu.",
    "eN4fM": "In Rust können Sie die Kiste „base64“ für die Base64-Kodierung und -Dekodierung verwenden. Fügen Sie „base64 = „1.x““ zu Ihrer Cargo.toml-Datei im Abschnitt [Abhängigkeiten] hinzu, führen Sie „cargo build“ aus und fügen Sie die erforderlichen Importe in Ihren Code ein, um diese Funktionen zu nutzen.",
    "eTmq": "Geschichte der CodeGen ToolBox",
    "e_8pZ": "Eine vielseitige Toolbox für Entwickler zur Verbesserung der Produktivität.",
    "ediql2": "ungarisch",
    "efg45678": "Vergleich mit Base32",
    "efghi678": "Diese Variante wird häufig für Dateinamen, URLs oder Situationen verwendet, in denen Sonderzeichen vermieden werden müssen.",
    "egkqC8t": "Base58",
    "egkqCd8t": "Base62",
    "eifoni": "katalanisch",
    "eqkqd4W": "Bitte geben Sie einen Namen für das neue Tag ein",
    "etV-l": "Dateien nach SIT2 kopieren",
    "eu5mh0": "Belarussisch",
    "euaI8": "Erstellen Sie ein neues lokales Konto",
    "euhy9v": "estnisch",
    "f0q4w": "Ein beliebtes Einsatzszenario ist die Generierung geheimer Schlüssel für die Zwei-Faktor-Authentifizierung (2FA), bei der Dienste wie Google Authenticator und Yubikey Base32-codierte Geheimnisse verwenden.",
    "f1t2z": "Base62 wurde entwickelt, um eine kürzere, URL-sichere Alternative zu Base64 bereitzustellen, insbesondere für eindeutige Bezeichner und kurze URLs.",
    "f3ttw8": "Maori",
    "f4t7z": "Base58 wurde ursprünglich für Bitcoin entwickelt, um öffentliche Adressen und private Schlüssel eindeutig darzustellen.",
    "f5a0s": "Darüber hinaus erzeugt Base32 eine längere Ausgabe, kann jedoch für bestimmte Anwendungen wie Dateinamen besser geeignet sein, da es keine Sonderzeichen enthält, die mit den Dateisystemregeln in Konflikt geraten könnten.",
    "f5bLC": "Dokumentation",
    "f7akol": "Englisch",
    "f7t1z": "Fügen Sie die Bibliothek manuell oder über einen Paketmanager wie Swift Package Manager (SPM) zu Ihrem Xcode-Projekt hinzu.",
    "f8n4m": "Seine Kompaktheit ermöglicht eine effizientere Raumnutzung in QR-Codes und sorgt gleichzeitig für die Lesbarkeit mit Standard-Barcodescannern.",
    "f8wne": "Binden Sie das Paket ein, indem Sie „Install-Package BouncyCastle“ in der Paket-Manager-Konsole ausführen oder es Ihrer .csproj-Datei hinzufügen.",
    "f9t1z": "Base85 wurde ursprünglich entwickelt, um Binärdaten in PostScript-Dokumenten effizient darzustellen und bessere Komprimierungsraten zu erzielen.",
    "f9t2z": "Fügen Sie Ihrer pom.xml-Datei Folgendes hinzu: `<dependency> <groupId>org.iso</groupId> <artifactId>iso-base45</artifactId> <version>...</version> </dependency>` wobei Version ist die neueste Version.",
    "fBP5h": "Nutzername",
    "fEr5j": "Neues Skript erstellen",
    "fTt2N": "Perl benötigt das Modul „MIME::Base64“ für die Base64-Kodierung und -Dekodierung. Installieren Sie es, indem Sie „cpan install MIME::Base64“ ausführen, falls es noch nicht installiert ist.",
    "fV_1P": "Anmelden",
    "fdxluz": "rumänisch",
    "ff02c": "Abgesagt",
    "fghi6789": "Es wird zum Übertragen oder Speichern von Binärdateien in textbasierten Formaten verwendet und gewährleistet so die Kompatibilität zwischen verschiedenen Systemen.",
    "fgj880": "Telugu",
    "fqV_1P": "Schalten Sie Ihre LafTools frei",
    "g1h5n": "Wie funktioniert Base45?",
    "g2_aX": "Verschlüsseltes Passwort in Datei kopieren",
    "g3h5s": "Wie funktioniert Base85?",
    "g4h7s": "Für C++ können Sie die Bibliothek „base45-cpp“ verwenden, die als GitHub-Repository verfügbar ist.",
    "g5SK9": "Zuletzt geöffnet",
    "g5ybh": "Fügen Sie die Abhängigkeit zu Ihrem Projekt hinzu (Maven: 'org.apache.commons:commons-codec').",
    "g6f0r": "Für die Kernbibliotheken von Ruby ist keine zusätzliche Installation erforderlich. Ersetzen Sie einfach „TEST12345“ durch Ihren gewünschten Wert.",
    "g6f0t": "Führen Sie „go get github.com/mitchellh/go-base32“ aus, um die Abhängigkeit zu Ihrem Projekt hinzuzufügen.",
    "g6v3b": "Allerdings kann der größere Zeichensatz von Base45 die Wahrscheinlichkeit von Fehlern beim Umgang mit nicht-alphanumerischen Zeichen erhöhen, was in manchen Umgebungen oder Übertragungskanälen ein Problem darstellen könnte.",
    "g7h5k": "Wie funktioniert Base58?",
    "g8h7s": "Wie funktioniert Base62?",
    "g8r3e": "Der Hauptnachteil von Base32 ist seine relativ geringe Platzeffizienz; Es erweitert die Eingabedaten um etwa 25 % mehr als Base64. Dies bedeutet, dass für die gleiche Menge an codierten Daten mehr Speicherplatz oder Bandbreite benötigt wird.",
    "gDjbs": "Historische Daten",
    "gK3dNQ": "Kopieren",
    "gQhfS": "Datei-Tools",
    "gT6re": "C++ verfügt über keine native Base64-Implementierung. In diesem Beispiel wird die OpenSSL-Bibliothek zum Durchführen der Base64-Kodierung und -Dekodierung verwendet. Um OpenSSL zu verwenden, installieren Sie es auf Ihrem System und verknüpfen Sie es beim Kompilieren Ihres Programms mit den entsprechenden Bibliotheken.",
    "gU1O2": "Ausgelöst",
    "gkC8t": "Base64",
    "gkdqqC8t": "Basis45",
    "gkqC8t": "Base32",
    "gnKMZ": "Erfrischt.",
    "h4e1b": "Dies ist auch in Situationen nützlich, in denen Groß-/Kleinschreibung beachtete alphanumerische Zeichenfolgen einfacher zu handhaben sind als hexadezimale oder Base64-Zeichenfolgen, die möglicherweise nicht alphanumerische Zeichen enthalten, die in bestimmten Kontexten (z. B. URLs oder Dateinamen) Probleme verursachen können.",
    "h6AeI": "Websocket-Verbindung um {0} geschlossen",
    "h7rUq": "In Node.js kann die integrierte Klasse „Buffer“ die Base64-Kodierung und -Dekodierung verarbeiten, ohne dass externe Bibliotheken erforderlich sind. Dieses Code-Snippet kodiert die Zeichenfolge „TEST12345“ in Base64 und dekodiert sie dann wieder in die ursprüngliche Zeichenfolge.",
    "h9j3m": "Polsterung in Base32",
    "hJUMN": "Zielsprache",
    "hMvh1": "Backup-Datenbank",
    "hRFxV": "Weitere Informationen finden Sie auf unserer Website",
    "hcnt1k": "mazedonisch",
    "hhOT3": "Suche mit Name",
    "hij90klm": "Base32 verwendet ein kleineres Alphabet (A-Z2-7), was zu längeren, aber besser lesbaren Zeichenfolgen führt.",
    "htt1d2": "Esperanto",
    "hu-iz": "Timer",
    "huE6U": "Variable",
    "hyV-d": "Erledigt",
    "hyirc0": "Schwedisch",
    "i27qmr": "Friesisch",
    "i6hMN": "Bildbestätigungscode",
    "i7w2m": "Gibt es integrierte Base45-Bibliotheken in gängigen Programmiersprachen?",
    "i88tb": "Ergebnis in Datei exportieren",
    "i8q8tb": "Konfigurieren Sie Workflow für die Eingabe",
    "i9o7k": "Vorteile von Base32 gegenüber Base64",
    "iNEhY": "Generischer Code verschönern",
    "iNQvo": "Zeigen Sie zunächst ein Beispiel.",
    "iNqF1T": "Cloud-Konto verwalten",
    "iOEjZ": "Kein verfügbarer Code",
    "iQL2c": "Wir sind noch dabei, den gesamten Funktionsumfang dieser Schaltfläche auszuprobieren. Wenn Sie Feedback oder Verbesserungsvorschläge haben, teilen Sie uns dies bitte mit!",
    "i_lang_": "Sprachpakete",
    "ib135dq": "Ihre Statusmeldung wird hier angezeigt",
    "iknTS": "Passwortmanager",
    "init_env": "Laden von Systemressourcen",
    "ip2g1": "Kopiert",
    "ipOSQE": "Pro-Edition",
    "it8ths": "Indonesisch",
    "ixyP0": "Automatische Verarbeitung der Echtzeitaktion",
    "j1b5k": "Zu den häufigsten Vorgängen im Zusammenhang mit Base32 gehören das Codieren von Binärdaten in einen Base32-String und das Decodieren eines Base32-Strings zurück in sein ursprüngliches Binärformat.",
    "j4s6r": "Wie kodiere/dekodiere ich mit Base62 in JavaScript?",
    "j5s7r": "Wie kodiere/dekodiere ich mit Base85 in JavaScript?",
    "j6s3r": "Wie kodiere/dekodiere ich mit Base58 in JavaScript?",
    "j7k2t": "Um Daten mit Base45 zu kodieren, benötigen Sie eine Bibliothek oder Funktion, die den Base45-Algorithmus implementiert.",
    "j8s6r": "Für Kotlin können Sie die „Barcode-Core“-Bibliothek verwenden, die Base45-Funktionalität enthält.",
    "j9s5r": "Für C# können Sie die auf NuGet verfügbare „Base45“-Bibliothek verwenden.",
    "jJuNz": "Ausgangssprache",
    "jO5eP": "OK",
    "jOXj0": "Upps, etwas ist schief gelaufen.",
    "jPNCb": "Wiederholt.",
    "jQXdi": "Lichtmodus",
    "jR1zX": "KI-Labor",
    "jRzgS": "Das Foundation-Framework von Swift enthält integrierte Methoden für die Base64-Kodierung und -Dekodierung. Es werden keine externen Bibliotheken benötigt; Importieren Sie einfach „Foundation“, um diese Funktionen zu nutzen.",
    "jZvLJ": "PHP verfügt über die integrierten Funktionen „base64_encode()“ und „base64_decode()“ für die Verarbeitung von Base64-Operationen. Diese Funktionen sind sofort verfügbar und erfordern keine zusätzliche Einrichtung oder Installation.",
    "jaj7M": "Alle Rechte vorbehalten.",
    "jb392": "Name",
    "jfpqt": "Notizen-Navigator",
    "jgDoEq": "Keine FAQ-Daten",
    "jhDoE": "FAQ-Daten abrufen",
    "jlxvpk": "Koreanisch",
    "k17PG": "Websocket-Verbindung geschlossen.",
    "k1m4e": "Allerdings bietet es nicht ganz die gleiche Platzeffizienz wie Base64 oder Base32, da es weniger Zeichen in seinem Alphabet verwendet.",
    "k2SVY": "aus",
    "k2em5e": "Dies führt zu kürzeren Ausgabezeichenfolgen bei gleicher Menge an Eingabedaten, was in Szenarien von Vorteil sein kann, in denen die Minimierung der Größe von entscheidender Bedeutung ist.",
    "k2ku5p": "Tschechisch",
    "k3m2e": "Kopieren Sie die bereitgestellte Vorlage in eine neue Go-Datei, ersetzen Sie den Platzhalter durch den tatsächlich codierten Wert und führen Sie die Datei dann mit „go run yourfile.go“ aus",
    "k41a5": "LafTools",
    "k4s5rx": "Slowenisch",
    "k7d9f": "Rubys integrierte „base32“-Bibliothek bietet Methoden für die Base32-Kodierung und -Dekodierung.",
    "k7d9r": "Das Paket „go-base32“ bietet Base32-Kodierungs- und Dekodierungsfunktionen in Go.",
    "k7g0n": "In Base32 werden alle 5 Bits der Eingabedaten einem der 32 Zeichen aus der Menge „ABCDEFGHIJKLMNOPQRSTUVWXYZ234567=“ zugeordnet.",
    "k9em5e": "Dies macht es ideal für Szenarien, in denen eine prägnante, URL-freundliche Kennung ohne Einbußen bei der Lesbarkeit erforderlich ist.",
    "k9jtr": "Das npm-Paket „base32-encoding“ wird für die Base32-Kodierung und -Dekodierung in Node.js verwendet.",
    "kLH79": "Email",
    "kOi5A": "Seite drucken",
    "kPD22": "Wörterbuch",
    "kPJ-A4": "Aktualisierung",
    "kZd9G": "Ruby verfügt über eine integrierte „Base64“-Bibliothek, die Methoden für die Base64-Kodierung und -Dekodierung bereitstellt. Binden Sie die Bibliothek mit „require“ ein",
    "kcHxr": "Bitte geben Sie hier den Benutzernamen des Administratorkontos ein",
    "kjks1": "Abrufen der i18n-Konfiguration von der lokalen Server-API",
    "kqv5ht": "Jiddisch",
    "krxSK": "KI-Assistent",
    "ks12d": "Internet-Sicherheit",
    "kv4wag": "Niederländisch",
    "l1p9z": "Was ist Base32?",
    "l3akoa": "Amharisch",
    "l6Djb": "Wählen Sie eine der Optionen als Ihr bevorzugtes Thema:",
    "lIn3_": "Admin-Benutzername",
    "lQFII": "Lösen Sie die Initialisierung erneut aus",
    "lRHDQ": "Verlassen Sie den Vollbildmodus",
    "lUh5c": "Allgemein",
    "lkuulh": "Französisch",
    "lp0qmd0": "Markieren Sie es als Favorit",
    "lpKAz": "Einstellungen",
    "lpzg83": "Samoaner",
    "lzGS2": "Erweiterungsdetail",
    "m0106": "Konverter",
    "m0107": "Generator",
    "m0108": "Formatierer",
    "m6d8b": "Jeder 5-Bit-Wert wird durch ein einzelnes Zeichen dargestellt, was eine effiziente Kodierung und Dekodierung für Systeme ermöglicht, die lieber mit Oktetten (8-Bit-Einheiten) arbeiten.",
    "m6t1b": "Die „base32“-Bibliothek von Daniel R. Collins bietet Base32-Kodierungs- und Dekodierungsfunktionen in C++.",
    "m7WZw": "System-Websocket defekt",
    "m8rTc1": "Sobald der Shell-Skript-Manager implementiert ist, können Sie ihn zum Verwalten Ihrer Shell-Befehle verwenden.",
    "m9k1z": "Wenn die zu dekodierenden Daten jedoch eine bestimmte Anwendungssemantik enthalten (z. B. bestimmte QR-Code-Formate), kann nach der Dekodierung eine zusätzliche Verarbeitung erforderlich sein.",
    "mBgF1": "Mausaktion",
    "mSFei": "Quellcode auf GitHub",
    "mWXeh": "Arbeitsbereich-ID: {0}",
    "mabHq": "Finden Sie alte Dateien",
    "mbzCv": "Es ist ein Fehler aufgetreten: {0}, Ablehnungszeit ist {1}",
    "md2.desc.1039": "Dieser Vorgang kodiert Daten in einen {0}-Hash.",
    "md2.text.192d3": "Generieren Sie {0} Hash",
    "md2aO2NaJITm": "Einrückt und verschönert Cascading Style Sheets (CSS)-Code, sodass er leichter lesbar und verständlich ist.",
    "md4.desc.1039": "Dieser Vorgang hasht Daten in einen {0}-Hash.",
    "md4.text.192d3": "Generieren Sie {0} Hash",
    "md5-cpp-install-openssl-0002": "Installieren Sie OpenSSL auf Ihrem System und verknüpfen Sie es mit den Bibliotheken „libssl“ und „libcrypto“, wenn Sie Ihre C++-Anwendung erstellen.",
    "md5-cpp-openssl-0001": "C++ verwendet die OpenSSL-Bibliothek, um MD5-Hashes zu generieren. Sie müssen OpenSSL installieren und in Ihrem Projekt damit verknüpfen.",
    "md5-cpp-use-openssl-0003": "Das Snippet erstellt eine Funktion „getMD5“, die eine Eingabezeichenfolge entgegennimmt, ihren MD5-Hash mithilfe der MD5-API von OpenSSL berechnet und den Hash als hexadezimale Zeichenfolge zurückgibt. Fügen Sie diesen Code in Ihr C++-Programm ein und rufen Sie die Funktion „getMD5“ mit der gewünschten Eingabe auf.",
    "md5-csharp-built-in-0001": "In C# wird die Klasse „System.Security.Cryptography.MD5“ zum Generieren von MD5-Hashes verwendet.",
    "md5-csharp-no-install-0002": "Es ist keine Installation einer externen Bibliothek erforderlich, da diese Teil von .NET Framework/Core ist.",
    "md5-csharp-use-0003": "Dieses Snippet erstellt eine MD5-Instanz, konvertiert die Eingabezeichenfolge in Bytes, berechnet den Hash und codiert den Hash schließlich im Base64-Format. Platzieren Sie diesen Code im Einstiegspunkt Ihrer C#-Anwendung und führen Sie ihn aus, um den Base64-codierten MD5-Hash zu erhalten.",
    "md5-java-built-in-0001": "Java verwendet die Klasse „java.security.MessageDigest“, um MD5-Hashes zu generieren.",
    "md5-java-imports-0002": "Sie müssen „java.security.MessageDigest“ und „java.util.Base64“ importieren, um das Ergebnis zu hashen und zu kodieren.",
    "md5-java-use-0003": "Das Snippet ruft eine Instanz des MD5-Digest-Algorithmus ab, aktualisiert sie mit den Bytes der Eingabezeichenfolge und codiert dann den resultierenden Hash in eine Base64-Zeichenfolge. Kopieren Sie diesen Code in eine Java-Klasse und führen Sie deren Hauptmethode aus, um den Base64-codierten MD5-Hash zu erhalten.",
    "md5-nodejs-built-in-0001": "In Node.js wird das integrierte „Crypto“-Modul zum Generieren von MD5-Hashes verwendet.",
    "md5-nodejs-no-install-0002": "Es ist keine Installation einer externen Bibliothek erforderlich, da „crypto“ mit Node.js vorinstalliert ist.",
    "md5-nodejs-use-0003": "Das Snippet erstellt mit „createHash('md5')“ ein Hash-Objekt, aktualisiert es mit der Eingabezeichenfolge und konvertiert dann den Digest über „.digest('hex')“ in das Hexadezimalformat. Fügen Sie diesen Code in Ihr Node.js-Skript ein und führen Sie ihn aus, um den MD5-Hash des Eingabewerts abzurufen.",
    "md5-php-built-in-0001": "PHP verfügt über eine integrierte Funktion „md5()“ zum Generieren von MD5-Hashes.",
    "md5-php-no-install-0002": "Es ist keine Installation einer externen Bibliothek erforderlich, da „md5()“ in PHP vorinstalliert ist.",
    "md5-php-use-0003": "Dieses einfache Beispiel definiert eine „getMD5“-Funktion, die die PHP-Funktion „md5()“ für die bereitgestellte Eingabezeichenfolge aufruft. Kopieren Sie diesen Code in eine PHP-Datei, speichern Sie ihn mit der Erweiterung .php und führen Sie ihn auf einem Webserver oder über die Befehlszeile aus, um den MD5-Hash des Eingabewerts anzuzeigen.",
    "md5-python-built-in-0001": "Python verwendet die integrierte „hashlib“-Bibliothek zum Generieren von MD5-Hashes.",
    "md5-python-no-install-0002": "Es ist keine zusätzliche Installation erforderlich, da „hashlib“ standardmäßig in Python enthalten ist.",
    "md5-python-use-0003": "Die bereitgestellte Vorlage kodiert die Eingabezeichenfolge in Bytes, bevor ein MD5-Hash-Objekt erstellt wird. Anschließend wird die Methode „.hexdigest()“ für das Hash-Objekt aufgerufen, um den MD5-Hash in hexadezimaler Form abzurufen. Kopieren Sie diesen Code in ein Python-Skript und führen Sie es aus, um den MD5-Hash zu erhalten.",
    "md5.desc.rxsHq": "Dieser Vorgang hasht Daten in einen {0}-Hash.",
    "md5.textiDjMIo": "Generieren Sie {0} Hash",
    "md6.desc.1039": "Dieser Vorgang hasht Daten in einen {0}-Hash.",
    "md6.text.192d3": "Generieren Sie {0} Hash",
    "mihc3": "Dieser Vorgang wurde abgeschlossen",
    "mjHoR": "Auch technisch gesehen kann niemand dieses Token lesen, sonst hätte er/sie Ihren Computer angegriffen und kontrolliert.",
    "mnb19i": "Deutsch",
    "mno34567": "Vorteile von Base64",
    "mnoijklm": "Gibt es andere BaseXX-Kodierungen?",
    "mslw4o": "griechisch",
    "mwn7iv": "Zulu",
    "myxedr": "mongolisch",
    "n0pqrstu": "Beispielverwendung von Base64",
    "n1jA9": "Bestätigen",
    "n24tes": "Portugiesisch (Brasilien)",
    "n3e7r": "Geschichte von Base32",
    "n94an4": "Polieren",
    "n98EW": "Vertauschen Sie den Text der Eingaberegion und der Ausgaberegion.",
    "nSeIq8-": "Und was am wichtigsten ist: Es ist kostenlos und Open Source. Sie können es für Ihren persönlichen oder kommerziellen Zweck verwenden.",
    "nTvw4": "Um Ihre Daten und Einstellungen zu schützen und separat zu speichern, können Sie dazu Ihr lokales Konto verwenden. Darüber hinaus wird LafTools in Zukunft Instant-Message-Widgets für Benutzer unterstützen.",
    "nmb1wx": "Yoruba",
    "nodBw": "Dieser Vorgang kodiert Rohdaten in eine ASCII-{0}-Zeichenfolge.",
    "nopqrs01": "Während Base64 auf Kompaktheit optimiert, wird Base32 gewählt, wenn die Minimierung von Eingabefehlern, wie z. B. manuelle Eingaben, von entscheidender Bedeutung ist.",
    "nrix6l": "Chichewa",
    "nxJC7": "Die Standardaktion, die ausgeführt werden soll, wenn der Transformator ausgeführt wird.",
    "o1umzi": "Französisch",
    "o52xW": "Export",
    "o8xyzu": "Luxemburgisch",
    "oBz8D": "Wird geladen",
    "oNLxH": "Nutzername",
    "oNg3f": "Offizielle Website",
    "ocxsw3": "irisch",
    "of_ox": "Alles in allem ist LafTools eine Komplettlösung für alle Ihre Bedürfnisse.",
    "oj23X": "Datenbank wiederherstellen",
    "ooiFU": "Starten Sie den Java-Dienst neu",
    "oqHqVq": "Sortiere nach",
    "oqHqqV": "Gesamt: {0} Befehle",
    "oqHqqVq": "Zeiten kopieren",
    "oqjbcj": "Laotisch",
    "os8h6u": "dänisch",
    "p5e9n": "Fügen Sie die Bibliothek als Abhängigkeit in Ihrem Gradle-Build-Skript hinzu. Fügen Sie beispielsweise in der Datei build.gradle auf App-Ebene „implementation 'com.bottlerocketstudios:barcode-core:...“ mit der neuesten Versionsnummer hinzu.",
    "p6e3n": "Um es zu installieren, führen Sie „Install-Package Base45“ in der Package Manager-Konsole aus oder fügen Sie die Abhängigkeit über den NuGet Package Manager hinzu.",
    "p8Exxc1s": "Es gibt verschiedene Tools, die KI-Technologien nutzen, um Aufgaben im KI-Labor effizienter auszuführen.",
    "p8eq9n": "Sie können Bibliotheken wie „base85“ oder „ascii85“ für die Base85-Kodierung und -Dekodierung in JavaScript verwenden.",
    "p9e1n": "Sie können Bibliotheken wie „base-x“ (<a href='https://github.com/cryptocoinjs/base-x'>GitHub-Link</a>) oder „base62“ (<a href='https: //www.npmjs.com/package/base62'>npm-Link</a>) für Base62-Kodierung und -Dekodierung in JavaScript.",
    "p9s5t": "Base32 wurde 2001 von Douglas Crockford entwickelt, der für seine Beiträge zu JavaScript bekannt ist. Es wurde als zuverlässigere Alternative zu bestehenden Kodierungen wie Base64 entwickelt, insbesondere für Situationen, in denen textbasierte Darstellungen von Binärdaten erforderlich sind.",
    "pANmj": "Tags können basierend auf Servertypen, Skriptverwendungen oder anderen von Ihnen bevorzugten Kriterien definiert werden.",
    "pA_deJ": "In die Zwischenablage exportieren",
    "pA_feeJ": "Terminal wieder anschließen",
    "pA_qweJ": "Puffer löschen",
    "pDBSWq": "Für den rechten Bereich ist kein Inhalt verfügbar",
    "pEk1kk": "LafTools stellt Ihnen hier nützliche Funktionalitäten vor.",
    "pEk1qkk": "Listen Sie alle geöffneten Registerkarten auf",
    "pHZDB": "Echtzeit-Action",
    "pJoOz": "Datei öffnen",
    "pKHRT": "Gehen Sie zu Extras",
    "pKqHRq": "Suchnotizen",
    "pL6qH": "Vollendet.",
    "ph5jH": "Umgang mit diesem Teil",
    "piih4x": "Tadschikisch",
    "pmAee": "Lesen Sie weitere Informationen zu diesem Tool.",
    "pmnp4b": "ukrainisch",
    "ppmz8e": "Haitianisches Kreol",
    "pq5e9n": "Sie können Bibliotheken wie „bs58“ verwenden, um Base58-Kodierung und -Dekodierung in JavaScript durchzuführen.",
    "pqrs890t": "Universelle Kompatibilität: Base64 ist weithin anerkannt und wird in allen wichtigen Programmiersprachen unterstützt.",
    "pqs7y3": "Bitte erwägen Sie die Registrierung dieser Webseite als PWA, um vollständige Keymap-Unterstützung zu erhalten.",
    "psA_eJ": "Als Datei exportieren",
    "psZoP": "Legen Sie Dateien hier ab, um sie zu verarbeiten",
    "psqqpq_o": "Okay, das Ergebnis wurde {0} Mal in Ihre Zwischenablage kopiert.",
    "q12beqwR": "Keine verfügbaren Tools",
    "q29t31": "Polieren",
    "q2n3r": "Heutzutage wird es in verschiedenen Anwendungen eingesetzt, bei denen Platzeffizienz und Lesbarkeit von entscheidender Bedeutung sind, beispielsweise bei PDF-Dokumenten und bestimmten Netzwerkprotokollen.",
    "q2n9r": "Kopieren Sie nach dem Hinzufügen die bereitgestellte Vorlage in eine Swift-Datei. Beachten Sie, dass wir in diesem Beispiel ein hypothetisches Szenario verwenden, in dem Sie über die Base64-Darstellung der Base45-Zeichenfolge verfügen. Ersetzen Sie ihn durch den tatsächlich codierten Wert, bevor Sie den Code ausführen.",
    "q2w5m": "Zweck der Verwendung von Base32?",
    "q2x8k": "Seine Verwendung hat sich auf andere Kryptowährungen und Szenarien ausgeweitet, in denen für Menschen lesbare, fehlerresistente Zeichenfolgen erforderlich sind.",
    "q5h8n": "Der Hauptvorteil ist die reduzierte Stringlänge bei gleicher Menge codierter Daten, wodurch es sich für Anwendungen eignet, bei denen Platzeffizienz von entscheidender Bedeutung ist.",
    "q6K7o": "Aus Notizen laden",
    "q6n1r": "Die Bibliothek stellt Encoder- und Decoderklassen bereit, die die Base45-Konvertierung durchführen. Sobald die Abhängigkeit hinzugefügt wurde, kopieren Sie den Vorlagencode in eine Java-Klasse und führen Sie ihn aus.",
    "q7n3r": "Außerdem werden mehrdeutige Zeichen wie „O“ und „0“, „I“ und „l“ vermieden, die zu menschlichen Transkriptionsfehlern führen können.",
    "q9iuti": "Walisisch",
    "qDrbEr": "Der von Ihnen angegebene Benutzername ist leer. Bitte überprüfen Sie ihn und versuchen Sie es erneut.",
    "qF4uS2": "Arbeitsbereich erstellen",
    "qF4uS23": "Neues Fenster",
    "qHoktx": "Danke schön!",
    "qN1LdZ2": "Zuletzt bearbeitet",
    "qQmBr": "Textübersetzung",
    "qTqyvWdY": "Noch nicht fertig",
    "qWemXE4": "1. Januar 2024",
    "qWw3eTH": "Dieser Teil hilft bei der Verwaltung von Dateien auf Ihrer lokalen Festplatte oder Cloud-Festplatte.",
    "qdeFXx": "Derzeit ist die von Ihnen gesuchte Seite noch nicht vollständig implementiert.",
    "qpDBSW": "Kein Panel verfügbar",
    "qpDBSWe1": "Kein Panel verfügbar",
    "qqK_x_": "Anmelden",
    "qqqwYoz": "Helfen",
    "qqwYoz": "Tabs",
    "qqwYqwe": "Arbeitsbereiche",
    "qrstuvwx": "Ja, neben Base64 und Base32 gibt es auch Base16 (Hexadezimal), Base58 und Base85, die jeweils für unterschiedliche Szenarien konzipiert sind.",
    "qtpmvP": "Bestätigen Sie das lokale Passwort",
    "qubSJ": "Erweiterungs-VM ist keine ID. (REF: IQnMH).",
    "qv1p5n": "In Java können Sie beispielsweise die Bibliothek „org.iso.base45“ verwenden, um Ihre Daten zu kodieren.",
    "qzshys": "Urdu",
    "r1GLS": "Stichworte",
    "r2n7v": "Der Hauptvorteil ist eine bessere Lesbarkeit durch den Ausschluss ähnlich aussehender Zeichen, wodurch Fehler bei der manuellen Eingabe reduziert werden.",
    "r4n6v": "Fügen Sie die Abhängigkeit zu Ihrem Projekt hinzu, indem Sie „go get github.com/btcsuite/btcutil“ ausführen. Dadurch wird das Paket heruntergeladen und installiert.",
    "r6nq2v": "Der Hauptvorteil von Base62 ist seine erhöhte Speicherplatzeffizienz aufgrund eines größeren Zeichensatzes als Base32, jedoch ohne nicht-alphanumerische Zeichen, die in Base64 vorkommen.",
    "r6tq9z": "<b>Beispiel:</b> Um „TEST12345“ in Base32 zu kodieren, können Sie Bibliotheken wie base32-encode in Node.js oder integrierte Funktionen in anderen Sprachen wie Pythons base64.b32encode verwenden.",
    "r8c6z": "Ersetzen Sie „TEST12345“ durch Ihre eigene Zeichenfolge und führen Sie diese Klasse als Java-Programm aus, um Ergebnisse anzuzeigen.",
    "r8y2w": "Für die Base32-Kodierung und -Dekodierung wird hier die PHP-Bibliothek „Base32“ verwendet.",
    "r9a3t": "Base45 ist ein textbasiertes Kodierungsschema, das Binärdaten in ASCII-Zeichen kodiert.",
    "r9qn8v": "Der Hauptvorteil von Base85 ist die verbesserte Speicherplatzeffizienz aufgrund eines größeren Zeichensatzes (85 gegenüber 64 in Base64 oder 32 in Base32).",
    "rK6cx": "{0}, entworfen und entwickelt vom LafTools-Team",
    "rLXJN": "In Kotlin kann die in Android integrierte Klasse „android.util.Base64“ für die Base64-Kodierung und -Dekodierung verwendet werden. In diesem Beispiel wird von einer Android-Umgebung ausgegangen. Erwägen Sie für Nicht-Android-Kotlin-Projekte die Verwendung von „java.util.Base64“.",
    "rQkas": "Willkommen bei LafTools",
    "rR1vd": "Eingabe aus Datei",
    "rT34qnO": "Geben Sie Text zur Bearbeitung ein. Das Ergebnis wird im Ausgabeeditor angezeigt.",
    "rVqlu": "{0} dekodieren",
    "rYSpwq": "Der MD2-Algorithmus (Message-Digest 2) ist eine kryptografische Hash-Funktion, die 1989 von Ronald Rivest entwickelt wurde. Der Algorithmus ist für 8-Bit-Computer optimiert. Obwohl MD2 auch seit 2014 nicht mehr als sicher gilt, wird es weiterhin in der Öffentlichkeit verwendet Schlüsselinfrastrukturen als Teil von mit MD2 und RSA generierten Zertifikaten. Der Message-Digest-Algorithmus besteht standardmäßig aus 18 Runden.",
    "r_n6h": "Heller oder dunkler Modus",
    "rf0mql3": "Helles oder dunkles Thema",
    "rpG0G": "Wir schätzen Ihr Feedback und freuen uns über Ihre Gedanken darüber, wie wir unser Produkt verbessern können – zögern Sie nicht, uns Ihr Feedback mitzuteilen!",
    "run_text": "Bevor wir Ihre Workbench betreten, möchten wir zunächst die erforderlichen Systemressourcen vorladen. Bitte warten Sie eine Weile, der Vorgang wird bald abgeschlossen sein. Einzelheiten dazu finden Sie unten.",
    "rycJy": "LafTools ist eine vielseitige Toolbox, die speziell für Programmierer entwickelt wurde. Es stellt die zweite Version der CodeGen Toolbox dar, jetzt mit einer schlankeren Laufzeit, geschrieben in Golang und JavaScript.",
    "ryhkqb": "bulgarisch",
    "s0vrf9": "hebräisch",
    "s1b3m": "Im Gegensatz zu Base64 oder Base32 schließt es die leicht verwechselbaren Zeichen „0“, „O“, „I“ und „l“ aus und eignet sich daher für URLs und QR-Codes.",
    "s3e6r": "Wie kodiere ich Daten mit Base45?",
    "s4OeX": "Melden Sie sich erfolgreich am System an",
    "s5b8m": "Ersetzen Sie „TEST12345“ durch Ihre eigenen Daten und führen Sie dieses Skript in einer PHP-Umgebung aus, um Base32-Operationen durchzuführen.",
    "s5e8r": "Ersetzen Sie „TEST12345“ durch Ihre tatsächlichen Daten und führen Sie dieses Snippet in einem Swift-Anwendungskontext aus, um Base32-Vorgänge auszuführen.",
    "s5t0n": "Beim Auffüllen in Base32 werden „=“-Zeichen hinzugefügt, um sicherzustellen, dass der letzte Teil der codierten Daten immer noch ein Vielfaches von 8 Bits enthält. Im Gegensatz zu Base64 ist die Base32-Auffüllung jedoch minimal, da jedes Base32-Zeichen bereits 5 Bits codiert.",
    "s7e9r": "Es werden keine externen Bibliotheken benötigt. Ersetzen Sie einfach „b'TEST12345“ durch Ihr tatsächliches byteähnliches Objekt zum Kodieren/Dekodieren.",
    "sBxHr": "Scala verwendet die in Java integrierte Klasse „java.util.Base64“ für Base64-Operationen. Stellen Sie sicher, dass Sie eine JVM-Plattform mit Java 8 oder höher verwenden.",
    "sHoxxW": "Konvertierung",
    "sKx5t": "Die in Java integrierte Klasse „java.util.Base64“, die seit Java 8 verfügbar ist, stellt Methoden für die Base64-Kodierung und -Dekodierung bereit. Die Eingabezeichenfolge wird mithilfe der UTF-8-Kodierung in Bytes konvertiert und dann nach Bedarf kodiert und dekodiert.",
    "sO0MOe": "Jedes Mal, wenn Sie länger als 5 Sekunden in einem Fenster bleiben, wird es hier angezeigt.",
    "sR8yc": "Schließen",
    "sc49my": "Sindhi",
    "sdfk1": "Scrollen Sie durch die Tabs nach links",
    "sdfk13": "Scrollen Sie mit den Tabs nach rechts",
    "sglMS": "Zeit schaffen",
    "sk123": "Noch nicht fertig",
    "slqcWD": "Dieser Logikteil wird noch nicht unterstützt, bitte bleiben Sie dran.",
    "sojBI": "Konvertierung",
    "spCqEa": "MACHEN",
    "spdh98": "Vereinfachtes Chinesisch",
    "ssDaOq": "Neu bei LafTools?",
    "ssm80i": "baskisch",
    "svqh06": "Aserbaidschanisch",
    "sys_updates": "Neueste Systemaktualisierungen",
    "t63Qw": "Zurückweisen",
    "t6wczq": "Xhosa",
    "t7m4g": "Die Kiste „base32“ wird für die Base32-Kodierung und -Dekodierung in Rust verwendet.",
    "t84q1z": "Armenisch",
    "t8c6xc": "somali",
    "t8z1v": "Wenn am Ende nicht genügend Bits übrig sind, um eine vollständige 5-Bit-Gruppe zu füllen, werden Füllzeichen „=“ hinzugefügt. Beispielsweise erfordert ein Byte zwei Base32-Zeichen und eine 3-Byte-Sequenz würde vier Base32-Zeichen erfordern.",
    "t9m3g": "CryptoSwift ist ein beliebtes Swift-Paket, das Base32-Kodierungs- und Dekodierungsfunktionen enthält.",
    "tBIX-d": "Windows",
    "tEiv_": "Erweiterungsdetails abrufen",
    "tIy3Q": "Es ist ein Fehler aufgetreten",
    "tIyq3Q": "Es ist ein Fehler aufgetreten",
    "tR8pY": "Go stellt ein Standardbibliothekspaket „encoding/base64“ mit Funktionen für die Base64-Kodierung und -Dekodierung bereit. Es sind keine externen Abhängigkeiten erforderlich. Importieren Sie dieses Paket einfach in Ihr Go-Programm und rufen Sie die entsprechenden Funktionen auf.",
    "tWe1yF": "Kein Shell-Befehl verfügbar.",
    "tY3p1": "Mehr Informationen",
    "tiaiB": "Stornieren",
    "tn7duf": "kroatisch",
    "ttAre": "Geben Sie hier Ihr Klartext-Passwort ein",
    "tuv23456": "Base64-URL-sichere Variante",
    "twamg": "KI-Assistent, der Ihre Kreativität fördert",
    "tyhgpr": "Javanisch",
    "u1i2b": "Welche Vorteile bietet die Verwendung von Base85 gegenüber Base64 oder Base32?",
    "u2l8s": "Was ist Base45?",
    "u3i8b": "Welche Vorteile bietet die Verwendung von Base62 gegenüber Base64 oder Base32?",
    "u3j9p": "Base32 wird häufig verwendet, wenn Sie eine kompakte Textdarstellung von Binärdaten benötigen, die ohne Informationsverlust eingegeben oder gedruckt werden kann, z. B. bei Dateiintegritätsprüfungen, Geocaching und der sicheren Passwortgenerierung.",
    "u7i9b": "Verwenden Sie für Go das auf GitHub verfügbare Paket „btcutil“, insbesondere das Base58-Modul.",
    "u7vwx8yz": "Allgemeine Base64-Operationen",
    "u8i5b": "Welche Vorteile bietet die Verwendung von Base58 gegenüber Base64 oder Base32?",
    "u9g6t": "Um diesen Code auszuführen, müssen Sie das Paket „@digitalbazaar/base45“ installieren.",
    "uCEe8": "Echtzeitkonvertierung",
    "uFcDQ": "Statusdaten werden initialisiert...",
    "uV5Bi": "Erweiterung kann nicht geladen werden",
    "uVseB": "Drücken Sie {0}, um die Hotkey-Liste anzuzeigen",
    "uW7eZ": "In C gibt es keine native Base64-Implementierung. In diesem Beispiel wird die OpenSSL-Bibliothek für die Base64-Kodierung und -Dekodierung verwendet. Um dieses Code-Snippet zu verwenden, installieren Sie OpenSSL auf Ihrem System und verknüpfen Sie es mit den entsprechenden Bibliotheken, wenn Sie Ihr Programm kompilieren, indem Sie einen Befehl ähnlich „gcc -o base64_example base64_example.c -lssl -lcrypto“ verwenden.",
    "ucDLv": "Sie haben dieses Element {0} Mal kopiert",
    "ui5pZ": "Befehlsparser",
    "ulah0q": "japanisch",
    "unc9E": "Zufälliger Text",
    "usr_defined": "Systemeinstellungen",
    "uvwxyza1": "Kein Datenverlust: Da es sich um einen umkehrbaren Prozess handelt, führt die Base64-Kodierung nicht zu Informationsverlusten.",
    "uwqGE": "Gehen Sie zu Extras",
    "v3k5r": "Der Zeichensatz umfasst alle Groß- und Kleinbuchstaben (A-Z, a-z) und Ziffern (0-9) und bietet so eine kompaktere Darstellung im Vergleich zu Base64 oder Base32.",
    "v4k6r": "Es kodiert Daten im Vergleich zu Base64 oder Base32 in eine kompaktere Form, indem es einen größeren Zeichensatz verwendet.",
    "v4n9t": "Base58 ist ein Codierungsschema, das Binärdaten als Folge alphanumerischer Zeichen darstellt.",
    "v5k3r": "Diese Bibliothek bietet eine einfache API für die Base45-Kodierung und -Dekodierung in Node.js-Anwendungen. Kopieren Sie nach der Installation die bereitgestellte Vorlage in Ihr Skript und führen Sie es mit dem Node.js-Interpreter aus.",
    "v6qkl": "Das BouncyCastle NuGet-Paket bietet Base32-Kodierung und -Dekodierung in C#.",
    "v7q3db": "Thailändisch",
    "v9b7t": "Ersetzen Sie „TEST12345“ durch Ihre eigene Zeichenfolge und führen Sie diese Konsolenanwendung aus, um Base32-Kodierungs- und -Dekodierungsvorgänge durchzuführen.",
    "vOjNC": "Geben Sie das Passwort oder den sicheren Schlüssel ein",
    "vTsQU": "Bitte geben Sie den Einladungscode von Ihrem Administrator an",
    "vU17B": "Die Anfrage konnte nicht gesendet werden",
    "vWqac": "Bevor wir Ihre Workbench betreten, möchten wir zunächst die erforderlichen Systemressourcen vorladen. Bitte warten Sie eine Weile, der Vorgang wird bald abgeschlossen sein. Einzelheiten dazu finden Sie unten.",
    "vaP0vq": "Richten Sie das lokale Passwort erfolgreich ein.",
    "vci8rd": "Niederländisch",
    "vh9j4": "Eingang",
    "vo1prl": "Spanisch",
    "vr93oi": "finnisch",
    "vrfjnf": "Italienisch",
    "vwx1yza2": "Ein Beispiel ist die Codierung einer Bilddatei, um sie in ein HTML-<img>-Tag einzubetten:",
    "w1x4k": "Ja, es gibt mehrere Varianten, darunter Ascii85 (verwendet in PostScript und PDF), Z85 (ZeroMQ) und UUencode (ein älteres Format). Jeder hat einen etwas anderen Zeichensatz und andere Regeln.",
    "w2x9qk": "Während Base62 selbst keine nennenswerten Varianten aufweist, können sich einige Implementierungen in der Wahl des Zeichensatzes geringfügig unterscheiden, z. B. durch den Ausschluss von „+“ oder „/“, die üblicherweise in Base64 verwendet werden.",
    "w3x7k": "Ja, einige beliebte Varianten umfassen Base58Check, das eine Prüfsumme zur Fehlererkennung hinzufügt, die häufig bei Bitcoin verwendet wird.",
    "w6otqn": "Korsisch",
    "w92j07": "Russisch",
    "w9qudj": "Punjabi",
    "wAxtg": "Zunächst haben wir eine UUID als autorisiertes Token generiert, damit Sie diese Einrichtung durchführen können. Nach dem, was LafTools erhalten hat, ist das von Ihnen bereitgestellte Token {0}. Es wurde von LafTools erfolgreich überprüft und Sie können daher mit der Einrichtung dieses Formulars fortfahren.",
    "wI1eh": "Nächste",
    "wQYoz": "Datei",
    "wQdYoz": "Bearbeiten",
    "wQdqwYoz": "Sicht",
    "wcl1K": "Verwendung",
    "wgkk6y": "maltesisch",
    "wj3VS": "Dieser Vorgang dekodiert Daten aus einer ASCII-{0}-Zeichenfolge zurück in ihr Rohformat.",
    "wsWcXd": "Benachrichtigungen",
    "wxyzabcd": "Es gibt eine URL-sichere Version von Base64, die „+“ durch „-“ und „/“ durch „_“ ersetzt und auf das Auffüllen von „=“ verzichtet, wodurch sie für Web-URLs geeignet ist.",
    "x009": "Um auf unsere Nutzungsdokumentation zuzugreifen",
    "x2c5e": "Um Base45 in Python verwenden zu können, müssen Sie die Bibliothek „base45“ installieren.",
    "x2z6r": "Was ist Base58?",
    "x5alzu": "Kurdisch (Kurmanji)",
    "x5tHV": "Systemübersicht",
    "x5z1b": "Base45 wurde hauptsächlich für die Verwendung von QR-Codes im Rahmen digitaler COVID-Zertifikate entwickelt.",
    "x6v2w": "In C gibt es keine Standard-Base32-Bibliothek, daher verwenden wir hier eine hypothetische „libbase32“-Bibliothek.",
    "x7n1m": "Base62 ist ein Codierungsschema, das Binärdaten als Folge von 62 alphanumerischen Zeichen darstellt.",
    "x8mdg": "Das integrierte „base64“-Modul von Python bietet Base32-Kodierung und -Dekodierung über die Funktionen „b32encode“ und „b32decode“.",
    "x9g7e": "Laden Sie den Quellcode von GitHub (https://github.com/dankamongmen/libbase32) herunter oder installieren Sie ihn als Paket, sofern für Ihre Plattform verfügbar.",
    "x9n1b": "Base85 ist ein Codierungsschema, das Binärdaten mithilfe eines Satzes von 85 druckbaren ASCII-Zeichen darstellt.",
    "xMBv0": "Verwandte Ressourcen werden geladen...",
    "xOJqG1": "Häufig gestellte Fragen",
    "xPHqP": "Die Beschreibung ist noch nicht definiert.",
    "xQ_ls": "Redis sichern",
    "xbz0B": "Alle Fenster schließen",
    "xbz0B2": "Tab schließen",
    "xdqwe": "Willkommen bei LafTools!",
    "xeP4zV": "Sehen Sie sich schnell Ihre TODO-Elemente an",
    "xeP4zVd": "Schlagen Sie schnell einen englischen Wortschatz nach.",
    "xlqtA": "Rückmeldung",
    "xs22XLF": "Für diese Artikel-ID sind keine Daten verfügbar. Bitte wählen Sie andere Artikel aus.",
    "y3b6n": "Ja, solange die codierte Zeichenfolge gemäß der Base45-Spezifikation generiert wurde, sollte jeder kompatible Decoder in der Lage sein, sie zu decodieren.",
    "y3m7k": "Verwenden Sie für Java die Bibliothek „iso-base45“, die als Maven-Abhängigkeit in Ihr Projekt eingebunden werden kann.",
    "y3m9k": "Warum wurde Base62 erstellt?",
    "y3qjdd": "Ihr lokales Passwort wurde erfolgreich überprüft.",
    "y5nne": "Dieser Code kann direkt in einer Node.js-Umgebung oder als Teil eines größeren Projekts ausgeführt werden, in dem Sie Base32-Funktionalität benötigen.",
    "y6m8k": "Warum wurde Base85 erstellt?",
    "y6t1n": "Nachteile von Base32",
    "y8Ir5": "Dieser Teil wird zum Initialisieren Ihres Administratorkontos verwendet. Im Moment muss hier jedoch nichts erstellt oder angepasst werden, da es zuvor von Ihrem Administrator eingerichtet wurde. Bitte vernachlässigen Sie diesen Teil und fahren Sie mit den verbleibenden Schritten fort.",
    "y8b1m": "Ersetzen Sie „TEST12345“ durch Ihre eigenen Daten und stellen Sie sicher, dass die Bibliotheksfunktionen korrekt implementiert und verknüpft sind, um dieses Programm für Base32-Operationen zu kompilieren und auszuführen.",
    "y9m1n": "Warum wurde Base58 erstellt?",
    "y9m3k": "Für Swift können Sie die auf GitHub verfügbare Bibliothek „Base45“ verwenden.",
    "y9z2e": "Ersetzen Sie „TEST12345“ durch Ihr tatsächliches Byte-Slice und führen Sie dieses Go-Programm aus, um es mit der Base32-Standardkodierung zu kodieren und zu dekodieren.",
    "y9z2t": "Führen Sie dieses Skript in einer Ruby-Umgebung wie IRB aus oder speichern Sie es als .rb-Datei und führen Sie es mit „Ruby-Dateiname.rb“ aus.",
    "ySVf-": "Versuchen Sie es noch einmal mit dieser Anfrage",
    "yTsqFO": "Der MD4-Algorithmus (Message-Digest 4) ist eine kryptografische Hash-Funktion, die 1990 von Ronald Rivest entwickelt wurde. Die Digest-Länge beträgt 128 Bit. Der Algorithmus hat spätere Designs beeinflusst, beispielsweise die Algorithmen MD5, SHA-1 und RIPEMD. Die Sicherheit von MD4 wurde stark beeinträchtigt.",
    "yVprb": "Dieser Teil befindet sich noch in der Entwicklung.",
    "y_2Q1": "Kodieren und dekodieren",
    "y_2Q2": "Symmetrische Krypto",
    "y_2Q3": "Asymmetrische Krypto",
    "y_2Q4": "Nationale Algorithmen Chinas",
    "y_2Q5": "Web-Auth",
    "y_2Q5dqw": "Text-Matcher",
    "y_9YM": "Die Ausgabe wird hier angezeigt.",
    "y_9YqM": "Statische Dateien werden geladen...",
    "y_BN6": "Digest-Algorithmus",
    "ya0cwu": "malaiisch",
    "yc7dqiu": "Vereinfachtes Chinesisch",
    "yfYeg": "Textvorlage",
    "yiRso": "Cloud-Notizen",
    "ykganl": "dänisch",
    "yqiRso": "Lokale Notizen",
    "yqrxl4": "serbisch",
    "yznU9": "Leere Baumdaten",
    "z-o28we": "Prozesspanel",
    "z0j2nf": "Hindi",
    "z1m2t": "Beispielverwendung: `const encoded = bs58.encode('your-data'); const decoded = bs58.decode(encoded);`",
    "z1n5qr": "Beispiele hierfür sind das base45-npm-Paket für JavaScript und dotnet-base45 für .NET.",
    "z1oFn": "Flucht und Unflucht",
    "z2jzej": "Marathi",
    "z2m7t": "Beispielverwendung: `const base62 = require('base62'); const encoded = base62.encode('your-data'); const decoded = base62.decode(encoded);`",
    "z2t7m": "Was ist Base85?",
    "z2x8c": "Base32 weist weniger visuelle Mehrdeutigkeiten auf, da es nur Großbuchstaben und Ziffern verwendet, was das Lesen und Transkribieren per Hand oder am Telefon im Vergleich zu Base64, das „+“, „/“ und Kleinbuchstaben enthält, erleichtert.",
    "z3m1t": "Nachdem Sie die Abhängigkeit hinzugefügt und das Projekt synchronisiert haben, kopieren Sie die bereitgestellte Vorlage in eine Kotlin-Klasse und ersetzen Sie den Platzhalter durch den tatsächlich codierten Wert, bevor Sie den Code ausführen.",
    "z4t9b": "Was ist Base62?",
    "z5b7m": "Im Vergleich zu Base64 oder Base32 wird ein größeres Alphabet (0-9, A-Z, a-z, -, ., $, /, +, % und *) verwendet, was zu kürzeren codierten Zeichenfolgen für dieselben Eingabedaten führt.",
    "z5bvb": "Installieren Sie es, indem Sie „npm install base32-encoding“ ausführen. Ersetzen Sie „TEST12345“ durch Ihre gewünschten Eingabedaten im Code-Snippet.",
    "z5m6t": "Beispielverwendung: `const base85 = require('base85'); const encoded = base85.encode('your-data'); const decoded = base85.decode(encoded);`",
    "z6m1c": "Spätere Varianten wie z-base-32 wurden eingeführt, um die Benutzerfreundlichkeit zu verbessern und einige weniger einprägsame Zeichen durch andere zu ersetzen, aber die ursprüngliche Spezifikation von Crockford wird auch heute noch häufig verwendet.",
    "z79b1a": "Arabisch",
    "z7n1m": "Verwenden Sie npm oder Yarn, um es zu installieren, indem Sie „npm install @digitalbazaar/base45“ oder „yarn add @digitalbazaar/base45“ ausführen.",
    "z7t1p": "Gibt es bestimmte Varianten von Base62?",
    "z8_ZjYX4H": "Verschönern Sie {0}",
    "z8em2t": "Kopieren Sie nach der Installation die bereitgestellte Vorlage in eine C#-Konsolenanwendung und ersetzen Sie den Platzhalter durch den tatsächlich codierten Wert, bevor Sie das Programm ausführen.",
    "z8m2t": "Welche Vorteile bietet die Verwendung von Base45 gegenüber Base64 oder Base32?",
    "z8n6k": "Ersetzen Sie „TEST12345“ durch die gewünschte Zeichenfolge, kompilieren Sie dieses Programm und führen Sie es aus, um die Ergebnisse der Base32-Kodierung und -Dekodierung anzuzeigen.",
    "z8qm2t": "Die Bibliothek stellt Encoder- und Decoderklassen für Base45-Operationen bereit. Kopieren Sie den Vorlagencode in eine C#-Konsolenanwendung und führen Sie ihn nach der Installation des Pakets aus.",
    "z8qqm2t": "Kopieren Sie nach der Installation die bereitgestellte Vorlage in eine C#-Konsolenanwendung und ersetzen Sie den Platzhalter durch den tatsächlich codierten Wert, bevor Sie das Programm ausführen.",
    "z9b6n": "Fügen Sie die Abhängigkeit über Swift Package Manager ('https://github.com/krzyzanowskim/CryptoSwift') zu Ihrem Xcode-Projekt hinzu.",
    "z9kVv": "Python verfügt über ein integriertes „Base64“-Modul, das Methoden für die Base64-Kodierung und -Dekodierung bereitstellt. Die Eingabezeichenfolge wird zunächst mithilfe der UTF-8-Kodierung in Bytes konvertiert, bevor sie in Base64 kodiert und dann wieder in ihre ursprüngliche Form dekodiert wird.",
    "z9t2p": "Gibt es spezielle Varianten von Base58?",
    "z9t7p": "Gibt es bestimmte Varianten von Base85?",
    "zN2ES": "Arbeitsbereiche",
    "zaSKh": "Aktualisierung",
    "zc3Hf": "Passwort",
    "zjDJk": "Bitte geben Sie den Pfad zum Arbeitsbereichsverzeichnis an",
    "zkqUFa": "{0} ist noch nicht konfiguriert",
    "zkv375": "Khmer",
    "zmDWx": "Kontaktiere uns",
    "znVRwq": "Dateien",
    "zpyd34": "Englisch",
    "zqiIoqXw": "Berechnungen ausführen...",
    "zwd4v": "Erweiterungsdetail",
    "zwgYx": "Der verschlüsselte Passwortwert wird hier angezeigt.",
    "zyx98765": "Kann Base64 zur Komprimierung verwendet werden?",
    "zzcepr": "Cebuano"
}