{
    "": "Mensaje: {0}",
    "-8l11": "Copiado",
    "-DqwwR": "Operación completada.",
    "-GJ_72": "Cambiado al espacio de trabajo seleccionado {0}",
    "-Jx4J": "Cuenta local",
    "-Rj3y": "Temas",
    "-XZnW": "Atrás",
    "-Yo129I": "Herramientas de texto",
    "01do0y": "canarés",
    "04SSf": "¿Has olvidado tu contraseña?",
    "07naT": "Error: {0}",
    "07ui6": "Más información",
    "0Ceqru": "Base64 es una notación para codificar datos de bytes arbitrarios utilizando un conjunto restringido de símbolos que pueden ser utilizados cómodamente por humanos y procesados ​​por computadoras.",
    "0PgZ_": "Traducción",
    "0gvcN": "Bienvenido a la página de descripción general, aún está en desarrollo.",
    "0gywa": "No se encontró el espacio de trabajo, será redirigido a la página de índice del espacio de trabajo.",
    "0pfdz7": "uzbeko",
    "123e4567": "¿Qué es Base64?",
    "13pmE": "Apoyanos",
    "1507oa": "bengalí",
    "1JOFP": "Abrir mi espacio de trabajo",
    "1NTgQ": "Abrir espacio de trabajo",
    "1Npez": "Por favor proporcione la ruta",
    "1Tuab": "Copiado",
    "1X8x7": "Ejemplo",
    "1YmJc": "Seleccione una de las opciones como su idioma preferido:",
    "1a2b3c4d": "¿Por qué utilizar Base64?",
    "1a3Sc": "Cancelar carga",
    "1bd": "Flujo de trabajo",
    "1e3e5n": "Hausa",
    "1h6jH": "¡Advertencia, la salida está vacía!",
    "1j62a": "haz esto en otro momento",
    "1jj0ri": "japonés",
    "1k_44": "Esta operación decodifica datos de una cadena ASCII Base64 a su formato sin formato.",
    "1th2nw": "cingalés",
    "1yIQu": "Puede intentar reprocesar su acción o hacer clic en el botón a continuación para descartar el error.",
    "20nmcv": "latín",
    "22XLF": "No ha terminado aún",
    "23fgh456": "Historia de Base64",
    "24vLI": "Creado",
    "27j7sy": "Shona",
    "2D9a6": "¿Has olvidado tu contraseña?",
    "2D9qdk6": "¿Es lo suficientemente seguro?",
    "2IF6A": "Parece que el almacenamiento guardado de Forge encuentra algún problema",
    "2JyFN": "Copiar resultado al portapapeles",
    "2Ocbey": "Versión",
    "2RhAT": "Parece que el proceso de recuperación de Forge encuentra algún problema",
    "2Ruh6": "Crear nueva cuenta local",
    "2S5ap": "Alternar modo de pantalla completa",
    "2Y1mR": "Borrar texto",
    "2bcde3fg": "Desventajas de Base64",
    "2bqHk": "Carga del archivo",
    "2e4fb7": "igbo",
    "2giYv": "Contraseña de prueba: {0}",
    "2khdsv": "pastún",
    "2lehqwp": "vietnamita",
    "2lhcqwp": "turco",
    "2lhqqwp": "indonesio",
    "2lhqqwqp": "malayo",
    "2lhqwwp": "tailandés",
    "2qdin8": "porfavor ingrese el codigo de verificacion",
    "2tib5m": "sueco",
    "2ybu7j": "noruego",
    "30eo2v": "gujarati",
    "32D9a6": "Crea una cuenta",
    "33RXi": "La solicitud fue rechazada debido a parámetros insatisfactorios.",
    "346qid": "ruso",
    "34wxyz56": "¿Cómo codificar/decodificar Base64 en JavaScript?",
    "39dsCt": "Recibirá la última notificación de los servicios de la aplicación si la tiene.",
    "3ii2tt": "gaélico escocés",
    "3umnB": "Ficha desconocida",
    "441oja": "georgiano",
    "44Ntqw-": "Manejo de la operación.",
    "46bksi": "lituano",
    "4K_vhq": "Duplicar esta pestaña",
    "4PIqD": "Revisión de código",
    "4UYIJ": "No completado aún.",
    "4cGA_": "Recuperando datos para las preferencias del sistema...",
    "4hijk5lm": "Aumento de tamaño: los datos codificados son aproximadamente un 33 % más grandes que los datos binarios originales.",
    "4kKe4": "Tu contraseña",
    "4tqb4x": "húngaro",
    "4vdfwf": "DE ACUERDO",
    "4wlih": "La solicitud fue rechazada debido a parámetros insatisfactorios.",
    "52OiQ": "Copiado {0} veces",
    "54cwb": "La API Websocket del sistema encontró un error: {0}",
    "56ibcj": "vietnamita",
    "58HQX": "Si no conoce su valor, comuníquese con su administrador para obtener más detalles, que se pueden encontrar en su configuración.",
    "5BOhl": "código de invitación",
    "5Ih2u": "Navegador de herramientas",
    "5NCPT": "Modo oscuro",
    "5NJeGsu1": "Correo electrónico, puede organizar fácilmente su bandeja de entrada, redactar y enviar mensajes y estar al tanto de su correspondencia. Hasta ahora, se utiliza únicamente como herramienta de comunicación entre los usuarios y nuestro equipo.",
    "5NJeddqGsu1": "Esta sección incluye materiales informáticos, artículos wiki, guías de uso y más.",
    "5NJedqddqGsu1": "Esta sección incluye recursos informáticos que pueden utilizarse para crear sus propios proyectos.",
    "5Perd": "Lo sentimos, la función 'Usar Smart Editor' aún no está disponible. Todavía estamos trabajando para implementarlo. Gracias por su paciencia.",
    "5ZBYR": "Atrás",
    "5dF7o": "Actualizar",
    "5e6f7g8h": "Base64 se utiliza cuando es necesario transmitir datos binarios a través de protocolos basados ​​en texto como correo electrónico o JSON, o incrustarlos en lugares donde solo se permite texto.",
    "5eXVS": "Contenido del guión",
    "5ggegx": "coreano",
    "5lW8qp": "Mostrar un ejemplo de esta herramienta",
    "5q-Zxqa": "Administrador de guiones",
    "5qPOJL": "Para admitir LafTools, considere darle una estrella a nuestro repositorio en GitHub o actualizar a nuestra versión profesional mediante una suscripción mensual. Apreciaríamos mucho su ayuda y prometemos que LafTools mejorará aún más con los fondos recaudados.",
    "5qV5Sf": "Eliminar este registro de la lista",
    "5rg5mt": "madagascarí",
    "5srFq": "LafHerramientas",
    "5v8jl7": "hmong",
    "6AumW": "Acción por defecto",
    "6ClPV": "Crear",
    "6hsnqWe": "Aunque LafTools es gratuito y de código abierto, mantenerlo aún requiere una cantidad significativa de tiempo y energía. En particular, necesitamos fondos para pagar determinadas API de la nube. Si aprecia LafTools, considere apoyarnos.",
    "6j13s3": "islandés",
    "6nopqrst": "Sin cifrado: Base64 no es un método de cifrado; se decodifica fácilmente y no proporciona seguridad.",
    "6qT9d-N": "Para el portátil, LafTools no solo proporciona un administrador de comandos de shell, sino que también agregará potentes herramientas de notas en un futuro próximo, como MarkDown, Latex, {0}, etc.",
    "6ulj8i": "nepalí",
    "6yOXx": "Nombre desconocido",
    "71x7x": "Código fuente en GitHub",
    "78abcdef": "JavaScript ofrece funciones integradas como btoa() y atob() para codificación y decodificación Base64 respectivamente.",
    "78ijk9lm": "Base64 se definió por primera vez en RFC 1421 (1993) y luego se estandarizó en RFC 4648 (2006).",
    "7MOO1": "Iniciar sesión",
    "7dm0d8": "Chino tradicional",
    "7g5w22": "noruego",
    "7k56u3": "gallego",
    "7q40W": "No se puede inicializar el administrador",
    "7u4vzu": "eslovaco",
    "7x3f6": "Pestaña - 1",
    "82r0C": "Administre su lista de tareas pendientes y haga las cosas de manera más eficiente.",
    "83dNp": "No se puede cargar el ID de extensión. (REF: 1dl1f)",
    "8LdRj": "Descripción general",
    "8LdRjq": "Calcular",
    "8LdevRj": "Servicio",
    "8M1wY": "terminales locales",
    "8eeL1Kk": "Acerca de",
    "8mn_qa": "Recuperando los datos de los servicios de terminal...",
    "8qzWJu": "Lo sentimos, actualmente aún no admitimos dispositivos de pantalla pequeña. Utilice una PC para visitar esta página.",
    "8veXac": "El tiempo es el recurso más valioso, adminístrelo sabiamente.",
    "97um9v": "hawaiano",
    "9Xv8-": "Guardar como nota",
    "9_qaj": "Salir de este formulario",
    "9a335": "Haga clic en cualquier elemento de extensión en el primer menú de la izquierda; el actual está vacío o no es válido.",
    "9e4fcl": "Tamil",
    "9eZHM": "¡Ups! Parece que encontramos algunas advertencias o errores.",
    "9gqo8x": "letón",
    "9i0j1k2l": "También se utiliza para incrustar imágenes pequeñas directamente en HTML o CSS como URL de datos.",
    "9m85mf": "sesoto",
    "9qy1xn": "portugués",
    "9tbbkt": "finlandés",
    "9zCSc": "No hay espacios de trabajo disponibles",
    "A69UZ": "variables",
    "AVUvu": "Base62 es una notación para codificar datos de bytes arbitrarios utilizando un conjunto restringido de símbolos que pueden ser utilizados cómodamente por humanos y procesados ​​por computadoras. La base numérica alta da como resultado cadenas más cortas que con el sistema decimal o hexadecimal.",
    "AW9N8": "Región de entrada",
    "AfPC0": "Tu contraseña en texto plano",
    "Ahrjc": "El directorio no existe, ¿quieres crearlo?",
    "AkXgF": "En curso: {0}%",
    "Apx8D": "¿Cómo restablecer su contraseña manualmente?",
    "B0s0z": "Propósito de esta página:",
    "BGd7P9": "Esta operación codifica datos sin procesar en una cadena ASCII Base64.",
    "BGd7dP9": "Esta operación codifica datos sin procesar en una cadena ASCII {0}.",
    "BGdd7dP9": "Esta operación codifica datos sin procesar en una cadena ASCII {0}.",
    "BShq3M": "Problemas",
    "BW3bpT": "Leyendo el archivo del disco...",
    "Bd9h-": "Agrégalo a mi colección favorita.",
    "BuihG": "Ajustes del sistema",
    "CASef": "Bien, la operación está activada.",
    "CEv8B": "¿Está seguro de eliminar este registro? En caso afirmativo, haga clic en este botón nuevamente.",
    "CVUl0": "LafHerramientas",
    "CWohyqde": "Herramientas",
    "CWoqhy": "Lista de extensiones por ID de categoría seleccionada",
    "CfZAX": "El Archivo {0} seleccionado, lo estamos cargando en el servicio principal.",
    "CidOqAZ": "Como creador de LafTools, me conmueve mucho que esté dispuesto a apoyarnos. Contamos con buena gente en nuestro equipo que trabaja duro para mejorar continuamente LafTools.",
    "Cide2w": "Para ver si hay algún problema al ejecutar tu acción.",
    "DIQFq": "Verifique si el parámetro de URL se proporcionó correctamente; parece que no tiene permiso para completar este formulario. De forma predeterminada, podrá ver el siguiente mensaje en la salida del servicio cuando se acaba de iniciar.",
    "DIweGq": "Asegure sus herramientas Laf",
    "DTTPW": "Reestablezca su estatus",
    "DVoKw": "Cerrar sesión en este sistema",
    "DadYp": "Rebote en tiempo real",
    "DrXAq": "¡Bienvenido a utilizar LafTools!",
    "DrbEr": "La contraseña que proporcionaste está vacía, verifícala e inténtalo nuevamente.",
    "DtlAc": "Cargando recursos del sistema",
    "Dxlw0": "Completo",
    "E62ej": "Filtrar comandos de shell",
    "E6F9B": "Agréguelo al flujo de trabajo",
    "ERK7E": "Si encuentra algún problema o tiene alguna sugerencia mientras usa LafTools, no dude en contactarnos por correo electrónico o GitHub en cualquier momento, estaremos encantados de ayudarle.",
    "EgBXL": "Seleccione o proporcione etiquetas.",
    "Ewvgo": "Todavía no empezado.",
    "ExqvX": "Lista de teclas de acceso rápido",
    "Eyq856": "Aún no hemos terminado: estamos dedicados a brindar las funciones más recientes y mejores, y seguiremos publicando actualizaciones para asegurarnos de que tenga la mejor experiencia posible.",
    "F-OUm": "Configuración rápida para LafTools",
    "F0CCF": "Lista de teclas de acceso rápido",
    "F4uS2": "Archivo nuevo",
    "FBVyc": "Vuelva a ingresar el código de verificación.",
    "FDlRI": "Asigne un nombre a esta nueva pestaña y haga clic para confirmarla.",
    "FOyHW": "Buscar en todas partes",
    "FQzhg": "Ignorar entrada vacía",
    "FhVWl": "Cifre su contraseña",
    "FjYbR": "Producción",
    "Fv-zz": "Copiar resultado",
    "Fy217": "Configurar el transformador de texto",
    "Fzp3t": "Proporcionar valor",
    "G3MJN": "Mostrar panel de salida",
    "G9QVo": "Administrar pestañas",
    "GR7jK": "Tipo",
    "Ggob_": "Cancelar",
    "H-Ae75": "Confirme su contraseña local.",
    "H-qA75": "Proporcione la contraseña local.",
    "H8fQ4": "Cambiar al modo claro u oscuro",
    "HEAhr": "Después de traducir, el resultado aparecerá aquí.",
    "HIc3c": "Terminado",
    "HNDat": "Para realizar cambios, haga clic en el botón \"{0}\". De lo contrario, haga clic en \"{1}\" para aplicar los cambios. ¡Que lo pases bien con esta caja de herramientas!",
    "Hflf2": "Por motivos de seguridad cibernética, no le ayudaremos a restablecer su contraseña a través de API o páginas aquí a menos que actualice manualmente el archivo protegido por el sistema.",
    "HjvV3": "No eliminaremos sus archivos en el disco, simplemente eliminaremos este registro de la lista.",
    "HyIC_": "Tecla de barra diagonal (/)",
    "HyIC_d": "Tecla de barra diagonal (/)",
    "I8FLi": "Ahora es el momento de configurar su administrador. Configure la contraseña lo más compleja posible para dejar perplejos a esos atacantes descorteses.",
    "IAC0A": "Herramientas de búsqueda",
    "ICefi": "Cancelado",
    "IKqqATS": "Actualizar datos de la página actual",
    "IOOrz": "(¿Sería perjudicial para su sistema? No lo creemos, siempre que pueda modificar el archivo de configuración conservado del sistema, eso significa que puede leer todo sobre los archivos de datos de LafTools).",
    "IWUH5": "Mostrar ejemplo",
    "IaSyO": "Cancelar",
    "IfsGO": "Favoritos",
    "IfsdGO": "Favoritos",
    "ImUmf": "Nuevo",
    "J-3KA": "Proporcione un nombre para este script, que sería más útil.",
    "J164i": "p.ej. Copiar archivos al servidor remoto",
    "J2xoL": "Por favor vea el error: {0}",
    "JA_Bp": "Proporcione un nombre para la nueva etiqueta al principio.",
    "JQEVK": "Código",
    "JQLmS": "Ajustó el tamaño",
    "JQLmSq": "Terminado.",
    "JTBRh": "LafTools almacenó el valor de la contraseña en el archivo local, pero no se preocupe, adoptamos un mecanismo de cifrado de contraseña unidireccional, es decir, que nadie puede leer la contraseña de la versión de texto sin formato. Para restablecer la contraseña, siga los siguientes instrumentos para restablecer manualmente su contraseña.",
    "JYqxz2": "Bienvenido a LafTools, esta es una versión privilegiada.",
    "JdqiUE8": "Esta operación decodifica datos de una cadena ASCII (con un alfabeto de su elección, incluidos ajustes preestablecidos) a su forma original.",
    "JdqidUE8": "Esta operación decodifica datos de una cadena ASCII (con un alfabeto de su elección, incluidos ajustes preestablecidos) a su forma original.",
    "JfFHw": "Obtener solicitud de información del espacio de trabajo",
    "JiUE8": "Esta operación decodifica datos de una cadena ASCII {0} a su formato sin formato.",
    "K1qJZI": "Bienvenido a LafTools, Su Excelencia.",
    "KGS2-": "Una vez que haya completado los pasos anteriores, podrá usar su nueva contraseña para iniciar sesión en su sistema. Si no pudo acceder al sistema de archivos, solicite a su administrador o al soporte de TI que cree ese archivo. Si el archivo ya existía, elimínelo y vuelva a crear uno.",
    "KIc63": "Función aún no compatible",
    "KYh1N": "Todas las notas",
    "KcqrRr": "Referencia",
    "KcrRr": "Recuperar datos de implementación de código",
    "KmEUF": "Proporcione una descripción general rápida de las herramientas actuales del sistema.",
    "Kw4OJr": "Terminal",
    "Kyd9H": "Código fuente en GitHub",
    "L-p-Y": "Copie el contenido del comando de shell actual al portapapeles",
    "L3zEM": "Mostrar ejemplo",
    "L42mxa": "Por favor ingrese su texto fuente en este campo.",
    "L49kCq": "Proporcione y confirme la contraseña de bloqueo en este formulario para proteger sus LafTools.",
    "L71q_N": "La contraseña que proporcionaste está vacía, verifícala e inténtalo nuevamente.",
    "L9bQku": "Decodificar {0}",
    "L9qbQku": "Decodificar {0}",
    "LAc1m": "Se actualizó la vista de la aplicación.",
    "LFdvM": "Sin iniciar sesión",
    "LM715": "Recuperar nombres de usuario de la API del servidor local",
    "LPJrV": "Copiar resultado",
    "LU9Jj": "Base85 (también llamado Ascii85) es una notación para codificar datos de bytes arbitrarios. Generalmente es más eficiente que Base64.<br><br>Esta operación decodifica datos de una cadena ASCII (con un alfabeto de su elección, ajustes preestablecidos incluidos). Base85 se usa comúnmente en los formatos de archivo PostScript y PDF de Adobe.",
    "LWaeFqd": "Cambia a tu idioma preferido",
    "Le71_N-": "La contraseña que proporcionó no es la misma que la confirmada, verifíquela e inténtelo nuevamente.",
    "LnJ4H": "Tenga en cuenta que la cuenta local no es la misma que la del usuario registrado en nuestro sitio web; la primera se define solo en su PC, mientras que la segunda se puede usar para la sincronización en la nube.",
    "LqWaFd": "Ajustes del sistema",
    "M3qytc": "Codificar {0}",
    "M3ytc": "A base64",
    "M4ywN1": "Calculadora, Calendario, Reloj, Clima y más.",
    "M6MrW": "Bien",
    "M7jct": "Ingrese al modo de pantalla completa",
    "MN2lT": "La longitud de la contraseña no puede ser inferior a 6",
    "Ma5mv": "Alternar la visibilidad de las pestañas de la barra de herramientas",
    "Mq9pdpT": "Enumere todos los recursos relevantes para el menú funcional que seleccionó.",
    "Mq9ppT": "Vea rápidamente el estado de sus servicios",
    "MrgmU": "Confirmar",
    "NMLOn": "Copiar ruta de archivo",
    "NMLOn1": "Abrir espacio de trabajo",
    "NNfJo": "Cargar datos desde el archivo",
    "Nq1IR": "No se puede cargar la máquina virtual de extensión",
    "Nqc0LqwX": "Si cree que hay una vulnerabilidad en este proceso, no dude en contactarnos por correo electrónico o GitHub en cualquier momento, nos gustaría mejorarlo urgentemente.",
    "O02-W": "No cargando...",
    "O94Yx": "en",
    "OO0qPN": "Ejemplo cargado",
    "OQWm4": "Reportar un error",
    "OSHOI": "Pagina de bienvenida",
    "OSqZQM": "Contraseña local",
    "OeO0PeN": "Bien, el ejemplo se muestra en el editor de entrada.",
    "OeOQY": "HACER",
    "OpPFe": "Si te gusta LafTools, compártelo con tus amigos y danos una estrella, ¡gracias!",
    "Opcty": "Archivos",
    "OqqGx2qg": "Cargando los recursos estáticos, por favor espere...",
    "OrCt5": "Redirigiendo al banco de trabajo...",
    "Ot6EP": "Herramientas polacas",
    "P4ROa": "Región de salida",
    "PM_N5": "Sesión - {0}",
    "PUxuU": "Recuperando datos para paquetes de idiomas...",
    "PapkF": "Si tiene alguna pregunta o sugerencia sobre LafTools, no dude en hacérnoslo saber. Siempre estamos buscando formas de mejorar nuestro producto y brindar la mejor experiencia posible a nuestros usuarios. Puede contactarnos en work7z@outlook.com. ¡Gracias por utilizar LafTools!",
    "PpCHA": "Clave de preguntas (?)",
    "PqazM-": "En primer lugar, utilice los controles del formulario a continuación para cifrar su contraseña.",
    "QL9Sn": "Por el momento, no parece haber una descripción disponible.",
    "QLKzF": "Está repleto de funciones que satisfacen las necesidades tanto de desarrolladores novatos como experimentados, lo que la convierte en una herramienta imprescindible en el arsenal de cualquier programador.",
    "QM2Ob": "Herramientas recientes",
    "QM2Oq": "Notas recientes",
    "QRAdA": "Inglés a chino",
    "QhdpH": "Edición comunitaria",
    "QzlA3": "Ocurrió un error",
    "R12bq": "Listar pestañas que no se muestran",
    "RNBze0": "Herramientas",
    "RNeBze0": "Pestañas abiertas",
    "RNewBze0": "Configuración de herramientas",
    "RO4ZP": "Ocurrió un error",
    "RPVRl": "Parece que esta extensión no es compatible con la versión actual de LafTools. Considere instalar la última versión para admitir esta extensión, o no dude en contactarnos planteando un problema en GitHub.",
    "RhqzcdD": "Ajustes del sistema",
    "RjCO3": "Lista de espacios de trabajo",
    "S4MMV": "¡Ups! Encontramos algunos problemas al cargar el archivo.",
    "SAnnQ": "Cargando el archivo {0}",
    "SBsDz": "Configuración de su cuenta de administrador.",
    "SGs7B": "Configure sus LafTools rápidamente",
    "SMqD13": "Introduzca para filtrar",
    "SPem9": "Este campo aún no está listo.",
    "SQAw7": "Lenguaje fuente",
    "SYSq1": "Ejemplo",
    "SZgXb": "Configurar contraseña local",
    "SdGcT": "Otra parte",
    "Sm9tq": "Por favor proporcione la contraseña de la cuenta aquí",
    "Sm9tqq": "Proporcione una contraseña para desbloquear sus LafTools",
    "Spcfdee": "Modo claro u oscuro",
    "TBPqy7": "Idioma",
    "TD7DA": "Idiomas",
    "TNoePE": "LafTools Nube",
    "Ttrqqet": "¡Escribe y guarda tus pensamientos aquí!",
    "TwFcr": "Lengua de llegada",
    "TyqvWY3": "Archivo local",
    "U2ZNl": "Más información en Wikipedia",
    "U4qqq9": "Eliminar esta pestaña de la lista",
    "U7zP2": "Por favor proporcione el nombre de usuario de la cuenta aquí",
    "UF_Dp": "Se produjo un error: {0}, el tiempo de rechazo es {1}",
    "UU_7h": "Haga clic en cualquier elemento de categoría en el primer menú de la izquierda; la categoría actual está vacía o no es válida.",
    "UZ2Ig": "Nueva cuenta local",
    "Ugpng": "Favorito",
    "Uzqjy": "Implementación",
    "V6U_f": "Términos de servicio",
    "V6XEO": "Ingrese nombre de usuario o correo electrónico",
    "VAZq8r": "Permite a los desarrolladores ejecutar varios comandos, como ejecutar scripts, instalar paquetes y navegar por el sistema de archivos, todo desde el editor.",
    "VEfeqZG": "Notas",
    "VI6VT": "Historia",
    "VOsZc": "Informar problema",
    "VSZ": "Haga clic para reactivar",
    "VZtqg6": "Crear nuevo formulario de script",
    "Vaf2y": "El nombre de la pestaña no puede estar en blanco.",
    "VeY9K": "Condiciones de uso",
    "VgG5y": "Haga clic aquí para actualizar el estado de su extensión",
    "VjZCv": "Conversión en tiempo real",
    "WPrTW": "Página web oficial",
    "WXo6D": "renovado",
    "WYCVL": "Configuración rápida",
    "X4L_Z": "No se proporciona la extensión VM.",
    "X6Fq4j": "Después de años de desarrollo y perfeccionamiento dedicados, estamos seguros de que LafTools puede mejorar significativamente su experiencia de programación al brindar más comodidad y eficiencia a su flujo de trabajo.",
    "XKpI0": "Haga clic para procesar su texto en la región de entrada",
    "XLWoR": "Selecciona tu preferido y continúa",
    "XQxJB": "Mis espacios de trabajo",
    "X_HGx": "LafTools es una caja de herramientas versátil diseñada para satisfacer diversas necesidades. Es totalmente de código abierto, lo que garantiza transparencia y seguridad. A pesar de su tiempo de ejecución liviano, ofrece soporte completo para plataformas, incluido ARMv8, y soporte nativo de IA similar a ChatGPT. LafTools está altamente integrado con una interfaz de usuario productiva y se actualiza continuamente con nuevas herramientas. Se puede utilizar en la web y con Docker y proporciona recursos adicionales como notas y manuales.",
    "XeXF77": "Ajustes",
    "XikdD": "Momentos por favor, ¡ya casi llegamos!",
    "Y5GAC": "Su nombre de usuario",
    "Y9mQ2": "Por favor proporcione el nombre de usuario de la cuenta aquí",
    "YAAU3q": "Contraseña local",
    "YHCjT": "LafTools admite temas globales de luz y oscuridad, es útil en particular con codificadores de turnos de noche.",
    "YNwKz": "Idioma no admitido: {0}, utilizará el inglés de forma predeterminada.",
    "YOYTp": "Configuración rápida",
    "YPPPL": "Alternar la visibilidad de las pestañas de las barras de herramientas",
    "YQN9u": "Se produjo un error al cargar {0}. Verifique los detalles a continuación.",
    "Y_k0z": "¿Has olvidado tu contraseña?",
    "Ye3TXses": "Para configurar si la transformación se ejecutará automáticamente cuando se cambie el texto de entrada.",
    "Ylq2X": "Error de corrección",
    "YquQqTXq": "¿Ejecución automática?",
    "YrTdq": "Todo",
    "YrVq683": "Correo",
    "YrVqdd683": "Manuales",
    "Z2QTU": "Acerca de",
    "Z3rhY": "Mensaje",
    "Z7ALO": "Cambiado al espacio de trabajo seleccionado",
    "Z7OTt": "El archivo que seleccionó es demasiado grande; seleccione un archivo de menos de 30 MB.",
    "ZAGva": "¿Estás seguro de eliminar este espacio de trabajo?",
    "ZAKaFq": "Mi cuenta en la nube",
    "ZW1Dgz": "No hay mensaje disponible",
    "ZXRGC": "Por favor vea el error: {0}",
    "ZbD3F": "{0}, elaborado por el equipo de LafTools",
    "Zk7JI": "Aún no es compatible",
    "ZrbduC": "Cierra todas las pestañas",
    "ZrbuC": "Cerrar pestaña",
    "_5OqeG": "Desmarcarlo",
    "_LFF3": "Si encuentra algún problema o tiene alguna sugerencia al usar LafTools, no dude en contactarnos por correo electrónico o GitHub en cualquier momento, estamos dispuestos a mejorarlo.",
    "_trez": "Intercambiar texto",
    "_trqL": "Recuperando datos de recursos del sistema...",
    "_z3lR": "Actualizar código",
    "a3yqoz": "persa",
    "a3z-3k12": "Herramientas de dirección IP",
    "a4jbpq": "checo",
    "a4r9t": "¿Puede Base45 decodificar cualquier cadena codificada en Base45 independientemente de su origen?",
    "a4s6x": "¿Cómo funciona Base32?",
    "a8b7z": "Por lo tanto, el relleno sólo es necesario si el último grupo de bits que se codifican no es divisible por 40 bits (ya que 8 caracteres Base32 representan 40 bits). El relleno constará de cero a seis caracteres '=\" al final de la cadena codificada.",
    "aCkOP": "Salida",
    "aHAfR": "Obteniendo datos para {0}....",
    "aSOpr": "Generador de modelos de datos",
    "ab9c0d1e": "Las operaciones principales incluyen codificación (convertir binario a Base64) y decodificación (convertir Base64 nuevamente a binario).",
    "abc12345": "Base64 es un esquema de codificación que representa datos binarios como una secuencia de caracteres ASCII.",
    "abcdef12": "¿Cómo funciona Base64?",
    "about_LafTools_toolbox": "Acerca de LafTools",
    "adpgq": "Crear nuevo espacio de trabajo",
    "ah-C4": "Nueva nota",
    "aj3nhd": "Alemán",
    "aked6": "Referencias",
    "aked61": "Introducción",
    "asElV": "Eliminar",
    "az4uS2": "¿Está seguro de cerrar sesión en este sistema? Tenga en cuenta que será redirigido a la página de inicio de sesión.",
    "azpNX": "Terminado.",
    "b0qjSL": "Ingrese al directorio {1} y cree un archivo {2}, coloque su contraseña cifrada como todo el contenido del archivo.",
    "b6sx9b": "filipino",
    "b8g2k": "Escenarios de uso para Base32",
    "bP_6qG": "Consejos para olvidar su contraseña",
    "bT4R6": "Nueva pestaña",
    "bVlBN": "Chino al inglés",
    "bcdef01a": "Base64 funciona dividiendo datos binarios en grupos de 6 bits y asignando cada grupo a un carácter específico de un alfabeto de 64 caracteres (A-Za-z0-9+/).",
    "bhojei1": "Chino tradicional",
    "bjZyW": "Traducir",
    "bors14": "turco",
    "bp_-b": "Para administrar completamente LafTools, debe configurar su administrador al comienzo del flujo de configuración. Hemos verificado su identificación mediante el token del parámetro URL. Tenga la seguridad de que nadie más puede configurar su permiso de root a menos que obtenga el token de configuración.",
    "bqqrij": "swahili",
    "c0eCw": "Traduce tu texto a cualquier idioma que desees.",
    "c0v2p": "Operaciones comunes con Base32",
    "c1p3b": "Una vez integrado, copie la plantilla proporcionada en su programa C++ y reemplace el marcador de posición con el valor codificado real antes de ejecutar el programa.",
    "c1p4b": "Luego, cada número decimal se convierte en una secuencia única de cinco caracteres Base85. Si quedan menos de cuatro bytes al final, es posible que se aplique relleno.",
    "c2tpr": "La biblioteca Apache Commons Codec proporciona funcionalidad de codificación y decodificación Base32 en Java.",
    "c2vw9k": "Si bien Base45 no está tan implementado como Base64 o Base32, existen bibliotecas de código abierto para varios idiomas.",
    "c5m1b": "Otra variante, Base58Flickr, difiere ligeramente en su conjunto de caracteres. Reemplaza '+' por ',' y '/' por '-', adaptándose a las necesidades de URL de Flickr.",
    "c5meku": "sundanés",
    "c5p1b": "No se utiliza relleno; la longitud de la salida codificada depende directamente del tamaño de los datos de entrada.",
    "c6p4n": "Después de instalar la biblioteca, copie la plantilla proporcionada en su script de Python y ejecútela. La biblioteca ofrece funciones integradas para convertir entre bytes y cadenas codificadas en Base45.",
    "c6p9b": "Si la longitud de los datos de entrada no es divisible por 8, no se utiliza el relleno; en cambio, cada grupo no completo se trata de forma independiente.",
    "c7Uoqqe": "Antes de utilizar LafTools, proporcione y confirme su contraseña local como se muestra a continuación.",
    "c8me6b": "Los esquemas personalizados similares a Base62 pueden adaptarse a aplicaciones específicas, pero generalmente se adhieren al mismo principio de utilizar un conjunto de caracteres más grande que Base64 o Base32.",
    "c9j5k": "Descargue e incluya el encabezado 'base32.h' y su correspondiente implementación en su proyecto.",
    "c9j5v": "Instálelo a través de Composer agregando 'composer require christian-riesen/base32' a su proyecto.",
    "c9q7w": "¿Por qué se creó Base45?",
    "cNQp_": "Recursos",
    "cPS6q": "Todas las herramientas",
    "cQqwI8r": "Cargando el estado de Terminal Service",
    "cbaq54321": "No, Base64 no es una técnica de compresión, solo cambia la representación de los datos, no su tamaño.",
    "cdefg234": "Se agregan caracteres de relleno (=) al final para garantizar que la longitud de los datos codificados sea un múltiplo de 4 caracteres.",
    "cfYYN": "Descubrir más",
    "ciZV2": "Base32 es una notación para codificar datos de bytes arbitrarios utilizando un conjunto restringido de símbolos que pueden ser utilizados cómodamente por humanos y procesados ​​por computadoras. Utiliza un conjunto de caracteres más pequeño que Base64, generalmente el alfabeto en mayúsculas y los números del 2 al 7.",
    "ciZV21": "Base45 es una notación para codificar datos de bytes arbitrarios utilizando un conjunto restringido de símbolos que pueden ser utilizados cómodamente por humanos y procesados ​​por computadoras. La base numérica alta da como resultado cadenas más cortas que con el sistema decimal o hexadecimal. Base45 está optimizado para su uso con códigos QR.",
    "ciZV2deq1": "Base58 (similar a Base64) es una notación para codificar datos de bytes arbitrarios. Se diferencia de Base64 en que elimina los caracteres que se malinterpretan fácilmente (es decir, l, I, 0 y O) para mejorar la legibilidad humana. Base58 se usa comúnmente en criptomonedas (Bitcoin, Ripple, etc.).",
    "cj1pd": "Operación de actualización",
    "cjzqj9": "bosnio",
    "cmxzpg": "malayalam",
    "coM2I": "Utilice el editor inteligente",
    "crD7I": "Para configurar si la transformación debe ignorar el texto de entrada vacío cuya longitud es cero.",
    "cuRCb": "Categoría no encontrada.",
    "cuRCqb": "La categoría no existe",
    "cxqhqa": "Myanmar (birmano)",
    "d-l2l": "Confirmar",
    "d-qPr": "Diseño desconocido: {0}",
    "d1x7v": "Otro ejemplo es Git, donde los objetos hash a veces se almacenan en formato Base32 para evitar problemas con finales de línea y restricciones de nombres de archivos. Además, HashiCorp Vault utiliza Base32 para la derivación de claves.",
    "d2w4e": "Al igual que otros sistemas de conversión de bases, Base62 funciona convirtiendo bytes de entrada en un número entero grande y luego expresándolo como una combinación de caracteres de su conjunto de 62 caracteres.",
    "d2w6e": "Clona/descarga el repositorio e incluye el archivo de encabezado proporcionado en tu proyecto. Compile y vincule los archivos fuente de acuerdo con la documentación del proyecto.",
    "d3w2e": "Base58 funciona convirtiendo bytes de entrada en un número entero grande y luego expresa ese número entero como una combinación de caracteres de su conjunto de 58 caracteres (A-Z, a-z, 1-9).",
    "d5KZH": "¡Gracias por usar LafTools!",
    "d5LAU": "Licenciado bajo AGPLv3",
    "d5fmq2": "italiano",
    "d5hit": "Sesión - {0}",
    "d5x1rl": "Español",
    "d6g0w": "Este fragmento se puede ejecutar en cualquier entorno Python, incluidos scripts, sesiones interactivas o dentro de una aplicación más grande.",
    "d6y9k": "Si no hay suficientes bytes para llenar el último grupo, no se utiliza el relleno; en cambio, los bits restantes se procesan y asignan a sus caracteres correspondientes.",
    "d7w2e": "Base85 funciona dividiendo los datos de entrada en grupos de cuatro bytes y convirtiendo cada grupo en un número decimal entre 0 y 2^32-1.",
    "d8w1b": "Puede hacer esto usando pip ejecutando `pip install base45` o `python -m pip install base45`.",
    "d9w7m": "Además, debido a que solo usa letras mayúsculas, no puede utilizar todas las combinaciones posibles de distinción entre mayúsculas y minúsculas como medida de seguridad adicional, como lo hace a veces Base64 con el plegado de mayúsculas y minúsculas durante la decodificación.",
    "dCFIC": "Código más bonito",
    "dCFIwC": "Generador de código",
    "dGKMx": "Producción",
    "dGVUB": "Herramientas de red",
    "dV5Eq": "Actualizar la lista de espacios de trabajo",
    "dWbBm": "C# incluye la clase 'System.Convert' con métodos integrados ToBase64String y FromBase64String que le permiten codificar y decodificar datos Base64. La cadena de entrada primero se convierte en una matriz de bytes usando codificación UTF-8, luego se codifica y decodifica en consecuencia.",
    "dk122q": "Administre sus flujos de trabajo para combinar múltiples herramientas.",
    "dkarh": "Okie, la caja de herramientas abrió el directorio. Si no aparece ninguna ventana emergente, verifique si su plataforma admite esta función o si el directorio está en el servidor.",
    "dkjk12": "esta es la prueba",
    "dkkq12": "Configura tu herramienta en esta pestaña.",
    "dl4kr": "¿Has olvidado tu contraseña?",
    "dpRY4": "Diccionario",
    "dqTqyvWY": "Menú del cajón",
    "dsdpA_eJ": "Ajustar tamaño",
    "dtjdt4": "kazajo",
    "dxLQq": "Permiso de raíz",
    "dzjTo": "Por favor proporcione la contraseña de la cuenta aquí",
    "e--gB": "No se proporciona el ID de extensión.",
    "e4Cd8t": "Base85",
    "e5c7r": "Base32 es un esquema de codificación de binario a texto que representa datos en una cadena ASCII utilizando un subconjunto de 32 caracteres. Está diseñado para ser legible por humanos y seguro para URL.",
    "e5rycw": "Kirguistán",
    "e8Crq": "Complete el siguiente campo de nombre de usuario y contraseña para continuar.",
    "e8x2v": "Base45 funciona dividiendo los datos de entrada en grupos de 5 bytes cada uno. Luego convierte cada grupo en un número decimal y lo asigna al carácter correspondiente de su conjunto de 45 caracteres.",
    "eN4fM": "En Rust, puede utilizar la caja 'base64' para la codificación y decodificación Base64. Agregue 'base64 = \\\"1.x\\\"' a su archivo Cargo.toml en la sección [dependencias], ejecute 'cargo build' e incluya las importaciones necesarias en su código para utilizar estas funciones.",
    "eTmq": "Historia de CodeGen ToolBox",
    "e_8pZ": "Una caja de herramientas versátil para que los desarrolladores mejoren la productividad.",
    "ediql2": "húngaro",
    "efg45678": "Comparación con Base32",
    "efghi678": "Esta variante se utiliza a menudo para nombres de archivos, URL o situaciones en las que se deben evitar los caracteres especiales.",
    "egkqC8t": "base58",
    "egkqCd8t": "Base62",
    "eifoni": "catalán",
    "eqkqd4W": "Proporcione un nombre para la nueva etiqueta.",
    "etV-l": "Copiar archivos a SIT2",
    "eu5mh0": "bielorruso",
    "euaI8": "Crear nueva cuenta local",
    "euhy9v": "estonio",
    "f0q4w": "Un escenario de uso popular es la generación de claves secretas para la autenticación de dos factores (2FA), donde servicios como Google Authenticator y Yubikey utilizan secretos codificados en Base32.",
    "f1t2z": "Base62 se desarrolló para proporcionar una alternativa más corta y segura para URL a Base64, particularmente para identificadores únicos y URL cortas.",
    "f3ttw8": "maorí",
    "f4t7z": "Base58 se desarrolló inicialmente para Bitcoin para representar direcciones públicas y claves privadas sin ambigüedad.",
    "f5a0s": "Además, Base32 produce resultados más largos, pero puede ser más adecuado para aplicaciones específicas como nombres de archivos debido a su falta de caracteres especiales que podrían entrar en conflicto con las reglas del sistema de archivos.",
    "f5bLC": "Documentación",
    "f7akol": "Inglés",
    "f7t1z": "Agregue la biblioteca a su proyecto Xcode manualmente o mediante un administrador de paquetes como Swift Package Manager (SPM).",
    "f8n4m": "Su tamaño compacto permite un uso más eficiente del espacio en los códigos QR y al mismo tiempo mantiene la legibilidad con lectores de códigos de barras estándar.",
    "f8wne": "Incluya el paquete ejecutando 'Install-Package BouncyCastle' en la Consola del Administrador de paquetes o agregándolo a su archivo .csproj.",
    "f9t1z": "Base85 se desarrolló inicialmente para representar de manera eficiente datos binarios en documentos PostScript para obtener mejores relaciones de compresión.",
    "f9t2z": "Agregue lo siguiente a su archivo pom.xml: `<dependency> <groupId>org.iso</groupId> <artifactId>iso-base45</artifactId> <version>...</version> </dependency>` donde La versión es la última versión.",
    "fBP5h": "Nombre de usuario",
    "fEr5j": "Crear nuevo guión",
    "fTt2N": "Perl requiere el módulo 'MIME::Base64' para la codificación y decodificación Base64. Instálelo ejecutando 'cpan install MIME::Base64' si aún no está instalado.",
    "fV_1P": "Iniciar sesión",
    "fdxluz": "rumano",
    "ff02c": "Cancelado",
    "fghi6789": "Se utiliza para transmitir o almacenar archivos binarios en formatos basados ​​en texto, lo que garantiza la compatibilidad entre varios sistemas.",
    "fgj880": "telugu",
    "fqV_1P": "Desbloquea tus herramientas Laf",
    "g1h5n": "¿Cómo funciona Base45?",
    "g2_aX": "Copie la contraseña cifrada en el archivo",
    "g3h5s": "¿Cómo funciona Base85?",
    "g4h7s": "Para C++, puede utilizar la biblioteca 'base45-cpp' que está disponible como repositorio de GitHub.",
    "g5SK9": "Recientemente abierto",
    "g5ybh": "Agregue la dependencia a su proyecto (Maven: 'org.apache.commons:commons-codec').",
    "g6f0r": "No se requiere instalación adicional para las bibliotecas principales de Ruby. Simplemente reemplace 'TEST12345' con el valor deseado.",
    "g6f0t": "Ejecute 'go get github.com/mitchellh/go-base32' para agregar la dependencia a su proyecto.",
    "g6v3b": "Sin embargo, el conjunto de caracteres más grande de Base45 puede aumentar la probabilidad de errores al tratar con caracteres no alfanuméricos, lo que podría ser un problema en algunos entornos o canales de transmisión.",
    "g7h5k": "¿Cómo funciona Base58?",
    "g8h7s": "¿Cómo funciona Base62?",
    "g8r3e": "La principal desventaja de Base32 es su eficiencia espacial relativamente pobre; expande los datos de entrada en aproximadamente un 25% más que Base64. Esto significa que ocupa más almacenamiento o ancho de banda para la misma cantidad de datos codificados.",
    "gDjbs": "Información histórica",
    "gK3dNQ": "Copiar",
    "gQhfS": "Herramientas de archivo",
    "gT6re": "C++ no tiene una implementación nativa de Base64. Este ejemplo utiliza la biblioteca OpenSSL para realizar la codificación y decodificación Base64. Para usar OpenSSL, instálelo en su sistema y vincúlelo con las bibliotecas apropiadas al compilar su programa.",
    "gU1O2": "Activado",
    "gkC8t": "Base64",
    "gkdqqC8t": "base45",
    "gkqC8t": "Base32",
    "gnKMZ": "Renovado.",
    "gsHQM": "Datos de ejemplo cargados correctamente",
    "h4e1b": "También es útil para situaciones en las que las cadenas alfanuméricas que distinguen entre mayúsculas y minúsculas son más fáciles de manejar que las hexadecimales o base64, que pueden contener caracteres no alfanuméricos que podrían causar problemas en ciertos contextos (como URL o nombres de archivos).",
    "h6AeI": "Conexión Websocket cerrada a las {0}",
    "h7rUq": "En Node.js, la clase 'Buffer' incorporada puede manejar la codificación y decodificación Base64 sin necesidad de bibliotecas externas. Este fragmento de código codifica la cadena 'TEST12345' en Base64 y luego la decodifica nuevamente a la cadena original.",
    "h9j3m": "Relleno en Base32",
    "hJUMN": "Lengua de llegada",
    "hMvh1": "Base de datos de respaldo",
    "hRFxV": "Para obtener más información, por favor visite nuestro sitio web",
    "hcnt1k": "macedónio",
    "hhOT3": "Buscar por nombre",
    "hij90klm": "Base32 utiliza un alfabeto más pequeño (A-Z2-7), lo que da como resultado cadenas más largas pero más legibles para los humanos.",
    "htt1d2": "esperanto",
    "hu-iz": "Temporizador",
    "huE6U": "Variable",
    "hyV-d": "Hecho",
    "hyirc0": "sueco",
    "i27qmr": "frisio",
    "i6hMN": "Código de verificación de imagen",
    "i7w2m": "¿Existen bibliotecas Base45 integradas en lenguajes de programación populares?",
    "i88tb": "Exportar resultado a archivo",
    "i8q8tb": "Configurar flujo de trabajo para entrada",
    "i9o7k": "Ventajas de Base32 sobre Base64",
    "iNQvo": "Muestre un ejemplo para empezar.",
    "iNqF1T": "Administrar cuenta en la nube",
    "iOEjZ": "No hay código disponible",
    "iQL2c": "Todavía estamos explorando la gama completa de funciones de este botón. Si tiene algún comentario o sugerencia sobre cómo podemos mejorarlo, ¡háganoslo saber!",
    "i_lang_": "Paquetes de idiomas",
    "ib135dq": "Su mensaje de estado se mostrará aquí",
    "iknTS": "Administrador de contraseñas",
    "init_env": "Cargando recursos del sistema",
    "ip2g1": "Copiado",
    "ipOSQE": "Edición profesional",
    "it8ths": "indonesio",
    "ixyP0": "Procesar la acción en tiempo real automáticamente",
    "j1b5k": "Las operaciones más comunes que involucran Base32 incluyen codificar datos binarios en una cadena Base32 y decodificar una cadena Base32 nuevamente a su formato binario original.",
    "j4s6r": "¿Cómo codifico/decodifico con Base62 en JavaScript?",
    "j5s7r": "¿Cómo codifico/decodifico con Base85 en JavaScript?",
    "j6s3r": "¿Cómo codifico/decodifico con Base58 en JavaScript?",
    "j7k2t": "Para codificar datos con Base45, necesita una biblioteca o función que implemente el algoritmo Base45.",
    "j8s6r": "Para Kotlin, puede utilizar la biblioteca 'barcode-core' que incluye la funcionalidad Base45.",
    "j9s5r": "Para C#, puede utilizar la biblioteca 'Base45' disponible en NuGet.",
    "jJuNz": "Lenguaje fuente",
    "jO5eP": "DE ACUERDO",
    "jOXj0": "Ups, algo salió mal.",
    "jPNCb": "Reintentado.",
    "jQXdi": "Modo de luz",
    "jR1zX": "Laboratorio de IA",
    "jRzgS": "El marco Foundation de Swift incluye métodos integrados para la codificación y decodificación Base64. No se necesitan bibliotecas externas; simplemente importe 'Fundación' para utilizar estas funciones.",
    "jZvLJ": "PHP viene con funciones integradas 'base64_encode()' y 'base64_decode()' para manejar operaciones Base64. Estas funciones están fácilmente disponibles y no requieren configuración o instalación adicional.",
    "jaj7M": "Reservados todos los derechos.",
    "jb392": "Nombre",
    "jfpqt": "Navegador de notas",
    "jgDoEq": "Sin datos de preguntas frecuentes",
    "jhDoE": "Recuperar datos de preguntas frecuentes",
    "jlxvpk": "coreano",
    "k17PG": "Conexión Websocket cerrada.",
    "k1m4e": "Sin embargo, no ofrece la misma eficiencia de espacio que Base64 o Base32 ya que utiliza menos caracteres en su alfabeto.",
    "k2SVY": "apagado",
    "k2em5e": "Esto da como resultado cadenas de salida más cortas para la misma cantidad de datos de entrada, lo que puede resultar beneficioso en escenarios en los que minimizar el tamaño es fundamental.",
    "k2ku5p": "checo",
    "k3m2e": "Copie la plantilla proporcionada en un nuevo archivo Go, reemplace el marcador de posición con el valor codificado real y luego ejecute el archivo usando `go run yourfile.go`",
    "k41a5": "LafHerramientas",
    "k4s5rx": "esloveno",
    "k7d9f": "La biblioteca 'base32' incorporada de Ruby proporciona métodos para la codificación y decodificación Base32.",
    "k7d9r": "El paquete 'go-base32' proporciona capacidades de codificación y decodificación Base32 en Go.",
    "k7g0n": "En Base32, cada 5 bits de datos de entrada se asignan a uno de los 32 caracteres del conjunto 'ABCDEFGHIJKLMNOPQRSTUVWXYZ234567='.",
    "k9em5e": "Esto lo hace ideal para escenarios donde se requiere un identificador conciso y compatible con URL sin sacrificar la legibilidad.",
    "k9jtr": "El paquete npm 'base32-encoding' se utiliza para la codificación y decodificación Base32 en Node.js.",
    "kLH79": "Correo electrónico",
    "kOi5A": "Imprimir página",
    "kPD22": "Diccionario",
    "kPJ-A4": "Actualizar",
    "kZd9G": "Ruby tiene una biblioteca 'base64' incorporada que proporciona métodos para la codificación y decodificación Base64. Incluir la biblioteca con 'require",
    "kcHxr": "Proporcione el nombre de usuario de la cuenta de administrador aquí",
    "kjks1": "Recuperando la configuración i18n de la API del servidor local",
    "kqv5ht": "yídish",
    "krxSK": "Asistente de IA",
    "ks12d": "La seguridad cibernética",
    "kv4wag": "Holandés",
    "l1p9z": "¿Qué es Base32?",
    "l3akoa": "amárico",
    "l6Djb": "Seleccione una de las opciones como su tema preferido:",
    "lIn3_": "Nombre de usuario administrador",
    "lQFII": "Vuelva a activar la inicialización",
    "lRHDQ": "Salir del modo de pantalla completa",
    "lUh5c": "General",
    "lkuulh": "Francés",
    "lp0qmd0": "Marcalo como favorito",
    "lpKAz": "Ajustes",
    "lpzg83": "samoano",
    "lzGS2": "Detalle de extensión",
    "m0106": "Convertidor",
    "m0107": "generador",
    "m0108": "Formateador",
    "m6d8b": "Cada valor de 5 bits está representado por un solo carácter, lo que permite una codificación y decodificación eficiente para sistemas que prefieren trabajar con octetos (unidades de 8 bits).",
    "m6t1b": "La biblioteca 'base32' de Daniel R. Collins proporciona funcionalidad de codificación y decodificación Base32 en C++.",
    "m7WZw": "Sistema Websocket roto",
    "m8rTc1": "Una vez que se implemente el administrador de scripts de shell, puede usarlo para administrar sus comandos de shell.",
    "m9k1z": "Sin embargo, si los datos que se están decodificando contienen una semántica de aplicación específica (por ejemplo, formatos de códigos QR específicos), es posible que sea necesario un procesamiento adicional después de la decodificación.",
    "mBgF1": "Acción del ratón",
    "mSFei": "Código fuente en GitHub",
    "mWXeh": "ID del espacio de trabajo: {0}",
    "mabHq": "Buscar archivos antiguos",
    "mbzCv": "Se produjo un error: {0}, el tiempo de rechazo es {1}",
    "mihc3": "Completada esta operación",
    "mjHoR": "Además, técnicamente, nadie puede leer este token, de lo contrario habrá atacado y controlado su computadora.",
    "mnb19i": "Alemán",
    "mno34567": "Ventajas de Base64",
    "mnoijklm": "¿Existen otras codificaciones BaseXX?",
    "mslw4o": "Griego",
    "mwn7iv": "zulú",
    "myxedr": "mongol",
    "n0pqrstu": "Ejemplo de uso de Base64",
    "n1jA9": "Confirmar",
    "n24tes": "Portugués (Brasil)",
    "n3e7r": "Historia de Base32",
    "n94an4": "Polaco",
    "n98EW": "Intercambie el texto de la región de entrada y la región de salida.",
    "nSeIq8-": "Y lo más importante es que es gratuito y de código abierto. Puede utilizarlo para su propósito personal o comercial.",
    "nTvw4": "Para proteger y guardar por separado sus datos y configuraciones, puede usar su cuenta local para lograrlo. Además, LafTools admitirá widgets de mensajes instantáneos entre los usuarios en el futuro.",
    "nmb1wx": "yoruba",
    "nodBw": "Esta operación codifica datos sin procesar en una cadena ASCII {0}.",
    "nopqrs01": "Si bien Base64 optimiza la compacidad, se elige Base32 cuando minimizar los errores de entrada, como la entrada manual, es crucial.",
    "nrix6l": "chichewa",
    "nxJC7": "La acción predeterminada que se ejecutará cuando se realiza el transformador.",
    "o1umzi": "Francés",
    "o52xW": "Exportar",
    "o8xyzu": "luxemburgués",
    "oBz8D": "Cargando",
    "oNLxH": "Nombre de usuario",
    "oNg3f": "Página web oficial",
    "ocxsw3": "irlandesa",
    "of_ox": "Considerándolo todo, LafTools es una solución integral para todas sus necesidades.",
    "oj23X": "Restaurar base de datos",
    "ooiFU": "Reiniciar el servicio Java",
    "oqHqVq": "Ordenar por",
    "oqHqqV": "Total: {0} comandos",
    "oqHqqVq": "Copiar tiempos",
    "oqjbcj": "laosiano",
    "os8h6u": "danés",
    "p5e9n": "Agregue la biblioteca como una dependencia en su script de compilación de Gradle. Por ejemplo, en el archivo build.gradle a nivel de aplicación, agregue `implementation 'com.bottlerocketstudios:barcode-core:...'` con el último número de versión.",
    "p6e3n": "Para instalarlo, ejecute `Install-Package Base45` en la Consola del Administrador de paquetes o agregue la dependencia a través del Administrador de paquetes NuGet.",
    "p8Exxc1s": "Existen varias herramientas que aprovechan las tecnologías de IA para realizar tareas de manera más eficiente en AI Laboratory.",
    "p8eq9n": "Puede utilizar bibliotecas como 'base85' o 'ascii85' para codificar y decodificar Base85 en JavaScript.",
    "p9e1n": "Puede utilizar bibliotecas como 'base-x' (<a href='https://github.com/cryptocoinjs/base-x'>enlace GitHub</a>) o 'base62' (<a href='https: //www.npmjs.com/package/base62'>npm link</a>) para codificación y decodificación Base62 en JavaScript.",
    "p9s5t": "Base32 fue desarrollado por Douglas Crockford, conocido por sus contribuciones a JavaScript, en 2001. Fue creado como una alternativa más confiable a las codificaciones existentes como Base64, especialmente para situaciones que requieren representaciones de datos binarios basadas en texto.",
    "pANmj": "Las etiquetas se pueden definir según los tipos de servidores, el uso de scripts o cualquier otro criterio que prefiera.",
    "pA_deJ": "Exportar al portapapeles",
    "pA_feeJ": "Reconectar terminal",
    "pA_qweJ": "Borrar búfer",
    "pDBSWq": "no hay contenido disponible para el panel derecho",
    "pEk1kk": "LafTools le presenta aquí funcionalidades útiles.",
    "pEk1qkk": "Lista todas las pestañas abiertas",
    "pHZDB": "Acción en tiempo real",
    "pJoOz": "Abrir documento",
    "pKHRT": "Ir a Herramientas",
    "pKqHRq": "Notas de búsqueda",
    "pL6qH": "Terminado.",
    "ph5jH": "Manejando esta parte",
    "piih4x": "tayiko",
    "pmAee": "Lea más información sobre esta herramienta.",
    "pmnp4b": "ucranio",
    "ppmz8e": "criollo haitiano",
    "pq5e9n": "Puede utilizar bibliotecas como 'bs58' para realizar la codificación y decodificación Base58 en JavaScript.",
    "pqrs890t": "Compatibilidad universal: Base64 es ampliamente reconocido y compatible con todos los principales lenguajes de programación.",
    "pqs7y3": "Considere registrar esta página web como PWA para tener soporte completo para mapas de teclas.",
    "psA_eJ": "Exportar como archivo",
    "psZoP": "Suelta archivos aquí para procesarlos",
    "psqqpq_o": "Bien, el resultado se ha copiado en tu portapapeles {0} veces.",
    "q12beqwR": "No hay herramientas disponibles",
    "q29t31": "Polaco",
    "q2n3r": "Hoy en día, se utiliza en diversas aplicaciones donde la eficiencia del espacio y la legibilidad son cruciales, como documentos PDF y ciertos protocolos de red.",
    "q2n9r": "Una vez agregada, copie la plantilla proporcionada en un archivo Swift. Tenga en cuenta que en este ejemplo, estamos usando un escenario hipotético en el que tiene la representación base64 de la cadena Base45; reemplácelo con el valor codificado real antes de ejecutar el código.",
    "q2w5m": "¿Propósito de usar Base32?",
    "q2x8k": "Su uso se ha expandido a otras criptomonedas y escenarios donde se desean cadenas legibles por humanos y resistentes a errores.",
    "q5h8n": "La principal ventaja es la longitud reducida de la cadena para la misma cantidad de datos codificados, lo que lo hace adecuado para aplicaciones donde la eficiencia del espacio es crítica.",
    "q6K7o": "Cargar desde notas",
    "q6n1r": "La biblioteca proporciona clases de codificador y decodificador que manejan la conversión Base45. Una vez agregada la dependencia, copie el código de la plantilla en una clase Java y ejecútelo.",
    "q7n3r": "También evita caracteres ambiguos como 'O' y '0', 'I' y 'l', que pueden provocar errores de transcripción humanos.",
    "q9iuti": "galés",
    "qDrbEr": "El nombre de usuario que proporcionó está vacío, compruébelo e inténtelo nuevamente.",
    "qF4uS2": "Crear espacio de trabajo",
    "qF4uS23": "Nueva ventana",
    "qHoktx": "¡Gracias!",
    "qN1LdZ2": "Última modificación",
    "qQmBr": "Traducción de texto",
    "qTqyvWdY": "No ha terminado aún",
    "qWemXE4": "1 de enero de 2024",
    "qWw3eTH": "Esta parte ayuda a mantener archivos en su disco local o disco en la nube.",
    "qdeFXx": "Actualmente, la página que estás buscando aún no está completamente implementada.",
    "qpDBSW": "no hay paneles disponibles",
    "qpDBSWe1": "no hay paneles disponibles",
    "qqK_x_": "Iniciar sesión",
    "qqqwYoz": "Ayuda",
    "qqwYoz": "Pestañas",
    "qqwYqwe": "Espacios de trabajo",
    "qrstuvwx": "Sí, además de Base64 y Base32, también existen Base16 (Hexadecimal), Base58 y Base85, cada una diseñada para diferentes escenarios.",
    "qtpmvP": "Confirmar contraseña local",
    "qubSJ": "La extensión VM no es ID. (REF: IQnMH).",
    "qv1p5n": "Por ejemplo, en Java, puedes utilizar la biblioteca 'org.iso.base45' para codificar tus datos.",
    "qzshys": "urdu",
    "r1GLS": "Etiquetas",
    "r2n7v": "La principal ventaja es una mayor legibilidad debido a la exclusión de caracteres de apariencia similar, lo que reduce los errores durante la entrada manual.",
    "r4n6v": "Agregue la dependencia a su proyecto ejecutando `go get github.com/btcsuite/btcutil`. Esto descargará e instalará el paquete.",
    "r6nq2v": "La principal ventaja de Base62 es su mayor eficiencia de espacio debido a un conjunto de caracteres más grande que Base32 pero sin caracteres no alfanuméricos que se encuentran en Base64.",
    "r6tq9z": "<b>Ejemplo:</b> Para codificar 'TEST12345' en Base32, puede usar bibliotecas como base32-encode en Node.js o funciones integradas en otros lenguajes como base64.b32encode de Python.",
    "r8c6z": "Reemplace 'TEST12345' con su propia cadena y ejecute esta clase como un programa Java para ver los resultados.",
    "r8y2w": "La biblioteca PHP 'Base32' se utiliza aquí para la codificación y decodificación Base32.",
    "r9a3t": "Base45 es un esquema de codificación basado en texto que codifica datos binarios en caracteres ASCII.",
    "r9qn8v": "La principal ventaja de Base85 es su eficiencia de espacio mejorada debido a un conjunto de caracteres más grande (85 frente a 64 en Base64 o 32 en Base32).",
    "rK6cx": "{0}, diseñado y desarrollado por el equipo de LafTools",
    "rLXJN": "En Kotlin, la clase 'android.util.Base64' incorporada de Android se puede utilizar para la codificación y decodificación Base64. Este ejemplo asume un entorno Android; para proyectos Kotlin que no sean de Android, considere usar 'java.util.Base64'.",
    "rQkas": "Bienvenido a LafTools",
    "rR1vd": "Entrada desde archivo",
    "rT34qnO": "Ingrese el texto para procesar. El resultado se mostrará en el editor de resultados.",
    "rVqlu": "Decodificar {0}",
    "rYSpw": "El algoritmo MD2 (Message-Digest 2) es una función hash criptográfica desarrollada por Ronald Rivest en 1989. El algoritmo está optimizado para computadoras de 8 bits.<br><br>Aunque MD2 ya no se considera seguro, incluso a partir de 2014, sigue utilizándose en infraestructuras de clave pública como parte de los certificados generados con MD2 y RSA. El algoritmo de resumen de mensajes consta, de forma predeterminada, de 18 rondas.",
    "r_n6h": "Modo claro u oscuro",
    "rf0mql3": "Tema claro u oscuro",
    "rpG0G": "Valoramos sus comentarios y nos encantaría escuchar su opinión sobre cómo podemos mejorar nuestro producto. ¡No dude en compartir sus comentarios con nosotros!",
    "run_text": "Antes de ingresar a su banco de trabajo, al principio nos gustaría precargar los recursos necesarios del sistema. Espere un momento, se completará pronto, cuyos detalles se pueden ver a continuación.",
    "rycJy": "LafTools es una caja de herramientas versátil diseñada específicamente para programadores. Representa la segunda versión de CodeGen Toolbox, ahora con un tiempo de ejecución más liviano escrito en Golang y JavaScript.",
    "ryhkqb": "búlgaro",
    "s0vrf9": "hebreo",
    "s1b3m": "A diferencia de Base64 o Base32, excluye los caracteres '0', 'O', 'I' y 'l' que se confunden fácilmente, lo que lo hace adecuado para URL y códigos QR.",
    "s3e6r": "¿Cómo codifico datos usando Base45?",
    "s4OeX": "Iniciar sesión en el sistema exitosamente",
    "s5b8m": "Reemplace 'TEST12345' con sus propios datos y ejecute este script en un entorno PHP para realizar operaciones Base32.",
    "s5e8r": "Reemplace 'TEST12345' con sus datos reales y ejecute este fragmento dentro del contexto de una aplicación Swift para realizar operaciones Base32.",
    "s5t0n": "El relleno en Base32 implica agregar caracteres '=\" para garantizar que el fragmento final de datos codificados todavía contenga un múltiplo de 8 bits. Sin embargo, a diferencia de Base64, el relleno de Base32 es mínimo porque cada carácter de Base32 ya codifica 5 bits.",
    "s7e9r": "No se necesitan bibliotecas externas. Simplemente reemplace 'b'TEST12345'' con su objeto real similar a bytes para codificar/decodificar.",
    "sBxHr": "Scala utiliza la clase 'java.util.Base64' incorporada de Java para operaciones Base64. Asegúrese de estar ejecutando en una plataforma JVM con Java 8 o superior.",
    "sHoxxW": "Conversión",
    "sKx5t": "La clase incorporada de Java 'java.util.Base64', disponible desde Java 8, proporciona métodos para la codificación y decodificación Base64. La cadena de entrada se convierte a bytes mediante codificación UTF-8 y luego se codifica y decodifica según sea necesario.",
    "sO0MOe": "Cada vez que permanezca en una ventana más de 5 segundos, se mostrará aquí.",
    "sR8yc": "Cerca",
    "sc49my": "sindhi",
    "sdfk1": "Desplazar pestañas hacia la izquierda",
    "sdfk13": "Desplazar pestañas hacia la derecha",
    "sglMS": "Crear tiempo",
    "sk123": "Aún no terminado",
    "slqcWD": "Esta parte lógica aún no es compatible, estad atentos.",
    "sojBI": "Conversión",
    "spCqEa": "HACER",
    "spdh98": "Chino simplificado",
    "ssDaOq": "¿Nuevo en LafTools?",
    "ssm80i": "vasco",
    "svqh06": "azerbaiyano",
    "sys_updates": "Últimas actualizaciones del sistema",
    "t63Qw": "Despedir",
    "t6wczq": "xhosa",
    "t7m4g": "La caja 'base32' se utiliza para la codificación y decodificación Base32 en Rust.",
    "t84q1z": "armenio",
    "t8c6xc": "somalí",
    "t8z1v": "Cuando no quedan suficientes bits al final para llenar un grupo completo de 5 bits, se agregan caracteres de relleno '=\". Por ejemplo, un byte requiere dos caracteres Base32 y una secuencia de 3 bytes necesitaría cuatro caracteres Base32.",
    "t9m3g": "CryptoSwift es un paquete Swift popular que incluye funcionalidad de codificación y decodificación Base32.",
    "tBIX-d": "ventanas",
    "tEiv_": "Recuperando detalles de extensión",
    "tIy3Q": "Encontré un error",
    "tIyq3Q": "Encontré un error",
    "tR8pY": "Go proporciona un paquete de biblioteca estándar 'encoding/base64' con funciones para codificación y decodificación Base64. No se requieren dependencias externas; simplemente importe este paquete a su programa Go y llame a las funciones apropiadas.",
    "tWe1yF": "No hay ningún comando de shell disponible.",
    "tY3p1": "Más información",
    "tiaiB": "Cancelar",
    "tn7duf": "croata",
    "ttAre": "Introduzca aquí su contraseña en texto plano",
    "tuv23456": "Variante segura de URL Base64",
    "twamg": "Asistente de IA, potenciando tu creatividad",
    "tyhgpr": "javanés",
    "u1i2b": "¿Cuáles son las ventajas de utilizar Base85 sobre Base64 o Base32?",
    "u2l8s": "¿Qué es Base45?",
    "u3i8b": "¿Cuáles son las ventajas de utilizar Base62 sobre Base64 o Base32?",
    "u3j9p": "Base32 se utiliza a menudo cuando se necesita una representación textual compacta de datos binarios que se puedan escribir o imprimir sin perder información, como en comprobaciones de integridad de archivos, geocaching y generación segura de contraseñas.",
    "u7i9b": "Para Go, utilice el paquete 'btcutil' disponible en GitHub, específicamente su módulo base58.",
    "u7vwx8yz": "Operaciones comunes de Base64",
    "u8i5b": "¿Cuáles son las ventajas de utilizar Base58 sobre Base64 o Base32?",
    "u9g6t": "Para ejecutar este código, necesita instalar el paquete '@digitalbazaar/base45'.",
    "uCEe8": "Conversión en tiempo real",
    "uFcDQ": "Inicializando los datos de estado...",
    "uV5Bi": "No se puede cargar la extensión",
    "uVseB": "Presione {0} para mostrar la lista de teclas de acceso rápido",
    "uW7eZ": "En C, no existe una implementación nativa de Base64. Este ejemplo utiliza la biblioteca OpenSSL para la codificación y decodificación Base64. Para usar este fragmento de código, instale OpenSSL en su sistema y vincúlelo con las bibliotecas apropiadas al compilar su programa usando un comando similar a 'gcc -o base64_example base64_example.c -lssl -lcrypto'.",
    "ucDLv": "Has copiado este elemento {0} veces",
    "ui5pZ": "Analizador de comandos",
    "ulah0q": "japonés",
    "unc9E": "Texto aleatorio",
    "usr_defined": "Preferencias del Sistema",
    "uvwxyza1": "Sin pérdida de datos: dado que es un proceso reversible, la codificación Base64 no produce ninguna pérdida de información.",
    "uwqGE": "Ir a Herramientas",
    "v3k5r": "El conjunto de caracteres incluye todas las letras mayúsculas y minúsculas (A-Z, a-z) y dígitos (0-9), lo que proporciona una representación más compacta en comparación con Base64 o Base32.",
    "v4k6r": "Codifica datos en una forma más compacta en comparación con Base64 o Base32 mediante el uso de un conjunto de caracteres más grande.",
    "v4n9t": "Base58 es un esquema de codificación que representa datos binarios como una secuencia de caracteres alfanuméricos.",
    "v5k3r": "Esta biblioteca proporciona una API simple para la codificación y decodificación Base45 en aplicaciones Node.js. Después de la instalación, copie la plantilla proporcionada en su script y ejecútela con el intérprete de Node.js.",
    "v6qkl": "El paquete BouncyCastle NuGet proporciona codificación y decodificación Base32 en C#.",
    "v7q3db": "tailandés",
    "v9b7t": "Reemplace 'TEST12345' con su propia cadena y ejecute esta aplicación de consola para realizar operaciones de codificación y decodificación Base32.",
    "vOjNC": "Ingrese la contraseña o clave segura",
    "vTsQU": "Proporcione el código de invitación de su administrador",
    "vU17B": "No se puede enviar la solicitud",
    "vWqac": "Antes de ingresar a su banco de trabajo, al principio nos gustaría precargar los recursos necesarios del sistema. Espere un momento, se completará pronto, cuyos detalles se pueden ver a continuación.",
    "vaP0vq": "Configure la contraseña local correctamente.",
    "vci8rd": "Holandés",
    "vh9j4": "Aporte",
    "vo1prl": "Español",
    "vr93oi": "finlandés",
    "vrfjnf": "italiano",
    "vwx1yza2": "Un ejemplo es codificar un archivo de imagen para incrustarlo en una etiqueta HTML <img>:",
    "w1x4k": "Sí, existen varias variantes, incluidas Ascii85 (utilizado en PostScript y PDF), Z85 (ZeroMQ) y UUencode (un formato más antiguo). Cada uno tiene un conjunto de personajes y reglas ligeramente diferentes.",
    "w2x9qk": "Si bien Base62 en sí no tiene variantes significativas, algunas implementaciones pueden diferir ligeramente en la elección del conjunto de caracteres, como excluir '+' o '/' comúnmente utilizados en Base64.",
    "w3x7k": "Sí, algunas variantes populares incluyen Base58Check, que agrega una suma de verificación para la detección de errores, comúnmente utilizada en Bitcoin.",
    "w6otqn": "corso",
    "w92j07": "ruso",
    "w9qudj": "punjabi",
    "wAxtg": "Inicialmente, generamos un UUID como token autorizado para que usted pueda realizar esta configuración. Según lo que LafTools recibió, el token que proporcionó es {0}, LafTools lo verifica correctamente y, en consecuencia, puede continuar configurando este formulario.",
    "wI1eh": "Próximo",
    "wQYoz": "Archivo",
    "wQdYoz": "Editar",
    "wQdqwYoz": "Vista",
    "wcl1K": "Uso",
    "wgkk6y": "maltés",
    "wj3VS": "Esta operación decodifica datos de una cadena ASCII {0} a su formato sin formato.",
    "wsWcXd": "Notificaciones",
    "wxyzabcd": "Existe una versión segura para URL de Base64 que reemplaza '+' por '-' y '/' por '_', y omite el relleno '=', lo que la hace adecuada para URL web.",
    "x009": "Para acceder a nuestra documentación de uso",
    "x2c5e": "Para usar Base45 en Python, necesitará instalar la biblioteca 'base45'.",
    "x2z6r": "¿Qué es Base58?",
    "x5alzu": "Kurdo (Kurmanji)",
    "x5tHV": "Resumen del sistema",
    "x5z1b": "Base45 se desarrolló principalmente para el uso de códigos QR en el contexto de los certificados COVID digitales.",
    "x6v2w": "No existe una biblioteca Base32 estándar en C, por lo que aquí estamos usando una biblioteca hipotética 'libbase32'.",
    "x7n1m": "Base62 es un esquema de codificación que representa datos binarios como una secuencia de 62 caracteres alfanuméricos.",
    "x8mdg": "El módulo 'base64' integrado de Python proporciona codificación y decodificación Base32 a través de las funciones 'b32encode' y 'b32decode'.",
    "x9g7e": "Descargue el código fuente de GitHub (https://github.com/dankamongmen/libbase32) o instálelo como un paquete si está disponible para su plataforma.",
    "x9n1b": "Base85 es un esquema de codificación que representa datos binarios utilizando un conjunto de 85 caracteres ASCII imprimibles.",
    "xMBv0": "Cargando recursos relacionados...",
    "xOJqG1": "Preguntas frecuentes",
    "xPHqP": "La descripción aún no está definida.",
    "xQ_ls": "Copia de seguridad de Redis",
    "xbz0B": "Cierra todas las pestañas",
    "xbz0B2": "Cerrar pestaña",
    "xdqwe": "¡Bienvenido a utilizar LafTools!",
    "xeP4zV": "Vea rápidamente sus elementos TODO",
    "xeP4zVd": "Busque rápidamente un vocabulario en inglés.",
    "xlqtA": "Comentario",
    "xs22XLF": "No hay datos disponibles para este ID de artículo; considere seleccionar otros artículos.",
    "y3b6n": "Sí, siempre que la cadena codificada se genere de acuerdo con la especificación Base45, cualquier decodificador compatible debería poder decodificarla.",
    "y3m7k": "Para Java, utilice la biblioteca 'iso-base45' que puede incluirse en su proyecto como una dependencia de Maven.",
    "y3m9k": "¿Por qué se creó Base62?",
    "y3qjdd": "Su contraseña local ha sido verificada exitosamente.",
    "y5nne": "Este código se puede ejecutar directamente en un entorno Node.js o como parte de un proyecto más grande donde necesite la funcionalidad Base32.",
    "y6m8k": "¿Por qué se creó Base85?",
    "y6t1n": "Desventajas de Base32",
    "y8Ir5": "Esta parte se utiliza para inicializar su cuenta de administrador; sin embargo, por ahora, no es necesario crear o ajustar nada aquí, ya que su administrador lo configuró previamente. Omita esta parte y continúe con los pasos restantes.",
    "y8b1m": "Reemplace 'TEST12345' con sus propios datos y asegúrese de que las funciones de la biblioteca estén implementadas y vinculadas correctamente para compilar y ejecutar este programa para operaciones Base32.",
    "y9m1n": "¿Por qué se creó Base58?",
    "y9m3k": "Para Swift, puede utilizar la biblioteca 'Base45' disponible en GitHub.",
    "y9z2e": "Reemplace 'TEST12345' con su segmento de bytes real y ejecute este programa Go para codificar y decodificar utilizando la codificación estándar Base32.",
    "y9z2t": "Ejecute este script en un entorno Ruby como IRB o guárdelo como un archivo .rb y ejecútelo con 'ruby filename.rb'.",
    "ySVf-": "Vuelva a intentar esta solicitud",
    "yVprb": "Esta parte aún está en desarrollo.",
    "y_2Q1": "Codificar y decodificar",
    "y_2Q2": "Cripto simétrico",
    "y_2Q3": "Cripto asimétrico",
    "y_2Q4": "Algoritmos nacionales de China",
    "y_2Q5": "Autenticación web",
    "y_2Q5dqw": "Comparador de texto",
    "y_9YM": "El resultado aparecerá aquí.",
    "y_9YqM": "Cargando archivos estáticos...",
    "y_BN6": "Algoritmo de resumen",
    "ya0cwu": "malayo",
    "yc7dqiu": "Chino simplificado",
    "yfYeg": "Plantilla de texto",
    "yiRso": "Notas en la nube",
    "ykganl": "danés",
    "yqiRso": "Notas locales",
    "yqrxl4": "serbio",
    "yznU9": "Datos de árbol vacíos",
    "z-o28we": "Panel de proceso",
    "z0j2nf": "hindi",
    "z1m2t": "Uso de ejemplo: `const codificado = bs58.encode('tus-datos'); const decodificado = bs58.decode (codificado);`",
    "z1n5qr": "Los ejemplos incluyen el paquete base45 npm para JavaScript y dotnet-base45 para .NET.",
    "z1oFn": "Escapar y desescapar",
    "z2jzej": "marathi",
    "z2m7t": "Uso de ejemplo: `const base62 = require('base62'); const codificado = base62.encode('tus-datos'); const decodificado = base62.decode (codificado);`",
    "z2t7m": "¿Qué es Base85?",
    "z2x8c": "Base32 tiene menos ambigüedades visuales ya que utiliza sólo letras mayúsculas y dígitos, lo que hace que sea más fácil de leer y transcribir a mano o por teléfono en comparación con Base64, que incluye '+', '/' y letras minúsculas.",
    "z3m1t": "Después de agregar la dependencia y sincronizar el proyecto, copie la plantilla proporcionada en una clase Kotlin, reemplazando el marcador de posición con el valor codificado real antes de ejecutar el código.",
    "z4t9b": "¿Qué es Base62?",
    "z5b7m": "Utiliza un alfabeto más grande (0-9, A-Z, a-z, -, ., $, /, +, %, y *) en comparación con Base64 o Base32, lo que da como resultado cadenas codificadas más cortas para los mismos datos de entrada.",
    "z5bvb": "Instálelo ejecutando 'npm install base32-encoding'. Reemplace 'TEST12345' con los datos de entrada que desee en el fragmento de código.",
    "z5m6t": "Uso de ejemplo: `const base85 = require('base85'); const codificado = base85.encode('tus-datos'); const decodificado = base85.decode (codificado);`",
    "z6m1c": "Se introdujeron variaciones posteriores como z-base-32 para mejorar la usabilidad, reemplazando algunos caracteres menos memorables por otros, pero la especificación original de Crockford sigue siendo ampliamente utilizada en la actualidad.",
    "z79b1a": "Arábica",
    "z7n1m": "Utilice npm o Yarn para instalarlo ejecutando `npm install @digitalbazaar/base45` o `yarn add @digitalbazaar/base45`.",
    "z7t1p": "¿Existen variantes específicas de Base62?",
    "z8em2t": "Después de la instalación, copie la plantilla proporcionada en una aplicación de consola C# y reemplace el marcador de posición con el valor codificado real antes de ejecutar el programa.",
    "z8m2t": "¿Cuáles son las ventajas de utilizar Base45 sobre Base64 o Base32?",
    "z8n6k": "Reemplace 'TEST12345' con la cadena que desee, compile y ejecute este programa para ver los resultados de codificación y decodificación Base32.",
    "z8qm2t": "La biblioteca proporciona clases de codificador y decodificador para operaciones Base45. Copie el código de la plantilla en una aplicación de consola C# y ejecútelo después de instalar el paquete.",
    "z8qqm2t": "Después de la instalación, copie la plantilla proporcionada en una aplicación de consola C# y reemplace el marcador de posición con el valor codificado real antes de ejecutar el programa.",
    "z9b6n": "Agregue la dependencia a su proyecto Xcode a través del Administrador de paquetes Swift ('https://github.com/krzyzanowskim/CryptoSwift').",
    "z9kVv": "Python tiene un módulo 'base64' incorporado que proporciona métodos para la codificación y decodificación Base64. La cadena de entrada primero se convierte a bytes usando codificación UTF-8 antes de codificarse en Base64 y luego decodificarse nuevamente a su forma original.",
    "z9t2p": "¿Existen variantes específicas de Base58?",
    "z9t7p": "¿Existen variantes específicas de Base85?",
    "zN2ES": "Espacios de trabajo",
    "zaSKh": "Actualizar",
    "zc3Hf": "Contraseña",
    "zjDJk": "Proporcione la ruta del directorio del espacio de trabajo.",
    "zkqUFa": "{0} aún no está configurado",
    "zkv375": "jemer",
    "zmDWx": "Contáctenos",
    "znVRwq": "Archivos",
    "zpyd34": "Inglés",
    "zqiIoqXw": "Ejecutando cálculos...",
    "zwd4v": "Detalle de extensión",
    "zwgYx": "El valor de la contraseña cifrada se mostrará aquí.",
    "zyx98765": "¿Se puede utilizar Base64 para compresión?",
    "zzcepr": "cebuano"
}