{
    "": "Message : {0}",
    "-8l11": "Copié",
    "-DqwwR": "Opération terminée.",
    "-GJ_72": "Basculé vers l'espace de travail sélectionné {0}",
    "-Jx4J": "Compte local",
    "-Rj3y": "Thèmes",
    "-XZnW": "Dos",
    "-Yo129I": "Outils de texte",
    "01do0y": "Kannada",
    "04SSf": "Mot de passe oublié?",
    "07naT": "Erreur : {0}",
    "07ui6": "Plus d'informations",
    "0Ceqru": "Base64 est une notation permettant de coder des données d'octets arbitraires à l'aide d'un ensemble restreint de symboles qui peuvent être facilement utilisés par les humains et traités par des ordinateurs.",
    "0MOjj": "MD5 (Message-Digest 5) est une fonction de hachage largement utilisée. Il a été utilisé dans diverses applications de sécurité et est également couramment utilisé pour vérifier l'intégrité des fichiers. Cependant, MD5 n'est pas résistant aux collisions et ne convient pas aux applications telles que les certificats SSL/TLS ou les signatures numériques qui reposent sur cette propriété.",
    "0PgZ_": "Traduction",
    "0gvcN": "Bienvenue sur la page de présentation, elle est encore en développement.",
    "0gywa": "Espace de travail introuvable, vous serez redirigé vers la page d'index de l'espace de travail.",
    "0pfdz7": "Ouzbek",
    "123e4567": "Qu’est-ce que Base64 ?",
    "13pmE": "Soutenez-nous",
    "1507oa": "bengali",
    "1JOFP": "Ouvrir mon espace de travail",
    "1NTgQ": "Espace de travail ouvert",
    "1Npez": "Veuillez fournir le chemin",
    "1Tuab": "Copié",
    "1X8x7": "Exemple",
    "1YmJc": "Sélectionnez l'une des options comme langue préférée :",
    "1a2b3c4d": "Pourquoi utiliser Base64 ?",
    "1a3Sc": "Annuler le chargement",
    "1bd": "Flux de travail",
    "1e3e5n": "Haoussa",
    "1h6jH": "Attention, la sortie est vide !",
    "1j62a": "Fais ça à un autre moment",
    "1jj0ri": "Japonais",
    "1k_44": "Cette opération décode les données d'une chaîne ASCII Base64 dans son format brut.",
    "1th2nw": "Cinghalais",
    "1yIQu": "Vous pouvez essayer de retraiter votre action ou cliquer sur le bouton ci-dessous pour ignorer l'erreur.",
    "20nmcv": "Latin",
    "22XLF": "Pas encore fini",
    "23fgh456": "Histoire de Base64",
    "24vLI": "Créé",
    "27j7sy": "Shona",
    "2D9a6": "Mot de passe oublié?",
    "2D9qdk6": "Est-ce suffisamment sécurisé ?",
    "2IF6A": "Il semble que le stockage de sauvegarde de Forge rencontre un problème",
    "2JyFN": "Copier le résultat dans le presse-papiers",
    "2Ocbey": "Version",
    "2RhAT": "Il semble que le processus de récupération de forge rencontre un problème",
    "2Ruh6": "Créer un nouveau compte local",
    "2S5ap": "Basculer en mode plein écran",
    "2Y1mR": "Effacer le texte",
    "2bcde3fg": "Inconvénients de Base64",
    "2bqHk": "Charger à partir d'un fichier",
    "2e4fb7": "Igbo",
    "2giYv": "Tester le mot de passe : {0}",
    "2khdsv": "pachtou",
    "2lehqwp": "vietnamien",
    "2lhcqwp": "turc",
    "2lhqqwp": "indonésien",
    "2lhqqwqp": "malais",
    "2lhqwwp": "thaïlandais",
    "2qdin8": "entrez le code de vérification S'il vous plait",
    "2tib5m": "suédois",
    "2ybu7j": "norvégien",
    "30eo2v": "gujarati",
    "32D9a6": "Créer un compte",
    "33RXi": "La demande a été rejetée en raison de paramètres insatisfaisants.",
    "346qid": "russe",
    "34wxyz56": "Comment encoder/décoder Base64 en JavaScript ?",
    "39dsCt": "Vous recevrez la dernière notification des services d'application si vous en avez.",
    "3ii2tt": "Gaélique écossais",
    "3umnB": "Jeton inconnu",
    "441oja": "géorgien",
    "44Ntqw-": "Gestion de l'opération.",
    "46bksi": "lituanien",
    "4K_vhq": "Dupliquer cet onglet",
    "4PIqD": "Révision du code",
    "4UYIJ": "Pas encore terminé.",
    "4cGA_": "Récupération des données pour les préférences système...",
    "4hijk5lm": "Augmentation de la taille : les données codées sont environ 33 % plus grandes que les données binaires d'origine.",
    "4kKe4": "Votre mot de passe",
    "4tqb4x": "hongrois",
    "4vdfwf": "D'ACCORD",
    "4wlih": "La demande a été rejetée en raison de paramètres insatisfaisants.",
    "52OiQ": "Copié {0} fois",
    "54cwb": "L'API Websocket du système a rencontré une erreur : {0}",
    "56ibcj": "vietnamien",
    "58HQX": "Si vous ne connaissez pas sa valeur, veuillez contacter votre administrateur pour plus de détails, qui se trouvent dans ses paramètres.",
    "5BOhl": "code d'invitation",
    "5Ih2u": "Navigateur d'outils",
    "5NCPT": "Mode sombre",
    "5NJeGsu1": "E-Mail, vous pouvez facilement organiser votre boîte de réception, rédiger et envoyer des messages et rester au courant de votre correspondance. Jusqu'à présent, il est utilisé uniquement comme outil de communication entre les utilisateurs et notre équipe.",
    "5NJeddqGsu1": "Cette section comprend du matériel informatique, des articles wiki, des guides d'utilisation, etc.",
    "5NJedqddqGsu1": "Cette section comprend des ressources informatiques qui peuvent être utilisées pour construire vos propres projets.",
    "5Perd": "Désolé, la fonction « Utiliser Smart Editor » n'est pas encore disponible. Nous travaillons toujours à sa mise en œuvre. Merci pour votre patience.",
    "5ZBYR": "Dos",
    "5dF7o": "Rafraîchir",
    "5e6f7g8h": "Base64 est utilisé lorsque les données binaires doivent être transmises via des protocoles basés sur du texte comme le courrier électronique ou JSON, ou intégrées à des endroits où seul le texte est autorisé.",
    "5eXVS": "Contenu du script",
    "5ggegx": "coréen",
    "5lW8qp": "Montrer un exemple pour cet outil",
    "5q-Zxqa": "Gestionnaire de scripts",
    "5qPOJL": "Pour prendre en charge LafTools, pensez soit à donner une étoile à notre référentiel sur GitHub, soit à passer à notre version professionnelle via un abonnement mensuel. Nous apprécierions grandement votre aide et nous promettons que LafTools deviendra encore meilleur grâce aux fonds collectés.",
    "5qV5Sf": "Supprimer cet enregistrement de la liste",
    "5rg5mt": "malgache",
    "5srFq": "LafOutils",
    "5v8jl7": "Hmong",
    "6AumW": "Action par défaut",
    "6ClPV": "Créer",
    "6hsnqWe": "Bien que LafTools soit gratuit et open source, sa maintenance nécessite néanmoins beaucoup de temps et d'énergie. Nous avons notamment besoin de fonds pour payer certaines API cloud. Si vous appréciez LafTools, pensez à nous soutenir.",
    "6j13s3": "islandais",
    "6nopqrst": "Pas de cryptage : Base64 n'est pas une méthode de cryptage ; il est facilement décodé et n’offre aucune sécurité.",
    "6qT9d-N": "Pour le notebook, LafTools fournit non seulement un gestionnaire de commandes shell, mais y ajoutera également de puissants outils de notes dans un avenir proche, tels que MarkDown, Latex, {0}, etc.",
    "6ulj8i": "Népalais",
    "6yOXx": "Nom inconnu",
    "71x7x": "Code source sur GitHub",
    "78abcdef": "JavaScript propose des fonctions intégrées telles que btoa() et atob() pour l'encodage et le décodage Base64 respectivement.",
    "78ijk9lm": "Base64 a été défini pour la première fois dans la RFC 1421 (1993), puis normalisé dans la RFC 4648 (2006).",
    "7MOO1": "Se connecter",
    "7dm0d8": "Chinois traditionnel",
    "7g5w22": "norvégien",
    "7k56u3": "Galicien",
    "7q40W": "Impossible d'initialiser l'administrateur",
    "7u4vzu": "slovaque",
    "7x3f6": "Onglet - 1",
    "82r0C": "Gérez votre liste TODO et faites les choses plus efficacement.",
    "83dNp": "Impossible de charger l'ID d'extension. (RÉF : 1dl1f)",
    "8LdRj": "Aperçu",
    "8LdRjq": "Calculer",
    "8LdevRj": "Service",
    "8M1wY": "Terminal local",
    "8eeL1Kk": "À propos",
    "8mn_qa": "Récupération des données des services terminaux...",
    "8qzWJu": "Désolé, nous ne prenons pas encore en charge les appareils à petit écran pour le moment. Veuillez utiliser un PC pour visiter cette page.",
    "8veXac": "Le temps est la ressource la plus précieuse, gérez-le judicieusement.",
    "97um9v": "hawaïen",
    "9Xv8-": "Enregistrer sous note",
    "9_qaj": "Quitter ce formulaire",
    "9a335": "Veuillez cliquer sur n'importe quel élément d'extension dans le premier menu de gauche, celui actuel est vide ou invalide.",
    "9e4fcl": "Tamil",
    "9eZHM": "Oops! Il semble que nous rencontrions des avertissements ou des erreurs.",
    "9gqo8x": "letton",
    "9i0j1k2l": "Il est également utilisé pour intégrer de petites images directement dans HTML ou CSS en tant qu'URL de données.",
    "9m85mf": "Sésotho",
    "9qy1xn": "Portugais",
    "9tbbkt": "finlandais",
    "9zCSc": "Aucun espace de travail disponible",
    "A69UZ": "Variables",
    "AVUvu": "Base62 est une notation permettant de coder des données d'octets arbitraires à l'aide d'un ensemble restreint de symboles qui peuvent être facilement utilisés par les humains et traités par des ordinateurs. La base numérique élevée donne des chaînes plus courtes qu'avec le système décimal ou hexadécimal.",
    "AW9N8": "Région d'entrée",
    "AfPC0": "Votre mot de passe en texte brut",
    "Ahrjc": "Le répertoire n'existe pas, souhaitez-vous le créer ?",
    "AkXgF": "En cours : {0} %",
    "Apx8D": "Comment réinitialiser votre mot de passe manuellement ?",
    "B0s0z": "Objectif de cette page :",
    "BGd7P9": "Cette opération code les données brutes dans une chaîne ASCII Base64.",
    "BGd7dP9": "Cette opération code les données brutes dans une chaîne ASCII {0}.",
    "BGdd7dP9": "Cette opération code les données brutes dans une chaîne ASCII {0}.",
    "BShq3M": "Problèmes",
    "BW3bpT": "Lecture du fichier à partir du disque...",
    "Bd9h-": "Ajoutez-le à ma collection préférée",
    "BuihG": "Les paramètres du système",
    "CASef": "C'est bon, l'opération est déclenchée.",
    "CEv8B": "Êtes-vous sûr de supprimer cet enregistrement ? Si oui, cliquez à nouveau sur ce bouton.",
    "CVUl0": "LafOutils",
    "CWoqhy": "Liste des exts par CategoryID sélectionné",
    "CfZAX": "Le fichier {0} sélectionné, nous le téléchargeons sur le service principal.",
    "CidOqAZ": "En tant que créateur de LafTools, je suis tellement touché que vous souhaitiez nous soutenir. Nous avons de bonnes personnes dans notre équipe qui travaillent dur pour améliorer continuellement LafTools.",
    "Cide2w": "Pour voir s'il y a un problème lors de l'exécution de votre action.",
    "DIQFq": "Veuillez vérifier si le paramètre URL a été correctement fourni, il semble que vous n'ayez pas l'autorisation de remplir ce formulaire. Par défaut, vous pourrez voir le message ci-dessous dans la sortie du service lors de son lancement.",
    "DIweGq": "Sécurisez vos LafTools",
    "DTTPW": "Statut de réinitialisation",
    "DVoKw": "Déconnectez-vous de ce système",
    "DadYp": "Anti-rebond en temps réel",
    "DrXAq": "Bienvenue à utiliser LafTools !",
    "DrbEr": "Le mot de passe que vous avez fourni est vide, veuillez vérifier et réessayer.",
    "DtlAc": "Chargement des ressources système",
    "Dxlw0": "Complet",
    "E62ej": "Commandes du shell de filtre",
    "E6F9B": "Ajoutez-le au flux de travail",
    "EEQkW": "L'algorithme MD6 (Message-Digest 6) est une fonction de hachage cryptographique. Il utilise une structure arborescente Merkle pour permettre un immense calcul parallèle de hachages pour des entrées très longues.",
    "ERK7E": "Si vous rencontrez un problème ou avez des suggestions lors de l'utilisation de LafTools, n'hésitez pas à nous contacter via EMail ou GitHub à tout moment, nous serons heureux de vous aider.",
    "EgBXL": "Sélectionnez ou fournissez des balises.",
    "Ewvgo": "Pas encore commencé.",
    "ExqvX": "Liste des touches de raccourci",
    "Eyq856": "Nous n'avons pas encore terminé : nous nous engageons à fournir les fonctionnalités les plus récentes et les plus performantes, et nous continuerons à publier des mises à jour pour garantir que vous bénéficiez de la meilleure expérience possible.",
    "F-OUm": "Configuration rapide pour LafTools",
    "F0CCF": "Liste des raccourcis clavier",
    "F4uS2": "Nouveau fichier",
    "FBVyc": "Veuillez saisir à nouveau le code de vérification",
    "FDlRI": "Nommez ce nouvel onglet et cliquez pour le confirmer.",
    "FOyHW": "Rechercher partout",
    "FQzhg": "Ignorer l'entrée vide",
    "FhVWl": "Chiffrez votre mot de passe",
    "FjYbR": "Sortir",
    "Fv-zz": "Copier le résultat",
    "Fy217": "Configurer le transformateur de texte",
    "Fzp3t": "Apporter de la valeur",
    "G3MJN": "Afficher le panneau de sortie",
    "G9QVo": "Gérer les onglets",
    "GR7jK": "Taper",
    "Ggob_": "Annuler",
    "H-Ae75": "Veuillez confirmer votre mot de passe local.",
    "H-qA75": "Veuillez fournir un mot de passe local.",
    "H8fQ4": "Basculer en mode clair ou sombre",
    "HEAhr": "Après la traduction, le résultat apparaîtra ici.",
    "HIc3c": "Complété",
    "HNDat": "Pour apporter des modifications, veuillez cliquer sur le bouton \"{0}\". Sinon, cliquez sur \"{1}\" pour appliquer vos modifications. Puissiez-vous passer un bon moment avec cette boîte à outils !",
    "Hflf2": "Pour des raisons de cybersécurité, nous ne vous aiderons pas à réinitialiser votre mot de passe via les API ou les pages ici, sauf si vous mettez à jour manuellement le fichier protégé par le système.",
    "HjvV3": "Nous ne supprimerons pas ses fichiers sur le disque, supprimerons simplement cet enregistrement de la liste.",
    "HyIC_": "Touche barre oblique (/)",
    "HyIC_d": "Touche barre oblique (/)",
    "I8FLi": "Maintenant, il est temps de configurer votre administrateur, veuillez définir le mot de passe aussi complexe que possible afin de pouvoir perplexe ces attaquants impolis.",
    "IAC0A": "Outils de recherche",
    "ICefi": "Annulé",
    "IKqqATS": "Actualiser les données de la page actuelle",
    "IOOrz": "(Cela serait-il nocif pour votre système ? Nous ne le pensons pas, tant que vous pouvez modifier le fichier de configuration préservé par le système, cela signifie que vous êtes autorisé à tout lire sur les fichiers de données LafTools.)",
    "IWUH5": "Afficher l'exemple",
    "IaSyO": "Annuler",
    "IfsGO": "Favoris",
    "IfsdGO": "Favoris",
    "ImUmf": "Nouveau",
    "J-3KA": "Veuillez fournir un nom pour ce script, ce qui serait plus utile.",
    "J164i": "par exemple. Copier les fichiers sur le serveur distant",
    "J2xoL": "Veuillez consulter l'erreur : {0}",
    "JA_Bp": "Veuillez d'abord fournir un nom pour la nouvelle balise.",
    "JQEVK": "Code",
    "JQLmS": "Ajusté la taille",
    "JQLmSq": "Complété.",
    "JTBRh": "LafTools a stocké la valeur du mot de passe dans le fichier local, mais ne vous inquiétez pas, nous avons adopté un mécanisme de cryptage du mot de passe unidirectionnel, c'est-à-dire que personne ne peut lire le mot de passe de la version en texte brut. Pour réinitialiser le mot de passe, veuillez suivre les instruments ci-dessous pour réinitialiser manuellement votre mot de passe.",
    "JYqxz2": "Bienvenue sur LafTools, ceci est une version initiée.",
    "JdqiUE8": "Cette opération décode les données d'une chaîne ASCII (avec un alphabet de votre choix, préréglages inclus) dans sa forme brute.",
    "JdqidUE8": "Cette opération décode les données d'une chaîne ASCII (avec un alphabet de votre choix, préréglages inclus) dans sa forme brute.",
    "JfFHw": "Obtenir une demande d'informations sur l'espace de travail",
    "JiUE8": "Cette opération décode les données d'une chaîne ASCII {0} dans son format brut.",
    "K1qJZI": "Bienvenue sur LafTools, Votre Excellence.",
    "KGS2-": "Une fois que vous avez terminé les étapes ci-dessus, vous pouvez utiliser votre nouveau mot de passe pour vous connecter à votre système. Si vous ne parvenez pas à accéder au système de fichiers, veuillez demander à votre administrateur ou à votre support informatique de créer ce fichier. Si le fichier existait déjà, supprimez-le et créez-en un nouveau.",
    "KIc63": "Fonction pas encore prise en charge",
    "KYh1N": "Toutes les notes",
    "KcqrRr": "Référence",
    "KcrRr": "Récupération des données d'implémentation du code",
    "KmEUF": "Fournir un aperçu rapide des outils système actuels.",
    "Kw4OJr": "Terminal",
    "Kyd9H": "Code source sur GitHub",
    "L-p-Y": "Copiez le contenu de la commande shell actuelle dans le presse-papiers",
    "L3zEM": "Afficher l'exemple",
    "L42mxa": "Veuillez saisir votre texte source dans ce champ.",
    "L49kCq": "Veuillez fournir et confirmer le mot de passe de verrouillage dans ce formulaire pour sécuriser votre LafTools.",
    "L71q_N": "Le mot de passe que vous avez fourni est vide, veuillez vérifier et réessayer.",
    "L9bQku": "Décoder {0}",
    "L9qbQku": "Décoder {0}",
    "LAc1m": "Actualisation de la vue de l'application.",
    "LFdvM": "Pas connecté",
    "LM715": "Récupération des noms d'utilisateur à partir de l'API du serveur local",
    "LPJrV": "Copier le résultat",
    "LU9Jj": "Base85 (également appelé Ascii85) est une notation permettant de coder des données d'octets arbitraires. Il est généralement plus efficace que Base64.<br><br>Cette opération décode les données d'une chaîne ASCII (avec un alphabet de votre choix, préréglages inclus). Base85 est couramment utilisé dans les formats de fichiers PostScript et PDF d'Adobe.",
    "LWaeFqd": "Passez à votre langue préférée",
    "Le71_N-": "Le mot de passe que vous avez fourni n'est pas le même que celui confirmé, veuillez vérifier et réessayer.",
    "LnJ4H": "Notez que le compte local n'est absolument pas le même que celui de l'utilisateur enregistré sur notre site Web, le premier est défini uniquement sur votre PC tandis que le second peut être utilisé pour la synchronisation cloud.",
    "LqWaFd": "Les paramètres du système",
    "M3qytc": "Encoder {0}",
    "M3ytc": "Vers Base64",
    "M4ywN1": "Calculatrice, calendrier, horloge, météo et bien plus encore.",
    "M6MrW": "Bien",
    "M7jct": "Passer en mode plein écran",
    "MN2lT": "La longueur du mot de passe ne peut pas être inférieure à 6",
    "Ma5mv": "Basculer la visibilité des onglets de la barre d'outils",
    "Mq9pdpT": "Répertoriez toutes les ressources pertinentes pour le menu fonctionnel que vous avez sélectionné.",
    "Mq9ppT": "Visualisez rapidement l’état de vos services",
    "MrgmU": "Confirmer",
    "NMLOn": "Copier le chemin du fichier",
    "NMLOn1": "Espace de travail ouvert",
    "NNfJo": "Charger des données à partir d'un fichier",
    "Nq1IR": "Impossible de charger la VM d'extension",
    "Nqc0LqwX": "Si vous pensez qu'il existe une vulnérabilité dans ce processus, n'hésitez pas à nous contacter via EMail ou GitHub à tout moment, nous aimerions l'améliorer de toute urgence.",
    "O02-W": "Ne charge pas...",
    "O94Yx": "sur",
    "OO0qPN": "Exemple chargé",
    "OQWm4": "Signaler un bug",
    "OSHOI": "Page d'accueil",
    "OSqZQM": "Mot de passe local",
    "OeO0PeN": "Bon, l'exemple est affiché dans l'éditeur de saisie.",
    "OeOQY": "FAIRE",
    "OpPFe": "Si vous aimez LafTools, partagez-le avec vos amis et donnez-nous une étoile, merci !",
    "Opcty": "Des dossiers",
    "OqqGx2qg": "Chargement des ressources statiques, veuillez patienter...",
    "OrCt5": "Redirection vers l'établi...",
    "Ot6EP": "Outils de polissage",
    "P4ROa": "Région de sortie",
    "PM_N5": "Séance – {0}",
    "PUxuU": "Récupération des données pour les modules linguistiques...",
    "PapkF": "Si vous avez des questions ou des suggestions concernant LafTools, n'hésitez pas à nous le faire savoir. Nous recherchons toujours des moyens d'améliorer notre produit et d'offrir la meilleure expérience possible à nos utilisateurs. Vous pouvez nous contacter à work7z@outlook.com. Merci d'utiliser LafTools !",
    "PpCHA": "Clé des questions (?)",
    "PqazM-": "Tout d'abord, veuillez utiliser les contrôles de formulaire ci-dessous pour crypter votre mot de passe.",
    "QL9Sn": "Pour le moment, il ne semble pas y avoir de description disponible.",
    "QLKzF": "Il regorge de fonctionnalités qui répondent aux besoins des développeurs débutants et expérimentés, ce qui en fait un outil incontournable dans l'arsenal de tout programmeur.",
    "QM2Ob": "Outils récents",
    "QM2Oq": "Notes récentes",
    "QRAdA": "Anglais vers chinois",
    "QhdpH": "Edition communautaire",
    "QzlA3": "Une erreur s'est produite",
    "R12bq": "Liste des onglets qui ne sont pas affichés",
    "RNBze0": "Outils",
    "RNeBze0": "Onglets ouverts",
    "RNewBze0": "Configuration de l'outil",
    "RO4ZP": "Une erreur s'est produite",
    "RPVRl": "Il semble que cette extension soit incompatible avec la version actuelle de LafTools, veuillez envisager d'installer la dernière version pour prendre en charge cette extension ou veuillez nous contacter en soulevant un problème sur GitHub.",
    "RhqzcdD": "Les paramètres du système",
    "RjCO3": "Liste des espaces de travail",
    "S4MMV": "Oops! Nous avons trouvé quelques problèmes lors du chargement du fichier.",
    "SAnnQ": "Chargement du fichier {0}",
    "SBsDz": "Configuration de votre compte administrateur.",
    "SGs7B": "Configurez rapidement vos LafTools",
    "SMqD13": "Entrez pour filtrer",
    "SPem9": "Ce champ n'est pas encore prêt.",
    "SQAw7": "Langue originelle",
    "SYSq1": "Exemple",
    "SZgXb": "Configurer le mot de passe local",
    "SdGcT": "Autre partie",
    "Sm9tq": "Veuillez fournir le mot de passe du compte ici",
    "Sm9tqq": "Veuillez fournir un mot de passe pour déverrouiller votre LafTools",
    "Spcfdee": "Mode clair ou sombre",
    "TBPqy7": "Langue",
    "TD7DA": "Langues",
    "TNoePE": "Nuage LafTools",
    "Ttrqqet": "Écrivez et enregistrez vos pensées ici !",
    "TwFcr": "Langue cible",
    "TyqvWY3": "Fichier local",
    "U2ZNl": "En savoir plus sur Wikipédia",
    "U4qqq9": "Supprimer cet onglet de la liste",
    "U7zP2": "Veuillez fournir le nom d'utilisateur du compte ici",
    "UF_Dp": "Une erreur s'est produite : {0}, l'heure de rejet est {1}",
    "UU_7h": "Veuillez cliquer sur n'importe quel élément de catégorie dans le premier menu de gauche, la catégorie actuelle est vide ou invalide.",
    "UZ2Ig": "Nouveau compte local",
    "Ugpng": "Préféré",
    "Uzqjy": "Mise en œuvre",
    "V6U_f": "Conditions d'utilisation",
    "V6XEO": "Entrez le nom d'utilisateur ou l'e-mail",
    "VAZq8r": "Il permet aux développeurs d'exécuter diverses commandes, telles que l'exécution de scripts, l'installation de packages et la navigation dans le système de fichiers, le tout depuis l'éditeur.",
    "VEfeqZG": "Remarques",
    "VI6VT": "Histoire",
    "VOsZc": "Signaler un problème",
    "VSZ": "Cliquez pour relancer",
    "VZtqg6": "Créer un nouveau formulaire de script",
    "Vaf2y": "Le nom de l'onglet ne peut pas être vide.",
    "VeY9K": "Conditions d'utilisation",
    "VgG5y": "Cliquez ici pour actualiser le statut de votre extension",
    "VjZCv": "Conversion en temps réel",
    "WPrTW": "Site officiel",
    "WXo6D": "Actualisé",
    "WYCVL": "Installation rapide",
    "X4L_Z": "L'extension VM n'est pas fournie.",
    "X6Fq4j": "Après des années de développement et de perfectionnement, nous sommes convaincus que LafTools peut améliorer considérablement votre expérience de programmation en apportant plus de commodité et d'efficacité à votre flux de travail.",
    "XKpI0": "Cliquez pour traiter votre texte dans la région de saisie",
    "XLWoR": "Sélectionnez votre préféré et continuez",
    "XQxJB": "Mes espaces de travail",
    "X_HGx": "LafTools est une boîte à outils polyvalente conçue pour répondre à divers besoins. Il est entièrement open source, garantissant transparence et sécurité. Malgré son environnement d'exécution léger, il offre une prise en charge complète de la plate-forme, y compris ARMv8, et une prise en charge native de l'IA similaire à ChatGPT. LafTools est hautement intégré à une interface utilisateur productive et est continuellement mis à jour avec de nouveaux outils. Il peut être utilisé sur le Web et avec Docker, et fournit des ressources supplémentaires telles que des notes et des manuels.",
    "XeXF77": "Paramètres",
    "XikdD": "Quelques instants s'il vous plaît, nous y sommes presque !",
    "Y5GAC": "Ton nom d'utilisateur",
    "Y9mQ2": "Veuillez fournir le nom d'utilisateur du compte ici",
    "YAAU3q": "Mot de passe local",
    "YHCjT": "LafTools prend en charge le thème global clair et sombre, il est particulièrement utile avec les codeurs de nuit.",
    "YNwKz": "Langue non prise en charge : {0}, utilisera l'anglais par défaut.",
    "YOYTp": "Installation rapide",
    "YPPPL": "Basculer la visibilité des onglets des barres d'outils",
    "YQN9u": "Une erreur s'est produite lors du chargement de {0}, veuillez vérifier les détails ci-dessous.",
    "Y_k0z": "Mot de passe oublié?",
    "Ye3TXses": "Pour configurer si la transformation sera exécutée automatiquement lorsque le texte saisi est modifié.",
    "Ylq2X": "Correction des erreurs",
    "YquQqTXq": "Exécution automatique ?",
    "YrTdq": "Tous",
    "YrVq683": "Mail",
    "YrVqdd683": "Manuels",
    "Z2QTU": "À propos",
    "Z3rhY": "Message",
    "Z7ALO": "Passé à l'espace de travail sélectionné",
    "Z7OTt": "Le fichier que vous avez sélectionné est trop volumineux, veuillez sélectionner un fichier inférieur à 30 Mo.",
    "ZAGva": "Êtes-vous sûr de supprimer cet espace de travail ?",
    "ZAKaFq": "Mon compte Cloud",
    "ZW1Dgz": "Aucun message disponible",
    "ZXRGC": "Veuillez consulter l'erreur : {0}",
    "ZbD3F": "{0}, conçu par l'équipe LafTools",
    "Zk7JI": "Ce n'est pas encore pris en charge",
    "ZrbduC": "Fermer tous les onglets",
    "ZrbuC": "Fermer l'onglet",
    "_5OqeG": "Décochez-le",
    "_LFF3": "Si vous rencontrez un problème ou avez des suggestions lors de l'utilisation de LafTools, n'hésitez pas à nous contacter via EMail ou GitHub à tout moment, nous sommes prêts à l'améliorer.",
    "_trez": "Échanger du texte",
    "_trqL": "Récupération des données pour les ressources système...",
    "_z3lR": "Actualiser le code",
    "a3yqoz": "persan",
    "a3z-3k12": "Outils d'adresse IP",
    "a4jbpq": "tchèque",
    "a4r9t": "Base45 peut-il décoder n'importe quelle chaîne codée en Base45, quelle que soit son origine ?",
    "a4s6x": "Comment fonctionne Base32 ?",
    "a8b7z": "Ainsi, le remplissage n'est nécessaire que si le dernier groupe de bits en cours de codage n'est pas divisible par 40 bits (puisque 8 caractères Base32 représentent 40 bits). Le remplissage sera composé de zéro à six caractères « = » à la fin de la chaîne codée.",
    "aCkOP": "Sortie",
    "aHAfR": "Récupération des données pour {0}...",
    "aSOpr": "Générateur de modèles de données",
    "ab9c0d1e": "Les opérations principales incluent le codage (conversion du binaire en Base64) et le décodage (conversion du Base64 en binaire).",
    "abc12345": "Base64 est un schéma de codage qui représente les données binaires sous la forme d'une séquence de caractères ASCII.",
    "abcdef12": "Comment fonctionne Base64 ?",
    "about_LafTools_toolbox": "À propos de LafTools",
    "adpgq": "Créer un nouvel espace de travail",
    "ah-C4": "Nouvelle remarque",
    "aj3nhd": "Allemand",
    "aked6": "Les références",
    "aked61": "Introduction",
    "asElV": "Retirer",
    "az4uS2": "Êtes-vous sûr de vous déconnecter de ce système ? Notez que vous serez redirigé vers la page de connexion.",
    "azpNX": "Complété.",
    "b0qjSL": "Veuillez entrer dans le répertoire {1} et créer un fichier {2}, mettre votre mot de passe crypté comme contenu complet du fichier.",
    "b6sx9b": "Philippin",
    "b8g2k": "Scénarios d'utilisation pour Base32",
    "bP_6qG": "Conseils pour avoir oublié votre mot de passe",
    "bT4R6": "Nouvel onglet",
    "bVlBN": "Chinois vers anglais",
    "bcdef01a": "Base64 fonctionne en divisant les données binaires en groupes de 6 bits et en mappant chaque groupe à un caractère spécifique d'un alphabet de 64 caractères (A-Za-z0-9+/).",
    "bhojei1": "Chinois traditionnel",
    "bjZyW": "Traduire",
    "bors14": "turc",
    "bp_-b": "Pour gérer entièrement LafTools, vous devez configurer votre administrateur au début du flux de configuration. Nous avons vérifié votre identification grâce au jeton de paramètre URL. Soyez assuré que personne d'autre ne peut configurer votre autorisation root à moins d'obtenir un jeton de configuration.",
    "bqqrij": "Swahili",
    "c0eCw": "Traduisez votre texte dans la langue de votre choix.",
    "c0v2p": "Opérations courantes avec Base32",
    "c1p3b": "Une fois intégré, copiez le modèle fourni dans votre programme C++ et remplacez l'espace réservé par la valeur codée réelle avant d'exécuter le programme.",
    "c1p4b": "Chaque nombre décimal est ensuite converti en une séquence unique de cinq caractères Base85. S'il reste moins de quatre octets à la fin, un remplissage peut être appliqué.",
    "c2tpr": "La bibliothèque Apache Commons Codec fournit des fonctionnalités d'encodage et de décodage Base32 en Java.",
    "c2vw9k": "Bien que Base45 ne soit pas aussi largement implémenté que Base64 ou Base32, des bibliothèques open source existent pour plusieurs langages.",
    "c5m1b": "Une autre variante, Base58Flickr, diffère légèrement par son jeu de caractères. Il remplace '+' par ',' et '/' par '-', s'adaptant aux besoins d'URL de Flickr.",
    "c5meku": "Soundanais",
    "c5p1b": "Le rembourrage n'est pas utilisé ; la longueur de la sortie codée dépend directement de la taille des données d'entrée.",
    "c6p4n": "Après avoir installé la bibliothèque, copiez le modèle fourni dans votre script Python et exécutez-le. La bibliothèque propose des fonctions intégrées pour la conversion entre les octets et les chaînes codées en Base45.",
    "c6p9b": "Si la longueur des données d'entrée n'est pas divisible par 8, le remplissage n'est pas utilisé ; au lieu de cela, chaque groupe non complet est traité indépendamment.",
    "c7Uoqqe": "Avant d'utiliser LafTools, veuillez fournir et confirmer votre mot de passe local comme ci-dessous.",
    "c8me6b": "Les schémas personnalisés de type Base62 peuvent être adaptés à des applications spécifiques, mais ils adhèrent généralement au même principe d'utilisation d'un jeu de caractères plus grand que Base64 ou Base32.",
    "c9j5k": "Téléchargez et incluez l'en-tête 'base32.h' et son implémentation correspondante dans votre projet.",
    "c9j5v": "Installez-le via Composer en ajoutant « composer require christian-riesen/base32 » à votre projet.",
    "c9q7w": "Pourquoi Base45 a-t-il été créé ?",
    "cNQp_": "Ressources",
    "cPS6q": "Tous les outils",
    "cQqwI8r": "Chargement de l'état du service Terminal",
    "cbaq54321": "Non, Base64 n'est pas une technique de compression, elle modifie uniquement la représentation des données et non leur taille.",
    "cdefg234": "Des caractères de remplissage (=) sont ajoutés à la fin pour garantir que la longueur des données codées est un multiple de 4 caractères.",
    "cfYYN": "Découvrir plus",
    "ciZV2": "Base32 est une notation permettant de coder des données d'octets arbitraires à l'aide d'un ensemble restreint de symboles qui peuvent être facilement utilisés par les humains et traités par des ordinateurs. Il utilise un jeu de caractères plus petit que Base64, généralement l'alphabet majuscule et les chiffres de 2 à 7.",
    "ciZV21": "Base45 est une notation permettant de coder des données d'octets arbitraires à l'aide d'un ensemble restreint de symboles qui peuvent être facilement utilisés par les humains et traités par des ordinateurs. La base numérique élevée donne des chaînes plus courtes qu'avec le système décimal ou hexadécimal. Base45 est optimisé pour une utilisation avec les codes QR.",
    "ciZV2deq1": "Base58 (similaire à Base64) est une notation pour coder des données d'octets arbitraires. Il diffère de Base64 en supprimant les caractères facilement mal lus (c'est-à-dire l, I, 0 et O) pour améliorer la lisibilité humaine. Base58 est couramment utilisé dans les crypto-monnaies (Bitcoin, Ripple, etc.).",
    "cj1pd": "Opération d'actualisation",
    "cjzqj9": "bosniaque",
    "cmxzpg": "Malayalam",
    "coM2I": "Utiliser l'éditeur intelligent",
    "crD7I": "Pour configurer si la transformation doit ignorer le texte d'entrée vide dont la longueur est nulle.",
    "cuRCb": "Catégorie introuvable.",
    "cuRCqb": "La catégorie n'existe pas",
    "cxqhqa": "Myanmar (birman)",
    "d-l2l": "Confirmer",
    "d-qPr": "Disposition inconnue : {0}",
    "d1x7v": "Un autre exemple est celui de Git, où les objets hachés sont parfois stockés au format Base32 pour éviter les problèmes de fin de ligne et de restrictions de nom de fichier. De plus, HashiCorp Vault utilise Base32 pour la dérivation des clés.",
    "d2w4e": "Semblable à d'autres systèmes de conversion de base, Base62 fonctionne en convertissant les octets d'entrée en un grand entier, puis en l'exprimant sous la forme d'une combinaison de caractères de son jeu de 62 caractères.",
    "d2w6e": "Clonez/téléchargez le référentiel et incluez le fichier d'en-tête fourni dans votre projet. Compilez et liez les fichiers sources selon la documentation du projet.",
    "d3w2e": "Base58 fonctionne en convertissant les octets d'entrée en un grand entier, puis en exprimant cet entier sous la forme d'une combinaison de caractères de son jeu de 58 caractères (A-Z, a-z, 1-9).",
    "d5KZH": "Merci d'utiliser LafTools !",
    "d5LAU": "Sous licence AGPLv3",
    "d5fmq2": "italien",
    "d5hit": "Séance – {0}",
    "d5x1rl": "Espagnol",
    "d6g0w": "Cet extrait peut être exécuté dans n'importe quel environnement Python, y compris des scripts, des sessions interactives ou dans une application plus grande.",
    "d6y9k": "S'il n'y a pas assez d'octets pour remplir le dernier groupe, le remplissage n'est pas utilisé ; au lieu de cela, les bits restants sont traités et mappés sur leur(s) caractère(s) correspondant(s).",
    "d7w2e": "Base85 fonctionne en divisant les données d'entrée en groupes de quatre octets et en convertissant chaque groupe en un nombre décimal compris entre 0 et 2 ^ 32-1.",
    "d8w1b": "Vous pouvez le faire en utilisant pip en exécutant « pip install base45 » ou « python -m pip install base45 ».",
    "d9w7m": "De plus, comme il utilise uniquement des lettres majuscules, il ne peut pas utiliser toutes les combinaisons possibles de sensibilité à la casse comme mesure de sécurité supplémentaire comme le fait parfois Base64 avec le pliage de la casse pendant le décodage.",
    "dCFIC": "Code plus joli",
    "dCFIwC": "Générateur de codes",
    "dGKMx": "Sortir",
    "dGVUB": "Outils réseau",
    "dV5Eq": "Actualiser la liste des espaces de travail",
    "dWbBm": "C# inclut la classe « System.Convert » avec les méthodes intégrées ToBase64String et FromBase64String qui vous permettent d'encoder et de décoder les données Base64. La chaîne d'entrée est d'abord convertie en un tableau d'octets à l'aide du codage UTF-8, puis codée et décodée en conséquence.",
    "dk122q": "Gérez vos flux de travail pour combiner plusieurs outils ensemble.",
    "dkarh": "Okie, la boîte à outils a ouvert le répertoire. Si aucune fenêtre contextuelle ne s'affiche, veuillez vérifier si votre plate-forme prend en charge cette fonction ou si le répertoire se trouve sur le serveur.",
    "dkjk12": "c'est un test",
    "dkkq12": "Configurez votre outil dans cet onglet.",
    "dl4kr": "Mot de passe oublié?",
    "dpRY4": "Dictionnaire",
    "dqTqyvWY": "Menu du tiroir",
    "dsdpA_eJ": "Ajuster la taille",
    "dtjdt4": "Kazakh",
    "dxLQq": "Autorisation racine",
    "dzjTo": "Veuillez fournir le mot de passe du compte ici",
    "e--gB": "L’ID d’extension n’est pas fourni.",
    "e4Cd8t": "Base85",
    "e5c7r": "Base32 est un schéma de codage binaire en texte qui représente les données dans une chaîne ASCII à l'aide d'un sous-ensemble de 32 caractères. Il est conçu pour être lisible par l’homme et sécurisé pour les URL.",
    "e5rycw": "Kirghize",
    "e8Crq": "Veuillez remplir les champs ci-dessous pour votre nom d'utilisateur et votre mot de passe pour continuer.",
    "e8x2v": "Base45 fonctionne en divisant les données d'entrée en groupes de 5 octets chacun. Il convertit ensuite chaque groupe en nombre décimal et le mappe à un caractère correspondant parmi son jeu de 45 caractères.",
    "eN4fM": "Dans Rust, vous pouvez utiliser la caisse 'base64' pour l'encodage et le décodage Base64. Ajoutez 'base64 = \\\"1.x\\\"' à votre fichier Cargo.toml sous la section [dependencies], exécutez 'cargo build' et incluez les importations nécessaires dans votre code pour utiliser ces fonctions.",
    "eTmq": "Histoire de CodeGen ToolBox",
    "e_8pZ": "Une boîte à outils polyvalente permettant aux développeurs d'améliorer leur productivité.",
    "ediql2": "hongrois",
    "efg45678": "Comparaison avec Base32",
    "efghi678": "Cette variante est souvent utilisée pour les noms de fichiers, les URL ou les situations où les caractères spéciaux doivent être évités.",
    "egkqC8t": "Base58",
    "egkqCd8t": "Base62",
    "eifoni": "catalan",
    "eqkqd4W": "Veuillez fournir un nom pour la nouvelle balise",
    "etV-l": "Copier des fichiers sur SIT2",
    "eu5mh0": "biélorusse",
    "euaI8": "Créer un nouveau compte local",
    "euhy9v": "estonien",
    "f0q4w": "Un scénario d'utilisation populaire consiste à générer des clés secrètes pour l'authentification à deux facteurs (2FA), où des services tels que Google Authenticator et Yubikey utilisent des secrets codés en Base32.",
    "f1t2z": "Base62 a été développé pour fournir une alternative plus courte et sécurisée pour les URL à Base64, en particulier pour les identifiants uniques et les URL courtes.",
    "f3ttw8": "Maori",
    "f4t7z": "Base58 a été initialement développé pour Bitcoin afin de représenter sans ambiguïté les adresses publiques et les clés privées.",
    "f5a0s": "De plus, Base32 produit une sortie plus longue mais peut être plus adapté à des applications spécifiques telles que les noms de fichiers en raison de son manque de caractères spéciaux susceptibles d'entrer en conflit avec les règles du système de fichiers.",
    "f5bLC": "Documentation",
    "f7akol": "Anglais",
    "f7t1z": "Ajoutez la bibliothèque à votre projet Xcode manuellement ou via un gestionnaire de packages comme Swift Package Manager (SPM).",
    "f8n4m": "Sa compacité permet une utilisation plus efficace de l'espace dans les codes QR tout en conservant la lisibilité avec les lecteurs de codes-barres standards.",
    "f8wne": "Incluez le package en exécutant « Install-Package BouncyCastle » dans la console du gestionnaire de packages ou en l'ajoutant à votre fichier .csproj.",
    "f9t1z": "Base85 a été initialement développé pour représenter efficacement les données binaires dans les documents PostScript afin d'obtenir de meilleurs taux de compression.",
    "f9t2z": "Ajoutez ce qui suit à votre fichier pom.xml : `<dependency> <groupId>org.iso</groupId> <artifactId>iso-base45</artifactId> <version>...</version> </dependency>` où la version est la dernière version.",
    "fBP5h": "Nom d'utilisateur",
    "fEr5j": "Créer un nouveau script",
    "fTt2N": "Perl nécessite le module 'MIME::Base64' pour l'encodage et le décodage Base64. Installez-le en exécutant 'cpan install MIME::Base64' s'il n'est pas déjà installé.",
    "fV_1P": "Se connecter",
    "fdxluz": "roumain",
    "ff02c": "Annulé",
    "fghi6789": "Il est utilisé pour transmettre ou stocker des fichiers binaires dans des formats texte, garantissant ainsi la compatibilité entre différents systèmes.",
    "fgj880": "Télougou",
    "fqV_1P": "Débloquez vos LafTools",
    "g1h5n": "Comment fonctionne Base45 ?",
    "g2_aX": "Copiez le mot de passe crypté dans le fichier",
    "g3h5s": "Comment fonctionne Base85 ?",
    "g4h7s": "Pour C++, vous pouvez utiliser la bibliothèque « base45-cpp » disponible en tant que référentiel GitHub.",
    "g5SK9": "Ouverte récente",
    "g5ybh": "Ajoutez la dépendance à votre projet (Maven : 'org.apache.commons:commons-codec').",
    "g6f0r": "Aucune installation supplémentaire n'est requise pour les bibliothèques principales de Ruby. Remplacez simplement « TEST12345 » par la valeur souhaitée.",
    "g6f0t": "Exécutez « go get github.com/mitchellh/go-base32 » pour ajouter la dépendance à votre projet.",
    "g6v3b": "Cependant, le jeu de caractères plus large de Base45 peut augmenter le risque d'erreurs lors du traitement de caractères non alphanumériques, ce qui pourrait poser problème dans certains environnements ou canaux de transmission.",
    "g7h5k": "Comment fonctionne Base58 ?",
    "g8h7s": "Comment fonctionne Base62 ?",
    "g8r3e": "Le principal inconvénient de Base32 est son efficacité spatiale relativement faible ; il étend les données d'entrée d'environ 25 % de plus que Base64. Cela signifie que cela nécessite plus de stockage ou de bande passante pour la même quantité de données codées.",
    "gDjbs": "Données historiques",
    "gK3dNQ": "Copie",
    "gQhfS": "Outils de fichiers",
    "gT6re": "C++ n'a pas d'implémentation native Base64. Cet exemple utilise la bibliothèque OpenSSL pour effectuer l'encodage et le décodage Base64. Pour utiliser OpenSSL, installez-le sur votre système et établissez un lien avec les bibliothèques appropriées lors de la compilation de votre programme.",
    "gU1O2": "Déclenché",
    "gkC8t": "Base64",
    "gkdqqC8t": "Base45",
    "gkqC8t": "Base32",
    "gnKMZ": "Rafraîchi.",
    "gsHQM": "Exemple de données chargé avec succès",
    "h4e1b": "Il est également utile dans les situations où les chaînes alphanumériques sensibles à la casse sont plus faciles à gérer que les chaînes hexadécimales ou base64, qui peuvent contenir des caractères non alphanumériques susceptibles de provoquer des problèmes dans certains contextes (comme les URL ou les noms de fichiers).",
    "h6AeI": "Connexion Websocket fermée à {0}",
    "h7rUq": "Dans Node.js, la classe « Buffer » intégrée peut gérer l'encodage et le décodage Base64 sans nécessiter de bibliothèques externes. Cet extrait de code encode la chaîne « TEST12345 » en Base64, puis la décode en chaîne d'origine.",
    "h9j3m": "Rembourrage en Base32",
    "hJUMN": "Langue cible",
    "hMvh1": "Base de données de sauvegarde",
    "hRFxV": "Pour plus d'information, veuillez visiter notre site web",
    "hcnt1k": "Macédonien",
    "hhOT3": "Rechercher par nom",
    "hij90klm": "Base32 utilise un alphabet plus petit (A-Z2-7), ce qui donne des chaînes plus longues mais plus lisibles par l'homme.",
    "htt1d2": "espéranto",
    "hu-iz": "Minuteur",
    "huE6U": "Variable",
    "hyV-d": "Fait",
    "hyirc0": "suédois",
    "i27qmr": "frison",
    "i6hMN": "Code de vérification des images",
    "i7w2m": "Existe-t-il des bibliothèques Base45 intégrées dans les langages de programmation populaires ?",
    "i88tb": "Exporter le résultat vers un fichier",
    "i8q8tb": "Configurer WorkFlow pour l'entrée",
    "i9o7k": "Avantages de Base32 par rapport à Base64",
    "iNQvo": "Montrez un exemple pour commencer.",
    "iNqF1T": "Gérer le compte cloud",
    "iOEjZ": "Aucun code disponible",
    "iQL2c": "Nous explorons toujours la gamme complète des fonctions de ce bouton. Si vous avez des commentaires ou des suggestions sur la façon dont nous pouvons l'améliorer, n'hésitez pas à nous le faire savoir !",
    "i_lang_": "Packs de langue",
    "ib135dq": "Votre message de statut sera affiché ici",
    "iknTS": "Gestionnaire de mots de passe",
    "init_env": "Chargement des ressources système",
    "ip2g1": "Copié",
    "ipOSQE": "Édition Pro",
    "it8ths": "indonésien",
    "ixyP0": "Traitement automatique de l'action en temps réel",
    "j1b5k": "Les opérations les plus courantes impliquant Base32 incluent le codage de données binaires dans une chaîne Base32 et le décodage d'une chaîne Base32 dans son format binaire d'origine.",
    "j4s6r": "Comment encoder/décoder avec Base62 en JavaScript ?",
    "j5s7r": "Comment encoder/décoder avec Base85 en JavaScript ?",
    "j6s3r": "Comment encoder/décoder avec Base58 en JavaScript ?",
    "j7k2t": "Pour encoder des données avec Base45, vous avez besoin d'une bibliothèque ou d'une fonction qui implémente l'algorithme Base45.",
    "j8s6r": "Pour Kotlin, vous pouvez utiliser la bibliothèque « barcode-core » qui inclut la fonctionnalité Base45.",
    "j9s5r": "Pour C#, vous pouvez utiliser la bibliothèque « Base45 » disponible sur NuGet.",
    "jJuNz": "Langue originelle",
    "jO5eP": "D'ACCORD",
    "jOXj0": "Opps, quelque chose s'est mal passé.",
    "jPNCb": "Réessayé.",
    "jQXdi": "Mode lumière",
    "jR1zX": "Laboratoire d'IA",
    "jRzgS": "Le framework Foundation de Swift comprend des méthodes intégrées pour l'encodage et le décodage Base64. Aucune bibliothèque externe n'est nécessaire ; importez simplement « Foundation » pour utiliser ces fonctionnalités.",
    "jZvLJ": "PHP est livré avec les fonctions intégrées « base64_encode() » et « base64_decode() » pour gérer les opérations Base64. Ces fonctions sont facilement disponibles et ne nécessitent aucune configuration ou installation supplémentaire.",
    "jaj7M": "Tous droits réservés.",
    "jb392": "Nom",
    "jfpqt": "Navigateur de notes",
    "jgDoEq": "Aucune donnée FAQ",
    "jhDoE": "Récupération des données FAQ",
    "jlxvpk": "coréen",
    "k17PG": "Connexion Websocket fermée.",
    "k1m4e": "Cependant, il n'offre pas tout à fait la même efficacité spatiale que Base64 ou Base32 puisqu'il utilise moins de caractères dans son alphabet.",
    "k2SVY": "désactivé",
    "k2em5e": "Cela se traduit par des chaînes de sortie plus courtes pour la même quantité de données d’entrée, ce qui peut être bénéfique dans les scénarios où la réduction de la taille est essentielle.",
    "k2ku5p": "tchèque",
    "k3m2e": "Copiez le modèle fourni dans un nouveau fichier Go, remplacez l'espace réservé par la valeur codée réelle, puis exécutez le fichier en utilisant « go run yourfile.go »",
    "k41a5": "LafOutils",
    "k4s5rx": "slovène",
    "k7d9f": "La bibliothèque « base32 » intégrée de Ruby fournit des méthodes d'encodage et de décodage Base32.",
    "k7d9r": "Le package « go-base32 » fournit des capacités d’encodage et de décodage Base32 dans Go.",
    "k7g0n": "En Base32, tous les 5 bits de données d'entrée sont mappés à l'un des 32 caractères de l'ensemble 'ABCDEFGHIJKLMNOPQRSTUVWXYZ234567='.",
    "k9em5e": "Cela le rend idéal pour les scénarios dans lesquels un identifiant concis et convivial pour les URL est requis sans sacrifier la lisibilité.",
    "k9jtr": "Le package npm 'base32-encoding' est utilisé pour l'encodage et le décodage Base32 dans Node.js.",
    "kLH79": "E-mail",
    "kOi5A": "Imprimer la page",
    "kPD22": "Dictionnaire",
    "kPJ-A4": "Rafraîchir",
    "kZd9G": "Ruby dispose d'une bibliothèque « base64 » intégrée qui fournit des méthodes d'encodage et de décodage Base64. Incluez la bibliothèque avec 'require",
    "kcHxr": "Veuillez fournir le nom d'utilisateur du compte administrateur ici",
    "kjks1": "Récupération de la configuration i18n à partir de l'API du serveur local",
    "kqv5ht": "yiddish",
    "krxSK": "Assistant IA",
    "ks12d": "La cyber-sécurité",
    "kv4wag": "Néerlandais",
    "l1p9z": "Qu’est-ce que Base32 ?",
    "l3akoa": "Amharique",
    "l6Djb": "Sélectionnez l'une des options comme thème préféré :",
    "lIn3_": "Nom d'utilisateur administrateur",
    "lQFII": "Re-déclencher l'initialisation",
    "lRHDQ": "Quitter le mode plein écran",
    "lUh5c": "Général",
    "lkuulh": "Français",
    "lp0qmd0": "Marquez-le comme favori",
    "lpKAz": "Paramètres",
    "lpzg83": "Samoan",
    "lzGS2": "Détails de l'extension",
    "m0106": "Convertisseur",
    "m0107": "Générateur",
    "m0108": "Formateur",
    "m6d8b": "Chaque valeur de 5 bits est représentée par un seul caractère, permettant un codage et un décodage efficaces pour les systèmes qui préfèrent travailler avec des octets (unités de 8 bits).",
    "m6t1b": "La bibliothèque 'base32' de Daniel R. Collins fournit des fonctionnalités d'encodage et de décodage Base32 en C++.",
    "m7WZw": "Websocket système cassé",
    "m8rTc1": "Une fois le gestionnaire de scripts shell implémenté, vous pouvez l'utiliser pour gérer vos commandes shell.",
    "m9k1z": "Cependant, si les données décodées contiennent une sémantique d'application spécifique (par exemple, des formats de code QR spécifiques), un traitement supplémentaire peut être nécessaire après le décodage.",
    "mBgF1": "Action de la souris",
    "mSFei": "Code source sur GitHub",
    "mWXeh": "ID de l'espace de travail : {0}",
    "mabHq": "Rechercher d'anciens fichiers",
    "mbzCv": "Une erreur s'est produite : {0}, l'heure de rejet est {1}",
    "md2.desc.1039": "Cette opération code les données dans un hachage {0}.",
    "md2.text.192d3": "Générer {0} hachage",
    "md4.desc.1039": "Cette opération hache les données dans un hachage {0}.",
    "md4.text.192d3": "Générer {0} hachage",
    "md5-cpp-install-openssl-0002": "Installez OpenSSL sur votre système et établissez un lien avec les bibliothèques « libssl » et « libcrypto » lors de la création de votre application C++.",
    "md5-cpp-openssl-0001": "C++ utilise la bibliothèque OpenSSL pour générer des hachages MD5. Vous devez installer OpenSSL et créer un lien vers celui-ci dans votre projet.",
    "md5-cpp-use-openssl-0003": "L'extrait crée une fonction « getMD5 » qui prend une chaîne d'entrée, calcule son hachage MD5 à l'aide de l'API MD5 d'OpenSSL et renvoie le hachage sous forme de chaîne hexadécimale. Collez ce code dans votre programme C++ et appelez la fonction « getMD5 » avec l'entrée souhaitée.",
    "md5-csharp-built-in-0001": "En C#, la classe « System.Security.Cryptography.MD5 » est utilisée pour générer des hachages MD5.",
    "md5-csharp-no-install-0002": "Aucune installation de bibliothèque externe n'est nécessaire puisqu'elle fait partie de .NET Framework/Core.",
    "md5-csharp-use-0003": "Cet extrait crée une instance MD5, convertit la chaîne d'entrée en octets, calcule le hachage et enfin code le hachage au format Base64. Placez ce code dans le point d’entrée de votre application C# et exécutez-le pour obtenir le hachage MD5 codé en Base64.",
    "md5-java-built-in-0001": "Java utilise la classe « java.security.MessageDigest » pour générer des hachages MD5.",
    "md5-java-imports-0002": "Vous devez importer « java.security.MessageDigest » et « java.util.Base64 » pour hacher et encoder le résultat.",
    "md5-java-use-0003": "L'extrait obtient une instance de l'algorithme de digestion MD5, la met à jour avec les octets de la chaîne d'entrée, puis code le hachage résultant dans une chaîne Base64. Copiez ce code dans une classe Java et exécutez sa méthode principale pour obtenir le hachage MD5 codé en Base64.",
    "md5-nodejs-built-in-0001": "Dans Node.js, le module « crypto » intégré est utilisé pour générer des hachages MD5.",
    "md5-nodejs-no-install-0002": "Aucune installation de bibliothèque externe n'est requise puisque « crypto » est préinstallé avec Node.js.",
    "md5-nodejs-use-0003": "L'extrait crée un objet de hachage à l'aide de `createHash('md5')`, le met à jour avec la chaîne d'entrée, puis convertit le résumé au format hexadécimal via `.digest('hex')`. Collez ce code dans votre script Node.js et exécutez-le pour obtenir le hachage MD5 de la valeur d'entrée.",
    "md5-php-built-in-0001": "PHP a une fonction intégrée 'md5()' pour générer des hachages MD5.",
    "md5-php-no-install-0002": "Aucune installation de bibliothèque externe n'est nécessaire car « md5() » est préinstallé en PHP.",
    "md5-php-use-0003": "Cet exemple simple définit une fonction 'getMD5' qui appelle la fonction PHP 'md5()' sur la chaîne d'entrée fournie. Copiez ce code dans un fichier PHP, enregistrez-le avec une extension .php et exécutez-le sur un serveur Web ou via la ligne de commande pour voir le hachage MD5 de la valeur d'entrée.",
    "md5-python-built-in-0001": "Python utilise la bibliothèque 'hashlib' intégrée pour générer des hachages MD5.",
    "md5-python-no-install-0002": "Aucune installation supplémentaire n'est nécessaire car « hashlib » est fourni en standard avec Python.",
    "md5-python-use-0003": "Le modèle fourni code la chaîne d'entrée en octets avant de créer un objet de hachage MD5. La méthode '.hexdigest()' est ensuite appelée sur l'objet de hachage pour récupérer le hachage MD5 sous forme hexadécimale. Copiez ce code dans un script Python et exécutez-le pour obtenir le hachage MD5.",
    "md5.desc.rxsHq": "Cette opération hache les données dans un hachage {0}.",
    "md5.textiDjMIo": "Générer {0} hachage",
    "md6.desc.1039": "Cette opération hache les données dans un hachage {0}.",
    "md6.text.192d3": "Générer {0} hachage",
    "mihc3": "Terminé cette opération",
    "mjHoR": "De plus, techniquement, personne ne peut lire ce jeton sinon il aurait attaqué et contrôlé votre ordinateur.",
    "mnb19i": "Allemand",
    "mno34567": "Avantages de Base64",
    "mnoijklm": "Existe-t-il d'autres encodages BaseXX ?",
    "mslw4o": "grec",
    "mwn7iv": "zoulou",
    "myxedr": "mongol",
    "n0pqrstu": "Exemple d'utilisation de Base64",
    "n1jA9": "Confirmer",
    "n24tes": "Portugais (Brésil)",
    "n3e7r": "Histoire de Base32",
    "n94an4": "polonais",
    "n98EW": "Échangez le texte de la région d’entrée et de la région de sortie.",
    "nSeIq8-": "Et surtout, c'est gratuit et open source. Vous pouvez l'utiliser à des fins personnelles ou commerciales.",
    "nTvw4": "Pour protéger et enregistrer séparément vos données et paramètres, vous pouvez utiliser votre compte local pour y parvenir. En outre, LafTools prendra à l’avenir en charge les widgets de messagerie instantanée entre les utilisateurs.",
    "nmb1wx": "Yorouba",
    "nodBw": "Cette opération code les données brutes dans une chaîne ASCII {0}.",
    "nopqrs01": "Alors que Base64 optimise la compacité, Base32 est choisi lorsque la minimisation des erreurs de saisie, comme la saisie manuelle, est cruciale.",
    "nrix6l": "Chichewa",
    "nxJC7": "L'action par défaut à exécuter lorsque le transformateur est effectué.",
    "o1umzi": "Français",
    "o52xW": "Exporter",
    "o8xyzu": "luxembourgeois",
    "oBz8D": "Chargement",
    "oNLxH": "Nom d'utilisateur",
    "oNg3f": "Site officiel",
    "ocxsw3": "irlandais",
    "of_ox": "Dans l’ensemble, LafTools est une solution unique pour tous vos besoins.",
    "oj23X": "Restaurer la base de données",
    "ooiFU": "Redémarrer le service Java",
    "oqHqVq": "Trier par",
    "oqHqqV": "Total : {0} commandes",
    "oqHqqVq": "Temps de copie",
    "oqjbcj": "Laotien",
    "os8h6u": "danois",
    "p5e9n": "Ajoutez la bibliothèque en tant que dépendance dans votre script de build Gradle. Par exemple, dans le fichier build.gradle au niveau de l'application, ajoutez « implémentation 'com.bottlerocketstudios:barcode-core:... » avec le dernier numéro de version.",
    "p6e3n": "Pour l'installer, exécutez « Install-Package Base45 » dans la console du gestionnaire de packages ou ajoutez la dépendance via NuGet Package Manager.",
    "p8Exxc1s": "Il existe divers outils qui exploitent les technologies d’IA pour effectuer des tâches plus efficacement dans AI Laboratory.",
    "p8eq9n": "Vous pouvez utiliser des bibliothèques telles que « base85 » ou « ascii85 » pour l'encodage et le décodage Base85 en JavaScript.",
    "p9e1n": "Vous pouvez utiliser des bibliothèques comme « base-x » (<a href='https://github.com/cryptocoinjs/base-x'>lien GitHub</a>) ou « base62 » (<a href='https : //www.npmjs.com/package/base62'>lien npm</a>) pour l'encodage et le décodage Base62 en JavaScript.",
    "p9s5t": "Base32 a été développé par Douglas Crockford, connu pour ses contributions à JavaScript, en 2001. Il a été créé comme une alternative plus fiable aux encodages existants comme Base64, en particulier pour les situations nécessitant des représentations textuelles de données binaires.",
    "pANmj": "Les balises peuvent être définies en fonction des types de serveurs, des utilisations des scripts ou de tout autre critère que vous préférez.",
    "pA_deJ": "Exporter vers le Presse-papiers",
    "pA_feeJ": "Reconnecter le terminal",
    "pA_qweJ": "Effacer le tampon",
    "pDBSWq": "aucun contenu disponible pour le panneau de droite",
    "pEk1kk": "LafTools vous présente ici des fonctionnalités utiles.",
    "pEk1qkk": "Lister tous les onglets ouverts",
    "pHZDB": "Action en temps réel",
    "pJoOz": "Fichier ouvert",
    "pKHRT": "Allez dans Outils",
    "pKqHRq": "Notes de recherche",
    "pL6qH": "Complété.",
    "ph5jH": "Manipulation de cette partie",
    "piih4x": "Tadjik",
    "pmAee": "Lisez plus d’informations sur cet outil.",
    "pmnp4b": "ukrainien",
    "ppmz8e": "Créole haïtien",
    "pq5e9n": "Vous pouvez utiliser des bibliothèques telles que « bs58 » pour effectuer l'encodage et le décodage Base58 en JavaScript.",
    "pqrs890t": "Compatibilité universelle : Base64 est largement reconnu et pris en charge dans tous les principaux langages de programmation.",
    "pqs7y3": "Veuillez envisager d'enregistrer cette page Web en tant que PWA pour bénéficier d'une prise en charge complète du clavier.",
    "psA_eJ": "Exporter sous forme de fichier",
    "psZoP": "Déposez les fichiers ici pour les traiter",
    "psqqpq_o": "D'accord, le résultat a été copié dans votre presse-papiers {0} fois.",
    "q12beqwR": "Aucun outil disponible",
    "q29t31": "polonais",
    "q2n3r": "Aujourd'hui, il est utilisé dans diverses applications où l'efficacité de l'espace et la lisibilité sont cruciales, comme les documents PDF et certains protocoles réseau.",
    "q2n9r": "Une fois ajouté, copiez le modèle fourni dans un fichier Swift. Notez que dans cet exemple, nous utilisons un scénario hypothétique dans lequel vous disposez de la représentation base64 de la chaîne Base45 ; remplacez-le par la valeur codée réelle avant d’exécuter le code.",
    "q2w5m": "Objectif de l'utilisation de Base32 ?",
    "q2x8k": "Son utilisation s'est étendue à d'autres crypto-monnaies et scénarios dans lesquels des chaînes lisibles par l'homme et résistantes aux erreurs sont souhaitées.",
    "q5h8n": "Le principal avantage est la longueur de chaîne réduite pour la même quantité de données codées, ce qui le rend adapté aux applications où l'efficacité de l'espace est critique.",
    "q6K7o": "Charger à partir de notes",
    "q6n1r": "La bibliothèque fournit des classes d'encodeur et de décodeur qui gèrent la conversion Base45. Une fois la dépendance ajoutée, copiez le code du modèle dans une classe Java et exécutez-le.",
    "q7n3r": "Il évite également les caractères ambigus comme « O » et « 0 », « I » et « l », qui peuvent conduire à des erreurs de transcription humaines.",
    "q9iuti": "gallois",
    "qDrbEr": "Le nom d'utilisateur que vous avez fourni est vide, veuillez vérifier et réessayer.",
    "qF4uS2": "Créer un espace de travail",
    "qF4uS23": "Nouvelle fenetre",
    "qHoktx": "Merci!",
    "qN1LdZ2": "Dernière modification",
    "qQmBr": "Traduction de texte",
    "qTqyvWdY": "Pas encore fini",
    "qWemXE4": "1er janvier 2024",
    "qWw3eTH": "Cette partie permet de conserver les fichiers sur votre disque local ou votre disque cloud.",
    "qdeFXx": "Actuellement, la page que vous recherchez n'est pas encore entièrement mise en œuvre.",
    "qpDBSW": "aucun panneau disponible",
    "qpDBSWe1": "aucun panneau disponible",
    "qqK_x_": "Se connecter",
    "qqqwYoz": "Aide",
    "qqwYoz": "Onglets",
    "qqwYqwe": "Espaces de travail",
    "qrstuvwx": "Oui, outre Base64 et Base32, il existe également Base16 (hexadécimal), Base58 et Base85, chacun conçu pour des scénarios différents.",
    "qtpmvP": "Confirmer le mot de passe local",
    "qubSJ": "La VM d’extension n’est pas un ID. (RÉF : IQnMH).",
    "qv1p5n": "Par exemple, en Java, vous pouvez utiliser la bibliothèque « org.iso.base45 » pour encoder vos données.",
    "qzshys": "Ourdou",
    "r1GLS": "Mots clés",
    "r2n7v": "Le principal avantage est une lisibilité accrue grâce à l’exclusion des caractères d’apparence similaire, réduisant ainsi les erreurs lors de la saisie manuelle.",
    "r4n6v": "Ajoutez la dépendance à votre projet en exécutant « go get github.com/btcsuite/btcutil ». Cela téléchargera et installera le package.",
    "r6nq2v": "Le principal avantage de Base62 est son efficacité spatiale accrue grâce à un jeu de caractères plus grand que Base32 mais sans caractères non alphanumériques trouvés dans Base64.",
    "r6tq9z": "<b>Exemple :</b> Pour encoder « TEST12345 » en Base32, vous pouvez utiliser des bibliothèques telles que base32-encode dans Node.js, ou des fonctions intégrées dans d'autres langages tels que base64.b32encode de Python.",
    "r8c6z": "Remplacez « TEST12345 » par votre propre chaîne et exécutez cette classe en tant que programme Java pour voir les résultats.",
    "r8y2w": "La bibliothèque PHP 'Base32' est utilisée ici pour l'encodage et le décodage Base32.",
    "r9a3t": "Base45 est un système de codage basé sur du texte qui code les données binaires en caractères ASCII.",
    "r9qn8v": "Le principal avantage de Base85 est son efficacité spatiale améliorée grâce à un jeu de caractères plus grand (85 contre 64 en Base64 ou 32 en Base32).",
    "rK6cx": "{0}, conçu et développé par l'équipe LafTools",
    "rLXJN": "Dans Kotlin, la classe « android.util.Base64 » intégrée d'Android peut être utilisée pour l'encodage et le décodage Base64. Cet exemple suppose un environnement Android ; pour les projets Kotlin non Android, pensez à utiliser « java.util.Base64 ».",
    "rQkas": "Bienvenue sur LafTools",
    "rR1vd": "Entrée à partir d'un fichier",
    "rT34qnO": "Saisissez le texte à traiter. Le résultat s'affichera dans l'éditeur de sortie.",
    "rVqlu": "Décoder {0}",
    "r_n6h": "Mode clair ou sombre",
    "rf0mql3": "Thème clair ou sombre",
    "rpG0G": "Nous apprécions vos commentaires et aimerions connaître votre avis sur la façon dont nous pouvons améliorer notre produit - n'hésitez pas à partager vos commentaires avec nous !",
    "run_text": "Avant d'entrer dans votre workbench, nous aimerions d'abord précharger les ressources système requises. Veuillez patienter un peu, il sera bientôt terminé, dont les détails sont visibles ci-dessous.",
    "rycJy": "LafTools est une boîte à outils polyvalente spécialement conçue pour les programmeurs. Il représente la deuxième version de CodeGen Toolbox, désormais avec un runtime plus léger écrit en Golang et JavaScript.",
    "ryhkqb": "bulgare",
    "s0vrf9": "hébreu",
    "s1b3m": "Contrairement à Base64 ou Base32, il exclut les caractères « 0 », « O », « I » et « l » facilement confondus, ce qui le rend adapté aux URL et aux codes QR.",
    "s3e6r": "Comment encoder des données en Base45 ?",
    "s4OeX": "Connectez-vous au système avec succès",
    "s5b8m": "Remplacez 'TEST12345' par vos propres données et exécutez ce script dans un environnement PHP pour effectuer des opérations Base32.",
    "s5e8r": "Remplacez « TEST12345 » par vos données réelles et exécutez cet extrait dans un contexte d'application Swift pour effectuer des opérations Base32.",
    "s5t0n": "Le remplissage en Base32 implique l'ajout de caractères « = » pour garantir que le dernier morceau de données codées contient toujours un multiple de 8 bits. Cependant, contrairement à Base64, le remplissage en Base32 est minime car chaque caractère Base32 code déjà 5 bits.",
    "s7e9r": "Aucune bibliothèque externe n'est nécessaire. Remplacez simplement le 'b'TEST12345'' par votre objet réel de type octets à encoder/décoder.",
    "sBxHr": "Scala utilise la classe « java.util.Base64 » intégrée à Java pour les opérations Base64. Assurez-vous que vous utilisez une plate-forme JVM avec Java 8 ou version ultérieure.",
    "sHoxxW": "Conversion",
    "sKx5t": "La classe intégrée « java.util.Base64 » de Java, disponible depuis Java 8, fournit des méthodes d'encodage et de décodage Base64. La chaîne d'entrée est convertie en octets à l'aide du codage UTF-8, puis codée et décodée selon les besoins.",
    "sO0MOe": "Chaque fois que vous restez dans une fenêtre plus de 5 secondes, cela s'affichera ici.",
    "sR8yc": "Fermer",
    "sc49my": "Sindhi",
    "sdfk1": "Faire défiler les onglets vers la gauche",
    "sdfk13": "Faire défiler les onglets vers la droite",
    "sglMS": "Créer du temps",
    "sk123": "Pas encore fini",
    "slqcWD": "Cette partie logique n'est pas encore supportée, veuillez rester à l'écoute.",
    "sojBI": "Conversion",
    "spCqEa": "FAIRE",
    "spdh98": "Chinois simplifié",
    "ssDaOq": "Vous êtes nouveau sur LafTools ?",
    "ssm80i": "Basque",
    "svqh06": "azerbaïdjanais",
    "sys_updates": "Dernières mises à jour du système",
    "t63Qw": "Rejeter",
    "t6wczq": "Xhosa",
    "t7m4g": "La caisse 'base32' est utilisée pour l'encodage et le décodage Base32 dans Rust.",
    "t84q1z": "arménien",
    "t8c6xc": "somali",
    "t8z1v": "Lorsqu'il ne reste plus assez de bits à la fin pour remplir un groupe complet de 5 bits, les caractères de remplissage '=' sont ajoutés. Par exemple, un octet nécessite deux caractères Base32 et une séquence de 3 octets nécessiterait quatre caractères Base32.",
    "t9m3g": "CryptoSwift est un package Swift populaire qui inclut des fonctionnalités d'encodage et de décodage Base32.",
    "tBIX-d": "les fenêtres",
    "tEiv_": "Récupération des détails de l'extension",
    "tIy3Q": "J'ai rencontré une erreur",
    "tIyq3Q": "J'ai rencontré une erreur",
    "tR8pY": "Go fournit un package de bibliothèque standard « encoding/base64 » avec des fonctions d'encodage et de décodage Base64. Aucune dépendance externe n'est requise ; importez simplement ce package dans votre programme Go et appelez les fonctions appropriées.",
    "tWe1yF": "Aucune commande shell disponible.",
    "tY3p1": "Plus d'information",
    "tiaiB": "Annuler",
    "tn7duf": "croate",
    "ttAre": "Saisissez ici votre mot de passe en clair",
    "tuv23456": "Variante sécurisée d'URL Base64",
    "twamg": "Assistant IA, renforcez votre créativité",
    "tyhgpr": "Javanais",
    "u1i2b": "Quels sont les avantages d’utiliser Base85 par rapport à Base64 ou Base32 ?",
    "u2l8s": "Qu’est-ce que Base45 ?",
    "u3i8b": "Quels sont les avantages d’utiliser Base62 par rapport à Base64 ou Base32 ?",
    "u3j9p": "Base32 est souvent utilisé lorsque vous avez besoin d'une représentation textuelle compacte de données binaires pouvant être saisies ou imprimées sans perte d'informations, comme dans le cadre des contrôles d'intégrité de fichiers, du géocaching et de la génération de mots de passe sécurisés.",
    "u7i9b": "Pour Go, utilisez le package « btcutil » disponible sur GitHub, en particulier son module base58.",
    "u7vwx8yz": "Opérations Base64 communes",
    "u8i5b": "Quels sont les avantages d’utiliser Base58 par rapport à Base64 ou Base32 ?",
    "u9g6t": "Pour exécuter ce code, vous devez installer le package '@digitalbazaar/base45'.",
    "uCEe8": "Conversion en temps réel",
    "uFcDQ": "Initialisation des données d'état...",
    "uV5Bi": "Impossible de charger l'extension",
    "uVseB": "Appuyez sur {0} pour afficher la liste des touches de raccourci",
    "uW7eZ": "En C, il n’existe pas d’implémentation native Base64. Cet exemple utilise la bibliothèque OpenSSL pour l'encodage et le décodage Base64. Pour utiliser cet extrait de code, installez OpenSSL sur votre système et établissez un lien avec les bibliothèques appropriées lors de la compilation de votre programme à l'aide d'une commande similaire à « gcc -o base64_example base64_example.c -lssl -lcrypto ».",
    "ucDLv": "Vous avez copié cet élément {0} fois",
    "ui5pZ": "Analyseur de commandes",
    "ulah0q": "Japonais",
    "unc9E": "Texte aléatoire",
    "usr_defined": "Préférences de système",
    "uvwxyza1": "Aucune perte de données : puisqu'il s'agit d'un processus réversible, l'encodage Base64 n'entraîne aucune perte d'informations.",
    "uwqGE": "Allez dans Outils",
    "v3k5r": "Le jeu de caractères comprend toutes les lettres majuscules et minuscules (A-Z, a-z) et les chiffres (0-9), offrant une représentation plus compacte par rapport à Base64 ou Base32.",
    "v4k6r": "Il encode les données sous une forme plus compacte par rapport à Base64 ou Base32 en utilisant un jeu de caractères plus grand.",
    "v4n9t": "Base58 est un schéma de codage qui représente les données binaires sous la forme d'une séquence de caractères alphanumériques.",
    "v5k3r": "Cette bibliothèque fournit une API simple pour l'encodage et le décodage Base45 dans les applications Node.js. Après l'installation, copiez le modèle fourni dans votre script et exécutez-le avec l'interpréteur Node.js.",
    "v6qkl": "Le package BouncyCastle NuGet fournit l’encodage et le décodage Base32 en C#.",
    "v7q3db": "thaïlandais",
    "v9b7t": "Remplacez « TEST12345 » par votre propre chaîne et exécutez cette application console pour effectuer les opérations d’encodage et de décodage Base32.",
    "vOjNC": "Entrez le mot de passe ou la clé sécurisée",
    "vTsQU": "Veuillez fournir le code d'invitation de votre administrateur",
    "vU17B": "Impossible d'envoyer la demande",
    "vWqac": "Avant d'entrer dans votre workbench, nous aimerions d'abord précharger les ressources système requises. Veuillez patienter un peu, il sera bientôt terminé, dont les détails sont visibles ci-dessous.",
    "vaP0vq": "Configurez le mot de passe local avec succès.",
    "vci8rd": "Néerlandais",
    "vh9j4": "Saisir",
    "vo1prl": "Espagnol",
    "vr93oi": "finlandais",
    "vrfjnf": "italien",
    "vwx1yza2": "Un exemple consiste à encoder un fichier image pour l'intégrer dans une balise HTML <img> :",
    "w1x4k": "Oui, plusieurs variantes existent, notamment Ascii85 (utilisé dans PostScript et PDF), Z85 (ZeroMQ) et UUencode (un format plus ancien). Chacun a un jeu de caractères et des règles légèrement différents.",
    "w2x9qk": "Bien que Base62 lui-même n'ait pas de variantes significatives, certaines implémentations peuvent différer légèrement dans leur choix de jeu de caractères, comme l'exclusion du « + » ou du « / » couramment utilisés en Base64.",
    "w3x7k": "Oui, certaines variantes populaires incluent Base58Check, qui ajoute une somme de contrôle pour la détection des erreurs, couramment utilisée dans Bitcoin.",
    "w6otqn": "Corse",
    "w92j07": "russe",
    "w9qudj": "Pendjabi",
    "wAxtg": "Initialement, nous avons généré un UUID en tant que jeton autorisé pour vous permettre d'effectuer cette configuration. D'après ce que LafTools a reçu, le token que vous avez fourni est {0}, il a été vérifié par LafTools avec succès et vous pouvez donc continuer à configurer ce formulaire.",
    "wI1eh": "Suivant",
    "wQYoz": "Déposer",
    "wQdYoz": "Modifier",
    "wQdqwYoz": "Voir",
    "wcl1K": "Usage",
    "wgkk6y": "maltais",
    "wj3VS": "Cette opération décode les données d'une chaîne ASCII {0} dans son format brut.",
    "wsWcXd": "Notifications",
    "wxyzabcd": "Il existe une version sécurisée pour les URL de Base64 qui remplace « + » par « - » et « / » par « _ », et omet le remplissage « = », ce qui la rend adaptée aux URL Web.",
    "x009": "Pour accéder à notre documentation d'utilisation",
    "x2c5e": "Pour utiliser Base45 en Python, vous devrez installer la bibliothèque 'base45'.",
    "x2z6r": "Qu’est-ce que Base58 ?",
    "x5alzu": "Kurde (Kurmanji)",
    "x5tHV": "Présentation du système",
    "x5z1b": "Base45 a été développé principalement pour l'utilisation du code QR dans le cadre des certificats numériques COVID.",
    "x6v2w": "Il n'existe pas de bibliothèque Base32 standard en C, nous utilisons donc ici une hypothétique bibliothèque 'libbase32'.",
    "x7n1m": "Base62 est un système de codage qui représente les données binaires sous la forme d'une séquence de 62 caractères alphanumériques.",
    "x8mdg": "Le module « base64 » intégré de Python fournit l'encodage et le décodage Base32 via les fonctions « b32encode » et « b32decode ».",
    "x9g7e": "Téléchargez le code source depuis GitHub (https://github.com/dankamongmen/libbase32) ou installez-le sous forme de package s'il est disponible pour votre plateforme.",
    "x9n1b": "Base85 est un schéma de codage qui représente des données binaires à l'aide d'un ensemble de 85 caractères ASCII imprimables.",
    "xMBv0": "Chargement des ressources associées...",
    "xOJqG1": "Questions fréquemment posées",
    "xPHqP": "La description n'est pas encore définie.",
    "xQ_ls": "Sauvegarde Redis",
    "xbz0B": "Fermer tous les onglets",
    "xbz0B2": "Fermer l'onglet",
    "xdqwe": "Bienvenue à utiliser LafTools !",
    "xeP4zV": "Visualisez rapidement vos éléments TODO",
    "xeP4zVd": "Recherchez rapidement un vocabulaire anglais.",
    "xlqtA": "Retour",
    "xs22XLF": "Aucune donnée disponible pour cet ID d'article, veuillez envisager de sélectionner d'autres articles.",
    "y3b6n": "Oui, tant que la chaîne codée a été générée conformément à la spécification Base45, tout décodeur conforme devrait être capable de la décoder.",
    "y3m7k": "Pour Java, utilisez la bibliothèque 'iso-base45' qui peut être incluse dans votre projet en tant que dépendance Maven.",
    "y3m9k": "Pourquoi Base62 a-t-il été créé ?",
    "y3qjdd": "Votre mot de passe local a été vérifié avec succès.",
    "y5nne": "Ce code peut être exécuté directement dans un environnement Node.js ou dans le cadre d'un projet plus vaste où vous avez besoin de la fonctionnalité Base32.",
    "y6m8k": "Pourquoi Base85 a-t-il été créé ?",
    "y6t1n": "Inconvénients de Base32",
    "y8Ir5": "Cette partie est utilisée pour initialiser votre compte administrateur, cependant, pour l'instant, il n'y a rien à créer ou à ajuster ici car il a été précédemment configuré par votre administrateur, veuillez négliger cette partie et poursuivre vos étapes restantes.",
    "y8b1m": "Remplacez « TEST12345 » par vos propres données et assurez-vous que les fonctions de la bibliothèque sont correctement implémentées et liées pour compiler et exécuter ce programme pour les opérations Base32.",
    "y9m1n": "Pourquoi Base58 a-t-il été créé ?",
    "y9m3k": "Pour Swift, vous pouvez utiliser la bibliothèque 'Base45' disponible sur GitHub.",
    "y9z2e": "Remplacez « TEST12345 » par votre tranche d'octets réelle et exécutez ce programme Go pour encoder et décoder à l'aide de l'encodage standard Base32.",
    "y9z2t": "Exécutez ce script dans un environnement Ruby tel qu'IRB ou enregistrez-le en tant que fichier .rb et exécutez-le avec 'ruby filename.rb'.",
    "ySVf-": "Réessayez cette demande",
    "yTsFO": "L'algorithme MD4 (Message-Digest 4) est une fonction de hachage cryptographique développée par Ronald Rivest en 1990. La longueur du résumé est de 128 bits. L'algorithme a influencé les conceptions ultérieures, telles que les algorithmes MD5, SHA-1 et RIPEMD.<br><br>La sécurité de MD4 a été gravement compromise.",
    "yVprb": "Cette partie est encore en développement.",
    "y_2Q1": "Encoder et décoder",
    "y_2Q2": "Crypto symétrique",
    "y_2Q3": "Crypto asymétrique",
    "y_2Q4": "Algorithmes nationaux chinois",
    "y_2Q5": "Authentification Web",
    "y_2Q5dqw": "Matcheur de texte",
    "y_9YM": "La sortie sera affichée ici.",
    "y_9YqM": "Chargement de fichiers statiques...",
    "y_BN6": "Algorithme de résumé",
    "ya0cwu": "malais",
    "yc7dqiu": "Chinois simplifié",
    "yfYeg": "Modèle de texte",
    "yiRso": "Notes sur le nuage",
    "ykganl": "danois",
    "yqiRso": "Remarques locales",
    "yqrxl4": "serbe",
    "yznU9": "Données d'arborescence vide",
    "z-o28we": "Panneau de processus",
    "z0j2nf": "hindi",
    "z1m2t": "Exemple d'utilisation : `const encoded = bs58.encode('your-data'); const décodé = bs58.decode (encodé);`",
    "z1n5qr": "Les exemples incluent le package base45 npm pour JavaScript et dotnet-base45 pour .NET.",
    "z1oFn": "Évasion et évasion",
    "z2jzej": "Marathi",
    "z2m7t": "Exemple d'utilisation : `const base62 = require('base62'); const encoded = base62.encode('vos-données'); const décodé = base62.decode (encodé);`",
    "z2t7m": "Qu’est-ce que Base85 ?",
    "z2x8c": "Base32 présente moins d'ambiguïtés visuelles puisqu'il utilise uniquement des lettres majuscules et des chiffres, ce qui facilite la lecture et la transcription à la main ou par téléphone par rapport à Base64 qui comprend les lettres « + », « / » et minuscules.",
    "z3m1t": "Après avoir ajouté la dépendance et synchronisé le projet, copiez le modèle fourni dans une classe Kotlin, en remplaçant l'espace réservé par la valeur codée réelle avant d'exécuter le code.",
    "z4t9b": "Qu’est-ce que Base62 ?",
    "z5b7m": "Il utilise un alphabet plus grand (0-9, A-Z, a-z, -, ., $, /, +, %, et *) par rapport à Base64 ou Base32, ce qui donne des chaînes codées plus courtes pour les mêmes données d'entrée.",
    "z5bvb": "Installez-le en exécutant « npm install base32-encoding ». Remplacez « TEST12345 » par les données d'entrée souhaitées dans l'extrait de code.",
    "z5m6t": "Exemple d'utilisation : `const base85 = require('base85'); const encoded = base85.encode('vos-données'); const décodé = base85.decode (encodé);`",
    "z6m1c": "Des variantes ultérieures comme z-base-32 ont été introduites pour améliorer la convivialité, en remplaçant certains caractères moins mémorables par d'autres, mais la spécification originale de Crockford reste largement utilisée aujourd'hui.",
    "z79b1a": "arabe",
    "z7n1m": "Utilisez npm ou Yarn pour l'installer en exécutant `npm install @digitalbazaar/base45` ou `yarn add @digitalbazaar/base45`.",
    "z7t1p": "Existe-t-il des variantes spécifiques de Base62 ?",
    "z8em2t": "Après l'installation, copiez le modèle fourni dans une application console C# et remplacez l'espace réservé par la valeur codée réelle avant d'exécuter le programme.",
    "z8m2t": "Quels sont les avantages d’utiliser Base45 par rapport à Base64 ou Base32 ?",
    "z8n6k": "Remplacez 'TEST12345' par la chaîne souhaitée, compilez et exécutez ce programme pour voir les résultats de l'encodage et du décodage Base32.",
    "z8qm2t": "La bibliothèque fournit des classes d'encodeur et de décodeur pour les opérations Base45. Copiez le code du modèle dans une application console C# et exécutez-le après avoir installé le package.",
    "z8qqm2t": "Après l'installation, copiez le modèle fourni dans une application console C# et remplacez l'espace réservé par la valeur codée réelle avant d'exécuter le programme.",
    "z9b6n": "Ajoutez la dépendance à votre projet Xcode via Swift Package Manager ('https://github.com/krzyzanowskim/CryptoSwift').",
    "z9kVv": "Python possède un module « base64 » intégré qui fournit des méthodes d'encodage et de décodage Base64. La chaîne d'entrée est d'abord convertie en octets à l'aide du codage UTF-8 avant d'être codée en Base64, puis décodée sous sa forme originale.",
    "z9t2p": "Existe-t-il des variantes spécifiques de Base58 ?",
    "z9t7p": "Existe-t-il des variantes spécifiques de Base85 ?",
    "zN2ES": "Espaces de travail",
    "zaSKh": "Rafraîchir",
    "zc3Hf": "Mot de passe",
    "zjDJk": "Veuillez fournir le chemin du répertoire de l'espace de travail",
    "zkqUFa": "{0} n'est pas encore configuré",
    "zkv375": "Khmer",
    "zmDWx": "Contactez-nous",
    "znVRwq": "Des dossiers",
    "zpyd34": "Anglais",
    "zqiIoqXw": "Exécution de calculs...",
    "zwd4v": "Détails de l'extension",
    "zwgYx": "La valeur du mot de passe crypté sera affichée ici.",
    "zyx98765": "Base64 peut-il être utilisé pour la compression ?",
    "zzcepr": "Cebuano"
}