{
    "": "Message : {0}",
    "-GJ_72": "Basculé vers l'espace de travail sélectionné {0}",
    "-Jx4J": "Compte local",
    "-Rj3y": "Thèmes",
    "-XZnW": "Dos",
    "04SSf": "Mot de passe oublié?",
    "07ui6": "Plus d'informations",
    "0PgZ_": "Traduction",
    "0gvcN": "Bienvenue sur la page de présentation, elle est encore en développement.",
    "0gywa": "Espace de travail introuvable, vous serez redirigé vers la page d'index de l'espace de travail.",
    "0ji-Z": "Réduire la configuration",
    "13pmE": "Soutenez-nous",
    "1JOFP": "Ouvrir mon espace de travail",
    "1NTgQ": "Espace de travail ouvert",
    "1Npez": "Veuillez fournir le chemin",
    "1Tuab": "Copié",
    "1YmJc": "Sélectionnez l'une des options comme langue préférée :",
    "1a3Sc": "Annuler le chargement",
    "1bd": "Flux de travail",
    "1j62a": "Fais ça à un autre moment",
    "1yIQu": "Vous pouvez essayer de retraiter votre action ou cliquer sur le bouton ci-dessous pour ignorer l'erreur.",
    "22XLF": "Pas encore fini",
    "24vLI": "Créé",
    "2D9a6": "Mot de passe oublié?",
    "2D9qdk6": "Est-ce suffisamment sécurisé ?",
    "2IF6A": "Il semble que le stockage de sauvegarde de Forge rencontre un problème",
    "2JyFN": "Copier le résultat dans le presse-papiers",
    "2Ocbey": "Version",
    "2RhAT": "Il semble que le processus de récupération de forge rencontre un problème",
    "2Ruh6": "Créer un nouveau compte local",
    "2S5ap": "Basculer en mode plein écran",
    "2Y1mR": "Effacer le texte",
    "2bqHk": "Charger à partir d'un fichier",
    "2giYv": "Tester le mot de passe : {0}",
    "2qdin8": "entrez le code de vérification S'il vous plait",
    "32D9a6": "Créer un compte",
    "33RXi": "La demande a été rejetée en raison de paramètres insatisfaisants.",
    "39dsCt": "Vous recevrez la dernière notification des services d'application si vous en avez.",
    "3umnB": "Jeton inconnu",
    "44Ntqw-": "Gestion de l'opération.",
    "4K_vhq": "Dupliquer cet onglet",
    "4PIqD": "Révision du code",
    "4UYIJ": "Pas encore terminé.",
    "4cGA_": "Récupération des données pour les préférences système...",
    "4kKe4": "Votre mot de passe",
    "4vdfwf": "D'ACCORD",
    "4wlih": "La demande a été rejetée en raison de paramètres insatisfaisants.",
    "52OiQ": "Copié {0} fois",
    "54cwb": "L'API Websocket du système a rencontré une erreur : {0}",
    "58HQX": "Si vous ne connaissez pas sa valeur, veuillez contacter votre administrateur pour plus de détails, qui se trouvent dans ses paramètres.",
    "5BOhl": "code d'invitation",
    "5Ih2u": "Navigateur d'outils",
    "5NCPT": "Mode sombre",
    "5NJeGsu1": "E-Mail, vous pouvez facilement organiser votre boîte de réception, rédiger et envoyer des messages et rester au courant de votre correspondance. Jusqu'à présent, il est utilisé uniquement comme outil de communication entre les utilisateurs et notre équipe.",
    "5NJeddqGsu1": "Cette section comprend du matériel informatique, des articles wiki, des guides d'utilisation, etc.",
    "5NJedqddqGsu1": "Cette section comprend des ressources informatiques qui peuvent être utilisées pour construire vos propres projets.",
    "5Perd": "Désolé, la fonction « Utiliser Smart Editor » n'est pas encore disponible. Nous travaillons toujours à sa mise en œuvre. Merci pour votre patience.",
    "5ZBYR": "Dos",
    "5dF7o": "Rafraîchir",
    "5q-Zxqa": "Gestionnaire de scripts",
    "5qV5Sf": "Supprimer cet enregistrement de la liste",
    "5srFq": "LafOutils",
    "6AumW": "Action par défaut",
    "6ClPV": "Créer",
    "6hsnqWe": "Bien que LafTools soit gratuit et open source, sa maintenance nécessite néanmoins beaucoup de temps et d'énergie. Nous avons notamment besoin de fonds pour payer certaines API cloud. Si vous appréciez LafTools, pensez à nous soutenir.",
    "6qT9d-N": "Pour le notebook, LafTools fournit non seulement un gestionnaire de commandes shell, mais y ajoutera également de puissants outils de notes dans un avenir proche, tels que MarkDown, Latex, {0}, etc.",
    "6yOXx": "Nom inconnu",
    "71x7x": "Code source sur GitHub",
    "7MOO1": "Se connecter",
    "7q40W": "Impossible d'initialiser l'administrateur",
    "7x3f6": "Onglet - 1",
    "82r0C": "Gérez votre liste TODO et faites les choses plus efficacement.",
    "83dNp": "Impossible de charger l'ID d'extension. (RÉF : 1dl1f)",
    "8LdRj": "Aperçu",
    "8LdRjq": "Calculer",
    "8LdevRj": "Service",
    "8M1wY": "Terminal local",
    "8mn_qa": "Récupération des données des services terminaux...",
    "8qzWJu": "Désolé, nous ne prenons pas encore en charge les appareils à petit écran pour le moment. Veuillez utiliser un PC pour visiter cette page.",
    "8veXac": "Le temps est la ressource la plus précieuse, gérez-le judicieusement.",
    "9Xv8-": "Enregistrer sous note",
    "9a335": "Veuillez cliquer sur n'importe quel élément d'extension dans le premier menu de gauche, celui actuel est vide ou invalide.",
    "9eZHM": "Oops! Il semble que nous rencontrions des avertissements ou des erreurs.",
    "9zCSc": "Aucun espace de travail disponible",
    "A69UZ": "Variables",
    "ANUZ7": "Cliquez pour sélectionner un fichier à traiter. La boîte à outils le traitera directement en service et affichera le résultat dans la région de sortie.",
    "AW9N8": "Région d'entrée",
    "AfPC0": "Votre mot de passe en texte brut",
    "Ahrjc": "Le répertoire n'existe pas, souhaitez-vous le créer ?",
    "Apx8D": "Comment réinitialiser votre mot de passe manuellement ?",
    "AqYcS": "Pour prendre en charge LafTools, pensez à passer à notre version professionnelle via un abonnement mensuel. Nous apprécierions grandement votre aide et nous promettons que LafTools deviendra encore meilleur grâce aux fonds collectés.",
    "B0s0z": "Objectif de cette page :",
    "BShq3M": "Problèmes",
    "BW3bpT": "Lecture du fichier à partir du disque...",
    "Bd9h-": "Ajoutez-le à ma collection préférée",
    "BuihG": "Les paramètres du système",
    "CEv8B": "Êtes-vous sûr de supprimer cet enregistrement ? Si oui, cliquez à nouveau sur ce bouton.",
    "CVUl0": "LafOutils",
    "CWohyqde": "Outils",
    "CWoqhy": "Liste des exts par CategoryID sélectionné",
    "CfZAX": "Le fichier {0} sélectionné, nous le téléchargeons sur le service principal.",
    "CidOqAZ": "En tant que créateur de LafTools, je suis tellement touché que vous souhaitiez nous soutenir. Nous avons de bonnes personnes dans notre équipe qui travaillent dur pour améliorer continuellement LafTools.",
    "Cide2w": "Pour voir s'il y a un problème lors de l'exécution de votre action.",
    "DIQFq": "Veuillez vérifier si le paramètre URL a été correctement fourni, il semble que vous n'ayez pas l'autorisation de remplir ce formulaire. Par défaut, vous pourrez voir le message ci-dessous dans la sortie du service lors de son lancement.",
    "DIweGq": "Sécurisez vos LafTools",
    "DTTPW": "Statut de réinitialisation",
    "DVoKw": "Déconnectez-vous de ce système",
    "DadYp": "Anti-rebond en temps réel",
    "Dj9qqwk": "Sortir",
    "DoWY7": "Définissez le texte de la région d'entrée ou de la région de sortie comme vide.",
    "DrXAq": "Bienvenue à utiliser LafTools !",
    "DrbEr": "Le mot de passe que vous avez fourni est vide, veuillez vérifier et réessayer.",
    "DtlAc": "Chargement des ressources système",
    "Dxlw0": "Complet",
    "E62ej": "Commandes du shell de filtre",
    "E6F9B": "Ajoutez-le au flux de travail",
    "ERK7E": "Si vous rencontrez un problème ou avez des suggestions lors de l'utilisation de LafTools, n'hésitez pas à nous contacter via EMail ou GitHub à tout moment, nous serons heureux de vous aider.",
    "Ewvgo": "Pas encore commencé.",
    "ExqvX": "Liste des touches de raccourci",
    "Eyq856": "Nous n'avons pas encore terminé : nous nous engageons à fournir les fonctionnalités les plus récentes et les plus performantes, et nous continuerons à publier des mises à jour pour garantir que vous bénéficiez de la meilleure expérience possible.",
    "F-OUm": "Configuration rapide pour LafTools",
    "F0CCF": "Liste des raccourcis clavier",
    "F4uS2": "Nouveau fichier",
    "FBVyc": "Veuillez saisir à nouveau le code de vérification",
    "FDlRI": "Nommez ce nouvel onglet et cliquez pour le confirmer.",
    "FOyHW": "Rechercher partout",
    "FhVWl": "Chiffrez votre mot de passe",
    "Fv-zz": "Copier le résultat",
    "Fy217": "Configurer le transformateur de texte",
    "Fzp3t": "Apporter de la valeur",
    "G3MJN": "Afficher le panneau de sortie",
    "G9QVo": "Gérer les onglets",
    "GKQDO": "Outils",
    "Ggob_": "Annuler",
    "H-Ae75": "Veuillez confirmer votre mot de passe local.",
    "H-qA75": "Veuillez fournir un mot de passe local.",
    "H8fQ4": "Basculer en mode clair ou sombre",
    "HEAhr": "Après la traduction, le résultat apparaîtra ici.",
    "HIc3c": "Complété",
    "HNDat": "Pour apporter des modifications, veuillez cliquer sur le bouton \"{0}\". Sinon, cliquez sur \"{1}\" pour appliquer vos modifications. Puissiez-vous passer un bon moment avec cette boîte à outils !",
    "Hflf2": "Pour des raisons de cybersécurité, nous ne vous aiderons pas à réinitialiser votre mot de passe via les API ou les pages ici, sauf si vous mettez à jour manuellement le fichier protégé par le système.",
    "HjvV3": "Nous ne supprimerons pas ses fichiers sur le disque, supprimerons simplement cet enregistrement de la liste.",
    "HyIC_": "Touche barre oblique (/)",
    "HyIC_d": "Touche barre oblique (/)",
    "I88nZ": "Configuration des outils",
    "I8FLi": "Maintenant, il est temps de configurer votre administrateur, veuillez définir le mot de passe aussi complexe que possible afin de pouvoir perplexe ces attaquants impolis.",
    "IAC0A": "Outils de recherche",
    "ICefi": "Annulé",
    "IKqqATS": "Actualiser les données de la page actuelle",
    "IOOrz": "(Cela serait-il nocif pour votre système ? Nous ne le pensons pas, tant que vous pouvez modifier le fichier de configuration préservé par le système, cela signifie que vous êtes autorisé à tout lire sur les fichiers de données LafTools.)",
    "IWUH5": "Afficher l'exemple",
    "IaSyO": "Annuler",
    "IfsGO": "Favoris",
    "IfsdGO": "Favoris",
    "ImUmf": "Nouveau",
    "J2xoL": "Veuillez consulter l'erreur : {0}",
    "J5aL1": "Basculer la visibilité du panneau de configuration de l'outil",
    "JA_Bp": "Veuillez d'abord fournir un nom pour la nouvelle balise.",
    "JQLmS": "Ajusté la taille",
    "JQLmSq": "Complété.",
    "JTBRh": "LafTools a stocké la valeur du mot de passe dans le fichier local, mais ne vous inquiétez pas, nous avons adopté un mécanisme de cryptage du mot de passe unidirectionnel, c'est-à-dire que personne ne peut lire le mot de passe de la version en texte brut. Pour réinitialiser le mot de passe, veuillez suivre les instruments ci-dessous pour réinitialiser manuellement votre mot de passe.",
    "JYqxz2": "Bienvenue sur LafTools, ceci est une version initiée.",
    "JfFHw": "Obtenir une demande d'informations sur l'espace de travail",
    "K1qJZI": "Bienvenue sur LafTools, Votre Excellence.",
    "KGS2-": "Une fois que vous avez terminé les étapes ci-dessus, vous pouvez utiliser votre nouveau mot de passe pour vous connecter à votre système. Si vous ne parvenez pas à accéder au système de fichiers, veuillez demander à votre administrateur ou à votre support informatique de créer ce fichier. Si le fichier existait déjà, supprimez-le et créez-en un nouveau.",
    "KIc63": "Fonction pas encore prise en charge",
    "KYh1N": "Toutes les notes",
    "KmEUF": "Fournir un aperçu rapide des outils système actuels.",
    "Kw4OJr": "Terminal",
    "Kyd9H": "Code source sur GitHub",
    "L3zEM": "Afficher l'exemple",
    "L42mxa": "Veuillez saisir votre texte source dans ce champ.",
    "L49kCq": "Veuillez fournir et confirmer le mot de passe de verrouillage dans ce formulaire pour sécuriser votre LafTools.",
    "L71q_N": "Le mot de passe que vous avez fourni est vide, veuillez vérifier et réessayer.",
    "LAc1m": "Actualisation de la vue de l'application.",
    "LFdvM": "Pas connecté",
    "LM715": "Récupération des noms d'utilisateur à partir de l'API du serveur local",
    "LPJrV": "Copier le résultat",
    "LWaeFqd": "Passez à votre langue préférée",
    "Le71_N-": "Le mot de passe que vous avez fourni n'est pas le même que celui confirmé, veuillez vérifier et réessayer.",
    "LnJ4H": "Notez que le compte local n'est absolument pas le même que celui de l'utilisateur enregistré sur notre site Web, le premier est défini uniquement sur votre PC tandis que le second peut être utilisé pour la synchronisation cloud.",
    "LqWaFd": "Les paramètres du système",
    "M4ywN1": "Calculatrice, calendrier, horloge, météo et bien plus encore.",
    "M7jct": "Passer en mode plein écran",
    "MN2lT": "La longueur du mot de passe ne peut pas être inférieure à 6",
    "Ma5mv": "Basculer la visibilité des onglets de la barre d'outils",
    "Mg4ldi": "Copie",
    "Mq9pdpT": "Répertoriez toutes les ressources pertinentes pour le menu fonctionnel que vous avez sélectionné.",
    "Mq9ppT": "Visualisez rapidement l’état de vos services",
    "MrgmU": "Confirmer",
    "NMLOn": "Copier le chemin du fichier",
    "NMLOn1": "Espace de travail ouvert",
    "NNd1o": "Utiliser un exemple pour les tests",
    "NNfJo": "Charger des données à partir d'un fichier",
    "Nq1IR": "Impossible de charger la VM d'extension",
    "Nqc0LqwX": "Si vous pensez qu'il existe une vulnérabilité dans ce processus, n'hésitez pas à nous contacter via EMail ou GitHub à tout moment, nous aimerions l'améliorer de toute urgence.",
    "O02-W": "Ne charge pas...",
    "O94Yx": "sur",
    "OQWm4": "Signaler un bug",
    "OSHOI": "Page d'accueil",
    "OSqZQM": "Mot de passe local",
    "OeOQY": "FAIRE",
    "OpPFe": "Si vous aimez LafTools, partagez-le avec vos amis et donnez-nous une étoile, merci !",
    "Opcty": "Des dossiers",
    "OrCt5": "Redirection vers l'établi...",
    "P4ROa": "Région de sortie",
    "PM_N5": "Séance – {0}",
    "PUxuU": "Récupération des données pour les modules linguistiques...",
    "PapkF": "Si vous avez des questions ou des suggestions concernant LafTools, n'hésitez pas à nous le faire savoir. Nous recherchons toujours des moyens d'améliorer notre produit et d'offrir la meilleure expérience possible à nos utilisateurs. Vous pouvez nous contacter à work7z@outlook.com. Merci d'utiliser LafTools !",
    "PpCHA": "Clé des questions (?)",
    "PqazM-": "Tout d'abord, veuillez utiliser les contrôles de formulaire ci-dessous pour crypter votre mot de passe.",
    "QL9Sn": "Pour le moment, il ne semble pas y avoir de description disponible.",
    "QLKzF": "Il regorge de fonctionnalités qui répondent aux besoins des développeurs débutants et expérimentés, ce qui en fait un outil incontournable dans l'arsenal de tout programmeur.",
    "QM2Ob": "Outils récents",
    "QM2Oq": "Notes récentes",
    "QRAdA": "Anglais vers chinois",
    "QhdpH": "Edition communautaire",
    "QzlA3": "Une erreur s'est produite",
    "R12bq": "Liste des onglets qui ne sont pas affichés",
    "RNBze0": "Outils",
    "RNeBze0": "Onglets ouverts",
    "RNewBze0": "Configuration de l'outil",
    "RPVRl": "Il semble que cette extension soit incompatible avec la version actuelle de LafTools, veuillez envisager d'installer la dernière version pour prendre en charge cette extension ou veuillez nous contacter en soulevant un problème sur GitHub.",
    "RhqzcdD": "Les paramètres du système",
    "RjCO3": "Liste des espaces de travail",
    "S4MMV": "Oops! Nous avons trouvé quelques problèmes lors du chargement du fichier.",
    "SAnnQ": "Chargement du fichier {0}",
    "SBsDz": "Configuration de votre compte administrateur.",
    "SGs7B": "Configurez rapidement vos LafTools",
    "SMqD13": "Entrez pour filtrer",
    "SQAw7": "Langue originelle",
    "SZgXb": "Configurer le mot de passe local",
    "SdGcT": "Autre partie",
    "Sm9tq": "Veuillez fournir le mot de passe du compte ici",
    "Sm9tqq": "Veuillez fournir un mot de passe pour déverrouiller votre LafTools",
    "Spcfdee": "Mode clair ou sombre",
    "TBPqy7": "Langue",
    "TD7DA": "Langues",
    "TNoePE": "Nuage LafTools",
    "Ttrqqet": "Écrivez et enregistrez vos pensées ici !",
    "TwFcr": "Langue cible",
    "TyqvWY3": "Fichier local",
    "U4qqq9": "Supprimer cet onglet de la liste",
    "U7zP2": "Veuillez fournir le nom d'utilisateur du compte ici",
    "UF_Dp": "Une erreur s'est produite : {0}, l'heure de rejet est {1}",
    "UU_7h": "Veuillez cliquer sur n'importe quel élément de catégorie dans le premier menu de gauche, la catégorie actuelle est vide ou invalide.",
    "UZ2Ig": "Nouveau compte local",
    "Ugpng": "Préféré",
    "V6U_f": "Conditions d'utilisation",
    "V6XEO": "Entrez le nom d'utilisateur ou l'e-mail",
    "VAZq8r": "Il permet aux développeurs d'exécuter diverses commandes, telles que l'exécution de scripts, l'installation de packages et la navigation dans le système de fichiers, le tout depuis l'éditeur.",
    "VEfeqZG": "Remarques",
    "VI6VT": "Histoire",
    "VOsZc": "Signaler un problème",
    "VSZ": "Cliquez pour relancer",
    "Vaf2y": "Le nom de l'onglet ne peut pas être vide.",
    "VeY9K": "Conditions d'utilisation",
    "VgG5y": "Cliquez ici pour actualiser le statut de votre extension",
    "VjZCv": "Conversion en temps réel",
    "WPrTW": "Site officiel",
    "WXo6D": "Actualisé",
    "WYCVL": "Installation rapide",
    "X4L_Z": "L'extension VM n'est pas fournie.",
    "X6Fq4j": "Après des années de développement et de perfectionnement, nous sommes convaincus que LafTools peut améliorer considérablement votre expérience de programmation en apportant plus de commodité et d'efficacité à votre flux de travail.",
    "XKpI0": "Cliquez pour traiter votre texte dans la région de saisie",
    "XLWoR": "Sélectionnez votre préféré et continuez",
    "XQxJB": "Mes espaces de travail",
    "X_HGx": "LafTools est une boîte à outils polyvalente conçue pour répondre à divers besoins. Il est entièrement open source, garantissant transparence et sécurité. Malgré son environnement d'exécution léger, il offre une prise en charge complète de la plate-forme, y compris ARMv8, et une prise en charge native de l'IA similaire à ChatGPT. LafTools est hautement intégré à une interface utilisateur productive et est continuellement mis à jour avec de nouveaux outils. Il peut être utilisé sur le Web et avec Docker, et fournit des ressources supplémentaires telles que des notes et des manuels.",
    "XikdD": "Quelques instants s'il vous plaît, nous y sommes presque !",
    "Y5GAC": "Ton nom d'utilisateur",
    "Y9mQ2": "Veuillez fournir le nom d'utilisateur du compte ici",
    "YAAU3q": "Mot de passe local",
    "YHCjT": "LafTools prend en charge le thème global clair et sombre, il est particulièrement utile avec les codeurs de nuit.",
    "YNwKz": "Langue non prise en charge : {0}, utilisera l'anglais par défaut.",
    "YOYTp": "Installation rapide",
    "YPPPL": "Basculer la visibilité des onglets des barres d'outils",
    "YQN9u": "Une erreur s'est produite lors du chargement de {0}, veuillez vérifier les détails ci-dessous.",
    "Y_k0z": "Mot de passe oublié?",
    "YrTdq": "Tous",
    "YrVq683": "Mail",
    "YrVqdd683": "Manuels",
    "YuQTX": "S'il faut exécuter le transformateur automatiquement lorsque le texte d'entrée est modifié.",
    "YuQqTX": "Exécution automatique ?",
    "Z2QTU": "À propos",
    "Z3rhY": "Message",
    "Z7ALO": "Passé à l'espace de travail sélectionné",
    "Z7OTt": "Le fichier que vous avez sélectionné est trop volumineux, veuillez sélectionner un fichier inférieur à 30 Mo.",
    "ZAGva": "Êtes-vous sûr de supprimer cet espace de travail ?",
    "ZAKaFq": "Mon compte Cloud",
    "ZIHEO": "Paramètres",
    "ZW1Dgz": "Aucun message disponible",
    "ZXRGC": "Veuillez consulter l'erreur : {0}",
    "Zpqqpf": "Chiffrer les données avec MD2",
    "ZrbduC": "Fermer tous les onglets",
    "ZrbuC": "Fermer l'onglet",
    "_5OqeG": "Décochez-le",
    "_LFF3": "Si vous rencontrez un problème ou avez des suggestions lors de l'utilisation de LafTools, n'hésitez pas à nous contacter via EMail ou GitHub à tout moment, nous sommes prêts à l'améliorer.",
    "_trez": "Échanger du texte",
    "_trqL": "Récupération des données pour les ressources système...",
    "_z3lR": "Actualiser le code",
    "aCkOP": "Sortie",
    "aHAfR": "Récupération des données pour {0}...",
    "about_LafTools_toolbox": "À propos de LafTools",
    "adpgq": "Créer un nouvel espace de travail",
    "ah-C4": "Nouvelle remarque",
    "aked6": "Les références",
    "aked61": "Introduction",
    "asElV": "Retirer",
    "az4uS2": "Êtes-vous sûr de vous déconnecter de ce système ? Notez que vous serez redirigé vers la page de connexion.",
    "b0qjSL": "Veuillez entrer dans le répertoire {1} et créer un fichier {2}, mettre votre mot de passe crypté comme contenu complet du fichier.",
    "bP_6qG": "Conseils pour avoir oublié votre mot de passe",
    "bT4R6": "Nouvel onglet",
    "bVlBN": "Chinois vers anglais",
    "bjZyW": "Traduire",
    "bp_-b": "Pour gérer entièrement LafTools, vous devez configurer votre administrateur au début du flux de configuration. Nous avons vérifié votre identification grâce au jeton de paramètre URL. Soyez assuré que personne d'autre ne peut configurer votre autorisation root à moins d'obtenir un jeton de configuration.",
    "c0eCw": "Traduisez votre texte dans la langue de votre choix.",
    "c7Uoqqe": "Avant d'utiliser LafTools, veuillez fournir et confirmer votre mot de passe local comme ci-dessous.",
    "cNQp_": "Ressources",
    "cQqwI8r": "Chargement de l'état du service Terminal",
    "cfYYN": "Découvrir plus",
    "cj1pd": "Opération d'actualisation",
    "coM2I": "Utiliser l'éditeur intelligent",
    "cuRCb": "Catégorie introuvable.",
    "cuRCqb": "La catégorie n'existe pas",
    "d-l2l": "Confirmer",
    "d-qPr": "Disposition inconnue : {0}",
    "d5KZH": "Merci d'utiliser LafTools !",
    "d5LAU": "Sous licence AGPLv3",
    "d5hit": "Séance – {0}",
    "dV5Eq": "Actualiser la liste des espaces de travail",
    "dk122q": "Gérez vos flux de travail pour combiner plusieurs outils ensemble.",
    "dkarh": "Okie, la boîte à outils a ouvert le répertoire. Si aucune fenêtre contextuelle ne s'affiche, veuillez vérifier si votre plate-forme prend en charge cette fonction ou si le répertoire se trouve sur le serveur.",
    "dkkq12": "Configurez votre outil dans cet onglet.",
    "dl4kr": "Mot de passe oublié?",
    "dpRY4": "Dictionnaire",
    "dqTqyvWY": "Menu du tiroir",
    "dsdpA_eJ": "Ajuster la taille",
    "dxLQq": "Autorisation racine",
    "dzjTo": "Veuillez fournir le mot de passe du compte ici",
    "e--gB": "L’ID d’extension n’est pas fourni.",
    "e8Crq": "Veuillez remplir les champs ci-dessous pour votre nom d'utilisateur et votre mot de passe pour continuer.",
    "eTmq": "Histoire de CodeGen ToolBox",
    "e_8pZ": "Une boîte à outils polyvalente permettant aux développeurs d'améliorer leur productivité.",
    "eqkqd4W": "Veuillez fournir un nom pour la nouvelle balise",
    "etV-l": "Copier des fichiers sur SIT2",
    "euaI8": "Créer un nouveau compte local",
    "f5bLC": "Documentation",
    "fBP5h": "Nom d'utilisateur",
    "fV_1P": "Se connecter",
    "ff02c": "Annulé",
    "flK30": "Propulsé par l'équipe LafTools",
    "fqV_1P": "Débloquez vos LafTools",
    "g2_aX": "Copiez le mot de passe crypté dans le fichier",
    "g4lqi": "Obtenez le hachage MD2",
    "g5SK9": "Ouverte récente",
    "gDjbs": "Données historiques",
    "gnKMZ": "Rafraîchi.",
    "gsHQM": "Exemple de données chargé avec succès",
    "h6AeI": "Connexion Websocket fermée à {0}",
    "h8E01": "Activé",
    "hJUMN": "Langue cible",
    "hMvh1": "Base de données de sauvegarde",
    "hRFxV": "Pour plus d'information, veuillez visiter notre site web",
    "hhOT3": "Rechercher par nom",
    "hmqzl": "Après avoir cliqué sur l’un des boutons de contrôle ci-dessus, le résultat apparaîtra ici.",
    "hu-iz": "Minuteur",
    "huE6U": "Variable",
    "hyV-d": "Fait",
    "i6hMN": "Code de vérification des images",
    "i88tb": "Exporter le résultat vers un fichier",
    "i8q8tb": "Configurer WorkFlow pour l'entrée",
    "iNQvo": "Montrez un exemple pour commencer.",
    "iNqF1T": "Gérer le compte cloud",
    "iQL2c": "Nous explorons toujours la gamme complète des fonctions de ce bouton. Si vous avez des commentaires ou des suggestions sur la façon dont nous pouvons l'améliorer, n'hésitez pas à nous le faire savoir !",
    "i_lang_": "Packs de langue",
    "ib135dq": "Votre message de statut sera affiché ici",
    "iknTS": "Gestionnaire de mots de passe",
    "init_env": "Chargement des ressources système",
    "ip2g1": "Copié",
    "ipOSQE": "Édition Pro",
    "ixyP0": "Traitement automatique de l'action en temps réel",
    "j-VM7": "Copiez la valeur de la région de sortie dans votre presse-papiers.",
    "jJuNz": "Langue originelle",
    "jO5eP": "D'ACCORD",
    "jPNCb": "Réessayé.",
    "jQXdi": "Mode lumière",
    "jR1zX": "Laboratoire d'IA",
    "jaj7M": "Tous droits réservés.",
    "jfpqt": "Navigateur de notes",
    "k17PG": "Connexion Websocket fermée.",
    "k1k239q": "Veuillez recharger la page ou redémarrer l'application pour appliquer cette modification.",
    "k2SVY": "désactivé",
    "k41a5": "LafOutils",
    "kLH79": "E-mail",
    "kOi5A": "Imprimer la page",
    "kPD22": "Dictionnaire",
    "kPJ-A4": "Rafraîchir",
    "kcHxr": "Veuillez fournir le nom d'utilisateur du compte administrateur ici",
    "kjks1": "Récupération de la configuration i18n à partir de l'API du serveur local",
    "krxSK": "Assistant IA",
    "l6Djb": "Sélectionnez l'une des options comme thème préféré :",
    "lIn3_": "Nom d'utilisateur administrateur",
    "lQFII": "Re-déclencher l'initialisation",
    "lRHDQ": "Quitter le mode plein écran",
    "lUh5c": "Général",
    "lp0qmd0": "Marquez-le comme favori",
    "lpKAz": "Paramètres",
    "lzGS2": "Détails de l'extension",
    "m7WZw": "Websocket système cassé",
    "m8rTc1": "Une fois le gestionnaire de scripts shell implémenté, vous pouvez l'utiliser pour gérer vos commandes shell.",
    "mBgF1": "Action de la souris",
    "mNucv": "Veuillez saisir votre texte, charger à partir d'un fichier ou faire glisser un fichier ici, puis la boîte à outils l'utilisera pour le traiter en conséquence.",
    "mSFei": "Code source sur GitHub",
    "mWXeh": "ID de l'espace de travail : {0}",
    "mabHq": "Rechercher d'anciens fichiers",
    "mbzCv": "Une erreur s'est produite : {0}, l'heure de rejet est {1}",
    "mihc3": "Terminé cette opération",
    "mjHoR": "De plus, techniquement, personne ne peut lire ce jeton sinon il aurait attaqué et contrôlé votre ordinateur.",
    "n1jA9": "Confirmer",
    "n98EW": "Échangez le texte de la région d’entrée et de la région de sortie.",
    "nSeIq8-": "Et surtout, c'est gratuit et open source. Vous pouvez l'utiliser à des fins personnelles ou commerciales.",
    "nTvw4": "Pour protéger et enregistrer séparément vos données et paramètres, vous pouvez utiliser votre compte local pour y parvenir. En outre, LafTools prendra à l’avenir en charge les widgets de messagerie instantanée entre les utilisateurs.",
    "nxJC7": "L'action par défaut à exécuter lorsque le transformateur est effectué.",
    "o52xW": "Exporter",
    "oBz8D": "Chargement",
    "oNLxH": "Nom d'utilisateur",
    "oNg3f": "Site officiel",
    "of_ox": "Dans l’ensemble, LafTools est une solution unique pour tous vos besoins.",
    "oj23X": "Restaurer la base de données",
    "ooiFU": "Redémarrer le service Java",
    "oqHqVq": "Trier par",
    "oqHqqV": "Total : {0} commandes",
    "oqHqqVq": "Temps de copie",
    "p8Exxc1s": "Il existe divers outils qui exploitent les technologies d’IA pour effectuer des tâches plus efficacement dans AI Laboratory.",
    "pA_deJ": "Exporter vers le Presse-papiers",
    "pA_feeJ": "Reconnecter le terminal",
    "pA_qweJ": "Effacer le tampon",
    "pDBSWq": "aucun contenu disponible pour le panneau de droite",
    "pEk1kk": "LafTools vous présente ici des fonctionnalités utiles.",
    "pEk1qkk": "Lister tous les onglets ouverts",
    "pHZDB": "Action en temps réel",
    "pJoOz": "Fichier ouvert",
    "pKHRT": "Allez dans Outils",
    "pKqHRq": "Notes de recherche",
    "pL6qH": "Complété.",
    "ph5jH": "Manipulation de cette partie",
    "pmAee": "Lisez plus d’informations sur cet outil.",
    "pqs7y3": "Veuillez envisager d'enregistrer cette page Web en tant que PWA pour bénéficier d'une prise en charge complète du clavier.",
    "psA_eJ": "Exporter sous forme de fichier",
    "psZoP": "Déposez les fichiers ici pour les traiter",
    "q12beqwR": "Aucun outil disponible",
    "q6K7o": "Charger à partir de notes",
    "qDrbEr": "Le nom d'utilisateur que vous avez fourni est vide, veuillez vérifier et réessayer.",
    "qF4uS2": "Créer un espace de travail",
    "qF4uS23": "Nouvelle fenetre",
    "qHoktx": "Merci!",
    "qN1LdZ2": "Dernière modification",
    "qQmBr": "Traduction de texte",
    "qTqyvWdY": "Pas encore fini",
    "qUabR": "Il n'y a aucun outil disponible pour cette catégorie.",
    "qWemXE4": "1er janvier 2024",
    "qWw3eTH": "Cette partie permet de conserver les fichiers sur votre disque local ou votre disque cloud.",
    "qdeFXx": "Actuellement, la page que vous recherchez n'est pas encore entièrement mise en œuvre.",
    "qpDBSW": "aucun panneau disponible",
    "qpDBSWe1": "aucun panneau disponible",
    "qqK_x_": "Se connecter",
    "qqqwYoz": "Aide",
    "qqwYoz": "Onglets",
    "qqwYqwe": "Espaces de travail",
    "qtpmvP": "Confirmer le mot de passe local",
    "qubSJ": "La VM d’extension n’est pas un ID. (RÉF : IQnMH).",
    "rQkas": "Bienvenue sur LafTools",
    "rR1vd": "Entrée à partir d'un fichier",
    "rR4R_FO1vd": "Vous pouvez sélectionner et confirmer le fichier que vous souhaitez traiter, puis la boîte à outils le lira et collera le contenu dans la région d'entrée.",
    "r_n6h": "Mode clair ou sombre",
    "rf0mql3": "Thème clair ou sombre",
    "rpG0G": "Nous apprécions vos commentaires et aimerions connaître votre avis sur la façon dont nous pouvons améliorer notre produit - n'hésitez pas à partager vos commentaires avec nous !",
    "run_text": "Avant d'entrer dans votre workbench, nous aimerions d'abord précharger les ressources système requises. Veuillez patienter un peu, il sera bientôt terminé, dont les détails sont visibles ci-dessous.",
    "rycJy": "LafTools est une boîte à outils polyvalente spécialement conçue pour les programmeurs. Il représente la deuxième version de CodeGen Toolbox, désormais avec un runtime plus léger écrit en Golang et JavaScript.",
    "s4OeX": "Connectez-vous au système avec succès",
    "sHoxxW": "Conversion",
    "sO0MOe": "Chaque fois que vous restez dans une fenêtre plus de 5 secondes, cela s'affichera ici.",
    "sR8yc": "Fermer",
    "sdfk1": "Faire défiler les onglets vers la gauche",
    "sdfk13": "Faire défiler les onglets vers la droite",
    "sglMS": "Créer du temps",
    "sk123": "Pas encore fini",
    "sojBI": "Conversion",
    "spCqEa": "FAIRE",
    "ssDaOq": "Vous êtes nouveau sur LafTools ?",
    "sys_updates": "Dernières mises à jour du système",
    "t63Qw": "Rejeter",
    "tBIX-d": "les fenêtres",
    "tEiv_": "Récupération des détails de l'extension",
    "tIy3Q": "J'ai rencontré une erreur",
    "tIyq3Q": "J'ai rencontré une erreur",
    "tWe1yF": "Aucune commande shell disponible.",
    "tY3p1": "Plus d'information",
    "ttAre": "Saisissez ici votre mot de passe en clair",
    "twamg": "Assistant IA, renforcez votre créativité",
    "uCEe8": "Conversion en temps réel",
    "uFcDQ": "Initialisation des données d'état...",
    "uV5Bi": "Impossible de charger l'extension",
    "uVseB": "Appuyez sur {0} pour afficher la liste des touches de raccourci",
    "ucDLv": "Vous avez copié cet élément {0} fois",
    "usr_defined": "Préférences de système",
    "uwqGE": "Allez dans Outils",
    "vOjNC": "Entrez le mot de passe ou la clé sécurisée",
    "vTsQU": "Veuillez fournir le code d'invitation de votre administrateur",
    "vU17B": "Impossible d'envoyer la demande",
    "vWqac": "Avant d'entrer dans votre workbench, nous aimerions d'abord précharger les ressources système requises. Veuillez patienter un peu, il sera bientôt terminé, dont les détails sont visibles ci-dessous.",
    "vaP0vq": "Configurez le mot de passe local avec succès.",
    "wAxtg": "Initialement, nous avons généré un UUID en tant que jeton autorisé pour vous permettre d'effectuer cette configuration. D'après ce que LafTools a reçu, le token que vous avez fourni est {0}, il a été vérifié par LafTools avec succès et vous pouvez donc continuer à configurer ce formulaire.",
    "wI1eh": "Suivant",
    "wQYoz": "Déposer",
    "wQdYoz": "Modifier",
    "wQdqwYoz": "Voir",
    "wsWcXd": "Notifications",
    "x009": "Pour accéder à notre documentation d'utilisation",
    "x5tHV": "Présentation du système",
    "xMBv0": "Chargement des ressources associées...",
    "xPHqP": "La description n'est pas encore définie.",
    "xQ_ls": "Sauvegarde Redis",
    "xbz0B": "Fermer tous les onglets",
    "xbz0B2": "Fermer l'onglet",
    "xdqwe": "Bienvenue à utiliser LafTools !",
    "xeP4zV": "Visualisez rapidement vos éléments TODO",
    "xeP4zVd": "Recherchez rapidement un vocabulaire anglais.",
    "xlqtA": "Retour",
    "xs22XLF": "Aucune donnée disponible pour cet ID d'article, veuillez envisager de sélectionner d'autres articles.",
    "y3qjdd": "Votre mot de passe local a été vérifié avec succès.",
    "y8Ir5": "Cette partie est utilisée pour initialiser votre compte administrateur, cependant, pour l'instant, il n'y a rien à créer ou à ajuster ici car il a été précédemment configuré par votre administrateur, veuillez négliger cette partie et poursuivre vos étapes restantes.",
    "ySVf-": "Réessayez cette demande",
    "yVprb": "Cette partie est encore en développement.",
    "y_9YM": "La sortie sera affichée ici.",
    "yiRso": "Notes sur le nuage",
    "yqiRso": "Remarques locales",
    "yznU9": "Données d'arborescence vide",
    "zN2ES": "Espaces de travail",
    "zaSKh": "Rafraîchir",
    "zc3Hf": "Mot de passe",
    "zjDJk": "Veuillez fournir le chemin du répertoire de l'espace de travail",
    "zmDWx": "Contactez-nous",
    "znVRwq": "Des dossiers",
    "zwd4v": "Détails de l'extension",
    "zwgYx": "La valeur du mot de passe crypté sera affichée ici."
}