{
    "": "Mensagem: {0}",
    "-GJ_72": "Mudou para o espaço de trabalho selecionado {0}",
    "-Jx4J": "Conta local",
    "-Rj3y": "Temas",
    "-XZnW": "Voltar",
    "04SSf": "Esqueceu sua senha?",
    "07ui6": "Mais informações",
    "0PgZ_": "Tradução",
    "0gvcN": "Bem-vindo à página de visão geral, ela ainda está em desenvolvimento.",
    "0gywa": "Espaço de trabalho não encontrado. Você será redirecionado para a página de índice do espaço de trabalho.",
    "0ji-Z": "Recolher configuração",
    "13pmE": "Apoie-nos",
    "1JOFP": "Abra meu espaço de trabalho",
    "1NTgQ": "Abrir espaço de trabalho",
    "1Npez": "Forneça o caminho",
    "1Tuab": "Copiado",
    "1YmJc": "Selecione uma das opções como seu idioma preferido:",
    "1a3Sc": "Cancelar carregamento",
    "1bd": "Fluxo de trabalho",
    "1j62a": "Faça isso em outro momento",
    "1yIQu": "Você pode tentar reprocessar sua ação ou clicar no botão abaixo para descartar o erro.",
    "22XLF": "Ainda não está terminado",
    "24vLI": "Criada",
    "2D9a6": "Esqueceu sua senha?",
    "2D9qdk6": "É seguro o suficiente?",
    "2IF6A": "Parece que o armazenamento salvo do Forge encontrou algum problema",
    "2JyFN": "Copiar resultado para a área de transferência",
    "2Ocbey": "Versão",
    "2RhAT": "Parece que o processo de recuperação da forja encontrou algum problema",
    "2Ruh6": "Criar nova conta local",
    "2S5ap": "Alternar modo de tela inteira",
    "2Y1mR": "Texto claro",
    "2bqHk": "Carregar do arquivo",
    "2giYv": "Senha de teste: {0}",
    "2qdin8": "Por favor, insira o código de verificação",
    "32D9a6": "Crie a sua conta aqui",
    "33RXi": "A solicitação foi rejeitada devido a parâmetros insatisfatórios.",
    "39dsCt": "Você receberá a notificação mais recente dos serviços de aplicativos, se tiver.",
    "3umnB": "Token desconhecido",
    "44Ntqw-": "Lidando com a operação.",
    "4K_vhq": "Duplicar esta guia",
    "4PIqD": "Revisão de código",
    "4UYIJ": "Ainda não foi completo.",
    "4cGA_": "Recuperando dados para preferências do sistema...",
    "4kKe4": "Sua senha",
    "4vdfwf": "OK",
    "4wlih": "A solicitação foi rejeitada devido a parâmetros insatisfatórios.",
    "54cwb": "A API Websocket do sistema encontrou um erro: {0}",
    "58HQX": "Caso você não saiba seu valor, entre em contato com seu administrador para obter mais detalhes, que podem ser encontrados em suas configurações.",
    "5BOhl": "Código de Convite",
    "5NCPT": "Modo escuro",
    "5NJeGsu1": "E-Mail, você pode organizar facilmente sua caixa de entrada, redigir e enviar mensagens e ficar por dentro de sua correspondência. Até o momento, é utilizado apenas como ferramenta de comunicação entre os usuários e nossa equipe.",
    "5NJeddqGsu1": "Esta seção inclui materiais de informática, artigos wiki, guias de uso e muito mais.",
    "5NJedqddqGsu1": "Esta seção inclui recursos de computador que podem ser usados ​​para construir seus próprios projetos.",
    "5Perd": "Desculpe, a função 'Usar Editor Inteligente' ainda não está disponível. Ainda estamos trabalhando para implementá-lo. Obrigado pela sua paciência.",
    "5ZBYR": "Voltar",
    "5dF7o": "Atualizar",
    "5srFq": "LafFerramentas",
    "6AumW": "Ação padrão",
    "6ClPV": "Criar",
    "6hsnqWe": "Embora o LafTools seja gratuito e de código aberto, mantê-lo ainda requer uma quantidade significativa de tempo e energia. Em particular, precisamos de fundos para pagar certas APIs em nuvem. Se você aprecia o LafTools, considere nos apoiar.",
    "6yOXx": "Nome desconhecido",
    "7MOO1": "Entrar",
    "7q40W": "Não é possível inicializar o administrador",
    "7x3f6": "Guia - 1",
    "82r0C": "Gerencie sua lista de tarefas pendentes e faça as coisas com mais eficiência.",
    "83dNp": "Não foi possível carregar o ID da extensão. (REF: 1dl1f)",
    "8LdRj": "Visão geral",
    "8LdRjq": "Calcular",
    "8LdevRj": "Serviço",
    "8M1wY": "Terminal local",
    "8mn_qa": "Recuperando os dados dos serviços de terminal...",
    "8qzWJu": "Desculpe, no momento ainda não oferecemos suporte a dispositivos de tela pequena. Use o PC para visitar esta página.",
    "9Xv8-": "Salvar como nota",
    "9a335": "Clique em qualquer item de extensão no primeiro menu à esquerda, o atual está vazio ou inválido.",
    "9eZHM": "Ops! Parece que encontramos alguns avisos ou erros.",
    "9zCSc": "Não há espaços de trabalho disponíveis",
    "ANUZ7": "Clique para selecionar um arquivo para processamento. A caixa de ferramentas irá processá-lo diretamente no serviço e mostrar o resultado na região de saída.",
    "AW9N8": "Região de entrada",
    "AfPC0": "Sua senha em texto simples",
    "Ahrjc": "O diretório não existe, deseja criá-lo?",
    "Apx8D": "Como redefinir sua senha manualmente?",
    "AqYcS": "Para oferecer suporte ao LafTools, considere atualizar para nossa versão profissional por meio de uma assinatura mensal. Agradeceríamos muito a sua ajuda e prometemos que o LafTools ficará ainda melhor com os fundos arrecadados.",
    "B0s0z": "Objetivo desta página:",
    "BShq3M": "Problemas",
    "BW3bpT": "Lendo o arquivo do disco...",
    "Bd9h-": "Adicione-o à minha coleção favorita",
    "BuihG": "Configurações de sistema",
    "CVUl0": "LafFerramentas",
    "CWohyqde": "Ferramentas",
    "CWoqhy": "Lista de Exts por CategoryID selecionado",
    "CfZAX": "O arquivo {0} selecionado, estamos enviando-o para o serviço principal.",
    "CidOqAZ": "Como criador do LafTools, estou muito emocionado por você estar disposto a nos apoiar. Temos boas pessoas em nossa equipe que trabalham duro para melhorar continuamente o LafTools.",
    "Cide2w": "Para ver se há algum problema ao executar sua ação.",
    "DIQFq": "Verifique se o parâmetro URL foi fornecido corretamente. Parece que você não tem permissão para preencher este formulário. Por padrão, você poderá ver a mensagem abaixo na saída do serviço quando ele for iniciado.",
    "DIweGq": "Proteja seu LafTools",
    "DTTPW": "Reinicie status",
    "DVoKw": "Sair deste sistema",
    "DadYp": "Debounce em tempo real",
    "Dj9qqwk": "Saída",
    "DoWY7": "Defina o texto da região de entrada ou da região de saída como vazio.",
    "DrXAq": "Bem-vindo ao uso do LafTools!",
    "DrbEr": "A senha que você forneceu está vazia, verifique e tente novamente.",
    "DtlAc": "Carregando recursos do sistema",
    "Dxlw0": "Completo",
    "E6F9B": "Adicione-o ao fluxo de trabalho",
    "ERK7E": "Se você encontrar algum problema ou tiver alguma sugestão ao usar o LafTools, sinta-se à vontade para nos contatar via e-mail ou GitHub a qualquer momento, teremos prazer em ajudá-lo.",
    "Ewvgo": "Ainda nao comecou.",
    "ExqvX": "Lista de teclas de atalho",
    "Eyq856": "Ainda não terminamos - estamos empenhados em fornecer os melhores e mais recentes recursos e continuaremos lançando atualizações para garantir que você tenha a melhor experiência possível.",
    "F-OUm": "Configuração rápida para LafTools",
    "F0CCF": "Lista de teclas de atalho",
    "F4uS2": "Novo arquivo",
    "FBVyc": "Reinsira o código de verificação",
    "FDlRI": "Dê um nome a esta nova guia e clique para confirmá-la.",
    "FOyHW": "Pesquise em qualquer lugar",
    "FhVWl": "Criptografe sua senha",
    "Fv-zz": "Copiar resultado",
    "Fy217": "Configurar transformador de texto",
    "G3MJN": "Mostrar painel de saída",
    "G9QVo": "Gerenciar guias",
    "GKQDO": "Ferramentas",
    "Ggob_": "Cancelar",
    "H-Ae75": "Por favor, confirme sua senha local.",
    "H-qA75": "Forneça a senha local.",
    "H8fQ4": "Alternar para modo claro ou escuro",
    "HEAhr": "Após a tradução, o resultado aparecerá aqui.",
    "HIc3c": "Concluído",
    "HNDat": "Para fazer alterações, clique no botão \"{0}\". Caso contrário, clique em \"{1}\" para aplicar suas alterações. Que você se divirta com esta caixa de ferramentas!",
    "Hflf2": "Por uma questão de segurança cibernética, não ajudaríamos a redefinir sua senha por meio de APIs ou páginas aqui, a menos que você atualize manualmente o arquivo protegido pelo sistema.",
    "HjvV3": "Não iremos deletar seus arquivos do disco, apenas removeremos este registro da lista.",
    "HyIC_": "Tecla de barra (/)",
    "HyIC_d": "Tecla de barra (/)",
    "I88nZ": "Configuração de ferramentas",
    "I8FLi": "Agora é hora de configurar seu administrador. Defina a senha o mais complexa possível para deixar perplexos os invasores indelicados.",
    "IAC0A": "Ferramentas de busca",
    "ICefi": "Cancelado",
    "IKqqATS": "Atualizar dados da página atual",
    "IOOrz": "(Seria prejudicial ao seu sistema? Achamos que não, contanto que você possa modificar o arquivo de configuração preservado do sistema, isso significa que você pode ler tudo sobre os arquivos de dados do LafTools.)",
    "IWUH5": "Mostrar exemplo",
    "IaSyO": "Cancelar",
    "IfsGO": "Favoritos",
    "IfsdGO": "Favoritos",
    "ImUmf": "Novo",
    "J2xoL": "Veja o erro: {0}",
    "J5aL1": "Alternar a visibilidade do painel de configuração da ferramenta",
    "JQLmS": "Ajustou o tamanho",
    "JQLmSq": "Concluído.",
    "JTBRh": "O LafTools armazenou o valor da senha no arquivo local, mas não se preocupe, adotamos um mecanismo de criptografia de senha unidirecional, ou seja, ninguém consegue ler a senha da versão em texto simples. Para redefinir a senha, siga os instrumentos abaixo para redefinir sua senha manualmente.",
    "JYqxz2": "Bem-vindo ao LafTools, esta é uma versão interna.",
    "JfFHw": "Obter solicitação de informações do espaço de trabalho",
    "K1qJZI": "Bem-vindo ao LafTools, Excelência.",
    "KGS2-": "Depois de concluir as etapas acima, você poderá usar sua nova senha para entrar no sistema. Se você não conseguiu acessar o sistema de arquivos, peça ao administrador ou ao suporte de TI para criar esse arquivo. Se o arquivo já existia, exclua-o e renove um.",
    "KIc63": "Função ainda não suportada",
    "KmEUF": "Fornece uma visão geral rápida das ferramentas atuais do sistema.",
    "Kw4OJr": "terminal",
    "Kyd9H": "Código-fonte no GitHub",
    "L3zEM": "Mostrar exemplo",
    "L42mxa": "Por favor insira seu texto fonte neste campo.",
    "L49kCq": "Forneça e confirme a senha de bloqueio neste formulário para proteger seu LafTools.",
    "L71q_N": "A senha que você forneceu está vazia, verifique e tente novamente.",
    "LAc1m": "Atualizada a visualização do aplicativo.",
    "LFdvM": "Não conectado",
    "LM715": "Recuperando nomes de usuário da API do servidor local",
    "LPJrV": "Copiar resultado",
    "LWaeFqd": "Mude para o seu idioma preferido",
    "Le71_N-": "A senha que você forneceu não é a mesma que a confirmada, verifique e tente novamente.",
    "LnJ4H": "Observe que a conta local não é totalmente igual à do usuário registrado em nosso site, a primeira é definida apenas no seu PC enquanto a segunda pode ser usada para sincronização na nuvem.",
    "LqWaFd": "Configurações de sistema",
    "M4ywN1": "Calculadora, calendário, relógio, clima e muito mais.",
    "M7jct": "Entre no modo de tela inteira",
    "MN2lT": "O comprimento da senha não pode ser inferior a 6",
    "Ma5mv": "Alternar a visibilidade das guias da barra de ferramentas",
    "Mg4ldi": "cópia de",
    "Mq9pdpT": "Liste todos os recursos relevantes para o menu funcional selecionado.",
    "Mq9ppT": "Visualize rapidamente o status dos seus serviços",
    "MrgmU": "confirme",
    "NMLOn": "Copiar caminho do arquivo",
    "NMLOn1": "Abrir espaço de trabalho",
    "NNd1o": "Use exemplo para teste",
    "NNfJo": "Carregar dados do arquivo",
    "Nq1IR": "Não foi possível carregar a VM de extensão",
    "Nqc0LqwX": "Se você acha que há uma vulnerabilidade neste processo, sinta-se à vontade para nos contatar via e-mail ou GitHub a qualquer momento, gostaríamos de aprimorá-la urgentemente.",
    "O02-W": "Não está carregando...",
    "O94Yx": "sobre",
    "OQWm4": "Reportar um erro",
    "OSHOI": "Página de boas-vindas",
    "OSqZQM": "Senha local",
    "OeOQY": "PENDÊNCIA",
    "Opcty": "arquivos",
    "OrCt5": "Redirecionando para o ambiente de trabalho...",
    "P4ROa": "Região de saída",
    "PM_N5": "Sessão - {0}",
    "PUxuU": "Recuperando dados para pacotes de idiomas...",
    "PapkF": "Se você tiver alguma dúvida ou sugestão sobre o LafTools, sinta-se à vontade para nos informar. Estamos sempre buscando maneiras de melhorar nosso produto e oferecer a melhor experiência possível aos nossos usuários. Você pode entrar em contato conosco em work7z@outlook.com. Obrigado por usar o LafTools!",
    "PpCHA": "Chave da pergunta (?)",
    "PqazM-": "Primeiro de tudo, use os controles do formulário abaixo para criptografar sua senha",
    "QL9Sn": "No momento, não parece haver uma descrição disponível.",
    "QLKzF": "Está repleto de recursos que atendem às necessidades de desenvolvedores novatos e experientes, tornando-o uma ferramenta obrigatória no arsenal de qualquer programador.",
    "QM2Ob": "Ferramentas recentes",
    "QM2Oq": "Notas recentes",
    "QRAdA": "inglês para chinês",
    "QhdpH": "Edição da comunidade",
    "QzlA3": "Um erro ocorreu",
    "R12bq": "Listar guias que não são mostradas",
    "RNBze0": "Ferramentas",
    "RNeBze0": "Guias abertas",
    "RNewBze0": "Configuração da ferramenta",
    "RPVRl": "Parece que esta extensão é incompatível com a versão atual do LafTools. Considere instalar a versão mais recente para suportar esta extensão ou entre em contato conosco levantando um problema no GitHub.",
    "RhqzcdD": "Configurações de sistema",
    "RjCO3": "Lista de espaços de trabalho",
    "S4MMV": "Ops! Encontramos alguns problemas ao carregar o arquivo.",
    "SAnnQ": "Carregando o arquivo {0}",
    "SBsDz": "Configuração para sua conta de administrador.",
    "SGs7B": "Configure seu LafTools rapidamente",
    "SMqD13": "Digite para filtrar",
    "SQAw7": "Idioma de origem",
    "SZgXb": "Configurar senha local",
    "SdGcT": "Outra parte",
    "Sm9tq": "Forneça a senha da conta aqui",
    "Sm9tqq": "Por favor, forneça a senha para desbloquear seu LafTools",
    "Spcfdee": "Modo claro ou escuro",
    "TBPqy7": "Linguagem",
    "TD7DA": "línguas",
    "TNoePE": "Nuvem LafTools",
    "Ttrqqet": "Escreva e salve suas idéias aqui!",
    "TwFcr": "Idioma alvo",
    "TyqvWY3": "Arquivo local",
    "TyqvqWY3": "Meus cadernos",
    "U4qqq9": "Remover esta guia da lista",
    "U7zP2": "Forneça o nome de usuário da conta aqui",
    "UF_Dp": "Ocorreu um erro: {0}, o tempo rejeitado é {1}",
    "UU_7h": "Clique em qualquer item de categoria no primeiro menu à esquerda; a categoria atual está vazia ou é inválida.",
    "UZ2Ig": "Nova conta local",
    "Ugpng": "Favorito",
    "V6U_f": "Termos de serviço",
    "V6XEO": "Digite o nome de usuário ou e-mail",
    "VAZq8r": "Ele permite que os desenvolvedores executem vários comandos, como executar scripts, instalar pacotes e navegar no sistema de arquivos, tudo dentro do editor.",
    "VEfeqZG": "Notas",
    "VOsZc": "Reportar problema",
    "VSZ": "Clique para reativar",
    "Vaf2y": "O nome da guia não poderia ficar em branco.",
    "VeY9K": "Termos de uso",
    "VgG5y": "Clique aqui para atualizar o status da sua extensão",
    "VjZCv": "Conversão em tempo real",
    "WPrTW": "Website oficial",
    "WXo6D": "Atualizado",
    "WYCVL": "Configuração rápida",
    "X4L_Z": "A VM de extensão não é fornecida.",
    "X6Fq4j": "Após anos de desenvolvimento e refinamento dedicados, estamos confiantes de que o LafTools pode aprimorar significativamente sua experiência de programação, trazendo mais conveniência e eficiência ao seu fluxo de trabalho.",
    "XKpI0": "Clique para processar seu texto na região de entrada",
    "XLWoR": "Selecione o seu preferido e continue",
    "XQxJB": "Meus espaços de trabalho",
    "X_HGx": "LafTools é uma caixa de ferramentas versátil projetada para atender a diversas necessidades. É totalmente de código aberto, garantindo transparência e segurança. Apesar de seu tempo de execução leve, ele oferece suporte completo à plataforma, incluindo ARMv8, e suporte nativo de IA semelhante ao ChatGPT. LafTools é altamente integrado a uma UI produtiva e é continuamente atualizado com novas ferramentas. Ele pode ser usado pela web e com Docker e fornece recursos adicionais como notas e manuais.",
    "XikdD": "Momentos por favor, estamos quase lá!",
    "Y5GAC": "Seu nome de usuário",
    "Y9mQ2": "Forneça o nome de usuário da conta aqui",
    "YAAU3q": "Senha local",
    "YHCjT": "LafTools suporta tema global claro e escuro, é útil principalmente com codificadores noturnos.",
    "YNwKz": "Idioma não suportado: {0}, usará o inglês por padrão.",
    "YOYTp": "Configuração rápida",
    "YPPPL": "Alternar a visibilidade das guias da barra de ferramentas",
    "YQN9u": "Ocorreu um erro ao carregar {0}, verifique os detalhes abaixo.",
    "Y_k0z": "Esqueceu sua senha?",
    "YrVq683": "Correspondência",
    "YrVqdd683": "Manuais",
    "YuQTX": "Se o transformador deve ser executado automaticamente quando o texto de entrada for alterado.",
    "YuQqTX": "Execução automática?",
    "Z2QTU": "Sobre",
    "Z3rhY": "Mensagem",
    "Z7ALO": "Mudou para o espaço de trabalho selecionado",
    "Z7OTt": "O arquivo que você selecionou é muito grande. Selecione um arquivo com menos de 30 MB.",
    "ZAGva": "Tem certeza de que deseja excluir este espaço de trabalho?",
    "ZAKaFq": "Minha conta na nuvem",
    "ZIHEO": "Configurações",
    "ZW1Dgz": "Nenhuma mensagem disponível",
    "ZXRGC": "Veja o erro: {0}",
    "Zpqqpf": "Criptografe os dados com MD2",
    "ZrbduC": "Fechar todas as guias",
    "ZrbuC": "Aba fechada",
    "_5OqeG": "Desmarque",
    "_LFF3": "Caso você encontre algum problema ou tenha alguma sugestão ao usar o LafTools, sinta-se à vontade para nos contatar via e-mail ou GitHub a qualquer momento, estamos dispostos a aprimorá-lo.",
    "_trez": "Trocar texto",
    "_trqL": "Recuperando dados para recursos do sistema...",
    "_z3lR": "Atualizar código",
    "aCkOP": "Saída",
    "aHAfR": "Buscando dados para {0}...",
    "about_LafTools_toolbox": "Sobre LafTools",
    "adpgq": "Criar novo espaço de trabalho",
    "aked6": "Referências",
    "aked61": "Introdução",
    "asElV": "Remover",
    "az4uS2": "Tem certeza de que deseja sair deste sistema? Observe que você será redirecionado para a página de login.",
    "b0qjSL": "Por favor entre no diretório {1} e crie um arquivo {2}, coloque sua senha criptografada como todo o conteúdo do arquivo.",
    "bP_6qG": "Dicas para esquecer sua senha",
    "bT4R6": "Nova aba",
    "bVlBN": "Chinês para Inglês",
    "bjZyW": "Traduzir",
    "bp_-b": "Para gerenciar totalmente o LafTools, você precisa configurar seu administrador no início do fluxo de configuração. Verificamos sua identificação pelo token de parâmetro de URL. Tenha certeza de que ninguém mais pode configurar sua permissão de root, a menos que obtenha o token de configuração.",
    "c0eCw": "Traduza seu texto para qualquer idioma que desejar.",
    "c7Uoqqe": "Antes de usar o LafTools, forneça e confirme sua senha local conforme abaixo.",
    "cNQp_": "Recursos",
    "cQqwI8r": "Carregando o status do Terminal Service",
    "cfYYN": "Descubra mais",
    "cj1pd": "Operação de atualização",
    "coM2I": "Use o Editor Inteligente",
    "cuRCb": "Categoria não encontrada.",
    "cuRCqb": "A categoria não existe",
    "d-l2l": "confirme",
    "d-qPr": "Layout desconhecido: {0}",
    "d5KZH": "Obrigado por usar o LafTools!",
    "d5LAU": "Licenciado sob AGPLv3",
    "d5hit": "Sessão - {0}",
    "dDGrHq": "Navegador de aplicativos",
    "dV5Eq": "Atualizar lista de espaços de trabalho",
    "dk122q": "Gerencie seus fluxos de trabalho para combinar várias ferramentas.",
    "dkarh": "Ok, a caixa de ferramentas abriu o diretório. Se não aparecer nenhuma janela, verifique se sua plataforma suporta esta função ou se o diretório está no servidor.",
    "dkkq12": "Configure sua ferramenta nesta aba.",
    "dl4kr": "Esqueceu sua senha?",
    "dpRY4": "Dicionário",
    "dqTqyvWY": "Menu Gaveta",
    "dsdpA_eJ": "Ajustar tamanho",
    "dxLQq": "Permissão raiz",
    "dzjTo": "Forneça a senha da conta aqui",
    "e--gB": "O ID da extensão não é fornecido.",
    "e8Crq": "Preencha abaixo o campo de nome de usuário e senha para continuar.",
    "eTmq": "História da caixa de ferramentas CodeGen",
    "e_8pZ": "Uma caixa de ferramentas versátil para desenvolvedores melhorarem a produtividade.",
    "euaI8": "Criar nova conta local",
    "f5bLC": "Documentação",
    "fBP5h": "Nome de usuário",
    "fV_1P": "Entrar",
    "ff02c": "Cancelado",
    "flK30": "Desenvolvido pela equipe LafTools",
    "fqV_1P": "Desbloqueie seu LafTools",
    "g2_aX": "Copie a senha criptografada para o arquivo",
    "g4lqi": "Obtenha hash MD2",
    "g5SK9": "Aberto recentemente",
    "gDjbs": "Data histórica",
    "gnKMZ": "Atualizado.",
    "gsHQM": "Dados de exemplo carregados com sucesso",
    "h6AeI": "Conexão Websocket fechada às {0}",
    "h8E01": "Habilitado",
    "hJUMN": "Idioma alvo",
    "hRFxV": "Para mais informações, visite nosso site",
    "hhOT3": "Procura por nome",
    "hmqzl": "Depois de clicar em um dos controles de botão acima, o resultado aparecerá aqui.",
    "hyV-d": "Feito",
    "i6hMN": "Código de verificação de imagem",
    "i88tb": "Exportar resultado para arquivo",
    "i8q8tb": "Configurar WorkFlow para entrada",
    "iNQvo": "Mostre um exemplo para começar.",
    "iNqF1T": "Gerenciar conta na nuvem",
    "iQL2c": "Ainda estamos explorando toda a gama de funções deste botão. Se você tiver algum comentário ou sugestão sobre como podemos melhorá-lo, informe-nos!",
    "i_lang_": "Pacotes de idiomas",
    "ib135dq": "Sua mensagem de status será exibida aqui",
    "init_env": "Carregando recursos do sistema",
    "ip2g1": "Copiado",
    "ipOSQE": "Edição Pró",
    "ixyP0": "Processando a ação em tempo real automaticamente",
    "j-VM7": "Copie o valor da região de saída para sua área de transferência.",
    "jJuNz": "Idioma de origem",
    "jO5eP": "OK",
    "jPNCb": "Tentei novamente.",
    "jQXdi": "Modo claro",
    "jR1zX": "Laboratório de IA",
    "jaj7M": "Todos os direitos reservados.",
    "k17PG": "Conexão Websocket fechada.",
    "k1k239q": "Atualize a página ou reinicie o aplicativo para aplicar esta alteração.",
    "k2SVY": "desligado",
    "k41a5": "LafFerramentas",
    "kLH79": "E-mail",
    "kOi5A": "Imprimir página",
    "kPD22": "Dicionário",
    "kPJ-A4": "Atualizar",
    "kcHxr": "Forneça o nome de usuário da conta de administrador aqui",
    "kjks1": "Recuperando a configuração do i18n da API do servidor local",
    "krxSK": "Assistente de IA",
    "l6Djb": "Selecione uma das opções como tema preferido:",
    "lIn3_": "Nome de usuário do administrador",
    "lQFII": "Reacione a inicialização",
    "lRHDQ": "Sair do modo de tela cheia",
    "lp0qmd0": "Marcar como favorito",
    "lpKAz": "Configurações",
    "lzGS2": "Detalhe da extensão",
    "m7WZw": "Websocket do sistema quebrado",
    "mBgF1": "Ação do mouse",
    "mNucv": "Insira seu texto, carregue do arquivo ou arraste um arquivo aqui, então a caixa de ferramentas irá usá-lo para processar de acordo.",
    "mSFei": "Código-fonte no GitHub",
    "mWXeh": "ID do espaço de trabalho: {0}",
    "mbzCv": "Ocorreu um erro: {0}, o tempo rejeitado é {1}",
    "mihc3": "Concluiu esta operação",
    "mjHoR": "Além disso, tecnicamente, ninguém pode ler este token, caso contrário, ele atacará e controlará seu computador.",
    "n1jA9": "confirme",
    "n98EW": "Troque o texto da região de entrada e da região de saída.",
    "nTvw4": "Para proteger e salvar separadamente seus dados e configurações, você pode usar sua conta local para fazer isso. Além disso, o LafTools oferecerá suporte a widgets de mensagens instantâneas entre os usuários no futuro.",
    "nxJC7": "A ação padrão a ser executada quando o transformador for executado.",
    "o52xW": "Exportar",
    "oBz8D": "Carregando",
    "oNLxH": "Nome de usuário",
    "oNg3f": "Website oficial",
    "of_ox": "Resumindo, LafTools é uma solução completa para todas as suas necessidades.",
    "p8Exxc1s": "Existem várias ferramentas que aproveitam as tecnologias de IA para executar tarefas com mais eficiência no Laboratório de IA.",
    "pA_deJ": "Exportar para a área de transferência",
    "pA_feeJ": "Reconectar Terminal",
    "pA_qweJ": "Limpar buffer",
    "pDBSWq": "nenhum conteúdo disponível para o painel direito",
    "pEk1kk": "LafTools apresenta funcionalidades úteis para você aqui.",
    "pEk1qkk": "Liste todas as guias abertas",
    "pHZDB": "Ação em tempo real",
    "pJoOz": "Abrir arquivo",
    "pKHRT": "Vá para Ferramentas",
    "pKHRq": "Vá para Notas",
    "pL6qH": "Concluído.",
    "ph5jH": "Lidando com esta parte",
    "pmAee": "Leia mais informações sobre esta ferramenta.",
    "pqs7y3": "Considere registrar esta página da web como um PWA para ter suporte completo ao mapa de teclado.",
    "psA_eJ": "Exportar como arquivo",
    "psZoP": "Solte os arquivos aqui para processá-los",
    "q12beqwR": "Nenhuma ferramenta disponível",
    "q6K7o": "Carregar das notas",
    "qDrbEr": "O nome de usuário que você forneceu está vazio. Verifique e tente novamente.",
    "qF4uS2": "Criar espaço de trabalho",
    "qF4uS23": "Nova janela",
    "qHoktx": "Obrigado!",
    "qQmBr": "Tradução do texto",
    "qTqyvWdY": "Ainda não está terminado",
    "qUabR": "Não há ferramentas disponíveis para esta categoria.",
    "qWemXE4": "1º de janeiro de 2024",
    "qWw3eTH": "Esta parte ajuda a manter os arquivos em seu disco local ou disco na nuvem.",
    "qpDBSW": "nenhum painel disponível",
    "qpDBSWe1": "nenhum painel disponível",
    "qqK_x_": "Entrar",
    "qqqwYoz": "Ajuda",
    "qqwYoz": "Guias",
    "qqwYqwe": "Espaços de trabalho",
    "qtpmvP": "Confirme a senha local",
    "qubSJ": "Extensão VM não é ID. (REF: IQnMH).",
    "rQkas": "Bem-vindo ao LafTools",
    "rR1vd": "Entrada do arquivo",
    "rR4R_FO1vd": "Você pode selecionar e confirmar o arquivo que deseja processar, então a caixa de ferramentas irá lê-lo e colar o conteúdo na região de entrada.",
    "r_n6h": "Modo claro ou escuro",
    "rf0mql3": "Tema claro ou escuro",
    "rpG0G": "Valorizamos seu feedback e adoraríamos ouvir sua opinião sobre como podemos melhorar nosso produto - não hesite em compartilhar seus comentários conosco!",
    "run_text": "Antes de entrar em seu ambiente de trabalho, gostaríamos de pré-carregar os recursos necessários do sistema primeiro. Aguarde um pouco, em breve será concluído, cujos detalhes podem ser visualizados abaixo.",
    "rycJy": "LafTools é uma caixa de ferramentas versátil projetada especificamente para programadores. Ele representa a segunda versão do CodeGen Toolbox, agora com um runtime mais leve escrito em Golang e JavaScript.",
    "s4OeX": "Faça login no sistema com sucesso",
    "sHoxxW": "Conversão",
    "sO0MOe": "Cada vez que você ficar em uma janela por mais de 5 segundos, ela será mostrada aqui.",
    "sR8yc": "Fechar",
    "sdfk1": "Rolar as guias para a esquerda",
    "sdfk13": "Rolar as guias para a direita",
    "sk123": "Ainda não acabado",
    "sojBI": "Conversão",
    "spCqEa": "PENDÊNCIA",
    "ssDaOq": "Novo no LafTools?",
    "sys_updates": "Últimas atualizações do sistema",
    "t63Qw": "Liberar",
    "tBIX-d": "janelas",
    "tEiv_": "Recuperando detalhes da extensão",
    "tEkR3": "Insira seu valor de acordo com a mensagem de prompt",
    "tIy3Q": "Encontrou um erro",
    "tIyq3Q": "Encontrou um erro",
    "ttAre": "Insira sua senha em texto simples aqui",
    "twamg": "Assistente de IA, capacitando sua criatividade",
    "uCEe8": "Conversão em tempo real",
    "uFcDQ": "Inicializando os dados de status...",
    "uV5Bi": "Não foi possível carregar a extensão",
    "uVseB": "Pressione {0} para mostrar a lista de teclas de atalho",
    "usr_defined": "Preferências do Sistema",
    "uwqGE": "Vá para Ferramentas",
    "vOjNC": "Digite a senha ou chave segura",
    "vTsQU": "Forneça o código de convite do seu administrador",
    "vU17B": "Não foi possível enviar a solicitação",
    "vWqac": "Antes de entrar em seu ambiente de trabalho, gostaríamos de pré-carregar os recursos necessários do sistema primeiro. Aguarde um pouco, em breve será concluído, cujos detalhes podem ser visualizados abaixo.",
    "vaP0vq": "Configure a senha local com sucesso.",
    "wAxtg": "Inicialmente, geramos um UUID como token autorizado para você fazer esta configuração. Pelo que o LafTools recebeu, o token que você forneceu é {0}, foi verificado pelo LafTools com sucesso e consequentemente você pode continuar a configurar este formulário.",
    "wI1eh": "Próximo",
    "wQYoz": "Arquivo",
    "wQdYoz": "Editar",
    "wQdqwYoz": "Visualizar",
    "wsWcXd": "Notificações",
    "x009": "Para acessar nossa documentação de uso",
    "x5tHV": "Visão geral do sistema",
    "xMBv0": "Carregando recursos relacionados...",
    "xPHqP": "A descrição ainda não está definida.",
    "xbz0B": "Fechar todas as guias",
    "xbz0B2": "Aba fechada",
    "xdqwe": "Bem-vindo ao uso do LafTools!",
    "xeP4zV": "Visualize rapidamente seus itens TODO",
    "xeP4zVd": "Procure rapidamente um vocabulário em inglês.",
    "xlqtA": "Opinião",
    "xs22XLF": "Não há dados disponíveis para este ID de item. Considere selecionar outros itens.",
    "y3qjdd": "Sua senha local foi verificada com sucesso.",
    "y8Ir5": "Esta parte é usada para inicializar sua conta de administrador, porém, por enquanto, não há nada que precise ser criado ou ajustado aqui, pois foi previamente configurado pelo seu administrador, negligencie esta parte e prossiga com as etapas restantes.",
    "ySVf-": "Tente novamente esta solicitação",
    "y_9YM": "A saída será exibida aqui.",
    "yznU9": "Dados de árvore vazios",
    "zN2ES": "Espaços de trabalho",
    "zaSKh": "Atualizar",
    "zc3Hf": "Senha",
    "zjDJk": "Forneça o caminho do diretório do espaço de trabalho",
    "zmDWx": "Contate-nos",
    "znVRwq": "arquivos",
    "zwd4v": "Detalhe da extensão",
    "zwgYx": "O valor da senha criptografada será exibido aqui."
}