{
    "": "ข้อความ: {0}",
    "-8l11": "คัดลอกแล้ว",
    "-DqwwR": "การดำเนินการเสร็จสมบูรณ์",
    "-GJ_72": "สลับไปยังพื้นที่ทำงานที่เลือก {0}",
    "-Jx4J": "บัญชีท้องถิ่น",
    "-Rj3y": "ธีมส์",
    "-XZnW": "กลับ",
    "-Yo129I": "เครื่องมือข้อความ",
    "01do0y": "กันนาดา",
    "04SSf": "ลืมรหัสผ่าน?",
    "07ui6": "ข้อมูลเพิ่มเติม",
    "0Ceqru": "Base64 เป็นสัญลักษณ์สำหรับการเข้ารหัสข้อมูลไบต์ที่กำหนดเองโดยใช้ชุดสัญลักษณ์ที่จำกัด ซึ่งมนุษย์สามารถใช้งานได้สะดวกและประมวลผลโดยคอมพิวเตอร์",
    "0PgZ_": "การแปล",
    "0gvcN": "ยินดีต้อนรับสู่หน้าภาพรวม มันยังอยู่ระหว่างการพัฒนา",
    "0gywa": "ไม่พบพื้นที่ทำงาน คุณจะถูกเปลี่ยนเส้นทางไปยังหน้าดัชนีพื้นที่ทำงาน",
    "0pfdz7": "อุซเบก",
    "13pmE": "สนับสนุนเรา",
    "1507oa": "เบงกาลี",
    "1JOFP": "เปิดพื้นที่ทำงานของฉัน",
    "1NTgQ": "เปิดพื้นที่ทำงาน",
    "1Npez": "กรุณาระบุเส้นทาง",
    "1Tuab": "คัดลอกแล้ว",
    "1X8x7": "ตัวอย่าง",
    "1YmJc": "เลือกหนึ่งในตัวเลือกเป็นภาษาที่คุณต้องการ:",
    "1a3Sc": "ยกเลิกการโหลด",
    "1bd": "ขั้นตอนการทำงาน",
    "1e3e5n": "เฮาซา",
    "1h6jH": "คำเตือน ผลลัพธ์ว่างเปล่า!",
    "1j62a": "ทำเช่นนี้ในเวลาอื่น",
    "1jj0ri": "ญี่ปุ่น",
    "1k_44": "การดำเนินการนี้จะถอดรหัสข้อมูลจากสตริง ASCII Base64 กลับเป็นรูปแบบ Raw",
    "1th2nw": "สิงหล",
    "1yIQu": "คุณสามารถลองประมวลผลการกระทำของคุณใหม่หรือคลิกปุ่มด้านล่างเพื่อยกเลิกข้อผิดพลาด",
    "20nmcv": "ละติน",
    "22XLF": "ยังไม่เสร็จ",
    "24vLI": "สร้าง",
    "27j7sy": "โชนา",
    "2D9a6": "ลืมรหัสผ่าน?",
    "2D9qdk6": "ปลอดภัยเพียงพอหรือไม่?",
    "2IF6A": "ดูเหมือนว่า forge save storage จะประสบปัญหาบางอย่าง",
    "2JyFN": "คัดลอกผลลัพธ์ไปยังคลิปบอร์ด",
    "2Ocbey": "เวอร์ชัน",
    "2RhAT": "ดูเหมือนว่ากระบวนการฟอร์จดึงข้อมูลจะประสบปัญหาบางอย่าง",
    "2Ruh6": "สร้างบัญชีท้องถิ่นใหม่",
    "2S5ap": "สลับโหมดเต็มหน้าจอ",
    "2Y1mR": "ล้างข้อความ",
    "2bqHk": "โหลดจากไฟล์",
    "2e4fb7": "อิกโบ",
    "2giYv": "ทดสอบรหัสผ่าน: {0}",
    "2khdsv": "ปาสโต้",
    "2lehqwp": "ภาษาเวียดนาม",
    "2lhcqwp": "ภาษาตุรกี",
    "2lhqqwp": "ชาวอินโดนีเซีย",
    "2lhqqwqp": "มาเลย์",
    "2lhqwwp": "แบบไทย",
    "2qdin8": "กรุณากรอกรหัสยืนยัน",
    "2tib5m": "ภาษาสวีเดน",
    "2ybu7j": "ภาษานอร์เวย์",
    "30eo2v": "คุชราต",
    "32D9a6": "สร้างบัญชี",
    "33RXi": "คำขอถูกปฏิเสธเนื่องจากพารามิเตอร์ที่ไม่น่าพอใจ",
    "346qid": "ภาษารัสเซีย",
    "39dsCt": "คุณจะได้รับการแจ้งเตือนล่าสุดจากบริการแอพหากมี",
    "3ii2tt": "เกลิคสกอต",
    "3umnB": "โทเค็นที่ไม่รู้จัก",
    "441oja": "จอร์เจีย",
    "44Ntqw-": "จัดการการดำเนินงาน",
    "46bksi": "ลิทัวเนีย",
    "4K_vhq": "ทำซ้ำแท็บนี้",
    "4PIqD": "รีวิวโค้ด",
    "4UYIJ": "ยังไม่แล้วเสร็จ.",
    "4cGA_": "กำลังดึงข้อมูลสำหรับการตั้งค่าระบบ...",
    "4kKe4": "รหัสผ่านของคุณ",
    "4tqb4x": "ภาษาฮังการี",
    "4vdfwf": "ตกลง",
    "4wlih": "คำขอถูกปฏิเสธเนื่องจากพารามิเตอร์ที่ไม่น่าพอใจ",
    "52OiQ": "คัดลอก {0} ครั้ง",
    "54cwb": "System Websocket API พบข้อผิดพลาด: {0}",
    "56ibcj": "ภาษาเวียดนาม",
    "58HQX": "หากคุณไม่ทราบคุณค่าของมัน โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอรายละเอียดเพิ่มเติม ซึ่งสามารถพบได้ในการตั้งค่าของเขา",
    "5BOhl": "รหัสการเชิญ",
    "5Ih2u": "เครื่องมือนาวิเกเตอร์",
    "5NCPT": "โหมดมืด",
    "5NJeGsu1": "อีเมล คุณสามารถจัดระเบียบกล่องจดหมายของคุณ เขียนและส่งข้อความ และติดตามการติดต่อสื่อสารของคุณได้อย่างง่ายดาย ถึงตอนนี้จะใช้เป็นเครื่องมือสื่อสารระหว่างผู้ใช้กับทีมงานของเราเท่านั้น",
    "5NJeddqGsu1": "ส่วนนี้ประกอบด้วยเอกสารเกี่ยวกับคอมพิวเตอร์ บทความ wiki คู่มือการใช้งาน และอื่นๆ",
    "5NJedqddqGsu1": "ส่วนนี้ประกอบด้วยทรัพยากรคอมพิวเตอร์ที่สามารถใช้ในการสร้างโครงการของคุณเอง",
    "5Perd": "ขออภัย ฟังก์ชัน 'ใช้ตัวแก้ไขอัจฉริยะ' ยังไม่พร้อมใช้งาน เรายังคงดำเนินการเพื่อนำไปปฏิบัติ ขอขอบคุณสำหรับความอดทนของคุณ.",
    "5ZBYR": "กลับ",
    "5dF7o": "รีเฟรช",
    "5eXVS": "เนื้อหาสคริปต์",
    "5ggegx": "เกาหลี",
    "5q-Zxqa": "ผู้จัดการสคริปต์",
    "5qPOJL": "เพื่อสนับสนุน LafTools ลองพิจารณาให้ดาวแก่พื้นที่เก็บข้อมูลของเราบน GitHub หรืออัปเกรดเป็นเวอร์ชันมืออาชีพผ่านการสมัครสมาชิกรายเดือน เราขอขอบคุณสำหรับความช่วยเหลือของคุณเป็นอย่างยิ่ง และเราสัญญาว่า LafTools จะดียิ่งขึ้นไปอีกด้วยเงินทุนที่ระดมทุนได้",
    "5qV5Sf": "ลบบันทึกนี้ออกจากรายการ",
    "5rg5mt": "มาลากาซี",
    "5srFq": "ลาฟทูลส์",
    "5v8jl7": "ม้ง",
    "6AumW": "การดำเนินการเริ่มต้น",
    "6ClPV": "สร้าง",
    "6hsnqWe": "แม้ว่า LafTools จะให้บริการฟรีและเป็นโอเพ่นซอร์ส แต่การบำรุงรักษายังคงต้องใช้เวลาและพลังงานเป็นจำนวนมาก โดยเฉพาะอย่างยิ่ง เราต้องการเงินทุนเพื่อชำระค่า Cloud API บางอย่าง หากคุณชื่นชอบ LafTools โปรดพิจารณาสนับสนุนเรา",
    "6j13s3": "ไอซ์แลนด์",
    "6qT9d-N": "สำหรับโน้ตบุ๊ก LafTools ไม่เพียงแต่จัดเตรียมตัวจัดการคำสั่งเชลล์เท่านั้น แต่ยังจะเพิ่มเครื่องมือบันทึกย่ออันทรงพลังเข้าไปในอนาคตอันใกล้นี้ เช่น MarkDown, Latex, {0} และอื่นๆ",
    "6ulj8i": "เนปาล",
    "6yOXx": "ชื่อที่ไม่รู้จัก",
    "71x7x": "ซอร์สโค้ดบน GitHub",
    "7MOO1": "เข้าสู่ระบบ",
    "7dm0d8": "จีนดั้งเดิม",
    "7g5w22": "ภาษานอร์เวย์",
    "7k56u3": "กาลิเซีย",
    "7q40W": "ไม่สามารถเริ่มต้นผู้ดูแลระบบได้",
    "7u4vzu": "สโลวัก",
    "7x3f6": "แท็บ - 1",
    "82r0C": "จัดการรายการสิ่งที่ต้องทำของคุณและทำสิ่งต่าง ๆ ได้อย่างมีประสิทธิภาพมากขึ้น",
    "83dNp": "ไม่สามารถโหลด ID ส่วนขยายได้ (อ้างอิง: 1dl1f)",
    "8LdRj": "ภาพรวม",
    "8LdRjq": "คำนวณ",
    "8LdevRj": "บริการ",
    "8M1wY": "สถานีท้องถิ่น",
    "8eeL1Kk": "เกี่ยวกับ",
    "8mn_qa": "กำลังดึงข้อมูลจากบริการเทอร์มินัล...",
    "8qzWJu": "ขออภัย ขณะนี้เรายังไม่รองรับอุปกรณ์หน้าจอขนาดเล็ก โปรดใช้พีซีเพื่อเข้าชมหน้านี้",
    "8veXac": "เวลาเป็นทรัพยากรที่มีค่าที่สุด จัดการมันอย่างชาญฉลาด",
    "97um9v": "ฮาวาย",
    "9Xv8-": "บันทึกเป็นหมายเหตุ",
    "9_qaj": "ออกจากแบบฟอร์มนี้",
    "9a335": "โปรดคลิกรายการส่วนขยายใดๆ ในเมนูแรกด้านซ้าย รายการปัจจุบันว่างเปล่าหรือไม่ถูกต้อง",
    "9e4fcl": "ทมิฬ",
    "9eZHM": "อ๊ะ! ดูเหมือนว่าเราพบคำเตือนหรือข้อผิดพลาดบางประการ",
    "9gqo8x": "ลัตเวีย",
    "9m85mf": "เซโซโท",
    "9qy1xn": "โปรตุเกส",
    "9tbbkt": "ภาษาฟินแลนด์",
    "9zCSc": "ไม่มีพื้นที่ทำงานที่พร้อมใช้งาน",
    "A69UZ": "ตัวแปร",
    "AW9N8": "ภูมิภาคอินพุต",
    "AfPC0": "รหัสผ่านข้อความธรรมดาของคุณ",
    "Ahrjc": "ไม่มีไดเร็กทอรี คุณต้องการสร้างไดเร็กทอรีนี้หรือไม่?",
    "AkXgF": "อยู่ระหว่างดำเนินการ: {0}%",
    "Apx8D": "จะรีเซ็ตรหัสผ่านของคุณด้วยตนเองได้อย่างไร?",
    "B0s0z": "วัตถุประสงค์ของหน้านี้:",
    "BGd7P9": "การดำเนินการนี้จะเข้ารหัสข้อมูลดิบลงในสตริง ASCII Base64",
    "BShq3M": "ปัญหา",
    "BW3bpT": "กำลังอ่านไฟล์จากดิสก์...",
    "Bd9h-": "เพิ่มลงในคอลเลกชั่นโปรดของฉัน",
    "BuihG": "การตั้งค่าระบบ",
    "CEv8B": "คุณแน่ใจที่จะลบบันทึกนี้หรือไม่? หากใช่ ให้คลิกปุ่มนี้อีกครั้ง",
    "CVUl0": "ลาฟทูลส์",
    "CWohyqde": "เครื่องมือ",
    "CWoqhy": "รายการ Exts ตาม CategoryID ที่เลือก",
    "CfZAX": "ไฟล์ {0} ที่เลือก เรากำลังอัปโหลดไปยังบริการหลัก",
    "CidOqAZ": "ในฐานะผู้สร้าง LafTools ฉันรู้สึกประทับใจมากที่คุณยินดีสนับสนุนเรา เรามีคนดีๆ ในทีมที่ทำงานอย่างหนักเพื่อปรับปรุง LafTools อย่างต่อเนื่อง",
    "Cide2w": "เพื่อดูว่ามีปัญหาใดๆ ในขณะที่ดำเนินการหรือไม่",
    "DIQFq": "โปรดตรวจสอบว่ามีการให้พารามิเตอร์ URL อย่างถูกต้องหรือไม่ ดูเหมือนว่าคุณไม่ได้รับอนุญาตให้กรอกแบบฟอร์มนี้ ตามค่าเริ่มต้น คุณจะสามารถดูข้อความด้านล่างในผลลัพธ์ของการบริการเมื่อเพิ่งเปิดตัว",
    "DIweGq": "รักษาความปลอดภัย LafTools ของคุณ",
    "DTTPW": "รีเซ็ตสถานะ",
    "DVoKw": "ออกจากระบบนี้",
    "DadYp": "การดีเด้งแบบเรียลไทม์",
    "DrXAq": "ยินดีต้อนรับสู่การใช้ LafTools!",
    "DrbEr": "รหัสผ่านที่คุณระบุว่างเปล่า โปรดตรวจสอบและลองอีกครั้ง",
    "DtlAc": "กำลังโหลดทรัพยากรระบบ",
    "Dxlw0": "สมบูรณ์",
    "E62ej": "คำสั่งเชลล์กรอง",
    "E6F9B": "เพิ่มลงในขั้นตอนการทำงาน",
    "ERK7E": "หากคุณพบปัญหาใด ๆ หรือมีข้อเสนอแนะใด ๆ ในขณะที่ใช้ LafTools โปรดติดต่อเราผ่านทางอีเมลหรือ GitHub ได้ตลอดเวลา เรายินดีที่จะช่วยเหลือคุณ",
    "EgBXL": "เลือกหรือระบุแท็ก",
    "Ewvgo": "ยังไม่ได้เริ่ม.",
    "ExqvX": "รายการคีย์ลัด",
    "Eyq856": "เรายังไม่เสร็จสิ้น - เรามุ่งมั่นที่จะนำเสนอคุณสมบัติใหม่ล่าสุดและดีที่สุด และเราจะเผยแพร่การอัปเดตต่อไปเพื่อให้แน่ใจว่าคุณได้รับประสบการณ์ที่ดีที่สุด",
    "F-OUm": "การตั้งค่าด่วนสำหรับ LafTools",
    "F0CCF": "รายการคีย์ลัด",
    "F4uS2": "ไฟล์ใหม่",
    "FBVyc": "กรุณาใส่รหัสยืนยันอีกครั้ง",
    "FDlRI": "ตั้งชื่อแท็บใหม่นี้แล้วคลิกเพื่อยืนยัน",
    "FOyHW": "ค้นหาทุกที่",
    "FQzhg": "ละเว้นอินพุตที่ว่างเปล่า",
    "FhVWl": "เข้ารหัสรหัสผ่านของคุณ",
    "FjYbR": "เอาท์พุต",
    "Fv-zz": "คัดลอกผลลัพธ์",
    "Fy217": "กำหนดค่าเครื่องมือนี้",
    "Fzp3t": "ให้คุณค่า",
    "G3MJN": "แสดงแผงเอาท์พุต",
    "G9QVo": "จัดการแท็บ",
    "GR7jK": "พิมพ์",
    "Ggob_": "ยกเลิก",
    "H-Ae75": "โปรดยืนยันรหัสผ่านท้องถิ่นของคุณ",
    "H-qA75": "กรุณาระบุรหัสผ่านท้องถิ่น",
    "H8fQ4": "สลับเป็นโหมดสว่างหรือมืด",
    "HEAhr": "หลังจากแปลแล้ว ผลลัพธ์จะปรากฏที่นี่",
    "HIc3c": "สมบูรณ์",
    "HNDat": "หากต้องการเปลี่ยนแปลง โปรดคลิกปุ่ม \"{0}\" หรือคลิก \"{1}\" เพื่อใช้การเปลี่ยนแปลงของคุณ ขอให้คุณมีช่วงเวลาที่ดีกับกล่องเครื่องมือนี้!",
    "Hflf2": "เพื่อความปลอดภัยทางไซเบอร์ เราจะไม่ช่วยรีเซ็ตรหัสผ่านของคุณผ่าน API หรือเพจต่างๆ ที่นี่ เว้นแต่คุณจะอัปเดตไฟล์ที่ป้องกันระบบด้วยตนเอง",
    "HjvV3": "เราจะไม่ลบไฟล์บนดิสก์ เพียงลบบันทึกนี้ออกจากรายการ",
    "HyIC_": "เครื่องหมายทับ (/)",
    "HyIC_d": "เครื่องหมายทับ (/)",
    "I8FLi": "ตอนนี้ถึงเวลาตั้งค่าผู้ดูแลระบบของคุณแล้ว โปรดตั้งรหัสผ่านให้ซับซ้อนที่สุดเท่าที่จะทำได้ เพื่อที่คุณจะได้สามารถสร้างความสับสนให้กับผู้โจมตีที่ไม่สุภาพเหล่านั้นได้",
    "IAC0A": "เครื่องมือค้นหา",
    "ICefi": "ยกเลิก",
    "IKqqATS": "รีเฟรชข้อมูลหน้าปัจจุบัน",
    "IOOrz": "(จะเป็นอันตรายต่อระบบของคุณหรือไม่? เราไม่คิดเช่นนั้น ตราบใดที่คุณสามารถแก้ไขไฟล์กำหนดค่าที่สงวนไว้ของระบบได้ นั่นหมายความว่าคุณจะได้รับสิทธิ์ในการอ่านทุกอย่างเกี่ยวกับไฟล์ข้อมูล LafTools)",
    "IWUH5": "แสดงตัวอย่าง",
    "IaSyO": "ยกเลิก",
    "IfsGO": "รายการโปรด",
    "IfsdGO": "รายการโปรด",
    "ImUmf": "ใหม่",
    "J-3KA": "โปรดระบุชื่อสคริปต์นี้ ซึ่งจะมีประโยชน์มากกว่า",
    "J164i": "เช่น. คัดลอกไฟล์ไปยังเซิร์ฟเวอร์ระยะไกล",
    "J2xoL": "โปรดดูข้อผิดพลาด: {0}",
    "JA_Bp": "โปรดระบุชื่อสำหรับแท็กใหม่ในตอนแรก",
    "JQLmS": "ปรับขนาดแล้ว",
    "JQLmSq": "สมบูรณ์.",
    "JTBRh": "LafTools เก็บค่ารหัสผ่านไว้ในไฟล์ในเครื่อง แต่ไม่ต้องกังวล เราได้นำกลไกการเข้ารหัสรหัสผ่านทางเดียวมาใช้ กล่าวคือไม่มีใครสามารถอ่านรหัสผ่านของเวอร์ชันข้อความธรรมดาได้ หากต้องการรีเซ็ตรหัสผ่าน โปรดปฏิบัติตามเครื่องมือด้านล่างเพื่อรีเซ็ตรหัสผ่านด้วยตนเอง",
    "JYqxz2": "ยินดีต้อนรับสู่ LafTools นี่เป็นเวอร์ชันภายใน",
    "JfFHw": "รับคำขอข้อมูลพื้นที่ทำงาน",
    "K1qJZI": "ยินดีต้อนรับสู่ LafTools ฯพณฯ",
    "KGS2-": "เมื่อคุณทำตามขั้นตอนข้างต้นเสร็จแล้ว คุณสามารถใช้รหัสผ่านใหม่เพื่อลงชื่อเข้าใช้ระบบของคุณได้ หากคุณไม่สามารถเข้าถึงระบบไฟล์ได้ โปรดขอให้ผู้ดูแลระบบหรือฝ่ายสนับสนุนด้านไอทีของคุณสร้างไฟล์นั้นขึ้นมา หากไฟล์มีอยู่แล้ว ให้ลบออกแล้วสร้างใหม่",
    "KIc63": "ฟังก์ชั่นยังไม่รองรับ",
    "KYh1N": "หมายเหตุทั้งหมด",
    "KmEUF": "ให้ภาพรวมโดยย่อของเครื่องมือระบบปัจจุบัน",
    "Kw4OJr": "เทอร์มินัล",
    "Kyd9H": "ซอร์สโค้ดบน GitHub",
    "L-p-Y": "คัดลอกเนื้อหาของคำสั่งเชลล์ปัจจุบันไปยังคลิปบอร์ด",
    "L3zEM": "แสดงตัวอย่าง",
    "L42mxa": "กรุณากรอกข้อความต้นฉบับของคุณในช่องนี้",
    "L49kCq": "โปรดระบุและยืนยันรหัสผ่านล็อคในแบบฟอร์มนี้เพื่อรักษาความปลอดภัย LafTools ของคุณ",
    "L71q_N": "รหัสผ่านที่คุณระบุว่างเปล่า โปรดตรวจสอบและลองอีกครั้ง",
    "LAc1m": "รีเฟรชมุมมองแอป",
    "LFdvM": "ไม่ได้เข้าสู่ระบบ",
    "LM715": "กำลังดึงการกำหนดค่า i18n จาก API เซิร์ฟเวอร์ภายในเครื่อง",
    "LPJrV": "คัดลอกผลลัพธ์",
    "LWaeFqd": "สลับเป็นภาษาที่คุณต้องการ",
    "Le71_N-": "รหัสผ่านที่คุณระบุไม่เหมือนกับรหัสผ่านที่ยืนยัน โปรดตรวจสอบและลองอีกครั้ง",
    "LnJ4H": "โปรดทราบว่าบัญชีท้องถิ่นนั้นไม่เหมือนกับผู้ใช้ที่ลงทะเบียนบนเว็บไซต์ของเราโดยสิ้นเชิง บัญชีแรกถูกกำหนดไว้บนพีซีของคุณเท่านั้น ในขณะที่บัญชีหลังสามารถใช้สำหรับการซิงค์บนคลาวด์ได้",
    "LqWaFd": "การตั้งค่าระบบ",
    "M3ytc": "ถึงฐาน 64",
    "M4ywN1": "เครื่องคิดเลข ปฏิทิน นาฬิกา สภาพอากาศ และอื่นๆ",
    "M6MrW": "ดี",
    "M7jct": "เข้าสู่โหมดเต็มหน้าจอ",
    "MN2lT": "ความยาวของรหัสผ่านต้องไม่น้อยกว่า 6",
    "Ma5mv": "สลับการมองเห็นแท็บแถบเครื่องมือ",
    "Mq9pdpT": "แสดงรายการทรัพยากรที่เกี่ยวข้องทั้งหมดสำหรับเมนูการทำงานที่คุณเลือก",
    "Mq9ppT": "ดูสถานะบริการของคุณอย่างรวดเร็ว",
    "MrgmU": "ยืนยัน",
    "NMLOn": "คัดลอก FilePath",
    "NMLOn1": "เปิดพื้นที่ทำงาน",
    "NNfJo": "โหลดข้อมูลจากไฟล์",
    "Nq1IR": "ไม่สามารถโหลดส่วนขยาย VM ได้",
    "Nqc0LqwX": "หากคุณคิดว่ามีช่องโหว่ในกระบวนการนี้ โปรดติดต่อเราผ่านทางอีเมลหรือ GitHub ได้ตลอดเวลา เราต้องการปรับปรุงโดยด่วน",
    "O02-W": "ไม่โหลด...",
    "O94Yx": "บน",
    "OQWm4": "รายงานข้อผิดพลาด",
    "OSHOI": "ยินดีต้อนรับหน้า",
    "OSqZQM": "รหัสผ่านท้องถิ่น",
    "OeOQY": "ทำ",
    "OpPFe": "หากคุณชอบ LafTools โปรดแชร์กับเพื่อนของคุณและให้ดาวเราด้วย ขอบคุณ!",
    "Opcty": "ไฟล์",
    "OqqGx2qg": "กำลังโหลดทรัพยากรแบบคงที่ โปรดรอสักครู่...",
    "OrCt5": "กำลังเปลี่ยนเส้นทางไปยังโต๊ะทำงาน...",
    "Ot6EP": "เครื่องมือโปแลนด์",
    "P4ROa": "ภูมิภาคเอาท์พุต",
    "PM_N5": "เซสชัน - {0}",
    "PUxuU": "กำลังดึงข้อมูลสำหรับชุดภาษา...",
    "PapkF": "หากคุณมีคำถามหรือข้อเสนอแนะเกี่ยวกับ LafTools โปรดแจ้งให้เราทราบ เรามองหาวิธีปรับปรุงผลิตภัณฑ์ของเราและมอบประสบการณ์ที่ดีที่สุดให้กับผู้ใช้ของเราอยู่เสมอ คุณสามารถติดต่อเราได้ที่ work7z@outlook.com ขอขอบคุณที่ใช้ LafTools!",
    "PpCHA": "รหัสคำถาม(?)",
    "PqazM-": "ก่อนอื่น โปรดใช้การควบคุมแบบฟอร์มด้านล่างเพื่อเข้ารหัสรหัสผ่านของคุณ",
    "QL9Sn": "ในขณะนี้ ดูเหมือนจะไม่มีคำอธิบายให้ใช้งาน",
    "QLKzF": "มันอัดแน่นไปด้วยคุณสมบัติที่ตอบสนองความต้องการของนักพัฒนามือใหม่และนักพัฒนาที่มีประสบการณ์ ทำให้เป็นเครื่องมือที่ต้องมีในคลังแสงของโปรแกรมเมอร์",
    "QM2Ob": "เครื่องมือล่าสุด",
    "QM2Oq": "หมายเหตุล่าสุด",
    "QRAdA": "ภาษาอังกฤษเป็นภาษาจีน",
    "QhdpH": "ฉบับชุมชน",
    "QzlA3": "เกิดข้อผิดพลาด",
    "R12bq": "แท็บรายการที่ไม่แสดง",
    "RNBze0": "เครื่องมือ",
    "RNeBze0": "แท็บที่เปิดอยู่",
    "RNewBze0": "การกำหนดค่าเครื่องมือ",
    "RO4ZP": "เกิดข้อผิดพลาด",
    "RPVRl": "ดูเหมือนว่าส่วนขยายนี้เข้ากันไม่ได้กับ LafTools เวอร์ชันปัจจุบัน โปรดพิจารณาติดตั้งเวอร์ชันล่าสุดเพื่อรองรับส่วนขยายนี้ หรือโปรดติดต่อเราโดยแจ้งปัญหาบน GitHub",
    "RhqzcdD": "การตั้งค่าระบบ",
    "RjCO3": "รายการพื้นที่ทำงาน",
    "S4MMV": "อ๊ะ! เราพบปัญหาบางอย่างขณะโหลดไฟล์",
    "SAnnQ": "กำลังโหลดไฟล์ {0}",
    "SBsDz": "ตั้งค่าสำหรับบัญชีผู้ดูแลระบบของคุณ",
    "SGs7B": "ตั้งค่า LafTools ของคุณอย่างรวดเร็ว",
    "SMqD13": "ป้อนเพื่อกรอง",
    "SPem9": "สนามนี้ยังไม่พร้อม",
    "SQAw7": "ภาษาต้นฉบับ",
    "SYSq1": "ตัวอย่าง",
    "SZgXb": "ตั้งค่ารหัสผ่านท้องถิ่น",
    "SdGcT": "ส่วนอื่นๆ",
    "Sm9tq": "กรุณาระบุรหัสผ่านบัญชีที่นี่",
    "Sm9tqq": "กรุณาระบุรหัสผ่านเพื่อปลดล็อค LafTools ของคุณ",
    "Spcfdee": "โหมดสว่างหรือมืด",
    "TBPqy7": "ภาษา",
    "TD7DA": "ภาษา",
    "TNoePE": "LafTools คลาวด์",
    "Ttrqqet": "เขียนและบันทึกความคิดของคุณที่นี่!",
    "TwFcr": "ภาษาเป้าหมาย",
    "TyqvWY3": "ไฟล์ในเครื่อง",
    "U4qqq9": "ลบแท็บนี้ออกจากรายการ",
    "U7zP2": "กรุณาระบุชื่อผู้ใช้บัญชีที่นี่",
    "UF_Dp": "เกิดข้อผิดพลาด: {0} เวลาที่ปฏิเสธคือ {1}",
    "UU_7h": "กรุณาคลิกรายการหมวดหมู่ใดๆ บนเมนูแรกด้านซ้าย หมวดหมู่ปัจจุบันว่างเปล่าหรือไม่ถูกต้อง",
    "UZ2Ig": "บัญชีท้องถิ่นใหม่",
    "Ugpng": "ที่ชื่นชอบ",
    "V6U_f": "เงื่อนไขการให้บริการ",
    "V6XEO": "กรอกชื่อผู้ใช้หรืออีเมล",
    "VAZq8r": "ช่วยให้นักพัฒนาสามารถรันคำสั่งต่างๆ เช่น การรันสคริปต์ การติดตั้งแพ็คเกจ และการนำทางระบบไฟล์ ทั้งหมดนี้ทำได้จากภายในตัวแก้ไข",
    "VEfeqZG": "หมายเหตุ",
    "VI6VT": "ประวัติศาสตร์",
    "VOsZc": "รายงานปัญหา",
    "VSZ": "คลิกเพื่อทริกเกอร์อีกครั้ง",
    "VZtqg6": "สร้างแบบฟอร์มสคริปต์ใหม่",
    "Vaf2y": "ชื่อแท็บไม่สามารถเว้นว่างได้",
    "VeY9K": "ข้อกำหนดการใช้งาน",
    "VgG5y": "คลิกที่นี่เพื่อรีเฟรชสถานะของส่วนขยายของคุณ",
    "VjZCv": "การแปลงเรียลไทม์",
    "WPrTW": "เว็บไซต์อย่างเป็นทางการ",
    "WXo6D": "สดชื่น",
    "WYCVL": "การติดตั้งอย่างรวดเร็ว",
    "X4L_Z": "ไม่ได้ระบุส่วนขยาย VM",
    "X6Fq4j": "หลังจากหลายปีของการพัฒนาและปรับแต่งอย่างทุ่มเท เรามั่นใจว่า LafTools สามารถปรับปรุงประสบการณ์การเขียนโปรแกรมของคุณได้อย่างมากโดยนำความสะดวกสบายและประสิทธิภาพมาสู่ขั้นตอนการทำงานของคุณมากขึ้น",
    "XKpI0": "คลิกเพื่อประมวลผลข้อความของคุณในพื้นที่ป้อนข้อมูล",
    "XLWoR": "เลือกอันที่คุณต้องการและดำเนินการต่อ",
    "XQxJB": "พื้นที่ทำงานของฉัน",
    "X_HGx": "LafTools เป็นกล่องเครื่องมืออเนกประสงค์ที่ออกแบบมาเพื่อตอบสนองความต้องการที่หลากหลาย เป็นโอเพ่นซอร์สเต็มรูปแบบ รับประกันความโปร่งใสและความปลอดภัย แม้จะมีรันไทม์เพียงเล็กน้อย แต่ก็ให้การสนับสนุนแพลตฟอร์มเต็มรูปแบบ รวมถึง ARMv8 และการสนับสนุน AI ดั้งเดิมที่คล้ายกับ ChatGPT LafTools ได้รับการผสานรวมกับ UI ที่มีประสิทธิภาพและได้รับการอัปเดตด้วยเครื่องมือใหม่ๆ อย่างต่อเนื่อง สามารถใช้บนเว็บและกับ Docker และให้แหล่งข้อมูลเพิ่มเติม เช่น บันทึกย่อและคู่มือ",
    "XeXF77": "การตั้งค่า",
    "XikdD": "กรุณารอสักครู่ เราเกือบจะถึงจุดนั้นแล้ว!",
    "Y5GAC": "ชื่อผู้ใช้ของคุณ",
    "Y9mQ2": "กรุณาระบุชื่อผู้ใช้บัญชีที่นี่",
    "YAAU3q": "รหัสผ่านท้องถิ่น",
    "YHCjT": "LafTools รองรับธีมแสงและความมืดทั่วโลก ซึ่งมีประโยชน์โดยเฉพาะกับผู้เขียนโค้ดกะกลางคืน",
    "YNwKz": "ภาษาที่ไม่สนับสนุน: {0} จะใช้ภาษาอังกฤษเป็นค่าเริ่มต้น",
    "YOYTp": "การติดตั้งอย่างรวดเร็ว",
    "YPPPL": "สลับการมองเห็นแท็บแถบเครื่องมือ",
    "YQN9u": "เกิดข้อผิดพลาดขณะโหลด {0} โปรดตรวจสอบรายละเอียดด้านล่าง",
    "Y_k0z": "ลืมรหัสผ่าน?",
    "Ye3TXses": "เพื่อกำหนดค่าว่าการแปลงจะดำเนินการโดยอัตโนมัติหรือไม่เมื่อข้อความที่ป้อนมีการเปลี่ยนแปลง",
    "YquQqTXq": "วิ่งอัตโนมัติ?",
    "YrTdq": "ทั้งหมด",
    "YrVq683": "จดหมาย",
    "YrVqdd683": "คู่มือ",
    "Z2QTU": "เกี่ยวกับ",
    "Z3rhY": "ข้อความ",
    "Z7ALO": "สลับไปยังพื้นที่ทำงานที่เลือก",
    "Z7OTt": "ไฟล์ที่คุณเลือกมีขนาดใหญ่เกินไป โปรดเลือกไฟล์ที่มีขนาดน้อยกว่า 30MB",
    "ZAGva": "คุณแน่ใจหรือว่าจะลบพื้นที่ทำงานนี้",
    "ZAKaFq": "บัญชีคลาวด์ของฉัน",
    "ZW1Dgz": "ไม่มีข้อความที่ใช้ได้",
    "ZXRGC": "โปรดดูข้อผิดพลาด: {0}",
    "ZbD3F": "{0} สร้างขึ้นโดยทีมงาน LafTools",
    "ZrbduC": "ปิดแท็บทั้งหมด",
    "ZrbuC": "ปิดแท็บ",
    "_5OqeG": "ยกเลิกการทำเครื่องหมาย",
    "_LFF3": "หากคุณประสบปัญหาใด ๆ หรือมีข้อเสนอแนะใด ๆ ในขณะที่ใช้ LafTools โปรดติดต่อเราผ่านทางอีเมลหรือ GitHub ได้ตลอดเวลา เรายินดีที่จะปรับปรุง",
    "_trez": "สลับข้อความ",
    "_trqL": "กำลังดึงข้อมูลสำหรับทรัพยากรระบบ...",
    "_z3lR": "รีเฟรชโค้ด",
    "a3yqoz": "เปอร์เซีย",
    "a3z-3k12": "เครื่องมือที่อยู่ IP",
    "a4jbpq": "เช็ก",
    "aCkOP": "ออก",
    "aHAfR": "กำลังเรียกข้อมูลสำหรับ {0}...",
    "aSOpr": "เครื่องสร้างแบบจำลองข้อมูล",
    "about_LafTools_toolbox": "เกี่ยวกับ ลาฟทูลส์",
    "adpgq": "สร้างพื้นที่ทำงานใหม่",
    "ah-C4": "หมายเหตุใหม่",
    "aj3nhd": "เยอรมัน",
    "aked6": "อ้างอิง",
    "aked61": "การแนะนำ",
    "asElV": "ลบ",
    "az4uS2": "คุณแน่ใจหรือว่าจะออกจากระบบนี้? โปรดทราบว่าคุณจะถูกเปลี่ยนเส้นทางไปยังหน้าเข้าสู่ระบบ",
    "azpNX": "สมบูรณ์.",
    "b0qjSL": "โปรดป้อนไดเร็กทอรี {1} และสร้างไฟล์ {2} ใส่รหัสผ่านที่เข้ารหัสของคุณเป็นเนื้อหาไฟล์ทั้งหมด",
    "b6sx9b": "ฟิลิปปินส์",
    "bP_6qG": "เคล็ดลับสำหรับการลืมรหัสผ่านของคุณ",
    "bT4R6": "แท็บใหม่",
    "bVlBN": "จีนเป็นอังกฤษ",
    "bhojei1": "จีนดั้งเดิม",
    "bjZyW": "แปลภาษา",
    "bors14": "ภาษาตุรกี",
    "bp_-b": "หากต้องการจัดการ LafTools อย่างสมบูรณ์ คุณต้องตั้งค่าผู้ดูแลระบบของคุณที่จุดเริ่มต้นของขั้นตอนการตั้งค่า เราได้ตรวจสอบการระบุตัวตนของคุณด้วยโทเค็นพารามิเตอร์ URL แล้ว โปรดมั่นใจได้ว่าไม่มีใครสามารถตั้งค่าการอนุญาตรูทของคุณได้ เว้นแต่เขาหรือเธอจะได้รับโทเค็นการตั้งค่า",
    "bqqrij": "สวาฮีลี",
    "c0eCw": "แปลข้อความของคุณเป็นภาษาใดก็ได้ที่คุณต้องการ",
    "c5meku": "ซุนดา",
    "c7Uoqqe": "ก่อนที่จะใช้ LafTools โปรดระบุและยืนยันรหัสผ่านในเครื่องของคุณตามด้านล่างนี้",
    "cNQp_": "ทรัพยากร",
    "cPS6q": "เครื่องมือทั้งหมด",
    "cQqwI8r": "กำลังโหลดสถานะของบริการเทอร์มินัล",
    "cfYYN": "ค้นพบเพิ่มเติม",
    "cj1pd": "รีเฟรชการดำเนินการ",
    "cjzqj9": "บอสเนีย",
    "cmxzpg": "มาลายาลัม",
    "coM2I": "ใช้ตัวแก้ไขอัจฉริยะ",
    "crD7I": "เพื่อกำหนดค่าว่าการแปลงควรละเว้นข้อความอินพุตว่างที่มีความยาวเป็นศูนย์หรือไม่",
    "cuRCb": "ไม่พบหมวดหมู่",
    "cuRCqb": "ไม่มีหมวดหมู่",
    "cxqhqa": "เมียนมาร์ (พม่า)",
    "d-l2l": "ยืนยัน",
    "d-qPr": "รูปแบบที่ไม่รู้จัก: {0}",
    "d5KZH": "ขอขอบคุณที่ใช้ LafTools!",
    "d5LAU": "ได้รับอนุญาตภายใต้ AGPLv3",
    "d5fmq2": "ภาษาอิตาลี",
    "d5hit": "เซสชัน - {0}",
    "d5x1rl": "สเปน",
    "dCFIC": "โค้ดสวยกว่า",
    "dCFIwC": "เครื่องกำเนิดรหัส",
    "dGKMx": "เอาท์พุต",
    "dGVUB": "เครื่องมือเครือข่าย",
    "dV5Eq": "รีเฟรชรายการพื้นที่ทำงาน",
    "dk122q": "จัดการขั้นตอนการทำงานของคุณเพื่อรวมเครื่องมือต่างๆ เข้าด้วยกัน",
    "dkarh": "โอเค กล่องเครื่องมือเปิดไดเร็กทอรี หากไม่มีหน้าต่างป๊อปอัป โปรดตรวจสอบว่าแพลตฟอร์มของคุณรองรับฟังก์ชันนี้หรือไม่ หรือไดเร็กทอรีอยู่ในเซิร์ฟเวอร์",
    "dkjk12": "นี่คือการทดสอบ",
    "dkkq12": "กำหนดค่าเครื่องมือของคุณในแท็บนี้",
    "dl4kr": "ลืมรหัสผ่าน?",
    "dpRY4": "พจนานุกรม",
    "dqTqyvWY": "เมนูลิ้นชัก",
    "dsdpA_eJ": "ปรับขนาด",
    "dtjdt4": "คาซัค",
    "dxLQq": "การอนุญาตรูต",
    "dzjTo": "กรุณาระบุรหัสผ่านบัญชีที่นี่",
    "e--gB": "ไม่ได้ระบุรหัสส่วนขยาย",
    "e5rycw": "คีร์กีซ",
    "e8Crq": "กรุณากรอกชื่อผู้ใช้และรหัสผ่านด้านล่างเพื่อดำเนินการต่อ",
    "eTmq": "ประวัติความเป็นมาของกล่องเครื่องมือ CodeGen",
    "e_8pZ": "กล่องเครื่องมืออเนกประสงค์สำหรับนักพัฒนาเพื่อปรับปรุงประสิทธิภาพการทำงาน",
    "ediql2": "ภาษาฮังการี",
    "eifoni": "คาตาลัน",
    "eqkqd4W": "โปรดระบุชื่อสำหรับแท็กใหม่",
    "etV-l": "คัดลอกไฟล์ไปยัง SIT2",
    "eu5mh0": "เบลารุส",
    "euaI8": "สร้างบัญชีท้องถิ่นใหม่",
    "euhy9v": "เอสโตเนีย",
    "f3ttw8": "ชาวเมารี",
    "f5bLC": "เอกสารประกอบ",
    "f7akol": "ภาษาอังกฤษ",
    "fBP5h": "ชื่อผู้ใช้",
    "fEr5j": "สร้างสคริปต์ใหม่",
    "fV_1P": "เข้าสู่ระบบ",
    "fdxluz": "โรมาเนีย",
    "ff02c": "ยกเลิก",
    "fgj880": "เตลูกู",
    "fqV_1P": "ปลดล็อค LafTools ของคุณ",
    "g2_aX": "คัดลอกรหัสผ่านที่เข้ารหัสลงในไฟล์",
    "g5SK9": "เปิดล่าสุด",
    "gDjbs": "ข้อมูลทางประวัติศาสตร์",
    "gK3dNQ": "สำเนา",
    "gQhfS": "เครื่องมือไฟล์",
    "gkC8t": "ฐาน64",
    "gkqC8t": "ฐาน32",
    "gnKMZ": "สดชื่น",
    "gsHQM": "โหลดข้อมูลตัวอย่างเรียบร้อยแล้ว",
    "h6AeI": "การเชื่อมต่อ Websocket ปิดเมื่อ {0}",
    "hJUMN": "ภาษาเป้าหมาย",
    "hMvh1": "ฐานข้อมูลสำรอง",
    "hRFxV": "สำหรับข้อมูลเพิ่มเติม กรุณาเยี่ยมชมเว็บไซต์ของเรา",
    "hcnt1k": "มาซิโดเนีย",
    "hhOT3": "ค้นหาตามชื่อ",
    "htt1d2": "เอสเปรันโต",
    "hu-iz": "ตัวจับเวลา",
    "huE6U": "ตัวแปร",
    "hyV-d": "เสร็จแล้ว",
    "hyirc0": "ภาษาสวีเดน",
    "i27qmr": "ฟริเซียน",
    "i6hMN": "รหัสยืนยันรูปภาพ",
    "i88tb": "ส่งออกผลลัพธ์เป็นไฟล์",
    "i8q8tb": "กำหนดค่าเวิร์กโฟลว์สำหรับการป้อนข้อมูล",
    "iNQvo": "แสดงตัวอย่างเพื่อเริ่มต้นด้วย",
    "iNqF1T": "จัดการบัญชีคลาวด์",
    "iQL2c": "เรายังคงสำรวจฟังก์ชันทั้งหมดสำหรับปุ่มนี้ หากคุณมีข้อเสนอแนะหรือข้อเสนอแนะเกี่ยวกับวิธีที่เราสามารถปรับปรุงได้ โปรดแจ้งให้เราทราบ!",
    "i_lang_": "ชุดภาษา",
    "ib135dq": "ข้อความสถานะของคุณจะแสดงที่นี่",
    "iknTS": "ผู้จัดการรหัสผ่าน",
    "init_env": "กำลังโหลดทรัพยากรระบบ",
    "ip2g1": "คัดลอกแล้ว",
    "ipOSQE": "รุ่นโปร",
    "it8ths": "ชาวอินโดนีเซีย",
    "ixyP0": "ประมวลผลการดำเนินการแบบเรียลไทม์โดยอัตโนมัติ",
    "jJuNz": "ภาษาต้นฉบับ",
    "jO5eP": "ตกลง",
    "jOXj0": "ขออภัย มีบางอย่างผิดพลาด",
    "jPNCb": "ลองใหม่แล้ว",
    "jQXdi": "โหมดแสง",
    "jR1zX": "เอไอ แล็บ",
    "jaj7M": "สงวนลิขสิทธิ์.",
    "jb392": "ชื่อ",
    "jfpqt": "ตัวนำทางหมายเหตุ",
    "jlxvpk": "เกาหลี",
    "k17PG": "การเชื่อมต่อ Websocket ปิดแล้ว",
    "k1k239q": "โปรดโหลดหน้าซ้ำหรือรีสตาร์ทแอปเพื่อใช้การเปลี่ยนแปลงนี้",
    "k2SVY": "ปิด",
    "k2ku5p": "เช็ก",
    "k41a5": "ลาฟทูลส์",
    "k4s5rx": "ภาษาสโลเวเนีย",
    "kLH79": "อีเมล",
    "kOi5A": "พิมพ์หน้า",
    "kPD22": "พจนานุกรม",
    "kPJ-A4": "รีเฟรช",
    "kcHxr": "กรุณาระบุชื่อผู้ใช้บัญชีผู้ดูแลระบบที่นี่",
    "kjks1": "กำลังดึงการกำหนดค่า i18n จาก API เซิร์ฟเวอร์ภายในเครื่อง",
    "kqv5ht": "ภาษายิดดิช",
    "krxSK": "ผู้ช่วยเอไอ",
    "ks12d": "ความปลอดภัยทางไซเบอร์",
    "kv4wag": "ภาษาดัตช์",
    "l3akoa": "อัมฮาริก",
    "l6Djb": "เลือกหนึ่งในตัวเลือกเป็นธีมที่คุณต้องการ:",
    "lIn3_": "ชื่อผู้ใช้ของผู้ดูแลระบบ",
    "lQFII": "ทริกเกอร์การเริ่มต้นอีกครั้ง",
    "lRHDQ": "ออกจากโหมดเต็มหน้าจอ",
    "lUh5c": "ทั่วไป",
    "lkuulh": "ภาษาฝรั่งเศส",
    "lp0qmd0": "ทำเครื่องหมายว่าเป็นรายการโปรด",
    "lpKAz": "การตั้งค่า",
    "lpzg83": "ซามัว",
    "lzGS2": "รายละเอียดส่วนขยาย",
    "m0106": "ตัวแปลง",
    "m0107": "เครื่องกำเนิดไฟฟ้า",
    "m0108": "ฟอร์แมตเตอร์",
    "m7WZw": "ระบบ Websocket ใช้งานไม่ได้",
    "m8rTc1": "เมื่อใช้งานตัวจัดการเชลล์สคริปต์แล้ว คุณจะสามารถใช้เพื่อจัดการคำสั่งเชลล์ของคุณได้",
    "mBgF1": "การกระทำของเมาส์",
    "mSFei": "ซอร์สโค้ดบน GitHub",
    "mWXeh": "รหัสพื้นที่ทำงาน: {0}",
    "mabHq": "ค้นหาไฟล์เก่า",
    "mbzCv": "เกิดข้อผิดพลาด: {0} เวลาที่ปฏิเสธคือ {1}",
    "mihc3": "เสร็จสิ้นการดำเนินการนี้",
    "mjHoR": "นอกจากนี้ ในทางเทคนิคแล้ว ไม่มีใครสามารถอ่านโทเค็นนี้ได้ ไม่เช่นนั้นเขาจะโจมตีและควบคุมคอมพิวเตอร์ของคุณ",
    "mnb19i": "เยอรมัน",
    "mslw4o": "กรีก",
    "mwn7iv": "ซูลู",
    "myxedr": "มองโกเลีย",
    "n1jA9": "ยืนยัน",
    "n24tes": "โปรตุเกส (บราซิล)",
    "n94an4": "ขัด",
    "n98EW": "สลับข้อความของภูมิภาคอินพุตและภูมิภาคเอาต์พุต",
    "nSeIq8-": "และที่สำคัญที่สุดคือเป็นบริการฟรีและโอเพ่นซอร์ส คุณสามารถใช้มันเพื่อวัตถุประสงค์ส่วนตัวหรือเชิงพาณิชย์ของคุณ",
    "nTvw4": "เพื่อปกป้องและบันทึกข้อมูลและการตั้งค่าของคุณแยกกัน คุณสามารถใช้บัญชีท้องถิ่นของคุณเพื่อบรรลุเป้าหมายดังกล่าว นอกจากนี้ LafTools จะรองรับวิดเจ็ตข้อความโต้ตอบแบบทันทีในหมู่ผู้ใช้ในอนาคต",
    "nmb1wx": "โยรูบา",
    "nrix6l": "ชิเชวา",
    "nxJC7": "การดำเนินการเริ่มต้นที่จะดำเนินการเมื่อดำเนินการหม้อแปลงไฟฟ้า",
    "o1umzi": "ภาษาฝรั่งเศส",
    "o52xW": "ส่งออก",
    "o8xyzu": "ภาษาลักเซมเบิร์ก",
    "oBz8D": "กำลังโหลด",
    "oNLxH": "ชื่อผู้ใช้",
    "oNg3f": "เว็บไซต์อย่างเป็นทางการ",
    "ocxsw3": "ไอริช",
    "of_ox": "โดยรวมแล้ว LafTools เป็นโซลูชั่นแบบครบวงจรสำหรับทุกความต้องการของคุณ",
    "oj23X": "กู้คืนฐานข้อมูล",
    "ooiFU": "เริ่มบริการ Java ใหม่",
    "oqHqVq": "เรียงตาม",
    "oqHqqV": "ทั้งหมด: {0} คำสั่ง",
    "oqHqqVq": "คัดลอกไทม์ส",
    "oqjbcj": "ลาว",
    "os8h6u": "ภาษาเดนมาร์ก",
    "p8Exxc1s": "มีเครื่องมือมากมายที่ใช้ประโยชน์จากเทคโนโลยี AI เพื่อทำงานอย่างมีประสิทธิภาพมากขึ้นในห้องปฏิบัติการ AI",
    "p8Za4": "แสดงตัวอย่างเพื่อดำเนินการ",
    "pANmj": "แท็กสามารถกำหนดได้ตามประเภทเซิร์ฟเวอร์ การใช้สคริปต์ หรือเกณฑ์อื่นๆ ที่คุณต้องการ",
    "pA_deJ": "ส่งออกไปยังคลิปบอร์ด",
    "pA_feeJ": "เชื่อมต่อเทอร์มินัลอีกครั้ง",
    "pA_qweJ": "ล้างบัฟเฟอร์",
    "pDBSWq": "ไม่มีเนื้อหาสำหรับแผงด้านขวา",
    "pEk1kk": "LafTools นำเสนอฟังก์ชันการทำงานที่เป็นประโยชน์สำหรับคุณที่นี่",
    "pEk1qkk": "แสดงรายการแท็บที่เปิดอยู่ทั้งหมด",
    "pHZDB": "การดำเนินการแบบเรียลไทม์",
    "pJoOz": "เปิดไฟล์",
    "pKHRT": "ไปที่เครื่องมือ",
    "pKqHRq": "ค้นหาหมายเหตุ",
    "pL6qH": "สมบูรณ์.",
    "ph5jH": "จัดการในส่วนนี้",
    "piih4x": "ทาจิก",
    "pmAee": "อ่านข้อมูลเพิ่มเติมเกี่ยวกับเครื่องมือนี้",
    "pmnp4b": "ภาษายูเครน",
    "ppmz8e": "ชาวเฮติครีโอล",
    "pqs7y3": "โปรดพิจารณาลงทะเบียนหน้าเว็บนี้เป็น PWA เพื่อรับการสนับสนุนคีย์แมปเต็มรูปแบบ",
    "psA_eJ": "ส่งออกเป็นไฟล์",
    "psZoP": "วางไฟล์ที่นี่เพื่อประมวลผล",
    "psqpq_o": "โอเค ผลลัพธ์ถูกคัดลอกไปยังคลิปบอร์ดของคุณแล้ว",
    "q12beqwR": "ไม่มีเครื่องมือที่ใช้ได้",
    "q29t31": "ขัด",
    "q6K7o": "โหลดจากบันทึกย่อ",
    "q9iuti": "เวลส์",
    "qDrbEr": "ชื่อผู้ใช้ที่คุณระบุว่างเปล่า โปรดตรวจสอบและลองอีกครั้ง",
    "qF4uS2": "สร้างพื้นที่ทำงาน",
    "qF4uS23": "หน้าต่างใหม่",
    "qHoktx": "ขอบคุณ!",
    "qN1LdZ2": "แก้ไขครั้งล่าสุด",
    "qQmBr": "การแปลข้อความ",
    "qTqyvWdY": "ยังไม่เสร็จ",
    "qWemXE4": "1 ม.ค. 2024",
    "qWw3eTH": "ส่วนนี้ช่วยรักษาไฟล์บนดิสก์ภายในเครื่องหรือคลาวด์ดิสก์ของคุณ",
    "qdeFXx": "ขณะนี้ หน้านี้ที่คุณค้นหายังใช้งานไม่ครบถ้วน",
    "qpDBSW": "ไม่มีแผงที่ใช้ได้",
    "qpDBSWe1": "ไม่มีแผงที่ใช้ได้",
    "qqK_x_": "เข้าสู่ระบบ",
    "qqqwYoz": "ช่วย",
    "qqwYoz": "แท็บ",
    "qqwYqwe": "พื้นที่ทำงาน",
    "qtpmvP": "ยืนยันรหัสผ่านท้องถิ่น",
    "qubSJ": "ส่วนขยาย VM ไม่ใช่ ID (อ้างอิง: IQnMH)",
    "qzshys": "ภาษาอูรดู",
    "r1GLS": "แท็ก",
    "rK6cx": "{0} ออกแบบและพัฒนาโดยทีมงาน LafTools",
    "rQkas": "ยินดีต้อนรับสู่ LafTools",
    "rR1vd": "อินพุตจากไฟล์",
    "rT34qnO": "ป้อนข้อความเพื่อการประมวลผล ผลลัพธ์จะแสดงในตัวแก้ไขเอาต์พุต",
    "rVqlu": "ถอดรหัส {0}",
    "rYSpw": "อัลกอริธึม MD2 (Message-Digest 2) เป็นฟังก์ชันแฮชการเข้ารหัสที่พัฒนาโดย Ronald Rivest ในปี 1989 อัลกอริธึมได้รับการปรับให้เหมาะกับคอมพิวเตอร์ 8 บิต<br><br>แม้ว่า MD2 จะไม่ถือว่าปลอดภัยอีกต่อไป แม้ว่าในปี 2014 ก็ตาม ยังคงใช้งานอยู่ในโครงสร้างพื้นฐานคีย์สาธารณะโดยเป็นส่วนหนึ่งของใบรับรองที่สร้างด้วย MD2 และ RSA อัลกอริธึมการแยกข้อความประกอบด้วย 18 รอบตามค่าเริ่มต้น",
    "r_n6h": "โหมดสว่างหรือมืด",
    "rf0mql3": "ธีมสว่างหรือมืด",
    "rpG0G": "เราให้ความสำคัญกับความคิดเห็นของคุณและยินดีรับฟังความคิดเห็นของคุณเกี่ยวกับวิธีที่เราสามารถปรับปรุงผลิตภัณฑ์ของเราได้ โปรดอย่าลังเลที่จะแบ่งปันความคิดเห็นของคุณกับเรา!",
    "run_text": "ก่อนที่จะเข้าสู่โต๊ะทำงานของคุณ เราต้องการโหลดทรัพยากรระบบที่จำเป็นล่วงหน้าก่อน กรุณารอสักครู่จะแล้วเสร็จเร็วๆ นี้ โดยมีรายละเอียดดังนี้",
    "rycJy": "LafTools เป็นกล่องเครื่องมืออเนกประสงค์ที่ออกแบบมาสำหรับโปรแกรมเมอร์โดยเฉพาะ มันแสดงถึงเวอร์ชันที่สองของ CodeGen Toolbox ซึ่งขณะนี้มีรันไทม์ที่เบากว่าที่เขียนใน Golang และ JavaScript",
    "ryhkqb": "บัลแกเรีย",
    "s0vrf9": "ภาษาฮีบรู",
    "s4OeX": "เข้าสู่ระบบสำเร็จ",
    "sHoxxW": "การแปลง",
    "sO0MOe": "ทุกครั้งที่คุณอยู่ในหน้าต่างนานกว่า 5 วินาที หน้าต่างนั้นจะแสดงที่นี่",
    "sR8yc": "ปิด",
    "sc49my": "สินธี",
    "sdfk1": "เลื่อนแท็บไปทางซ้าย",
    "sdfk13": "เลื่อนแท็บไปทางขวา",
    "sglMS": "สร้างเวลา",
    "sk123": "ยังไม่เสร็จ",
    "slqcWD": "ส่วนลอจิกนี้ยังไม่รองรับ โปรดคอยติดตาม",
    "sojBI": "การแปลง",
    "spCqEa": "ทำ",
    "spdh98": "จีนตัวย่อ",
    "ssDaOq": "ยังใหม่กับ LafTools ใช่ไหม?",
    "ssm80i": "บาสก์",
    "svqh06": "อาเซอร์ไบจัน",
    "sys_updates": "การอัปเดตระบบล่าสุด",
    "t63Qw": "อนุญาตให้ออกไป",
    "t6wczq": "โคซา",
    "t84q1z": "อาร์เมเนีย",
    "t8c6xc": "โซมาเลีย",
    "tBIX-d": "หน้าต่าง",
    "tEiv_": "กำลังดึงรายละเอียดส่วนขยาย",
    "tIy3Q": "พบกับข้อผิดพลาด",
    "tIyq3Q": "พบกับข้อผิดพลาด",
    "tWe1yF": "ไม่มีคำสั่งเชลล์ที่ใช้ได้",
    "tY3p1": "ข้อมูลมากกว่านี้",
    "tiaiB": "ยกเลิก",
    "tn7duf": "โครเอเชีย",
    "ttAre": "ป้อนรหัสผ่านธรรมดาของคุณที่นี่",
    "twamg": "ผู้ช่วย AI เสริมพลังความคิดสร้างสรรค์ของคุณ",
    "tyhgpr": "ชวา",
    "uCEe8": "การแปลงเรียลไทม์",
    "uFcDQ": "กำลังเริ่มต้นข้อมูลสถานะ...",
    "uV5Bi": "ไม่สามารถโหลดส่วนขยายได้",
    "uVseB": "กด {0} เพื่อแสดงรายการฮ็อตคีย์",
    "ucDLv": "คุณได้คัดลอกรายการนี้มา {0} ครั้ง",
    "ui5pZ": "คำสั่งแยกวิเคราะห์",
    "ulah0q": "ญี่ปุ่น",
    "unc9E": "ข้อความสุ่ม",
    "usr_defined": "การตั้งค่าระบบ",
    "uwqGE": "ไปที่เครื่องมือ",
    "v7q3db": "แบบไทย",
    "vOjNC": "ป้อนรหัสผ่านหรือรหัสความปลอดภัย",
    "vTsQU": "โปรดระบุรหัสเชิญจากผู้ดูแลระบบของคุณ",
    "vU17B": "ไม่สามารถส่งคำขอได้",
    "vWqac": "ก่อนที่จะเข้าสู่โต๊ะทำงานของคุณ เราต้องการโหลดทรัพยากรระบบที่จำเป็นล่วงหน้าก่อน กรุณารอสักครู่จะแล้วเสร็จเร็วๆ นี้ โดยมีรายละเอียดดังนี้",
    "vaP0vq": "ตั้งค่ารหัสผ่านภายในเครื่องสำเร็จ",
    "vci8rd": "ภาษาดัตช์",
    "vh9j4": "ป้อนข้อมูล",
    "vo1prl": "สเปน",
    "vr93oi": "ภาษาฟินแลนด์",
    "vrfjnf": "ภาษาอิตาลี",
    "w6otqn": "คอร์ซิกา",
    "w92j07": "ภาษารัสเซีย",
    "w9qudj": "ปัญจาบ",
    "wAxtg": "ในตอนแรก เราได้สร้าง UUID ให้เป็นโทเค็นที่ได้รับอนุญาตเพื่อให้คุณตั้งค่านี้ได้ จากสิ่งที่ LafTools ได้รับ โทเค็นที่คุณให้ไว้คือ {0} ซึ่งได้รับการยืนยันโดย LafTools เรียบร้อยแล้ว และด้วยเหตุนี้คุณจึงสามารถตั้งค่าแบบฟอร์มนี้ต่อไปได้",
    "wI1eh": "ต่อไป",
    "wQYoz": "ไฟล์",
    "wQdYoz": "แก้ไข",
    "wQdqwYoz": "ดู",
    "wcl1K": "การใช้งาน",
    "wgkk6y": "ภาษามอลตา",
    "wsWcXd": "การแจ้งเตือน",
    "x009": "เพื่อเข้าถึงเอกสารการใช้งานของเรา",
    "x5alzu": "เคิร์ด (Kurmanji)",
    "x5tHV": "ภาพรวมของระบบ",
    "xMBv0": "กำลังโหลดทรัพยากรที่เกี่ยวข้อง...",
    "xPHqP": "คำอธิบายยังไม่ได้กำหนด",
    "xQ_ls": "สำรองข้อมูล Redis",
    "xbz0B": "ปิดแท็บทั้งหมด",
    "xbz0B2": "ปิดแท็บ",
    "xdqwe": "ยินดีต้อนรับสู่การใช้ LafTools!",
    "xeP4zV": "ดูรายการสิ่งที่ต้องทำของคุณอย่างรวดเร็ว",
    "xeP4zVd": "ค้นหาคำศัพท์ภาษาอังกฤษอย่างรวดเร็ว",
    "xlqtA": "ข้อเสนอแนะ",
    "xs22XLF": "ไม่มีข้อมูลสำหรับรหัสรายการนี้ โปรดพิจารณาเลือกรายการอื่น",
    "y3qjdd": "รหัสผ่านในเครื่องของคุณได้รับการยืนยันเรียบร้อยแล้ว",
    "y8Ir5": "ส่วนนี้ใช้สำหรับการเริ่มต้นบัญชีผู้ดูแลระบบของคุณ อย่างไรก็ตาม สำหรับตอนนี้ คุณยังไม่จำเป็นต้องสร้างหรือปรับเปลี่ยนใดๆ ที่นี่ เนื่องจากผู้ดูแลระบบของคุณตั้งค่าไว้ก่อนหน้านี้ โปรดละเลยส่วนนี้และดำเนินการตามขั้นตอนที่เหลือ",
    "ySVf-": "ลองคำขอนี้อีกครั้ง",
    "yVprb": "ส่วนนี้ยังอยู่ระหว่างการพัฒนา",
    "y_2Q1": "เข้ารหัสและถอดรหัส",
    "y_2Q2": "การเข้ารหัสแบบสมมาตร",
    "y_2Q3": "การเข้ารหัสแบบอสมมาตร",
    "y_2Q4": "อัลกอริทึมแห่งชาติของจีน",
    "y_2Q5": "การตรวจสอบสิทธิ์ทางเว็บ",
    "y_2Q5dqw": "ตัวจับคู่ข้อความ",
    "y_9YM": "ผลลัพธ์จะแสดงที่นี่",
    "y_9YqM": "กำลังโหลดไฟล์คงที่...",
    "y_BN6": "อัลกอริทึมย่อย",
    "ya0cwu": "มาเลย์",
    "yc7dqiu": "จีนตัวย่อ",
    "yfYeg": "เทมเพลตข้อความ",
    "yiRso": "บันทึกเมฆ",
    "ykganl": "ภาษาเดนมาร์ก",
    "yqiRso": "หมายเหตุท้องถิ่น",
    "yqrxl4": "เซอร์เบีย",
    "yznU9": "ข้อมูลต้นไม้ว่างเปล่า",
    "z-o28we": "แผงกระบวนการ",
    "z0j2nf": "ฮินดี",
    "z1oFn": "หลบหนีและหลบหนี",
    "z2jzej": "ภาษามราฐี",
    "z79b1a": "ภาษาอาหรับ",
    "zN2ES": "พื้นที่ทำงาน",
    "zaSKh": "รีเฟรช",
    "zc3Hf": "รหัสผ่าน",
    "zjDJk": "โปรดระบุเส้นทางไดเรกทอรีพื้นที่ทำงาน",
    "zkqUFa": "{0} ยังไม่ได้กำหนดค่า",
    "zkv375": "เขมร",
    "zmDWx": "ติดต่อเรา",
    "znVRwq": "ไฟล์",
    "zpyd34": "ภาษาอังกฤษ",
    "zqiIoqXw": "กำลังคำนวณ...",
    "zwd4v": "รายละเอียดส่วนขยาย",
    "zwgYx": "ค่ารหัสผ่านที่เข้ารหัสจะแสดงที่นี่",
    "zzcepr": "เซบู"
}