{
    "": "ข้อความ: {0}",
    "-8l11": "คัดลอกแล้ว",
    "-DqwwR": "การดำเนินการเสร็จสมบูรณ์",
    "-GJ_72": "สลับไปยังพื้นที่ทำงานที่เลือก {0}",
    "-Jx4J": "บัญชีท้องถิ่น",
    "-Rj3y": "ธีมส์",
    "-XZnW": "กลับ",
    "-Yo129I": "เครื่องมือข้อความ",
    "01do0y": "กันนาดา",
    "04SSf": "ลืมรหัสผ่าน?",
    "07naT": "ข้อผิดพลาด: {0}",
    "07ui6": "ข้อมูลเพิ่มเติม",
    "0Ceqru": "Base64 เป็นสัญลักษณ์สำหรับการเข้ารหัสข้อมูลไบต์ที่กำหนดเองโดยใช้ชุดสัญลักษณ์ที่จำกัด ซึ่งมนุษย์สามารถใช้งานได้สะดวกและประมวลผลโดยคอมพิวเตอร์",
    "0PgZ_": "การแปล",
    "0gvcN": "ยินดีต้อนรับสู่หน้าภาพรวม มันยังอยู่ระหว่างการพัฒนา",
    "0gywa": "ไม่พบพื้นที่ทำงาน คุณจะถูกเปลี่ยนเส้นทางไปยังหน้าดัชนีพื้นที่ทำงาน",
    "0pfdz7": "อุซเบก",
    "123e4567": "Base64 คืออะไร?",
    "13pmE": "สนับสนุนเรา",
    "1507oa": "เบงกาลี",
    "1JOFP": "เปิดพื้นที่ทำงานของฉัน",
    "1NTgQ": "เปิดพื้นที่ทำงาน",
    "1Npez": "กรุณาระบุเส้นทาง",
    "1Tuab": "คัดลอกแล้ว",
    "1X8x7": "ตัวอย่าง",
    "1YmJc": "เลือกหนึ่งในตัวเลือกเป็นภาษาที่คุณต้องการ:",
    "1a2b3c4d": "ทำไมต้องใช้ Base64?",
    "1a3Sc": "ยกเลิกการโหลด",
    "1bd": "ขั้นตอนการทำงาน",
    "1e3e5n": "เฮาซา",
    "1h6jH": "คำเตือน ผลลัพธ์ว่างเปล่า!",
    "1j62a": "ทำเช่นนี้ในเวลาอื่น",
    "1jj0ri": "ญี่ปุ่น",
    "1k_44": "การดำเนินการนี้จะถอดรหัสข้อมูลจากสตริง ASCII Base64 กลับเป็นรูปแบบ Raw",
    "1th2nw": "สิงหล",
    "1yIQu": "คุณสามารถลองประมวลผลการกระทำของคุณใหม่หรือคลิกปุ่มด้านล่างเพื่อยกเลิกข้อผิดพลาด",
    "20nmcv": "ละติน",
    "22XLF": "ยังไม่เสร็จ",
    "23fgh456": "ประวัติความเป็นมาของ Base64",
    "24vLI": "สร้าง",
    "27j7sy": "โชนา",
    "2D9a6": "ลืมรหัสผ่าน?",
    "2D9qdk6": "ปลอดภัยเพียงพอหรือไม่?",
    "2IF6A": "ดูเหมือนว่า forge save storage จะประสบปัญหาบางอย่าง",
    "2JyFN": "คัดลอกผลลัพธ์ไปยังคลิปบอร์ด",
    "2Ocbey": "เวอร์ชัน",
    "2RhAT": "ดูเหมือนว่ากระบวนการฟอร์จดึงข้อมูลจะประสบปัญหาบางอย่าง",
    "2Ruh6": "สร้างบัญชีท้องถิ่นใหม่",
    "2S5ap": "สลับโหมดเต็มหน้าจอ",
    "2Y1mR": "ล้างข้อความ",
    "2bcde3fg": "ข้อเสียของ Base64",
    "2bqHk": "โหลดจากไฟล์",
    "2e4fb7": "อิกโบ",
    "2giYv": "ทดสอบรหัสผ่าน: {0}",
    "2khdsv": "ปาสโต้",
    "2lehqwp": "ภาษาเวียดนาม",
    "2lhcqwp": "ภาษาตุรกี",
    "2lhqqwp": "ชาวอินโดนีเซีย",
    "2lhqqwqp": "มาเลย์",
    "2lhqwwp": "แบบไทย",
    "2qdin8": "กรุณากรอกรหัสยืนยัน",
    "2tib5m": "ภาษาสวีเดน",
    "2ybu7j": "ภาษานอร์เวย์",
    "30eo2v": "คุชราต",
    "32D9a6": "สร้างบัญชี",
    "33RXi": "คำขอถูกปฏิเสธเนื่องจากพารามิเตอร์ที่ไม่น่าพอใจ",
    "346qid": "ภาษารัสเซีย",
    "34wxyz56": "จะเข้ารหัส / ถอดรหัส Base64 ใน JavaScript ได้อย่างไร",
    "39dsCt": "คุณจะได้รับการแจ้งเตือนล่าสุดจากบริการแอพหากมี",
    "3ii2tt": "เกลิคสกอต",
    "3umnB": "โทเค็นที่ไม่รู้จัก",
    "441oja": "จอร์เจีย",
    "44Ntqw-": "จัดการการดำเนินงาน",
    "46bksi": "ลิทัวเนีย",
    "4K_vhq": "ทำซ้ำแท็บนี้",
    "4PIqD": "รีวิวโค้ด",
    "4UYIJ": "ยังไม่แล้วเสร็จ.",
    "4cGA_": "กำลังดึงข้อมูลสำหรับการตั้งค่าระบบ...",
    "4hijk5lm": "การเพิ่มขนาด: ข้อมูลที่เข้ารหัสมีขนาดใหญ่กว่าข้อมูลไบนารีดั้งเดิมประมาณ 33%",
    "4kKe4": "รหัสผ่านของคุณ",
    "4tqb4x": "ภาษาฮังการี",
    "4vdfwf": "ตกลง",
    "4wlih": "คำขอถูกปฏิเสธเนื่องจากพารามิเตอร์ที่ไม่น่าพอใจ",
    "52OiQ": "คัดลอก {0} ครั้ง",
    "54cwb": "System Websocket API พบข้อผิดพลาด: {0}",
    "56ibcj": "ภาษาเวียดนาม",
    "58HQX": "หากคุณไม่ทราบคุณค่าของมัน โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอรายละเอียดเพิ่มเติม ซึ่งสามารถพบได้ในการตั้งค่าของเขา",
    "5BOhl": "รหัสการเชิญ",
    "5Ih2u": "เครื่องมือนาวิเกเตอร์",
    "5NCPT": "โหมดมืด",
    "5NJeGsu1": "อีเมล คุณสามารถจัดระเบียบกล่องจดหมายของคุณ เขียนและส่งข้อความ และติดตามการติดต่อสื่อสารของคุณได้อย่างง่ายดาย ถึงตอนนี้จะใช้เป็นเครื่องมือสื่อสารระหว่างผู้ใช้กับทีมงานของเราเท่านั้น",
    "5NJeddqGsu1": "ส่วนนี้ประกอบด้วยเอกสารเกี่ยวกับคอมพิวเตอร์ บทความ wiki คู่มือการใช้งาน และอื่นๆ",
    "5NJedqddqGsu1": "ส่วนนี้ประกอบด้วยทรัพยากรคอมพิวเตอร์ที่สามารถใช้ในการสร้างโครงการของคุณเอง",
    "5Perd": "ขออภัย ฟังก์ชัน 'ใช้ตัวแก้ไขอัจฉริยะ' ยังไม่พร้อมใช้งาน เรายังคงดำเนินการเพื่อนำไปปฏิบัติ ขอขอบคุณสำหรับความอดทนของคุณ.",
    "5ZBYR": "กลับ",
    "5dF7o": "รีเฟรช",
    "5e6f7g8h": "Base64 ถูกใช้เมื่อจำเป็นต้องส่งข้อมูลไบนารีผ่านโปรโตคอลแบบข้อความ เช่น อีเมลหรือ JSON หรือฝังไว้ในตำแหน่งที่อนุญาตเฉพาะข้อความเท่านั้น",
    "5eXVS": "เนื้อหาสคริปต์",
    "5ggegx": "เกาหลี",
    "5lW8qp": "แสดงตัวอย่างสำหรับเครื่องมือนี้",
    "5q-Zxqa": "ผู้จัดการสคริปต์",
    "5qPOJL": "เพื่อสนับสนุน LafTools ลองพิจารณาให้ดาวแก่พื้นที่เก็บข้อมูลของเราบน GitHub หรืออัปเกรดเป็นเวอร์ชันมืออาชีพผ่านการสมัครสมาชิกรายเดือน เราขอขอบคุณสำหรับความช่วยเหลือของคุณเป็นอย่างยิ่ง และเราสัญญาว่า LafTools จะดียิ่งขึ้นไปอีกด้วยเงินทุนที่ระดมทุนได้",
    "5qV5Sf": "ลบบันทึกนี้ออกจากรายการ",
    "5rg5mt": "มาลากาซี",
    "5srFq": "ลาฟทูลส์",
    "5v8jl7": "ม้ง",
    "6AumW": "การดำเนินการเริ่มต้น",
    "6ClPV": "สร้าง",
    "6hsnqWe": "แม้ว่า LafTools จะให้บริการฟรีและเป็นโอเพ่นซอร์ส แต่การบำรุงรักษายังคงต้องใช้เวลาและพลังงานเป็นจำนวนมาก โดยเฉพาะอย่างยิ่ง เราต้องการเงินทุนเพื่อชำระค่า Cloud API บางอย่าง หากคุณชื่นชอบ LafTools โปรดพิจารณาสนับสนุนเรา",
    "6j13s3": "ไอซ์แลนด์",
    "6nopqrst": "ไม่มีการเข้ารหัส: Base64 ไม่ใช่วิธีการเข้ารหัส ถอดรหัสได้ง่ายและไม่มีความปลอดภัย",
    "6qT9d-N": "สำหรับโน้ตบุ๊ก LafTools ไม่เพียงแต่จัดเตรียมตัวจัดการคำสั่งเชลล์เท่านั้น แต่ยังจะเพิ่มเครื่องมือบันทึกย่ออันทรงพลังเข้าไปในอนาคตอันใกล้นี้ เช่น MarkDown, Latex, {0} และอื่นๆ",
    "6ulj8i": "เนปาล",
    "6yOXx": "ชื่อที่ไม่รู้จัก",
    "71x7x": "ซอร์สโค้ดบน GitHub",
    "78abcdef": "JavaScript มีฟังก์ชันในตัว เช่น btoa() และ atob() สำหรับการเข้ารหัสและถอดรหัส Base64 ตามลำดับ",
    "78ijk9lm": "Base64 ถูกกำหนดครั้งแรกใน RFC 1421 (1993) และต่อมาเป็นมาตรฐานใน RFC 4648 (2006)",
    "7MOO1": "เข้าสู่ระบบ",
    "7dm0d8": "จีนดั้งเดิม",
    "7g5w22": "ภาษานอร์เวย์",
    "7k56u3": "กาลิเซีย",
    "7q40W": "ไม่สามารถเริ่มต้นผู้ดูแลระบบได้",
    "7u4vzu": "สโลวัก",
    "7x3f6": "แท็บ - 1",
    "82r0C": "จัดการรายการสิ่งที่ต้องทำของคุณและทำสิ่งต่าง ๆ ได้อย่างมีประสิทธิภาพมากขึ้น",
    "83dNp": "ไม่สามารถโหลด ID ส่วนขยายได้ (อ้างอิง: 1dl1f)",
    "8LdRj": "ภาพรวม",
    "8LdRjq": "คำนวณ",
    "8LdevRj": "บริการ",
    "8M1wY": "สถานีท้องถิ่น",
    "8eeL1Kk": "เกี่ยวกับ",
    "8mn_qa": "กำลังดึงข้อมูลจากบริการเทอร์มินัล...",
    "8qzWJu": "ขออภัย ขณะนี้เรายังไม่รองรับอุปกรณ์หน้าจอขนาดเล็ก โปรดใช้พีซีเพื่อเข้าชมหน้านี้",
    "8veXac": "เวลาเป็นทรัพยากรที่มีค่าที่สุด จัดการมันอย่างชาญฉลาด",
    "97um9v": "ฮาวาย",
    "9Xv8-": "บันทึกเป็นหมายเหตุ",
    "9_qaj": "ออกจากแบบฟอร์มนี้",
    "9a335": "โปรดคลิกรายการส่วนขยายใดๆ ในเมนูแรกด้านซ้าย รายการปัจจุบันว่างเปล่าหรือไม่ถูกต้อง",
    "9e4fcl": "ทมิฬ",
    "9eZHM": "อ๊ะ! ดูเหมือนว่าเราพบคำเตือนหรือข้อผิดพลาดบางประการ",
    "9gqo8x": "ลัตเวีย",
    "9i0j1k2l": "นอกจากนี้ยังใช้สำหรับการฝังรูปภาพขนาดเล็กลงใน HTML หรือ CSS โดยตรงเป็น URL ข้อมูล",
    "9m85mf": "เซโซโท",
    "9qy1xn": "โปรตุเกส",
    "9tbbkt": "ภาษาฟินแลนด์",
    "9zCSc": "ไม่มีพื้นที่ทำงานที่พร้อมใช้งาน",
    "A69UZ": "ตัวแปร",
    "AVUvu": "Base62 เป็นสัญลักษณ์สำหรับการเข้ารหัสข้อมูลไบต์ที่กำหนดเองโดยใช้ชุดสัญลักษณ์ที่จำกัด ซึ่งมนุษย์สามารถใช้งานได้สะดวกและประมวลผลโดยคอมพิวเตอร์ ฐานตัวเลขสูงส่งผลให้สตริงสั้นกว่าระบบทศนิยมหรือฐานสิบหก",
    "AW9N8": "ภูมิภาคอินพุต",
    "AfPC0": "รหัสผ่านข้อความธรรมดาของคุณ",
    "Ahrjc": "ไม่มีไดเร็กทอรี คุณต้องการสร้างไดเร็กทอรีนี้หรือไม่?",
    "AkXgF": "อยู่ระหว่างดำเนินการ: {0}%",
    "Apx8D": "จะรีเซ็ตรหัสผ่านของคุณด้วยตนเองได้อย่างไร?",
    "B0s0z": "วัตถุประสงค์ของหน้านี้:",
    "BGd7P9": "การดำเนินการนี้จะเข้ารหัสข้อมูลดิบลงในสตริง ASCII Base64",
    "BGd7dP9": "การดำเนินการนี้จะเข้ารหัสข้อมูลดิบเป็นสตริง ASCII {0}",
    "BGdd7dP9": "การดำเนินการนี้จะเข้ารหัสข้อมูลดิบเป็นสตริง ASCII {0}",
    "BShq3M": "ปัญหา",
    "BW3bpT": "กำลังอ่านไฟล์จากดิสก์...",
    "Bd9h-": "เพิ่มลงในคอลเลกชั่นโปรดของฉัน",
    "BuihG": "การตั้งค่าระบบ",
    "CASef": "โอเค ปฏิบัติการเริ่มขึ้นแล้ว",
    "CEv8B": "คุณแน่ใจที่จะลบบันทึกนี้หรือไม่? หากใช่ ให้คลิกปุ่มนี้อีกครั้ง",
    "CVUl0": "ลาฟทูลส์",
    "CWohyqde": "เครื่องมือ",
    "CWoqhy": "รายการ Exts ตาม CategoryID ที่เลือก",
    "CfZAX": "ไฟล์ {0} ที่เลือก เรากำลังอัปโหลดไปยังบริการหลัก",
    "CidOqAZ": "ในฐานะผู้สร้าง LafTools ฉันรู้สึกประทับใจมากที่คุณยินดีสนับสนุนเรา เรามีคนดีๆ ในทีมที่ทำงานอย่างหนักเพื่อปรับปรุง LafTools อย่างต่อเนื่อง",
    "Cide2w": "เพื่อดูว่ามีปัญหาใดๆ ในขณะที่ดำเนินการหรือไม่",
    "DIQFq": "โปรดตรวจสอบว่ามีการให้พารามิเตอร์ URL อย่างถูกต้องหรือไม่ ดูเหมือนว่าคุณไม่ได้รับอนุญาตให้กรอกแบบฟอร์มนี้ ตามค่าเริ่มต้น คุณจะสามารถดูข้อความด้านล่างในผลลัพธ์ของการบริการเมื่อเพิ่งเปิดตัว",
    "DIweGq": "รักษาความปลอดภัย LafTools ของคุณ",
    "DTTPW": "รีเซ็ตสถานะ",
    "DVoKw": "ออกจากระบบนี้",
    "DadYp": "การดีเด้งแบบเรียลไทม์",
    "DrXAq": "ยินดีต้อนรับสู่การใช้ LafTools!",
    "DrbEr": "รหัสผ่านที่คุณระบุว่างเปล่า โปรดตรวจสอบและลองอีกครั้ง",
    "DtlAc": "กำลังโหลดทรัพยากรระบบ",
    "Dxlw0": "สมบูรณ์",
    "E62ej": "คำสั่งเชลล์กรอง",
    "E6F9B": "เพิ่มลงในขั้นตอนการทำงาน",
    "ERK7E": "หากคุณพบปัญหาใด ๆ หรือมีข้อเสนอแนะใด ๆ ในขณะที่ใช้ LafTools โปรดติดต่อเราผ่านทางอีเมลหรือ GitHub ได้ตลอดเวลา เรายินดีที่จะช่วยเหลือคุณ",
    "EgBXL": "เลือกหรือระบุแท็ก",
    "Ewvgo": "ยังไม่ได้เริ่ม.",
    "ExqvX": "รายการคีย์ลัด",
    "Eyq856": "เรายังไม่เสร็จสิ้น - เรามุ่งมั่นที่จะนำเสนอคุณสมบัติใหม่ล่าสุดและดีที่สุด และเราจะเผยแพร่การอัปเดตต่อไปเพื่อให้แน่ใจว่าคุณได้รับประสบการณ์ที่ดีที่สุด",
    "F-OUm": "การตั้งค่าด่วนสำหรับ LafTools",
    "F0CCF": "รายการคีย์ลัด",
    "F4uS2": "ไฟล์ใหม่",
    "FBVyc": "กรุณาใส่รหัสยืนยันอีกครั้ง",
    "FDlRI": "ตั้งชื่อแท็บใหม่นี้แล้วคลิกเพื่อยืนยัน",
    "FOyHW": "ค้นหาทุกที่",
    "FQzhg": "ละเว้นอินพุตที่ว่างเปล่า",
    "FhVWl": "เข้ารหัสรหัสผ่านของคุณ",
    "FjYbR": "เอาท์พุต",
    "Fv-zz": "คัดลอกผลลัพธ์",
    "Fy217": "กำหนดค่าเครื่องมือนี้",
    "Fzp3t": "ให้คุณค่า",
    "G3MJN": "แสดงแผงเอาท์พุต",
    "G9QVo": "จัดการแท็บ",
    "GR7jK": "พิมพ์",
    "Ggob_": "ยกเลิก",
    "H-Ae75": "โปรดยืนยันรหัสผ่านท้องถิ่นของคุณ",
    "H-qA75": "กรุณาระบุรหัสผ่านท้องถิ่น",
    "H8fQ4": "สลับเป็นโหมดสว่างหรือมืด",
    "HEAhr": "หลังจากแปลแล้ว ผลลัพธ์จะปรากฏที่นี่",
    "HIc3c": "สมบูรณ์",
    "HNDat": "หากต้องการเปลี่ยนแปลง โปรดคลิกปุ่ม \"{0}\" หรือคลิก \"{1}\" เพื่อใช้การเปลี่ยนแปลงของคุณ ขอให้คุณมีช่วงเวลาที่ดีกับกล่องเครื่องมือนี้!",
    "Hflf2": "เพื่อความปลอดภัยทางไซเบอร์ เราจะไม่ช่วยรีเซ็ตรหัสผ่านของคุณผ่าน API หรือเพจต่างๆ ที่นี่ เว้นแต่คุณจะอัปเดตไฟล์ที่ป้องกันระบบด้วยตนเอง",
    "HjvV3": "เราจะไม่ลบไฟล์บนดิสก์ เพียงลบบันทึกนี้ออกจากรายการ",
    "HyIC_": "เครื่องหมายทับ (/)",
    "HyIC_d": "เครื่องหมายทับ (/)",
    "I8FLi": "ตอนนี้ถึงเวลาตั้งค่าผู้ดูแลระบบของคุณแล้ว โปรดตั้งรหัสผ่านให้ซับซ้อนที่สุดเท่าที่จะทำได้ เพื่อที่คุณจะได้สามารถสร้างความสับสนให้กับผู้โจมตีที่ไม่สุภาพเหล่านั้นได้",
    "IAC0A": "เครื่องมือค้นหา",
    "ICefi": "ยกเลิก",
    "IKqqATS": "รีเฟรชข้อมูลหน้าปัจจุบัน",
    "IOOrz": "(จะเป็นอันตรายต่อระบบของคุณหรือไม่? เราไม่คิดเช่นนั้น ตราบใดที่คุณสามารถแก้ไขไฟล์กำหนดค่าที่สงวนไว้ของระบบได้ นั่นหมายความว่าคุณจะได้รับสิทธิ์ในการอ่านทุกอย่างเกี่ยวกับไฟล์ข้อมูล LafTools)",
    "IWUH5": "แสดงตัวอย่าง",
    "IaSyO": "ยกเลิก",
    "IfsGO": "รายการโปรด",
    "IfsdGO": "รายการโปรด",
    "ImUmf": "ใหม่",
    "J-3KA": "โปรดระบุชื่อสคริปต์นี้ ซึ่งจะมีประโยชน์มากกว่า",
    "J164i": "เช่น. คัดลอกไฟล์ไปยังเซิร์ฟเวอร์ระยะไกล",
    "J2xoL": "โปรดดูข้อผิดพลาด: {0}",
    "JA_Bp": "โปรดระบุชื่อสำหรับแท็กใหม่ในตอนแรก",
    "JQEVK": "รหัส",
    "JQLmS": "ปรับขนาดแล้ว",
    "JQLmSq": "สมบูรณ์.",
    "JTBRh": "LafTools เก็บค่ารหัสผ่านไว้ในไฟล์ในเครื่อง แต่ไม่ต้องกังวล เราได้นำกลไกการเข้ารหัสรหัสผ่านทางเดียวมาใช้ กล่าวคือไม่มีใครสามารถอ่านรหัสผ่านของเวอร์ชันข้อความธรรมดาได้ หากต้องการรีเซ็ตรหัสผ่าน โปรดปฏิบัติตามเครื่องมือด้านล่างเพื่อรีเซ็ตรหัสผ่านด้วยตนเอง",
    "JYqxz2": "ยินดีต้อนรับสู่ LafTools นี่เป็นเวอร์ชันภายใน",
    "JdqiUE8": "การดำเนินการนี้จะถอดรหัสข้อมูลจากสตริง ASCII (พร้อมตัวอักษรที่คุณเลือก รวมค่าที่ตั้งไว้ล่วงหน้า) กลับเป็นรูปแบบดิบ",
    "JdqidUE8": "การดำเนินการนี้จะถอดรหัสข้อมูลจากสตริง ASCII (พร้อมตัวอักษรที่คุณเลือก รวมค่าที่ตั้งไว้ล่วงหน้า) กลับเป็นรูปแบบดิบ",
    "JfFHw": "รับคำขอข้อมูลพื้นที่ทำงาน",
    "JiUE8": "การดำเนินการนี้จะถอดรหัสข้อมูลจากสตริง ASCII {0} กลับเป็นรูปแบบ Raw",
    "K1qJZI": "ยินดีต้อนรับสู่ LafTools ฯพณฯ",
    "KGS2-": "เมื่อคุณทำตามขั้นตอนข้างต้นเสร็จแล้ว คุณสามารถใช้รหัสผ่านใหม่เพื่อลงชื่อเข้าใช้ระบบของคุณได้ หากคุณไม่สามารถเข้าถึงระบบไฟล์ได้ โปรดขอให้ผู้ดูแลระบบหรือฝ่ายสนับสนุนด้านไอทีของคุณสร้างไฟล์นั้นขึ้นมา หากไฟล์มีอยู่แล้ว ให้ลบออกแล้วสร้างใหม่",
    "KIc63": "ฟังก์ชั่นยังไม่รองรับ",
    "KYh1N": "หมายเหตุทั้งหมด",
    "KcqrRr": "อ้างอิง",
    "KcrRr": "การดึงข้อมูลการใช้งานโค้ด",
    "KmEUF": "ให้ภาพรวมโดยย่อของเครื่องมือระบบปัจจุบัน",
    "Kw4OJr": "เทอร์มินัล",
    "Kyd9H": "ซอร์สโค้ดบน GitHub",
    "L-p-Y": "คัดลอกเนื้อหาของคำสั่งเชลล์ปัจจุบันไปยังคลิปบอร์ด",
    "L3zEM": "แสดงตัวอย่าง",
    "L42mxa": "กรุณากรอกข้อความต้นฉบับของคุณในช่องนี้",
    "L49kCq": "โปรดระบุและยืนยันรหัสผ่านล็อคในแบบฟอร์มนี้เพื่อรักษาความปลอดภัย LafTools ของคุณ",
    "L71q_N": "รหัสผ่านที่คุณระบุว่างเปล่า โปรดตรวจสอบและลองอีกครั้ง",
    "L9bQku": "ถอดรหัส {0}",
    "L9qbQku": "ถอดรหัส {0}",
    "LAc1m": "รีเฟรชมุมมองแอป",
    "LFdvM": "ไม่ได้เข้าสู่ระบบ",
    "LM715": "กำลังดึงการกำหนดค่า i18n จาก API เซิร์ฟเวอร์ภายในเครื่อง",
    "LPJrV": "คัดลอกผลลัพธ์",
    "LU9Jj": "Base85 (หรือที่เรียกว่า Ascii85) เป็นสัญลักษณ์สำหรับการเข้ารหัสข้อมูลไบต์ที่กำหนดเอง โดยปกติแล้วจะมีประสิทธิภาพมากกว่า Base64<br><br>การดำเนินการนี้จะถอดรหัสข้อมูลจากสตริง ASCII (พร้อมตัวอักษรที่คุณเลือก รวมค่าที่ตั้งล่วงหน้าไว้ด้วย) Base85 มักใช้ในรูปแบบไฟล์ PostScript และ PDF ของ Adobe",
    "LWaeFqd": "สลับเป็นภาษาที่คุณต้องการ",
    "Le71_N-": "รหัสผ่านที่คุณระบุไม่เหมือนกับรหัสผ่านที่ยืนยัน โปรดตรวจสอบและลองอีกครั้ง",
    "LnJ4H": "โปรดทราบว่าบัญชีท้องถิ่นนั้นไม่เหมือนกับผู้ใช้ที่ลงทะเบียนบนเว็บไซต์ของเราโดยสิ้นเชิง บัญชีแรกถูกกำหนดไว้บนพีซีของคุณเท่านั้น ในขณะที่บัญชีหลังสามารถใช้สำหรับการซิงค์บนคลาวด์ได้",
    "LqWaFd": "การตั้งค่าระบบ",
    "M3qytc": "เข้ารหัส {0}",
    "M3ytc": "ถึงฐาน 64",
    "M4ywN1": "เครื่องคิดเลข ปฏิทิน นาฬิกา สภาพอากาศ และอื่นๆ",
    "M6MrW": "ดี",
    "M7jct": "เข้าสู่โหมดเต็มหน้าจอ",
    "MN2lT": "ความยาวของรหัสผ่านต้องไม่น้อยกว่า 6",
    "Ma5mv": "สลับการมองเห็นแท็บแถบเครื่องมือ",
    "Mq9pdpT": "แสดงรายการทรัพยากรที่เกี่ยวข้องทั้งหมดสำหรับเมนูการทำงานที่คุณเลือก",
    "Mq9ppT": "ดูสถานะบริการของคุณอย่างรวดเร็ว",
    "MrgmU": "ยืนยัน",
    "NMLOn": "คัดลอก FilePath",
    "NMLOn1": "เปิดพื้นที่ทำงาน",
    "NNfJo": "โหลดข้อมูลจากไฟล์",
    "Nq1IR": "ไม่สามารถโหลดส่วนขยาย VM ได้",
    "Nqc0LqwX": "หากคุณคิดว่ามีช่องโหว่ในกระบวนการนี้ โปรดติดต่อเราผ่านทางอีเมลหรือ GitHub ได้ตลอดเวลา เราต้องการปรับปรุงโดยด่วน",
    "O02-W": "ไม่โหลด...",
    "O94Yx": "บน",
    "OO0qPN": "ตัวอย่างโหลดแล้ว",
    "OQWm4": "รายงานข้อผิดพลาด",
    "OSHOI": "ยินดีต้อนรับหน้า",
    "OSqZQM": "รหัสผ่านท้องถิ่น",
    "OeO0PeN": "เอาล่ะ ตัวอย่างจะแสดงในตัวแก้ไขอินพุต",
    "OeOQY": "ทำ",
    "OpPFe": "หากคุณชอบ LafTools โปรดแชร์กับเพื่อนของคุณและให้ดาวเราด้วย ขอบคุณ!",
    "Opcty": "ไฟล์",
    "OqqGx2qg": "กำลังโหลดทรัพยากรแบบคงที่ โปรดรอสักครู่...",
    "OrCt5": "กำลังเปลี่ยนเส้นทางไปยังโต๊ะทำงาน...",
    "Ot6EP": "เครื่องมือโปแลนด์",
    "P4ROa": "ภูมิภาคเอาท์พุต",
    "PM_N5": "เซสชัน - {0}",
    "PUxuU": "กำลังดึงข้อมูลสำหรับชุดภาษา...",
    "PapkF": "หากคุณมีคำถามหรือข้อเสนอแนะเกี่ยวกับ LafTools โปรดแจ้งให้เราทราบ เรามองหาวิธีปรับปรุงผลิตภัณฑ์ของเราและมอบประสบการณ์ที่ดีที่สุดให้กับผู้ใช้ของเราอยู่เสมอ คุณสามารถติดต่อเราได้ที่ work7z@outlook.com ขอขอบคุณที่ใช้ LafTools!",
    "PpCHA": "รหัสคำถาม(?)",
    "PqazM-": "ก่อนอื่น โปรดใช้การควบคุมแบบฟอร์มด้านล่างเพื่อเข้ารหัสรหัสผ่านของคุณ",
    "QL9Sn": "ในขณะนี้ ดูเหมือนจะไม่มีคำอธิบายให้ใช้งาน",
    "QLKzF": "มันอัดแน่นไปด้วยคุณสมบัติที่ตอบสนองความต้องการของนักพัฒนามือใหม่และนักพัฒนาที่มีประสบการณ์ ทำให้เป็นเครื่องมือที่ต้องมีในคลังแสงของโปรแกรมเมอร์",
    "QM2Ob": "เครื่องมือล่าสุด",
    "QM2Oq": "หมายเหตุล่าสุด",
    "QRAdA": "ภาษาอังกฤษเป็นภาษาจีน",
    "QhdpH": "ฉบับชุมชน",
    "QzlA3": "เกิดข้อผิดพลาด",
    "R12bq": "แท็บรายการที่ไม่แสดง",
    "RNBze0": "เครื่องมือ",
    "RNeBze0": "แท็บที่เปิดอยู่",
    "RNewBze0": "การกำหนดค่าเครื่องมือ",
    "RO4ZP": "เกิดข้อผิดพลาด",
    "RPVRl": "ดูเหมือนว่าส่วนขยายนี้เข้ากันไม่ได้กับ LafTools เวอร์ชันปัจจุบัน โปรดพิจารณาติดตั้งเวอร์ชันล่าสุดเพื่อรองรับส่วนขยายนี้ หรือโปรดติดต่อเราโดยแจ้งปัญหาบน GitHub",
    "RhqzcdD": "การตั้งค่าระบบ",
    "RjCO3": "รายการพื้นที่ทำงาน",
    "S4MMV": "อ๊ะ! เราพบปัญหาบางอย่างขณะโหลดไฟล์",
    "SAnnQ": "กำลังโหลดไฟล์ {0}",
    "SBsDz": "ตั้งค่าสำหรับบัญชีผู้ดูแลระบบของคุณ",
    "SGs7B": "ตั้งค่า LafTools ของคุณอย่างรวดเร็ว",
    "SMqD13": "ป้อนเพื่อกรอง",
    "SPem9": "สนามนี้ยังไม่พร้อม",
    "SQAw7": "ภาษาต้นฉบับ",
    "SYSq1": "ตัวอย่าง",
    "SZgXb": "ตั้งค่ารหัสผ่านท้องถิ่น",
    "SdGcT": "ส่วนอื่นๆ",
    "Sm9tq": "กรุณาระบุรหัสผ่านบัญชีที่นี่",
    "Sm9tqq": "กรุณาระบุรหัสผ่านเพื่อปลดล็อค LafTools ของคุณ",
    "Spcfdee": "โหมดสว่างหรือมืด",
    "TBPqy7": "ภาษา",
    "TD7DA": "ภาษา",
    "TNoePE": "LafTools คลาวด์",
    "Ttrqqet": "เขียนและบันทึกความคิดของคุณที่นี่!",
    "TwFcr": "ภาษาเป้าหมาย",
    "TyqvWY3": "ไฟล์ในเครื่อง",
    "U2ZNl": "เรียนรู้เพิ่มเติมเกี่ยวกับวิกิพีเดีย",
    "U4qqq9": "ลบแท็บนี้ออกจากรายการ",
    "U7zP2": "กรุณาระบุชื่อผู้ใช้บัญชีที่นี่",
    "UF_Dp": "เกิดข้อผิดพลาด: {0} เวลาที่ปฏิเสธคือ {1}",
    "UU_7h": "กรุณาคลิกรายการหมวดหมู่ใดๆ บนเมนูแรกด้านซ้าย หมวดหมู่ปัจจุบันว่างเปล่าหรือไม่ถูกต้อง",
    "UZ2Ig": "บัญชีท้องถิ่นใหม่",
    "Ugpng": "ที่ชื่นชอบ",
    "Uzqjy": "การนำไปปฏิบัติ",
    "V6U_f": "เงื่อนไขการให้บริการ",
    "V6XEO": "กรอกชื่อผู้ใช้หรืออีเมล",
    "VAZq8r": "ช่วยให้นักพัฒนาสามารถรันคำสั่งต่างๆ เช่น การรันสคริปต์ การติดตั้งแพ็คเกจ และการนำทางระบบไฟล์ ทั้งหมดนี้ทำได้จากภายในตัวแก้ไข",
    "VEfeqZG": "หมายเหตุ",
    "VI6VT": "ประวัติศาสตร์",
    "VOsZc": "รายงานปัญหา",
    "VSZ": "คลิกเพื่อทริกเกอร์อีกครั้ง",
    "VZtqg6": "สร้างแบบฟอร์มสคริปต์ใหม่",
    "Vaf2y": "ชื่อแท็บไม่สามารถเว้นว่างได้",
    "VeY9K": "ข้อกำหนดการใช้งาน",
    "VgG5y": "คลิกที่นี่เพื่อรีเฟรชสถานะของส่วนขยายของคุณ",
    "VjZCv": "การแปลงเรียลไทม์",
    "WPrTW": "เว็บไซต์อย่างเป็นทางการ",
    "WXo6D": "สดชื่น",
    "WYCVL": "การติดตั้งอย่างรวดเร็ว",
    "X4L_Z": "ไม่ได้ระบุส่วนขยาย VM",
    "X6Fq4j": "หลังจากหลายปีของการพัฒนาและปรับแต่งอย่างทุ่มเท เรามั่นใจว่า LafTools สามารถปรับปรุงประสบการณ์การเขียนโปรแกรมของคุณได้อย่างมากโดยนำความสะดวกสบายและประสิทธิภาพมาสู่ขั้นตอนการทำงานของคุณมากขึ้น",
    "XKpI0": "คลิกเพื่อประมวลผลข้อความของคุณในพื้นที่ป้อนข้อมูล",
    "XLWoR": "เลือกอันที่คุณต้องการและดำเนินการต่อ",
    "XQxJB": "พื้นที่ทำงานของฉัน",
    "X_HGx": "LafTools เป็นกล่องเครื่องมืออเนกประสงค์ที่ออกแบบมาเพื่อตอบสนองความต้องการที่หลากหลาย เป็นโอเพ่นซอร์สเต็มรูปแบบ รับประกันความโปร่งใสและความปลอดภัย แม้จะมีรันไทม์เพียงเล็กน้อย แต่ก็ให้การสนับสนุนแพลตฟอร์มเต็มรูปแบบ รวมถึง ARMv8 และการสนับสนุน AI ดั้งเดิมที่คล้ายกับ ChatGPT LafTools ได้รับการผสานรวมกับ UI ที่มีประสิทธิภาพและได้รับการอัปเดตด้วยเครื่องมือใหม่ๆ อย่างต่อเนื่อง สามารถใช้บนเว็บและกับ Docker และให้แหล่งข้อมูลเพิ่มเติม เช่น บันทึกย่อและคู่มือ",
    "XeXF77": "การตั้งค่า",
    "XikdD": "กรุณารอสักครู่ เราเกือบจะถึงจุดนั้นแล้ว!",
    "Y5GAC": "ชื่อผู้ใช้ของคุณ",
    "Y9mQ2": "กรุณาระบุชื่อผู้ใช้บัญชีที่นี่",
    "YAAU3q": "รหัสผ่านท้องถิ่น",
    "YHCjT": "LafTools รองรับธีมแสงและความมืดทั่วโลก ซึ่งมีประโยชน์โดยเฉพาะกับผู้เขียนโค้ดกะกลางคืน",
    "YNwKz": "ภาษาที่ไม่สนับสนุน: {0} จะใช้ภาษาอังกฤษเป็นค่าเริ่มต้น",
    "YOYTp": "การติดตั้งอย่างรวดเร็ว",
    "YPPPL": "สลับการมองเห็นแท็บแถบเครื่องมือ",
    "YQN9u": "เกิดข้อผิดพลาดขณะโหลด {0} โปรดตรวจสอบรายละเอียดด้านล่าง",
    "Y_k0z": "ลืมรหัสผ่าน?",
    "Ye3TXses": "เพื่อกำหนดค่าว่าการแปลงจะดำเนินการโดยอัตโนมัติหรือไม่เมื่อข้อความที่ป้อนมีการเปลี่ยนแปลง",
    "Ylq2X": "แก้ไขข้อผิดพลาด",
    "YquQqTXq": "วิ่งอัตโนมัติ?",
    "YrTdq": "ทั้งหมด",
    "YrVq683": "จดหมาย",
    "YrVqdd683": "คู่มือ",
    "Z2QTU": "เกี่ยวกับ",
    "Z3rhY": "ข้อความ",
    "Z7ALO": "สลับไปยังพื้นที่ทำงานที่เลือก",
    "Z7OTt": "ไฟล์ที่คุณเลือกมีขนาดใหญ่เกินไป โปรดเลือกไฟล์ที่มีขนาดน้อยกว่า 30MB",
    "ZAGva": "คุณแน่ใจหรือว่าจะลบพื้นที่ทำงานนี้",
    "ZAKaFq": "บัญชีคลาวด์ของฉัน",
    "ZW1Dgz": "ไม่มีข้อความที่ใช้ได้",
    "ZXRGC": "โปรดดูข้อผิดพลาด: {0}",
    "ZbD3F": "{0} สร้างขึ้นโดยทีมงาน LafTools",
    "Zk7JI": "มันยังไม่รองรับ",
    "ZrbduC": "ปิดแท็บทั้งหมด",
    "ZrbuC": "ปิดแท็บ",
    "_5OqeG": "ยกเลิกการทำเครื่องหมาย",
    "_LFF3": "หากคุณประสบปัญหาใด ๆ หรือมีข้อเสนอแนะใด ๆ ในขณะที่ใช้ LafTools โปรดติดต่อเราผ่านทางอีเมลหรือ GitHub ได้ตลอดเวลา เรายินดีที่จะปรับปรุง",
    "_trez": "สลับข้อความ",
    "_trqL": "กำลังดึงข้อมูลสำหรับทรัพยากรระบบ...",
    "_z3lR": "รีเฟรชโค้ด",
    "a3yqoz": "เปอร์เซีย",
    "a3z-3k12": "เครื่องมือที่อยู่ IP",
    "a4jbpq": "เช็ก",
    "a4r9t": "Base45 สามารถถอดรหัสสตริงที่เข้ารหัส Base45 ใด ๆ โดยไม่คำนึงถึงที่มาได้หรือไม่",
    "a4s6x": "Base32 ทำงานอย่างไร?",
    "a8b7z": "ดังนั้น การเติมจึงมีความจำเป็นก็ต่อเมื่อกลุ่มบิตสุดท้ายที่ถูกเข้ารหัสไม่สามารถหารด้วย 40 บิตได้ (เนื่องจากอักขระ Base32 8 ตัวแทน 40 บิต) การเติมจะประกอบด้วยอักขระ '=' ตั้งแต่ศูนย์ถึงหกตัวที่ส่วนท้ายของสตริงที่เข้ารหัส",
    "aCkOP": "ออก",
    "aHAfR": "กำลังเรียกข้อมูลสำหรับ {0}...",
    "aSOpr": "เครื่องสร้างแบบจำลองข้อมูล",
    "ab9c0d1e": "การดำเนินการหลัก ได้แก่ การเข้ารหัส (การแปลงไบนารีเป็น Base64) และการถอดรหัส (การแปลง Base64 กลับเป็นไบนารี)",
    "abc12345": "Base64 เป็นรูปแบบการเข้ารหัสที่แสดงข้อมูลไบนารีเป็นลำดับของอักขระ ASCII",
    "abcdef12": "Base64 ทำงานอย่างไร?",
    "about_LafTools_toolbox": "เกี่ยวกับ ลาฟทูลส์",
    "adpgq": "สร้างพื้นที่ทำงานใหม่",
    "ah-C4": "หมายเหตุใหม่",
    "aj3nhd": "เยอรมัน",
    "aked6": "อ้างอิง",
    "aked61": "การแนะนำ",
    "asElV": "ลบ",
    "az4uS2": "คุณแน่ใจหรือว่าจะออกจากระบบนี้? โปรดทราบว่าคุณจะถูกเปลี่ยนเส้นทางไปยังหน้าเข้าสู่ระบบ",
    "azpNX": "สมบูรณ์.",
    "b0qjSL": "โปรดป้อนไดเร็กทอรี {1} และสร้างไฟล์ {2} ใส่รหัสผ่านที่เข้ารหัสของคุณเป็นเนื้อหาไฟล์ทั้งหมด",
    "b6sx9b": "ฟิลิปปินส์",
    "b8g2k": "สถานการณ์การใช้งานสำหรับ Base32",
    "bP_6qG": "เคล็ดลับสำหรับการลืมรหัสผ่านของคุณ",
    "bT4R6": "แท็บใหม่",
    "bVlBN": "จีนเป็นอังกฤษ",
    "bcdef01a": "Base64 ทำงานโดยการแบ่งข้อมูลไบนารี่ออกเป็นกลุ่มๆ 6 บิต และแมปแต่ละกลุ่มกับอักขระเฉพาะจากตัวอักษร 64 ตัว (A-Za-z0-9+/)",
    "bhojei1": "จีนดั้งเดิม",
    "bjZyW": "แปลภาษา",
    "bors14": "ภาษาตุรกี",
    "bp_-b": "หากต้องการจัดการ LafTools อย่างสมบูรณ์ คุณต้องตั้งค่าผู้ดูแลระบบของคุณที่จุดเริ่มต้นของขั้นตอนการตั้งค่า เราได้ตรวจสอบการระบุตัวตนของคุณด้วยโทเค็นพารามิเตอร์ URL แล้ว โปรดมั่นใจได้ว่าไม่มีใครสามารถตั้งค่าการอนุญาตรูทของคุณได้ เว้นแต่เขาหรือเธอจะได้รับโทเค็นการตั้งค่า",
    "bqqrij": "สวาฮีลี",
    "c0eCw": "แปลข้อความของคุณเป็นภาษาใดก็ได้ที่คุณต้องการ",
    "c0v2p": "การดำเนินการทั่วไปกับ Base32",
    "c1p3b": "เมื่อรวมเข้าด้วยกันแล้ว ให้คัดลอกเทมเพลตที่ให้มาลงในโปรแกรม C++ ของคุณและแทนที่ตัวยึดตำแหน่งด้วยค่าที่เข้ารหัสจริงก่อนที่จะรันโปรแกรม",
    "c1p4b": "จากนั้นเลขทศนิยมแต่ละตัวจะถูกแปลงเป็นลำดับที่ไม่ซ้ำกันซึ่งประกอบด้วยอักขระ Base85 ห้าตัว หากส่วนท้ายเหลือน้อยกว่าสี่ไบต์ อาจมีการใช้การเสริม",
    "c2tpr": "ไลบรารี Apache Commons Codec มีฟังก์ชันการเข้ารหัสและถอดรหัส Base32 ใน Java",
    "c2vw9k": "แม้ว่า Base45 จะไม่ถูกนำมาใช้อย่างกว้างขวางเท่ากับ Base64 หรือ Base32 แต่ก็มีไลบรารีโอเพ่นซอร์สสำหรับหลายภาษา",
    "c5m1b": "อีกรูปแบบหนึ่งคือ Base58Flickr มีความแตกต่างเล็กน้อยในชุดอักขระ โดยแทนที่ '+' ด้วย ',' และ '/' ด้วย '-' ซึ่งปรับให้เข้ากับความต้องการ URL ของ Flickr",
    "c5meku": "ซุนดา",
    "c5p1b": "ไม่ได้ใช้ช่องว่างภายใน ความยาวของเอาต์พุตที่เข้ารหัสจะขึ้นอยู่กับขนาดของข้อมูลอินพุตโดยตรง",
    "c6p4n": "หลังจากติดตั้งไลบรารี ให้คัดลอกเทมเพลตที่ให้มาลงในสคริปต์ Python ของคุณแล้วรัน ไลบรารีมีฟังก์ชันในตัวสำหรับการแปลงระหว่างไบต์และสตริงที่เข้ารหัส Base45",
    "c6p9b": "หากความยาวของข้อมูลที่ป้อนเข้าไม่หารด้วย 8 จะไม่มีการใช้ช่องว่างภายใน แต่แต่ละกลุ่มที่ไม่เต็มจะได้รับการปฏิบัติอย่างเป็นอิสระแทน",
    "c7Uoqqe": "ก่อนที่จะใช้ LafTools โปรดระบุและยืนยันรหัสผ่านในเครื่องของคุณตามด้านล่างนี้",
    "c8me6b": "รูปแบบที่คล้ายกับ Base62 แบบกำหนดเองอาจได้รับการปรับแต่งสำหรับแอปพลิเคชันเฉพาะ แต่โดยทั่วไปแล้วจะยึดตามหลักการเดียวกันคือการใช้ชุดอักขระที่ใหญ่กว่า Base64 หรือ Base32",
    "c9j5k": "ดาวน์โหลดและรวมส่วนหัว 'base32.h' และการใช้งานที่เกี่ยวข้องในโปรเจ็กต์ของคุณ",
    "c9j5v": "ติดตั้งผ่าน Composer โดยเพิ่ม 'composer need christian-riesen/base32' ในโครงการของคุณ",
    "c9q7w": "เหตุใด Base45 จึงถูกสร้างขึ้น",
    "cNQp_": "ทรัพยากร",
    "cPS6q": "เครื่องมือทั้งหมด",
    "cQqwI8r": "กำลังโหลดสถานะของบริการเทอร์มินัล",
    "cbaq54321": "ไม่ Base64 ไม่ใช่เทคนิคการบีบอัด เพียงแต่เปลี่ยนการแสดงข้อมูล ไม่ใช่ขนาดของมัน",
    "cdefg234": "อักขระเสริม (=) จะถูกเพิ่มที่ส่วนท้ายเพื่อให้แน่ใจว่าความยาวของข้อมูลที่เข้ารหัสเป็นจำนวนทวีคูณของ 4 อักขระ",
    "cfYYN": "ค้นพบเพิ่มเติม",
    "ciZV2": "Base32 เป็นสัญลักษณ์สำหรับการเข้ารหัสข้อมูลไบต์ที่กำหนดเองโดยใช้ชุดสัญลักษณ์ที่จำกัด ซึ่งมนุษย์สามารถใช้งานได้สะดวกและประมวลผลโดยคอมพิวเตอร์ ใช้ชุดอักขระที่เล็กกว่า Base64 ซึ่งโดยปกติจะเป็นตัวอักษรตัวพิมพ์ใหญ่และตัวเลข 2 ถึง 7",
    "ciZV21": "Base45 เป็นสัญลักษณ์สำหรับการเข้ารหัสข้อมูลไบต์ที่กำหนดเองโดยใช้ชุดสัญลักษณ์แบบจำกัดที่มนุษย์สามารถใช้งานได้สะดวกและประมวลผลโดยคอมพิวเตอร์ ฐานตัวเลขสูงส่งผลให้สตริงสั้นกว่าระบบทศนิยมหรือฐานสิบหก Base45 ได้รับการปรับให้เหมาะสมสำหรับการใช้งานด้วยรหัส QR",
    "ciZV2deq1": "Base58 (คล้ายกับ Base64) คือสัญลักษณ์สำหรับการเข้ารหัสข้อมูลไบต์ที่กำหนดเอง มันแตกต่างจาก Base64 โดยการลบอักขระที่อ่านผิดได้ง่าย (เช่น l, I, 0 และ O) เพื่อปรับปรุงให้มนุษย์อ่านง่ายขึ้น Base58 มักใช้ในสกุลเงินดิจิทัล (Bitcoin, Ripple ฯลฯ)",
    "cj1pd": "รีเฟรชการดำเนินการ",
    "cjzqj9": "บอสเนีย",
    "cmxzpg": "มาลายาลัม",
    "coM2I": "ใช้ตัวแก้ไขอัจฉริยะ",
    "crD7I": "เพื่อกำหนดค่าว่าการแปลงควรละเว้นข้อความอินพุตว่างที่มีความยาวเป็นศูนย์หรือไม่",
    "cuRCb": "ไม่พบหมวดหมู่",
    "cuRCqb": "ไม่มีหมวดหมู่",
    "cxqhqa": "เมียนมาร์ (พม่า)",
    "d-l2l": "ยืนยัน",
    "d-qPr": "รูปแบบที่ไม่รู้จัก: {0}",
    "d1x7v": "อีกตัวอย่างหนึ่งคือใน Git ซึ่งบางครั้งออบเจ็กต์ที่แฮชจะถูกจัดเก็บในรูปแบบ Base32 เพื่อหลีกเลี่ยงปัญหาเรื่องการลงท้ายบรรทัดและข้อจำกัดของชื่อไฟล์ นอกจากนี้ HashiCorp Vault ยังใช้ Base32 สำหรับการรับคีย์อีกด้วย",
    "d2w4e": "เช่นเดียวกับระบบการแปลงฐานอื่นๆ Base62 ทำงานโดยการแปลงไบต์อินพุตให้เป็นจำนวนเต็มขนาดใหญ่ จากนั้นแสดงเป็นชุดอักขระจากชุดอักขระ 62 ตัว",
    "d2w6e": "โคลน/ดาวน์โหลดที่เก็บและรวมไฟล์ส่วนหัวที่ให้ไว้ในโปรเจ็กต์ของคุณ รวบรวมและเชื่อมโยงกับไฟล์ต้นฉบับตามเอกสารประกอบของโครงการ",
    "d3w2e": "Base58 ทำงานโดยการแปลงไบต์อินพุตให้เป็นจำนวนเต็มขนาดใหญ่ จากนั้นแสดงจำนวนเต็มนั้นเป็นการรวมอักขระจากชุดอักขระ 58 ตัว (A-Z, a-z, 1-9)",
    "d5KZH": "ขอขอบคุณที่ใช้ LafTools!",
    "d5LAU": "ได้รับอนุญาตภายใต้ AGPLv3",
    "d5fmq2": "ภาษาอิตาลี",
    "d5hit": "เซสชัน - {0}",
    "d5x1rl": "สเปน",
    "d6g0w": "ข้อมูลโค้ดนี้สามารถดำเนินการในสภาพแวดล้อม Python ใดก็ได้ รวมถึงสคริปต์ เซสชันแบบโต้ตอบ หรือภายในแอปพลิเคชันขนาดใหญ่",
    "d6y9k": "หากมีไบต์ไม่เพียงพอที่จะเติมกลุ่มสุดท้าย จะไม่มีการใช้ช่องว่างภายใน บิตที่เหลือจะถูกประมวลผลและแมปกับอักขระที่เกี่ยวข้องแทน",
    "d7w2e": "Base85 ทำงานโดยการแบ่งข้อมูลอินพุตออกเป็นกลุ่มๆ ละ 4 ไบต์ และแปลงแต่ละกลุ่มให้เป็นเลขทศนิยมระหว่าง 0 ถึง 2^32-1",
    "d8w1b": "คุณสามารถทำได้โดยใช้ pip โดยเรียกใช้ `pip install base45` หรือ `python -m pip install base45`",
    "d9w7m": "นอกจากนี้ เนื่องจากใช้เฉพาะอักษรตัวพิมพ์ใหญ่ จึงไม่สามารถใช้การรวมความไวของตัวพิมพ์ที่เป็นไปได้ทั้งหมดได้ เนื่องจากมาตรการรักษาความปลอดภัยเพิ่มเติม เช่น Base64 บางครั้งทำกับการพับตัวพิมพ์ระหว่างการถอดรหัส",
    "dCFIC": "โค้ดสวยกว่า",
    "dCFIwC": "เครื่องกำเนิดรหัส",
    "dGKMx": "เอาท์พุต",
    "dGVUB": "เครื่องมือเครือข่าย",
    "dV5Eq": "รีเฟรชรายการพื้นที่ทำงาน",
    "dWbBm": "C# รวมคลาส 'System.Convert' ด้วยวิธีการในตัว ToBase64String และ FromBase64String ที่อนุญาตให้คุณเข้ารหัสและถอดรหัสข้อมูล Base64 ขั้นแรกสตริงอินพุตจะถูกแปลงเป็นอาร์เรย์ไบต์โดยใช้การเข้ารหัส UTF-8 จากนั้นจึงเข้ารหัสและถอดรหัสตามลำดับ",
    "dk122q": "จัดการขั้นตอนการทำงานของคุณเพื่อรวมเครื่องมือต่างๆ เข้าด้วยกัน",
    "dkarh": "โอเค กล่องเครื่องมือเปิดไดเร็กทอรี หากไม่มีหน้าต่างป๊อปอัป โปรดตรวจสอบว่าแพลตฟอร์มของคุณรองรับฟังก์ชันนี้หรือไม่ หรือไดเร็กทอรีอยู่ในเซิร์ฟเวอร์",
    "dkjk12": "นี่คือการทดสอบ",
    "dkkq12": "กำหนดค่าเครื่องมือของคุณในแท็บนี้",
    "dl4kr": "ลืมรหัสผ่าน?",
    "dpRY4": "พจนานุกรม",
    "dqTqyvWY": "เมนูลิ้นชัก",
    "dsdpA_eJ": "ปรับขนาด",
    "dtjdt4": "คาซัค",
    "dxLQq": "การอนุญาตรูต",
    "dzjTo": "กรุณาระบุรหัสผ่านบัญชีที่นี่",
    "e--gB": "ไม่ได้ระบุรหัสส่วนขยาย",
    "e4Cd8t": "เบส85",
    "e5c7r": "Base32 เป็นรูปแบบการเข้ารหัสแบบไบนารีเป็นข้อความที่แสดงข้อมูลในสตริง ASCII โดยใช้ชุดย่อย 32 อักขระ ได้รับการออกแบบมาให้มนุษย์สามารถอ่านได้และปลอดภัยต่อ URL",
    "e5rycw": "คีร์กีซ",
    "e8Crq": "กรุณากรอกชื่อผู้ใช้และรหัสผ่านด้านล่างเพื่อดำเนินการต่อ",
    "e8x2v": "Base45 ทำงานโดยแบ่งข้อมูลอินพุตออกเป็นกลุ่ม ๆ ละ 5 ไบต์ จากนั้นจะแปลงแต่ละกลุ่มให้เป็นเลขทศนิยมและแมปให้เป็นอักขระที่สอดคล้องกันจากชุดอักขระ 45 ตัว",
    "eN4fM": "ใน Rust คุณสามารถใช้ลัง 'base64' สำหรับการเข้ารหัสและถอดรหัส Base64 เพิ่ม 'base64 = \\\"1.x\\\"' ลงในไฟล์ Cargo.toml ของคุณใต้ส่วน [การพึ่งพา] เรียกใช้ 'cargo build' และรวมการนำเข้าที่จำเป็นในโค้ดของคุณเพื่อใช้ฟังก์ชันเหล่านี้",
    "eTmq": "ประวัติความเป็นมาของกล่องเครื่องมือ CodeGen",
    "e_8pZ": "กล่องเครื่องมืออเนกประสงค์สำหรับนักพัฒนาเพื่อปรับปรุงประสิทธิภาพการทำงาน",
    "ediql2": "ภาษาฮังการี",
    "efg45678": "เปรียบเทียบกับ Base32",
    "efghi678": "รูปแบบนี้มักใช้กับชื่อไฟล์ URL หรือสถานการณ์ที่ต้องหลีกเลี่ยงอักขระพิเศษ",
    "egkqC8t": "เบส58",
    "egkqCd8t": "ฐาน62",
    "eifoni": "คาตาลัน",
    "eqkqd4W": "โปรดระบุชื่อสำหรับแท็กใหม่",
    "etV-l": "คัดลอกไฟล์ไปยัง SIT2",
    "eu5mh0": "เบลารุส",
    "euaI8": "สร้างบัญชีท้องถิ่นใหม่",
    "euhy9v": "เอสโตเนีย",
    "f0q4w": "สถานการณ์การใช้งานยอดนิยมอย่างหนึ่งคือการสร้างคีย์ลับสำหรับการตรวจสอบสิทธิ์แบบสองปัจจัย (2FA) ซึ่งบริการต่างๆ เช่น Google Authenticator และ Yubikey ใช้ความลับที่เข้ารหัส Base32",
    "f1t2z": "Base62 ได้รับการพัฒนาเพื่อให้เป็นทางเลือกที่สั้นกว่าและปลอดภัยต่อ URL แทน Base64 โดยเฉพาะอย่างยิ่งสำหรับตัวระบุที่ไม่ซ้ำและ URL แบบสั้น",
    "f3ttw8": "ชาวเมารี",
    "f4t7z": "Base58 ได้รับการพัฒนาครั้งแรกสำหรับ Bitcoin เพื่อเป็นตัวแทนที่อยู่สาธารณะและคีย์ส่วนตัวโดยไม่มีความคลุมเครือ",
    "f5a0s": "นอกจากนี้ Base32 ยังสร้างเอาต์พุตที่ยาวกว่าแต่อาจเหมาะสมกับแอปพลิเคชันเฉพาะ เช่น ชื่อไฟล์มากกว่า เนื่องจากไม่มีอักขระพิเศษที่อาจขัดแย้งกับกฎของระบบไฟล์",
    "f5bLC": "เอกสารประกอบ",
    "f7akol": "ภาษาอังกฤษ",
    "f7t1z": "เพิ่มไลบรารีลงในโปรเจ็กต์ Xcode ของคุณด้วยตนเองหรือผ่านทางตัวจัดการแพ็คเกจ เช่น Swift Package Manager (SPM)",
    "f8n4m": "ความกะทัดรัดช่วยให้ใช้พื้นที่ในโค้ด QR ได้อย่างมีประสิทธิภาพมากขึ้น ขณะเดียวกันก็รักษาความสามารถในการอ่านด้วยเครื่องสแกนบาร์โค้ดมาตรฐาน",
    "f8wne": "รวมแพ็คเกจโดยการรัน 'Install-Package BouncyCastle' ใน Package Manager Console หรือเพิ่มลงในไฟล์ .csproj ของคุณ",
    "f9t1z": "Base85 ได้รับการพัฒนาในตอนแรกเพื่อแสดงข้อมูลไบนารีในเอกสาร PostScript อย่างมีประสิทธิภาพเพื่ออัตราส่วนการบีบอัดที่ดีขึ้น",
    "f9t2z": "เพิ่มสิ่งต่อไปนี้ลงในไฟล์ pom.xml ของคุณ: `<dependency> <groupId>org.iso</groupId> <artifactId>iso-base45</artifactId> <version>...</version> </dependency>` โดยที่ เวอร์ชันเป็นรุ่นล่าสุด",
    "fBP5h": "ชื่อผู้ใช้",
    "fEr5j": "สร้างสคริปต์ใหม่",
    "fTt2N": "Perl ต้องการโมดูล 'MIME::Base64' สำหรับการเข้ารหัสและถอดรหัส Base64 ติดตั้งโดยการเรียกใช้ 'cpan ติดตั้ง MIME::Base64' หากยังไม่ได้ติดตั้ง",
    "fV_1P": "เข้าสู่ระบบ",
    "fdxluz": "โรมาเนีย",
    "ff02c": "ยกเลิก",
    "fghi6789": "ใช้ในการส่งหรือจัดเก็บไฟล์ไบนารี่ในรูปแบบข้อความ เพื่อให้มั่นใจถึงความเข้ากันได้ในระบบต่างๆ",
    "fgj880": "เตลูกู",
    "fqV_1P": "ปลดล็อค LafTools ของคุณ",
    "g1h5n": "Base45 ทำงานอย่างไร?",
    "g2_aX": "คัดลอกรหัสผ่านที่เข้ารหัสลงในไฟล์",
    "g3h5s": "Base85 ทำงานอย่างไร?",
    "g4h7s": "สำหรับ C++ คุณสามารถใช้ไลบรารี 'base45-cpp' ซึ่งสามารถใช้เป็นพื้นที่เก็บข้อมูล GitHub ได้",
    "g5SK9": "เปิดล่าสุด",
    "g5ybh": "เพิ่มการพึ่งพาให้กับโครงการของคุณ (Maven: 'org.apache.commons:commons-codec')",
    "g6f0r": "ไม่จำเป็นต้องติดตั้งเพิ่มเติมสำหรับไลบรารีหลักของ Ruby เพียงแทนที่ 'TEST12345' ด้วยค่าที่คุณต้องการ",
    "g6f0t": "เรียกใช้ 'go get github.com/mitchellh/go-base32' เพื่อเพิ่มการพึ่งพาให้กับโครงการของคุณ",
    "g6v3b": "อย่างไรก็ตาม ชุดอักขระที่ใหญ่ขึ้นของ Base45 อาจเพิ่มโอกาสที่จะเกิดข้อผิดพลาดเมื่อต้องรับมือกับอักขระที่ไม่ใช่ตัวอักษรและตัวเลข ซึ่งอาจเป็นปัญหาในบางสภาพแวดล้อมหรือช่องสัญญาณการส่งข้อมูล",
    "g7h5k": "Base58 ทำงานอย่างไร?",
    "g8h7s": "Base62 ทำงานอย่างไร?",
    "g8r3e": "ข้อเสียเปรียบหลักของ Base32 คือประสิทธิภาพพื้นที่ค่อนข้างต่ำ มันขยายข้อมูลอินพุตมากกว่า Base64 ประมาณ 25% ซึ่งหมายความว่าจะใช้พื้นที่จัดเก็บหรือแบนด์วิธมากขึ้นสำหรับข้อมูลที่เข้ารหัสในปริมาณเท่ากัน",
    "gDjbs": "ข้อมูลทางประวัติศาสตร์",
    "gK3dNQ": "สำเนา",
    "gQhfS": "เครื่องมือไฟล์",
    "gT6re": "C++ ไม่มีการใช้งาน Base64 ดั้งเดิม ตัวอย่างนี้ใช้ไลบรารี OpenSSL เพื่อทำการเข้ารหัสและถอดรหัส Base64 หากต้องการใช้ OpenSSL ให้ติดตั้งบนระบบของคุณและเชื่อมโยงกับไลบรารีที่เหมาะสมเมื่อทำการคอมไพล์โปรแกรมของคุณ",
    "gU1O2": "ทริกเกอร์",
    "gkC8t": "ฐาน64",
    "gkdqqC8t": "เบส45",
    "gkqC8t": "ฐาน32",
    "gnKMZ": "สดชื่น",
    "gsHQM": "โหลดข้อมูลตัวอย่างเรียบร้อยแล้ว",
    "h4e1b": "นอกจากนี้ยังมีประโยชน์สำหรับสถานการณ์ที่สตริงตัวอักษรและตัวเลขคละกันที่คำนึงถึงตัวพิมพ์เล็กและใหญ่จัดการได้ง่ายกว่าเลขฐานสิบหกหรือ base64 ซึ่งอาจมีอักขระที่ไม่ใช่ตัวอักษรและตัวเลขซึ่งอาจทำให้เกิดปัญหาในบางบริบท (เช่น URL หรือชื่อไฟล์)",
    "h6AeI": "การเชื่อมต่อ Websocket ปิดเมื่อ {0}",
    "h7rUq": "ใน Node.js คลาส 'Buffer' ในตัวสามารถรองรับการเข้ารหัสและถอดรหัส Base64 โดยไม่ต้องใช้ไลบรารีภายนอก ข้อมูลโค้ดนี้จะเข้ารหัสสตริง 'TEST12345' เป็น Base64 แล้วถอดรหัสกลับไปเป็นสตริงเดิม",
    "h9j3m": "การเสริมใน Base32",
    "hJUMN": "ภาษาเป้าหมาย",
    "hMvh1": "ฐานข้อมูลสำรอง",
    "hRFxV": "สำหรับข้อมูลเพิ่มเติม กรุณาเยี่ยมชมเว็บไซต์ของเรา",
    "hcnt1k": "มาซิโดเนีย",
    "hhOT3": "ค้นหาตามชื่อ",
    "hij90klm": "Base32 ใช้ตัวอักษรที่มีขนาดเล็กกว่า (A-Z2-7) ส่งผลให้สตริงยาวขึ้นแต่มนุษย์สามารถอ่านได้มากขึ้น",
    "htt1d2": "เอสเปรันโต",
    "hu-iz": "ตัวจับเวลา",
    "huE6U": "ตัวแปร",
    "hyV-d": "เสร็จแล้ว",
    "hyirc0": "ภาษาสวีเดน",
    "i27qmr": "ฟริเซียน",
    "i6hMN": "รหัสยืนยันรูปภาพ",
    "i7w2m": "มีไลบรารี Base45 ในตัวในภาษาโปรแกรมยอดนิยมหรือไม่",
    "i88tb": "ส่งออกผลลัพธ์เป็นไฟล์",
    "i8q8tb": "กำหนดค่าเวิร์กโฟลว์สำหรับการป้อนข้อมูล",
    "i9o7k": "ข้อดีของ Base32 มากกว่า Base64",
    "iNQvo": "แสดงตัวอย่างเพื่อเริ่มต้นด้วย",
    "iNqF1T": "จัดการบัญชีคลาวด์",
    "iOEjZ": "ไม่มีรหัสที่ใช้ได้",
    "iQL2c": "เรายังคงสำรวจฟังก์ชันทั้งหมดสำหรับปุ่มนี้ หากคุณมีข้อเสนอแนะหรือข้อเสนอแนะเกี่ยวกับวิธีที่เราสามารถปรับปรุงได้ โปรดแจ้งให้เราทราบ!",
    "i_lang_": "ชุดภาษา",
    "ib135dq": "ข้อความสถานะของคุณจะแสดงที่นี่",
    "iknTS": "ผู้จัดการรหัสผ่าน",
    "init_env": "กำลังโหลดทรัพยากรระบบ",
    "ip2g1": "คัดลอกแล้ว",
    "ipOSQE": "รุ่นโปร",
    "it8ths": "ชาวอินโดนีเซีย",
    "ixyP0": "ประมวลผลการดำเนินการแบบเรียลไทม์โดยอัตโนมัติ",
    "j1b5k": "การดำเนินการทั่วไปที่เกี่ยวข้องกับ Base32 ได้แก่ การเข้ารหัสข้อมูลไบนารี่ลงในสตริง Base32 และถอดรหัสสตริง Base32 กลับเป็นรูปแบบไบนารีดั้งเดิม",
    "j4s6r": "ฉันจะเข้ารหัส / ถอดรหัสด้วย Base62 ใน JavaScript ได้อย่างไร",
    "j5s7r": "ฉันจะเข้ารหัส / ถอดรหัสด้วย Base85 ใน JavaScript ได้อย่างไร",
    "j6s3r": "ฉันจะเข้ารหัส / ถอดรหัสด้วย Base58 ใน JavaScript ได้อย่างไร",
    "j7k2t": "หากต้องการเข้ารหัสข้อมูลด้วย Base45 คุณต้องมีไลบรารีหรือฟังก์ชันที่ใช้อัลกอริทึม Base45",
    "j8s6r": "สำหรับ Kotlin คุณสามารถใช้ไลบรารี 'barcode-core' ซึ่งรวมถึงฟังก์ชัน Base45",
    "j9s5r": "สำหรับ C# คุณสามารถใช้ไลบรารี 'Base45' ที่มีอยู่ใน NuGet",
    "jJuNz": "ภาษาต้นฉบับ",
    "jO5eP": "ตกลง",
    "jOXj0": "ขออภัย มีบางอย่างผิดพลาด",
    "jPNCb": "ลองใหม่แล้ว",
    "jQXdi": "โหมดแสง",
    "jR1zX": "เอไอ แล็บ",
    "jRzgS": "เฟรมเวิร์ก Foundation ของ Swift มีวิธีการเข้ารหัสและถอดรหัส Base64 ในตัว ไม่จำเป็นต้องมีไลบรารีภายนอก เพียงนำเข้า 'มูลนิธิ' เพื่อใช้คุณสมบัติเหล่านี้",
    "jZvLJ": "PHP มาพร้อมกับฟังก์ชัน 'base64_encode()' และ 'base64_decode()' ในตัวสำหรับจัดการการทำงานของ Base64 ฟังก์ชันเหล่านี้พร้อมใช้งานและไม่จำเป็นต้องตั้งค่าหรือติดตั้งเพิ่มเติม",
    "jaj7M": "สงวนลิขสิทธิ์.",
    "jb392": "ชื่อ",
    "jfpqt": "ตัวนำทางหมายเหตุ",
    "jgDoEq": "ไม่มีข้อมูลคำถามที่พบบ่อย",
    "jhDoE": "การดึงข้อมูลคำถามที่พบบ่อย",
    "jlxvpk": "เกาหลี",
    "k17PG": "การเชื่อมต่อ Websocket ปิดแล้ว",
    "k1k239q": "โปรดโหลดหน้าซ้ำหรือรีสตาร์ทแอปเพื่อใช้การเปลี่ยนแปลงนี้",
    "k1m4e": "อย่างไรก็ตาม มันไม่ได้ให้ประสิทธิภาพพื้นที่ค่อนข้างเหมือนกับ Base64 หรือ Base32 เนื่องจากใช้อักขระน้อยกว่าในตัวอักษร",
    "k2SVY": "ปิด",
    "k2em5e": "ส่งผลให้สตริงเอาต์พุตสั้นลงสำหรับข้อมูลอินพุตในปริมาณเท่ากัน ซึ่งอาจเป็นประโยชน์ในสถานการณ์ที่การลดขนาดเป็นสิ่งสำคัญ",
    "k2ku5p": "เช็ก",
    "k3m2e": "คัดลอกเทมเพลตที่ให้มาลงในไฟล์ Go ใหม่ แทนที่ตัวยึดตำแหน่งด้วยค่าที่เข้ารหัสจริง จากนั้นเรียกใช้ไฟล์โดยใช้ `go run yourfile.go`",
    "k41a5": "ลาฟทูลส์",
    "k4s5rx": "ภาษาสโลเวเนีย",
    "k7d9f": "ไลบรารี 'base32' ในตัวของ Ruby มีวิธีการเข้ารหัสและถอดรหัส Base32",
    "k7d9r": "แพ็คเกจ 'go-base32' มีความสามารถในการเข้ารหัสและถอดรหัส Base32 ใน Go",
    "k7g0n": "ใน Base32 ข้อมูลอินพุตทุกๆ 5 บิตจะถูกแมปกับหนึ่งใน 32 อักขระจากชุด 'ABCDEFGHIJKLMNOPQRSTUVWXYZ234567='",
    "k9em5e": "ทำให้เหมาะสำหรับสถานการณ์ที่ต้องการตัวระบุที่กระชับและเป็นมิตรกับ URL โดยไม่ต้องเสียสละความสามารถในการอ่าน",
    "k9jtr": "แพ็คเกจ npm 'การเข้ารหัส base32' ใช้สำหรับการเข้ารหัสและถอดรหัส Base32 ใน Node.js",
    "kLH79": "อีเมล",
    "kOi5A": "พิมพ์หน้า",
    "kPD22": "พจนานุกรม",
    "kPJ-A4": "รีเฟรช",
    "kZd9G": "Ruby มีไลบรารี 'base64' ในตัวที่ให้วิธีการเข้ารหัสและถอดรหัส Base64 รวมไลบรารีด้วย 'require \\\"base64\\\"' ในสคริปต์ของคุณ",
    "kcHxr": "กรุณาระบุชื่อผู้ใช้บัญชีผู้ดูแลระบบที่นี่",
    "kjks1": "กำลังดึงการกำหนดค่า i18n จาก API เซิร์ฟเวอร์ภายในเครื่อง",
    "kqv5ht": "ภาษายิดดิช",
    "krxSK": "ผู้ช่วยเอไอ",
    "ks12d": "ความปลอดภัยทางไซเบอร์",
    "kv4wag": "ภาษาดัตช์",
    "l1p9z": "Base32 คืออะไร?",
    "l3akoa": "อัมฮาริก",
    "l6Djb": "เลือกหนึ่งในตัวเลือกเป็นธีมที่คุณต้องการ:",
    "lIn3_": "ชื่อผู้ใช้ของผู้ดูแลระบบ",
    "lQFII": "ทริกเกอร์การเริ่มต้นอีกครั้ง",
    "lRHDQ": "ออกจากโหมดเต็มหน้าจอ",
    "lUh5c": "ทั่วไป",
    "lkuulh": "ภาษาฝรั่งเศส",
    "lp0qmd0": "ทำเครื่องหมายว่าเป็นรายการโปรด",
    "lpKAz": "การตั้งค่า",
    "lpzg83": "ซามัว",
    "lzGS2": "รายละเอียดส่วนขยาย",
    "m0106": "ตัวแปลง",
    "m0107": "เครื่องกำเนิดไฟฟ้า",
    "m0108": "ฟอร์แมตเตอร์",
    "m6d8b": "ค่า 5 บิตแต่ละค่าจะแสดงด้วยอักขระตัวเดียว ช่วยให้มีการเข้ารหัสและถอดรหัสที่มีประสิทธิภาพสำหรับระบบที่ต้องการทำงานกับออคเท็ต (หน่วย 8 บิต)",
    "m6t1b": "ไลบรารี 'base32' โดย Daniel R. Collins มีฟังก์ชันการเข้ารหัสและถอดรหัส Base32 ในภาษา C++",
    "m7WZw": "ระบบ Websocket ใช้งานไม่ได้",
    "m8rTc1": "เมื่อใช้งานตัวจัดการเชลล์สคริปต์แล้ว คุณจะสามารถใช้เพื่อจัดการคำสั่งเชลล์ของคุณได้",
    "m9k1z": "อย่างไรก็ตาม หากข้อมูลที่กำลังถอดรหัสมีความหมายแอปพลิเคชันเฉพาะ (เช่น รูปแบบโค้ด QR เฉพาะ) อาจจำเป็นต้องมีการประมวลผลเพิ่มเติมหลังจากการถอดรหัส",
    "mBgF1": "การกระทำของเมาส์",
    "mSFei": "ซอร์สโค้ดบน GitHub",
    "mWXeh": "รหัสพื้นที่ทำงาน: {0}",
    "mabHq": "ค้นหาไฟล์เก่า",
    "mbzCv": "เกิดข้อผิดพลาด: {0} เวลาที่ปฏิเสธคือ {1}",
    "mihc3": "เสร็จสิ้นการดำเนินการนี้",
    "mjHoR": "นอกจากนี้ ในทางเทคนิคแล้ว ไม่มีใครสามารถอ่านโทเค็นนี้ได้ ไม่เช่นนั้นเขาจะโจมตีและควบคุมคอมพิวเตอร์ของคุณ",
    "mnb19i": "เยอรมัน",
    "mno34567": "ข้อดีของ Base64",
    "mnoijklm": "มีการเข้ารหัส BaseXX อื่น ๆ หรือไม่",
    "mslw4o": "กรีก",
    "mwn7iv": "ซูลู",
    "myxedr": "มองโกเลีย",
    "n0pqrstu": "ตัวอย่างการใช้งาน Base64",
    "n1jA9": "ยืนยัน",
    "n24tes": "โปรตุเกส (บราซิล)",
    "n3e7r": "ประวัติความเป็นมาของ Base32",
    "n94an4": "ขัด",
    "n98EW": "สลับข้อความของภูมิภาคอินพุตและภูมิภาคเอาต์พุต",
    "nSeIq8-": "และที่สำคัญที่สุดคือเป็นบริการฟรีและโอเพ่นซอร์ส คุณสามารถใช้มันเพื่อวัตถุประสงค์ส่วนตัวหรือเชิงพาณิชย์ของคุณ",
    "nTvw4": "เพื่อปกป้องและบันทึกข้อมูลและการตั้งค่าของคุณแยกกัน คุณสามารถใช้บัญชีท้องถิ่นของคุณเพื่อบรรลุเป้าหมายดังกล่าว นอกจากนี้ LafTools จะรองรับวิดเจ็ตข้อความโต้ตอบแบบทันทีในหมู่ผู้ใช้ในอนาคต",
    "nmb1wx": "โยรูบา",
    "nodBw": "การดำเนินการนี้จะเข้ารหัสข้อมูลดิบเป็นสตริง ASCII {0}",
    "nopqrs01": "แม้ว่า Base64 จะปรับให้เหมาะสมกับความกะทัดรัด แต่ Base32 จะถูกเลือกเมื่อลดข้อผิดพลาดในการป้อนข้อมูลให้เหลือน้อยที่สุด เช่น การป้อนข้อมูลด้วยตนเอง ซึ่งถือเป็นสิ่งสำคัญ",
    "nrix6l": "ชิเชวา",
    "nxJC7": "การดำเนินการเริ่มต้นที่จะดำเนินการเมื่อดำเนินการหม้อแปลงไฟฟ้า",
    "o1umzi": "ภาษาฝรั่งเศส",
    "o52xW": "ส่งออก",
    "o8xyzu": "ภาษาลักเซมเบิร์ก",
    "oBz8D": "กำลังโหลด",
    "oNLxH": "ชื่อผู้ใช้",
    "oNg3f": "เว็บไซต์อย่างเป็นทางการ",
    "ocxsw3": "ไอริช",
    "of_ox": "โดยรวมแล้ว LafTools เป็นโซลูชั่นแบบครบวงจรสำหรับทุกความต้องการของคุณ",
    "oj23X": "กู้คืนฐานข้อมูล",
    "ooiFU": "เริ่มบริการ Java ใหม่",
    "oqHqVq": "เรียงตาม",
    "oqHqqV": "ทั้งหมด: {0} คำสั่ง",
    "oqHqqVq": "คัดลอกไทม์ส",
    "oqjbcj": "ลาว",
    "os8h6u": "ภาษาเดนมาร์ก",
    "p5e9n": "เพิ่มไลบรารีเป็นการพึ่งพาในสคริปต์สร้าง Gradle ของคุณ ตัวอย่างเช่น ในไฟล์ build.gradle ระดับแอป ให้เพิ่ม `implementation 'com.bottlerocketstudios:barcode-core:...''` ด้วยหมายเลขเวอร์ชันล่าสุด",
    "p6e3n": "หากต้องการติดตั้ง ให้รัน `Install-Package Base45` ใน Package Manager Console หรือเพิ่มการขึ้นต่อกันผ่าน NuGet Package Manager",
    "p8Exxc1s": "มีเครื่องมือมากมายที่ใช้ประโยชน์จากเทคโนโลยี AI เพื่อทำงานอย่างมีประสิทธิภาพมากขึ้นในห้องปฏิบัติการ AI",
    "p8eq9n": "คุณสามารถใช้ไลบรารีเช่น 'base85' หรือ 'ascii85' สำหรับการเข้ารหัสและถอดรหัส Base85 ใน JavaScript",
    "p9e1n": "คุณสามารถใช้ไลบรารีเช่น 'base-x' (<a href='https://github.com/cryptocoinjs/base-x'>ลิงก์ GitHub</a>) หรือ 'base62' (<a href='https: //www.npmjs.com/package/base62'>ลิงก์ npm</a>) สำหรับการเข้ารหัสและถอดรหัส Base62 ใน JavaScript",
    "p9s5t": "Base32 ได้รับการพัฒนาโดย Douglas Crockford ซึ่งเป็นที่รู้จักจากการมีส่วนร่วมใน JavaScript ในปี 2544 มันถูกสร้างขึ้นเพื่อเป็นทางเลือกที่เชื่อถือได้มากขึ้นสำหรับการเข้ารหัสที่มีอยู่เช่น Base64 โดยเฉพาะอย่างยิ่งสำหรับสถานการณ์ที่ต้องใช้การแสดงข้อมูลไบนารี่แบบข้อความ",
    "pANmj": "แท็กสามารถกำหนดได้ตามประเภทเซิร์ฟเวอร์ การใช้สคริปต์ หรือเกณฑ์อื่นๆ ที่คุณต้องการ",
    "pA_deJ": "ส่งออกไปยังคลิปบอร์ด",
    "pA_feeJ": "เชื่อมต่อเทอร์มินัลอีกครั้ง",
    "pA_qweJ": "ล้างบัฟเฟอร์",
    "pDBSWq": "ไม่มีเนื้อหาสำหรับแผงด้านขวา",
    "pEk1kk": "LafTools นำเสนอฟังก์ชันการทำงานที่เป็นประโยชน์สำหรับคุณที่นี่",
    "pEk1qkk": "แสดงรายการแท็บที่เปิดอยู่ทั้งหมด",
    "pHZDB": "การดำเนินการแบบเรียลไทม์",
    "pJoOz": "เปิดไฟล์",
    "pKHRT": "ไปที่เครื่องมือ",
    "pKqHRq": "ค้นหาหมายเหตุ",
    "pL6qH": "สมบูรณ์.",
    "ph5jH": "จัดการในส่วนนี้",
    "piih4x": "ทาจิก",
    "pmAee": "อ่านข้อมูลเพิ่มเติมเกี่ยวกับเครื่องมือนี้",
    "pmnp4b": "ภาษายูเครน",
    "ppmz8e": "ชาวเฮติครีโอล",
    "pq5e9n": "คุณสามารถใช้ไลบรารีเช่น 'bs58' เพื่อทำการเข้ารหัสและถอดรหัส Base58 ใน JavaScript",
    "pqrs890t": "ความเข้ากันได้สากล: Base64 ได้รับการยอมรับและรองรับอย่างกว้างขวางในภาษาการเขียนโปรแกรมหลักๆ ทั้งหมด",
    "pqs7y3": "โปรดพิจารณาลงทะเบียนหน้าเว็บนี้เป็น PWA เพื่อรับการสนับสนุนคีย์แมปเต็มรูปแบบ",
    "psA_eJ": "ส่งออกเป็นไฟล์",
    "psZoP": "วางไฟล์ที่นี่เพื่อประมวลผล",
    "psqqpq_o": "เอาล่ะ ผลลัพธ์ถูกคัดลอกไปยังคลิปบอร์ดของคุณแล้ว {0} ครั้ง",
    "q12beqwR": "ไม่มีเครื่องมือที่ใช้ได้",
    "q29t31": "ขัด",
    "q2n3r": "ปัจจุบันมีการนำไปใช้ในแอปพลิเคชันต่างๆ ที่ประสิทธิภาพพื้นที่และความสามารถในการอ่านเป็นสิ่งสำคัญ เช่น เอกสาร PDF และโปรโตคอลเครือข่ายบางอย่าง",
    "q2n9r": "เมื่อเพิ่มแล้ว ให้คัดลอกเทมเพลตที่ให้มาลงในไฟล์ Swift โปรดทราบว่าในตัวอย่างนี้ เรากำลังใช้สถานการณ์สมมติที่คุณมีการแสดง base64 ของสตริง Base45 แทนที่ด้วยค่าที่เข้ารหัสจริงก่อนที่จะรันโค้ด",
    "q2w5m": "วัตถุประสงค์ของการใช้ Base32?",
    "q2x8k": "การใช้งานได้ขยายไปสู่สกุลเงินดิจิทัลอื่น ๆ และสถานการณ์ที่ต้องการสตริงที่มนุษย์สามารถอ่านได้และป้องกันข้อผิดพลาด",
    "q5h8n": "ข้อได้เปรียบหลักคือความยาวสตริงลดลงสำหรับข้อมูลที่เข้ารหัสในปริมาณเท่ากัน ทำให้เหมาะสำหรับการใช้งานที่ประสิทธิภาพพื้นที่เป็นสิ่งสำคัญ",
    "q6K7o": "โหลดจากบันทึกย่อ",
    "q6n1r": "ไลบรารีมีคลาสตัวเข้ารหัสและตัวถอดรหัสที่จัดการการแปลง Base45 เมื่อเพิ่มการพึ่งพาแล้ว ให้คัดลอกโค้ดเทมเพลตลงในคลาส Java และดำเนินการ",
    "q7n3r": "นอกจากนี้ยังหลีกเลี่ยงอักขระที่ไม่ชัดเจน เช่น 'O' และ '0', 'I' และ 'l' ซึ่งอาจนำไปสู่ข้อผิดพลาดในการถอดเสียงโดยมนุษย์",
    "q9iuti": "เวลส์",
    "qDrbEr": "ชื่อผู้ใช้ที่คุณระบุว่างเปล่า โปรดตรวจสอบและลองอีกครั้ง",
    "qF4uS2": "สร้างพื้นที่ทำงาน",
    "qF4uS23": "หน้าต่างใหม่",
    "qHoktx": "ขอบคุณ!",
    "qN1LdZ2": "แก้ไขครั้งล่าสุด",
    "qQmBr": "การแปลข้อความ",
    "qTqyvWdY": "ยังไม่เสร็จ",
    "qWemXE4": "1 ม.ค. 2024",
    "qWw3eTH": "ส่วนนี้ช่วยรักษาไฟล์บนดิสก์ภายในเครื่องหรือคลาวด์ดิสก์ของคุณ",
    "qdeFXx": "ขณะนี้ หน้านี้ที่คุณค้นหายังใช้งานไม่ครบถ้วน",
    "qpDBSW": "ไม่มีแผงที่ใช้ได้",
    "qpDBSWe1": "ไม่มีแผงที่ใช้ได้",
    "qqK_x_": "เข้าสู่ระบบ",
    "qqqwYoz": "ช่วย",
    "qqwYoz": "แท็บ",
    "qqwYqwe": "พื้นที่ทำงาน",
    "qrstuvwx": "ใช่ นอกเหนือจาก Base64 และ Base32 แล้ว ยังมี Base16 (เลขฐานสิบหก), Base58 และ Base85 ซึ่งแต่ละประเภทได้รับการออกแบบมาสำหรับสถานการณ์ที่แตกต่างกัน",
    "qtpmvP": "ยืนยันรหัสผ่านท้องถิ่น",
    "qubSJ": "ส่วนขยาย VM ไม่ใช่ ID (อ้างอิง: IQnMH)",
    "qv1p5n": "ตัวอย่างเช่น ใน Java คุณสามารถใช้ไลบรารี 'org.iso.base45' เพื่อเข้ารหัสข้อมูลของคุณได้",
    "qzshys": "ภาษาอูรดู",
    "r1GLS": "แท็ก",
    "r2n7v": "ข้อได้เปรียบหลักคือเพิ่มความสามารถในการอ่านเนื่องจากการยกเว้นอักขระที่มีลักษณะคล้ายกัน ช่วยลดข้อผิดพลาดระหว่างการป้อนข้อมูลด้วยตนเอง",
    "r4n6v": "เพิ่มการพึ่งพาให้กับโครงการของคุณโดยเรียกใช้ `go get github.com/btcsuite/btcutil` นี่จะดาวน์โหลดและติดตั้งแพ็คเกจ",
    "r6nq2v": "ข้อได้เปรียบหลักของ Base62 คือประสิทธิภาพพื้นที่ที่เพิ่มขึ้นเนื่องจากชุดอักขระที่ใหญ่กว่า Base32 แต่ไม่มีอักขระที่ไม่ใช่ตัวอักษรและตัวเลขที่พบใน Base64",
    "r6tq9z": "<b>ตัวอย่าง:</b> หากต้องการเข้ารหัส 'TEST12345' ใน Base32 คุณสามารถใช้ไลบรารี เช่น base32-encode ใน Node.js หรือฟังก์ชันในตัวในภาษาอื่นๆ เช่น base64.b32encode ของ Python",
    "r8c6z": "แทนที่ 'TEST12345' ด้วยสตริงของคุณเองและรันคลาสนี้เป็นโปรแกรม Java เพื่อดูผลลัพธ์",
    "r8y2w": "ไลบรารี PHP 'Base32' ใช้สำหรับการเข้ารหัสและถอดรหัส Base32 ที่นี่",
    "r9a3t": "Base45 เป็นรูปแบบการเข้ารหัสแบบข้อความที่เข้ารหัสข้อมูลไบนารีเป็นอักขระ ASCII",
    "r9qn8v": "ข้อได้เปรียบหลักของ Base85 คือประสิทธิภาพพื้นที่ที่ดีขึ้นเนื่องจากชุดอักขระที่ใหญ่ขึ้น (85 เทียบกับ 64 ใน Base64 หรือ 32 ใน Base32)",
    "rK6cx": "{0} ออกแบบและพัฒนาโดยทีมงาน LafTools",
    "rLXJN": "ใน Kotlin คลาส 'android.util.Base64' ในตัวของ Android สามารถใช้สำหรับการเข้ารหัสและถอดรหัส Base64 ได้ ตัวอย่างนี้ถือว่าสภาพแวดล้อม Android; สำหรับโปรเจ็กต์ Kotlin ที่ไม่ใช่ Android ให้ลองใช้ 'java.util.Base64'",
    "rQkas": "ยินดีต้อนรับสู่ LafTools",
    "rR1vd": "อินพุตจากไฟล์",
    "rT34qnO": "ป้อนข้อความเพื่อการประมวลผล ผลลัพธ์จะแสดงในตัวแก้ไขเอาต์พุต",
    "rVqlu": "ถอดรหัส {0}",
    "rYSpw": "อัลกอริธึม MD2 (Message-Digest 2) เป็นฟังก์ชันแฮชการเข้ารหัสที่พัฒนาโดย Ronald Rivest ในปี 1989 อัลกอริธึมได้รับการปรับให้เหมาะกับคอมพิวเตอร์ 8 บิต<br><br>แม้ว่า MD2 จะไม่ถือว่าปลอดภัยอีกต่อไป แม้ว่าในปี 2014 ก็ตาม ยังคงใช้งานอยู่ในโครงสร้างพื้นฐานคีย์สาธารณะโดยเป็นส่วนหนึ่งของใบรับรองที่สร้างด้วย MD2 และ RSA อัลกอริธึมการแยกข้อความประกอบด้วย 18 รอบตามค่าเริ่มต้น",
    "r_n6h": "โหมดสว่างหรือมืด",
    "rf0mql3": "ธีมสว่างหรือมืด",
    "rpG0G": "เราให้ความสำคัญกับความคิดเห็นของคุณและยินดีรับฟังความคิดเห็นของคุณเกี่ยวกับวิธีที่เราสามารถปรับปรุงผลิตภัณฑ์ของเราได้ โปรดอย่าลังเลที่จะแบ่งปันความคิดเห็นของคุณกับเรา!",
    "run_text": "ก่อนที่จะเข้าสู่โต๊ะทำงานของคุณ เราต้องการโหลดทรัพยากรระบบที่จำเป็นล่วงหน้าก่อน กรุณารอสักครู่จะแล้วเสร็จเร็วๆ นี้ โดยมีรายละเอียดดังนี้",
    "rycJy": "LafTools เป็นกล่องเครื่องมืออเนกประสงค์ที่ออกแบบมาสำหรับโปรแกรมเมอร์โดยเฉพาะ มันแสดงถึงเวอร์ชันที่สองของ CodeGen Toolbox ซึ่งขณะนี้มีรันไทม์ที่เบากว่าที่เขียนใน Golang และ JavaScript",
    "ryhkqb": "บัลแกเรีย",
    "s0vrf9": "ภาษาฮีบรู",
    "s1b3m": "ต่างจาก Base64 หรือ Base32 ตรงที่ไม่รวมอักขระ '0', 'O', 'I' และ 'l' ที่สับสนได้ง่าย ทำให้เหมาะสำหรับ URL และโค้ด QR",
    "s3e6r": "ฉันจะเข้ารหัสข้อมูลโดยใช้ Base45 ได้อย่างไร",
    "s4OeX": "เข้าสู่ระบบสำเร็จ",
    "s5b8m": "แทนที่ 'TEST12345' ด้วยข้อมูลของคุณเอง และรันสคริปต์นี้ในสภาพแวดล้อม PHP เพื่อดำเนินการ Base32",
    "s5e8r": "แทนที่ 'TEST12345' ด้วยข้อมูลจริงของคุณและเรียกใช้ตัวอย่างนี้ภายในบริบทของแอปพลิเคชัน Swift เพื่อดำเนินการ Base32",
    "s5t0n": "การเติมใน Base32 เกี่ยวข้องกับการเพิ่มอักขระ '=' เพื่อให้แน่ใจว่าส่วนสุดท้ายของข้อมูลที่เข้ารหัสยังคงมีหลายบิต 8 บิต อย่างไรก็ตาม ไม่เหมือนกับ Base64 ตรงที่การเสริม Base32 นั้นน้อยมาก เนื่องจากอักขระ Base32 แต่ละตัวเข้ารหัสไว้ 5 บิตแล้ว",
    "s7e9r": "ไม่จำเป็นต้องมีไลบรารีภายนอก เพียงแทนที่ 'b'TEST12345'' ด้วยวัตถุที่มีลักษณะคล้ายไบต์จริงของคุณเพื่อเข้ารหัส/ถอดรหัส",
    "sBxHr": "Scala ใช้คลาส 'java.util.Base64' ในตัวของ Java สำหรับการดำเนินการ Base64 ตรวจสอบให้แน่ใจว่าคุณใช้งานบนแพลตฟอร์ม JVM ด้วย Java 8 หรือสูงกว่า",
    "sHoxxW": "การแปลง",
    "sKx5t": "คลาส 'java.util.Base64' ในตัวของ Java ซึ่งพร้อมใช้งานตั้งแต่ Java 8 จัดเตรียมวิธีสำหรับการเข้ารหัสและถอดรหัส Base64 สตริงอินพุตจะถูกแปลงเป็นไบต์โดยใช้การเข้ารหัส UTF-8 จากนั้นจึงเข้ารหัสและถอดรหัสตามความจำเป็น",
    "sO0MOe": "ทุกครั้งที่คุณอยู่ในหน้าต่างนานกว่า 5 วินาที หน้าต่างนั้นจะแสดงที่นี่",
    "sR8yc": "ปิด",
    "sc49my": "สินธี",
    "sdfk1": "เลื่อนแท็บไปทางซ้าย",
    "sdfk13": "เลื่อนแท็บไปทางขวา",
    "sglMS": "สร้างเวลา",
    "sk123": "ยังไม่เสร็จ",
    "slqcWD": "ส่วนลอจิกนี้ยังไม่รองรับ โปรดคอยติดตาม",
    "sojBI": "การแปลง",
    "spCqEa": "ทำ",
    "spdh98": "จีนตัวย่อ",
    "ssDaOq": "ยังใหม่กับ LafTools ใช่ไหม?",
    "ssm80i": "บาสก์",
    "svqh06": "อาเซอร์ไบจัน",
    "sys_updates": "การอัปเดตระบบล่าสุด",
    "t63Qw": "อนุญาตให้ออกไป",
    "t6wczq": "โคซา",
    "t7m4g": "กล่อง 'base32' ใช้สำหรับการเข้ารหัสและถอดรหัส Base32 ใน Rust",
    "t84q1z": "อาร์เมเนีย",
    "t8c6xc": "โซมาเลีย",
    "t8z1v": "เมื่อมีจำนวนบิตเหลือไม่เพียงพอที่จะเติมกลุ่ม 5 บิตให้เต็ม ระบบจะเพิ่มอักขระเสริม '=' ตัวอย่างเช่น ไบต์ต้องมีอักขระ Base32 สองตัว และลำดับ 3 ไบต์จะต้องมีอักขระ Base32 สี่ตัว",
    "t9m3g": "CryptoSwift เป็นแพ็คเกจ Swift ยอดนิยมที่มีฟังก์ชันการเข้ารหัสและถอดรหัส Base32",
    "tBIX-d": "หน้าต่าง",
    "tEiv_": "กำลังดึงรายละเอียดส่วนขยาย",
    "tIy3Q": "พบกับข้อผิดพลาด",
    "tIyq3Q": "พบกับข้อผิดพลาด",
    "tR8pY": "Go จัดเตรียมแพ็คเกจไลบรารีมาตรฐาน 'การเข้ารหัส/base64' พร้อมฟังก์ชันสำหรับการเข้ารหัสและถอดรหัส Base64 ไม่จำเป็นต้องพึ่งพาภายนอก เพียงนำเข้าแพ็คเกจนี้ไปยังโปรแกรม Go ของคุณและเรียกใช้ฟังก์ชันที่เหมาะสม",
    "tWe1yF": "ไม่มีคำสั่งเชลล์ที่ใช้ได้",
    "tY3p1": "ข้อมูลมากกว่านี้",
    "tiaiB": "ยกเลิก",
    "tn7duf": "โครเอเชีย",
    "ttAre": "ป้อนรหัสผ่านธรรมดาของคุณที่นี่",
    "tuv23456": "รูปแบบที่ปลอดภัยของ URL Base64",
    "twamg": "ผู้ช่วย AI เสริมพลังความคิดสร้างสรรค์ของคุณ",
    "tyhgpr": "ชวา",
    "u1i2b": "ข้อดีของการใช้ Base85 เหนือ Base64 หรือ Base32 คืออะไร",
    "u2l8s": "Base45 คืออะไร?",
    "u3i8b": "ข้อดีของการใช้ Base62 เหนือ Base64 หรือ Base32 คืออะไร",
    "u3j9p": "Base32 มักใช้เมื่อคุณต้องการการแสดงข้อมูลไบนารีในรูปแบบข้อความขนาดเล็กที่สามารถพิมพ์หรือพิมพ์ได้โดยไม่สูญเสียข้อมูล เช่น ในการตรวจสอบความสมบูรณ์ของไฟล์ geocaching และการสร้างรหัสผ่านที่ปลอดภัย",
    "u7i9b": "สำหรับ Go ให้ใช้แพ็คเกจ 'btcutil' ที่มีอยู่บน GitHub โดยเฉพาะโมดูล base58",
    "u7vwx8yz": "การดำเนินการ Base64 ทั่วไป",
    "u8i5b": "ข้อดีของการใช้ Base58 เหนือ Base64 หรือ Base32 คืออะไร",
    "u9g6t": "หากต้องการเรียกใช้โค้ดนี้ คุณต้องติดตั้งแพ็คเกจ '@digitalbazaar/base45'",
    "uCEe8": "การแปลงเรียลไทม์",
    "uFcDQ": "กำลังเริ่มต้นข้อมูลสถานะ...",
    "uV5Bi": "ไม่สามารถโหลดส่วนขยายได้",
    "uVseB": "กด {0} เพื่อแสดงรายการฮ็อตคีย์",
    "uW7eZ": "ใน C ไม่มีการใช้งาน Base64 ดั้งเดิม ตัวอย่างนี้ใช้ไลบรารี OpenSSL สำหรับการเข้ารหัสและถอดรหัส Base64 หากต้องการใช้ข้อมูลโค้ดนี้ ให้ติดตั้ง OpenSSL บนระบบของคุณและเชื่อมโยงกับไลบรารีที่เหมาะสมเมื่อคอมไพล์โปรแกรมของคุณโดยใช้คำสั่งที่คล้ายกับ 'gcc -o base64_example base64_example.c -lssl -lcrypto'",
    "ucDLv": "คุณได้คัดลอกรายการนี้มา {0} ครั้ง",
    "ui5pZ": "คำสั่งแยกวิเคราะห์",
    "ulah0q": "ญี่ปุ่น",
    "unc9E": "ข้อความสุ่ม",
    "usr_defined": "การตั้งค่าระบบ",
    "uvwxyza1": "ไม่มีการสูญเสียข้อมูล: เนื่องจากเป็นกระบวนการที่สามารถย้อนกลับได้ การเข้ารหัส Base64 จึงไม่ส่งผลให้ข้อมูลสูญหาย",
    "uwqGE": "ไปที่เครื่องมือ",
    "v3k5r": "ชุดอักขระประกอบด้วยตัวอักษรตัวพิมพ์ใหญ่และตัวพิมพ์เล็กทั้งหมด (A-Z, a-z) และตัวเลข (0-9) ซึ่งให้การแสดงที่มีขนาดกะทัดรัดมากขึ้นเมื่อเทียบกับ Base64 หรือ Base32",
    "v4k6r": "โดยจะเข้ารหัสข้อมูลในรูปแบบที่กะทัดรัดกว่าเมื่อเทียบกับ Base64 หรือ Base32 โดยใช้ชุดอักขระที่ใหญ่กว่า",
    "v4n9t": "Base58 เป็นรูปแบบการเข้ารหัสที่แสดงข้อมูลไบนารีเป็นลำดับของอักขระตัวอักษรและตัวเลข",
    "v5k3r": "ไลบรารีนี้มี API อย่างง่ายสำหรับการเข้ารหัสและถอดรหัส Base45 ในแอปพลิเคชัน Node.js หลังการติดตั้ง ให้คัดลอกเทมเพลตที่ให้มาลงในสคริปต์ของคุณ และรันด้วยตัวแปล Node.js",
    "v6qkl": "แพ็คเกจ BouncyCastle NuGet ให้การเข้ารหัสและถอดรหัส Base32 ใน C #",
    "v7q3db": "แบบไทย",
    "v9b7t": "แทนที่ 'TEST12345' ด้วยสตริงของคุณเอง และเรียกใช้แอปพลิเคชันคอนโซลนี้เพื่อดำเนินการเข้ารหัสและถอดรหัส Base32",
    "vOjNC": "ป้อนรหัสผ่านหรือรหัสความปลอดภัย",
    "vTsQU": "โปรดระบุรหัสเชิญจากผู้ดูแลระบบของคุณ",
    "vU17B": "ไม่สามารถส่งคำขอได้",
    "vWqac": "ก่อนที่จะเข้าสู่โต๊ะทำงานของคุณ เราต้องการโหลดทรัพยากรระบบที่จำเป็นล่วงหน้าก่อน กรุณารอสักครู่จะแล้วเสร็จเร็วๆ นี้ โดยมีรายละเอียดดังนี้",
    "vaP0vq": "ตั้งค่ารหัสผ่านภายในเครื่องสำเร็จ",
    "vci8rd": "ภาษาดัตช์",
    "vh9j4": "ป้อนข้อมูล",
    "vo1prl": "สเปน",
    "vr93oi": "ภาษาฟินแลนด์",
    "vrfjnf": "ภาษาอิตาลี",
    "vwx1yza2": "ตัวอย่างคือการเข้ารหัสไฟล์รูปภาพเพื่อฝังไว้ในแท็ก HTML <img>:",
    "w1x4k": "ใช่ มีหลายรูปแบบ รวมถึง Ascii85 (ใช้ใน PostScript และ PDF), Z85 (ZeroMQ) และ UUencode (รูปแบบเก่า) แต่ละคนมีชุดตัวละครและกฎที่แตกต่างกันเล็กน้อย",
    "w2x9qk": "แม้ว่า Base62 จะไม่มีตัวแปรที่สำคัญ แต่การใช้งานบางอย่างอาจแตกต่างกันเล็กน้อยในตัวเลือกชุดอักขระ เช่น การยกเว้น '+' หรือ '/' ที่ใช้กันทั่วไปใน Base64",
    "w3x7k": "ใช่ รูปแบบยอดนิยมบางรูปแบบ ได้แก่ Base58Check ซึ่งเพิ่มการตรวจสอบสำหรับการตรวจจับข้อผิดพลาด ซึ่งใช้กันทั่วไปใน Bitcoin",
    "w6otqn": "คอร์ซิกา",
    "w92j07": "ภาษารัสเซีย",
    "w9qudj": "ปัญจาบ",
    "wAxtg": "ในตอนแรก เราได้สร้าง UUID ให้เป็นโทเค็นที่ได้รับอนุญาตเพื่อให้คุณตั้งค่านี้ได้ จากสิ่งที่ LafTools ได้รับ โทเค็นที่คุณให้ไว้คือ {0} ซึ่งได้รับการยืนยันโดย LafTools เรียบร้อยแล้ว และด้วยเหตุนี้คุณจึงสามารถตั้งค่าแบบฟอร์มนี้ต่อไปได้",
    "wI1eh": "ต่อไป",
    "wQYoz": "ไฟล์",
    "wQdYoz": "แก้ไข",
    "wQdqwYoz": "ดู",
    "wcl1K": "การใช้งาน",
    "wgkk6y": "ภาษามอลตา",
    "wj3VS": "การดำเนินการนี้จะถอดรหัสข้อมูลจากสตริง ASCII {0} กลับเป็นรูปแบบ Raw",
    "wsWcXd": "การแจ้งเตือน",
    "wxyzabcd": "มี Base64 เวอร์ชันที่ปลอดภัยสำหรับ URL ซึ่งแทนที่ '+' ด้วย '-' และ '/' ด้วย '_' และละเว้นช่องว่างภายใน '=' ทำให้เหมาะสำหรับ URL ของเว็บ",
    "x009": "เพื่อเข้าถึงเอกสารการใช้งานของเรา",
    "x2c5e": "หากต้องการใช้ Base45 ใน Python คุณจะต้องติดตั้งไลบรารี 'base45'",
    "x2z6r": "Base58 คืออะไร?",
    "x5alzu": "เคิร์ด (Kurmanji)",
    "x5tHV": "ภาพรวมของระบบ",
    "x5z1b": "Base45 ได้รับการพัฒนาเพื่อใช้รหัส QR เป็นหลักภายในบริบทของใบรับรอง COVID ดิจิทัล",
    "x6v2w": "ไม่มีไลบรารี Base32 มาตรฐานในภาษา C ดังนั้นเราจึงใช้ไลบรารี 'libbase32' สมมุติที่นี่",
    "x7n1m": "Base62 เป็นรูปแบบการเข้ารหัสที่แสดงข้อมูลไบนารีเป็นลำดับอักขระตัวอักษรและตัวเลข 62 ตัว",
    "x8mdg": "โมดูล 'base64' ในตัวของ Python ให้การเข้ารหัสและถอดรหัส Base32 ผ่านฟังก์ชัน 'b32encode' และ 'b32decode'",
    "x9g7e": "ดาวน์โหลดซอร์สโค้ดจาก GitHub (https://github.com/dankamongmen/libbase32) หรือติดตั้งเป็นแพ็คเกจหากมีให้สำหรับแพลตฟอร์มของคุณ",
    "x9n1b": "Base85 เป็นรูปแบบการเข้ารหัสที่แสดงข้อมูลไบนารีโดยใช้ชุดอักขระ ASCII ที่พิมพ์ได้ 85 ตัว",
    "xMBv0": "กำลังโหลดทรัพยากรที่เกี่ยวข้อง...",
    "xOJqG1": "คำถามที่พบบ่อย",
    "xPHqP": "คำอธิบายยังไม่ได้กำหนด",
    "xQ_ls": "สำรองข้อมูล Redis",
    "xbz0B": "ปิดแท็บทั้งหมด",
    "xbz0B2": "ปิดแท็บ",
    "xdqwe": "ยินดีต้อนรับสู่การใช้ LafTools!",
    "xeP4zV": "ดูรายการสิ่งที่ต้องทำของคุณอย่างรวดเร็ว",
    "xeP4zVd": "ค้นหาคำศัพท์ภาษาอังกฤษอย่างรวดเร็ว",
    "xlqtA": "ข้อเสนอแนะ",
    "xs22XLF": "ไม่มีข้อมูลสำหรับรหัสรายการนี้ โปรดพิจารณาเลือกรายการอื่น",
    "y3b6n": "ใช่ ตราบใดที่สตริงที่เข้ารหัสถูกสร้างขึ้นตามข้อกำหนด Base45 ตัวถอดรหัสที่สอดคล้องใดๆ ก็สามารถถอดรหัสได้",
    "y3m7k": "สำหรับ Java ให้ใช้ไลบรารี 'iso-base45' ซึ่งสามารถรวมไว้ในโปรเจ็กต์ของคุณเป็นการพึ่งพา Maven",
    "y3m9k": "เหตุใด Base62 จึงถูกสร้างขึ้น",
    "y3qjdd": "รหัสผ่านในเครื่องของคุณได้รับการยืนยันเรียบร้อยแล้ว",
    "y5nne": "โค้ดนี้สามารถเรียกใช้ได้โดยตรงในสภาพแวดล้อม Node.js หรือเป็นส่วนหนึ่งของโปรเจ็กต์ขนาดใหญ่ที่คุณต้องการฟังก์ชัน Base32",
    "y6m8k": "เหตุใด Base85 จึงถูกสร้างขึ้น?",
    "y6t1n": "ข้อเสียของ Base32",
    "y8Ir5": "ส่วนนี้ใช้สำหรับการเริ่มต้นบัญชีผู้ดูแลระบบของคุณ อย่างไรก็ตาม สำหรับตอนนี้ คุณยังไม่จำเป็นต้องสร้างหรือปรับเปลี่ยนใดๆ ที่นี่ เนื่องจากผู้ดูแลระบบของคุณตั้งค่าไว้ก่อนหน้านี้ โปรดละเลยส่วนนี้และดำเนินการตามขั้นตอนที่เหลือ",
    "y8b1m": "แทนที่ 'TEST12345' ด้วยข้อมูลของคุณเอง และตรวจสอบให้แน่ใจว่าฟังก์ชันไลบรารีได้รับการใช้งานอย่างถูกต้องและเชื่อมโยงเพื่อคอมไพล์และรันโปรแกรมนี้สำหรับการดำเนินการ Base32",
    "y9m1n": "เหตุใด Base58 จึงถูกสร้างขึ้น?",
    "y9m3k": "สำหรับ Swift คุณสามารถใช้ไลบรารี 'Base45' ที่มีอยู่ใน GitHub",
    "y9z2e": "แทนที่ 'TEST12345' ด้วยส่วนไบต์จริงของคุณ และเรียกใช้โปรแกรม Go นี้เพื่อเข้ารหัสและถอดรหัสโดยใช้การเข้ารหัสมาตรฐาน Base32",
    "y9z2t": "รันสคริปต์นี้ในสภาพแวดล้อม Ruby เช่น IRB หรือบันทึกเป็นไฟล์ .rb และรันด้วย 'ruby filename.rb'",
    "ySVf-": "ลองคำขอนี้อีกครั้ง",
    "yVprb": "ส่วนนี้ยังอยู่ระหว่างการพัฒนา",
    "y_2Q1": "เข้ารหัสและถอดรหัส",
    "y_2Q2": "การเข้ารหัสแบบสมมาตร",
    "y_2Q3": "การเข้ารหัสแบบอสมมาตร",
    "y_2Q4": "อัลกอริทึมแห่งชาติของจีน",
    "y_2Q5": "การตรวจสอบสิทธิ์ทางเว็บ",
    "y_2Q5dqw": "ตัวจับคู่ข้อความ",
    "y_9YM": "ผลลัพธ์จะแสดงที่นี่",
    "y_9YqM": "กำลังโหลดไฟล์คงที่...",
    "y_BN6": "อัลกอริทึมย่อย",
    "ya0cwu": "มาเลย์",
    "yc7dqiu": "จีนตัวย่อ",
    "yfYeg": "เทมเพลตข้อความ",
    "yiRso": "บันทึกเมฆ",
    "ykganl": "ภาษาเดนมาร์ก",
    "yqiRso": "หมายเหตุท้องถิ่น",
    "yqrxl4": "เซอร์เบีย",
    "yznU9": "ข้อมูลต้นไม้ว่างเปล่า",
    "z-o28we": "แผงกระบวนการ",
    "z0j2nf": "ฮินดี",
    "z1m2t": "ตัวอย่างการใช้งาน: `const encoded = bs58.encode('your-data'); const ถอดรหัส = bs58.decode (เข้ารหัส); `",
    "z1n5qr": "ตัวอย่าง ได้แก่ แพ็กเกจ base45 npm สำหรับ JavaScript และ dotnet-base45 สำหรับ .NET",
    "z1oFn": "หลบหนีและหลบหนี",
    "z2jzej": "ภาษามราฐี",
    "z2m7t": "ตัวอย่างการใช้งาน: `const base62 = need('base62'); const เข้ารหัส = base62.encode('ข้อมูลของคุณ'); const ถอดรหัส = base62.decode (เข้ารหัส); `",
    "z2t7m": "Base85 คืออะไร?",
    "z2x8c": "Base32 มีความคลุมเครือทางสายตาน้อยกว่าเนื่องจากใช้เฉพาะตัวอักษรตัวพิมพ์ใหญ่และตัวเลข ทำให้ง่ายต่อการอ่านและถอดเสียงด้วยมือหรือทางโทรศัพท์ เมื่อเทียบกับ Base64 ซึ่งรวมถึง '+', '/' และตัวอักษรตัวพิมพ์เล็ก",
    "z3m1t": "หลังจากเพิ่มการพึ่งพาและซิงค์โปรเจ็กต์แล้ว ให้คัดลอกเทมเพลตที่ให้มาลงในคลาส Kotlin โดยแทนที่ตัวยึดตำแหน่งด้วยค่าที่เข้ารหัสจริงก่อนที่จะรันโค้ด",
    "z4t9b": "Base62 คืออะไร?",
    "z5b7m": "โดยจะใช้ตัวอักษรที่มีขนาดใหญ่กว่า (0-9, A-Z, a-z, -, ., $, /, +, % และ *) เมื่อเปรียบเทียบกับ Base64 หรือ Base32 ส่งผลให้สตริงที่เข้ารหัสสั้นลงสำหรับข้อมูลอินพุตเดียวกัน",
    "z5bvb": "ติดตั้งโดยการรัน 'npm install base32-encoding' แทนที่ \"TEST12345\" ด้วยข้อมูลอินพุตที่คุณต้องการในข้อมูลโค้ด",
    "z5m6t": "ตัวอย่างการใช้งาน: `const base85 = need('base85'); const เข้ารหัส = base85.encode('ข้อมูลของคุณ'); const ถอดรหัส = base85.decode (เข้ารหัส); `",
    "z6m1c": "รูปแบบต่อมา เช่น z-base-32 ได้รับการแนะนำเพื่อปรับปรุงการใช้งาน โดยแทนที่อักขระที่น่าจดจำบางตัวด้วยอักขระอื่นๆ แต่ข้อกำหนดดั้งเดิมของ Crockford ยังคงใช้กันอย่างแพร่หลายในปัจจุบัน",
    "z79b1a": "ภาษาอาหรับ",
    "z7n1m": "ใช้ npm หรือเส้นด้ายเพื่อติดตั้งโดยเรียกใช้ `npm install @digitalbazaar/base45` หรือ `yarn add @digitalbazaar/base45`",
    "z7t1p": "มี Base62 รุ่นพิเศษใดบ้างหรือไม่",
    "z8m2t": "ข้อดีของการใช้ Base45 เหนือ Base64 หรือ Base32 คืออะไร",
    "z8n6k": "แทนที่ 'TEST12345' ด้วยสตริงที่คุณต้องการ คอมไพล์และรันโปรแกรมนี้เพื่อดูผลลัพธ์การเข้ารหัสและถอดรหัส Base32",
    "z8qm2t": "ไลบรารีมีคลาสตัวเข้ารหัสและตัวถอดรหัสสำหรับการดำเนินการ Base45 คัดลอกโค้ดเทมเพลตลงในแอปพลิเคชันคอนโซล C# และดำเนินการหลังจากติดตั้งแพ็คเกจ",
    "z9b6n": "เพิ่มการพึ่งพาให้กับโครงการ Xcode ของคุณผ่าน Swift Package Manager ('https://github.com/krzyzanowskim/CryptoSwift')",
    "z9kVv": "Python มีโมดูล 'base64' ในตัวซึ่งมีวิธีการเข้ารหัสและถอดรหัส Base64 ขั้นแรกสตริงอินพุตจะถูกแปลงเป็นไบต์โดยใช้การเข้ารหัส UTF-8 ก่อนที่จะเข้ารหัสเป็น Base64 จากนั้นถอดรหัสกลับไปเป็นรูปแบบดั้งเดิม",
    "z9t2p": "มี Base58 รุ่นพิเศษใดบ้างหรือไม่",
    "z9t7p": "มี Base85 รุ่นพิเศษใดบ้าง?",
    "zN2ES": "พื้นที่ทำงาน",
    "zaSKh": "รีเฟรช",
    "zc3Hf": "รหัสผ่าน",
    "zjDJk": "โปรดระบุเส้นทางไดเรกทอรีพื้นที่ทำงาน",
    "zkqUFa": "{0} ยังไม่ได้กำหนดค่า",
    "zkv375": "เขมร",
    "zmDWx": "ติดต่อเรา",
    "znVRwq": "ไฟล์",
    "zpyd34": "ภาษาอังกฤษ",
    "zqiIoqXw": "กำลังคำนวณ...",
    "zwd4v": "รายละเอียดส่วนขยาย",
    "zwgYx": "ค่ารหัสผ่านที่เข้ารหัสจะแสดงที่นี่",
    "zyx98765": "Base64 สามารถใช้สำหรับการบีบอัดได้หรือไม่?",
    "zzcepr": "เซบู"
}