{
    "": "Tin nhắn: {0}",
    "-8l11": "Đã sao chép",
    "-DqwwR": "Hoạt động đã hoàn tất.",
    "-GJ_72": "Đã chuyển sang không gian làm việc đã chọn {0}",
    "-Jx4J": "Tài khoản địa phương",
    "-Rj3y": "Chủ đề",
    "-XZnW": "Mặt sau",
    "-Yo129I": "Công cụ văn bản",
    "01do0y": "tiếng Kannada",
    "04SSf": "Quên mật khẩu?",
    "07naT": "Lỗi: {0}",
    "07ui6": "Thêm thông tin",
    "0Ceqru": "Base64 là ký hiệu để mã hóa dữ liệu byte tùy ý bằng cách sử dụng một bộ ký hiệu hạn chế mà con người có thể sử dụng thuận tiện và được máy tính xử lý.",
    "0MO3jj": "MD5 (Message-Digest 5) là hàm băm được sử dụng rộng rãi. Nó đã được sử dụng trong nhiều ứng dụng bảo mật và cũng thường được sử dụng để kiểm tra tính toàn vẹn của tệp. Tuy nhiên, MD5 không có khả năng chống va chạm và không phù hợp với các ứng dụng như chứng chỉ SSL/TLS hoặc chữ ký số dựa vào thuộc tính này.",
    "0PgZ_": "Dịch",
    "0gvcN": "Chào mừng bạn đến với trang tổng quan, nó vẫn đang được phát triển.",
    "0gywa": "Không tìm thấy không gian làm việc, bạn sẽ được chuyển hướng đến trang chỉ mục không gian làm việc.",
    "0pfdz7": "tiếng Uzbek",
    "13pmE": "Hỗ trợ chúng tôi",
    "1507oa": "tiếng Bengali",
    "1JOFP": "Mở không gian làm việc của tôi",
    "1NTgQ": "Không gian làm việc mở",
    "1Npez": "Vui lòng cung cấp đường dẫn",
    "1Tuab": "Đã sao chép",
    "1X8x7": "Ví dụ",
    "1Xe82x7": "{0} Giảm thiểu",
    "1Xe8x7": "Làm đẹp CSS",
    "1YmJc": "Chọn một trong các tùy chọn làm ngôn ngữ ưa thích của bạn:",
    "1a3Sc": "Hủy tải",
    "1bd": "Quy trình làm việc",
    "1e3e5n": "Tiếng Hausa",
    "1h6jH": "Cảnh báo, đầu ra trống!",
    "1j62a": "Làm việc này vào lúc khác",
    "1jj0ri": "tiếng Nhật",
    "1k_44": "Hoạt động này giải mã dữ liệu từ chuỗi ASCII Base64 trở lại định dạng thô.",
    "1th2nw": "Sinhala",
    "1yIQu": "Bạn có thể thử xử lý lại hành động của mình hoặc nhấp vào nút bên dưới để loại bỏ lỗi.",
    "20nmcv": "Latin",
    "22XLF": "Chưa hoàn thành",
    "24vLI": "Tạo",
    "27j7sy": "Shona",
    "2D9a6": "Quên mật khẩu?",
    "2D9qdk6": "Nó có đủ an toàn không?",
    "2IF6A": "Có vẻ như việc lưu trữ giả mạo gặp phải một số vấn đề",
    "2JyFN": "Sao chép kết quả vào Clipboard",
    "2Ocbey": "Phiên bản",
    "2RhAT": "Có vẻ như quá trình truy xuất giả mạo gặp phải một số vấn đề",
    "2Ruh6": "Tạo tài khoản cục bộ mới",
    "2S5ap": "Bật chế độ toàn màn hình",
    "2Y1mR": "Xóa văn bản",
    "2bqHk": "Tải từ tập tin",
    "2e4fb7": "người Igbo",
    "2giYv": "Kiểm tra mật khẩu: {0}",
    "2khdsv": "Tiếng Pa-tô",
    "2lehqwp": "Tiếng Việt",
    "2lhcqwp": "tiếng Thổ Nhĩ Kỳ",
    "2lhqqwp": "tiếng Indonesia",
    "2lhqqwqp": "Mã Lai",
    "2lhqwwp": "tiếng Thái",
    "2qdin8": "Vui lòng nhập mã xác nhận",
    "2tib5m": "tiếng Thụy Điển",
    "2ybu7j": "người Na Uy",
    "30eo2v": "tiếng Gujarati",
    "32D9a6": "Tạo một tài khoản",
    "33RXi": "Yêu cầu đã bị từ chối do các tham số không đạt yêu cầu.",
    "346qid": "tiếng Nga",
    "39dsCt": "Bạn sẽ nhận được thông báo mới nhất từ ​​các dịch vụ ứng dụng nếu có.",
    "3ii2tt": "Tiếng Gaelic của Scotland",
    "3umnB": "Mã thông báo không xác định",
    "441oja": "tiếng Gruzia",
    "44Ntqw-": "Xử lý thao tác.",
    "46bksi": "tiếng Litva",
    "4K_vhq": "Sao chép tab này",
    "4PIqD": "Đánh giá mã",
    "4UYIJ": "Chưa hoàn thành.",
    "4cGA_": "Đang truy xuất dữ liệu về tùy chọn hệ thống...",
    "4kKe4": "Mật khẩu của bạn",
    "4tqb4x": "người Hungary",
    "4vdfwf": "ĐƯỢC RỒI",
    "4wlih": "Yêu cầu đã bị từ chối do các tham số không đạt yêu cầu.",
    "52OiQ": "Đã sao chép {0} lần",
    "54cwb": "API Websocket hệ thống đã gặp lỗi: {0}",
    "56ibcj": "Tiếng Việt",
    "58HQX": "Nếu bạn không biết giá trị của nó, vui lòng liên hệ với quản trị viên của bạn để biết thêm chi tiết, bạn có thể tìm thấy thông tin này trong cài đặt của anh ấy.",
    "5BOhl": "mã mời",
    "5Ih2u": "Công cụ điều hướng",
    "5NCPT": "Chế độ tối",
    "5NJeGsu1": "E-Mail, bạn có thể dễ dàng sắp xếp hộp thư đến, soạn và gửi thư cũng như luôn cập nhật thư từ của mình. Cho đến nay, nó chỉ được sử dụng như một công cụ giao tiếp giữa người dùng và nhóm của chúng tôi.",
    "5NJeddqGsu1": "Phần này bao gồm các tài liệu máy tính, bài viết wiki, hướng dẫn sử dụng, v.v.",
    "5NJedqddqGsu1": "Phần này bao gồm các tài nguyên máy tính có thể được sử dụng để xây dựng các dự án của riêng bạn.",
    "5Perd": "Rất tiếc, chức năng 'Sử dụng Trình chỉnh sửa Thông minh' hiện chưa khả dụng. Chúng tôi vẫn đang nỗ lực thực hiện nó. Cảm ơn vì sự kiên nhẫn của bạn.",
    "5ZBYR": "Mặt sau",
    "5dF7o": "Làm cho khỏe lại",
    "5eXVS": "Nội dung tập lệnh",
    "5ggegx": "Hàn Quốc",
    "5lW8qp": "Hiển thị một ví dụ cho công cụ này",
    "5q-Zxqa": "Trình quản lý tập lệnh",
    "5qPOJL": "Để hỗ trợ LafTools, hãy cân nhắc việc gắn sao cho kho lưu trữ của chúng tôi trên GitHub hoặc nâng cấp lên phiên bản chuyên nghiệp của chúng tôi thông qua đăng ký hàng tháng. Chúng tôi đánh giá rất cao sự giúp đỡ của bạn và chúng tôi hứa rằng LafTools sẽ còn trở nên tốt hơn nữa với số tiền quyên góp được.",
    "5qV5Sf": "Xóa bản ghi này khỏi danh sách",
    "5rg5mt": "Malagasy",
    "5srFq": "LafCông cụ",
    "5v8jl7": "người Mông",
    "6AumW": "Hành động mặc định",
    "6ClPV": "Tạo nên",
    "6MrfIfGc6": "Giảm thiểu mã",
    "6UICxHzVR.name": "Làm đẹp {0}",
    "6hsnqWe": "Mặc dù LafTools là nguồn mở và miễn phí nhưng việc duy trì nó vẫn đòi hỏi một lượng thời gian và năng lượng đáng kể. Đặc biệt, chúng tôi cần tiền để thanh toán cho một số API đám mây nhất định. Nếu bạn đánh giá cao LafTools, hãy cân nhắc ủng hộ chúng tôi.",
    "6j13s3": "tiếng Iceland",
    "6qT9d-N": "Đối với notebook, LafTools không chỉ cung cấp trình quản lý lệnh shell mà còn sẽ bổ sung thêm các công cụ ghi chú mạnh mẽ vào đó trong thời gian tới như MarkDown, Latex, {0}, v.v.",
    "6ulj8i": "tiếng Nepal",
    "6yOXx": "Cái tên không quen biết",
    "71x7x": "Mã nguồn trên GitHub",
    "7MOO1": "Đăng nhập",
    "7dm0d8": "Truyền thống Trung Quốc",
    "7g5w22": "người Na Uy",
    "7k56u3": "tiếng Galicia",
    "7q40W": "Không thể khởi tạo quản trị viên",
    "7u4vzu": "Tiếng Slovak",
    "7x3f6": "Tab - 1",
    "82r0C": "Quản lý danh sách TODO của bạn và hoàn thành công việc hiệu quả hơn.",
    "83dNp": "Không thể tải ID tiện ích mở rộng. (Tham khảo: 1dl1f)",
    "8LdRj": "Tổng quan",
    "8LdRjq": "Tính toán",
    "8LdevRj": "Dịch vụ",
    "8M1wY": "Nhà ga địa phương",
    "8eeL1Kk": "Về",
    "8mn_qa": "Đang lấy dữ liệu từ các dịch vụ đầu cuối...",
    "8qzWJu": "Rất tiếc, hiện tại chúng tôi chưa hỗ trợ thiết bị màn hình nhỏ, vui lòng sử dụng PC để truy cập trang này.",
    "97um9v": "tiếng Hawaii",
    "9Xv8-": "Lưu dưới dạng ghi chú",
    "9_qaj": "Thoát khỏi biểu mẫu này",
    "9e4fcl": "Tiếng Tamil",
    "9eZHM": "Ối! Có vẻ như chúng tôi gặp phải một số cảnh báo hoặc lỗi.",
    "9gqo8x": "tiếng Latvia",
    "9m85mf": "Sesotho",
    "9qy1xn": "tiếng Bồ Đào Nha",
    "9tbbkt": "tiếng Phần Lan",
    "9zCSc": "Không có không gian làm việc có sẵn",
    "A69UZ": "Biến",
    "AVUvu": "Base62 là ký hiệu để mã hóa dữ liệu byte tùy ý bằng cách sử dụng một bộ ký hiệu hạn chế mà con người có thể sử dụng thuận tiện và được máy tính xử lý. Cơ sở số cao dẫn đến các chuỗi ngắn hơn so với hệ thập phân hoặc thập lục phân.",
    "AW9N8": "Vùng đầu vào",
    "AfPC0": "Mật khẩu văn bản đơn giản của bạn",
    "Ahrjc": "Thư mục không tồn tại, bạn có muốn tạo nó không?",
    "AkXgF": "Đang tiến hành: {0}%",
    "Apx8D": "Làm cách nào để đặt lại mật khẩu của bạn theo cách thủ công?",
    "B0s0z": "Mục đích của trang này:",
    "BGd7P9": "Hoạt động này mã hóa dữ liệu thô thành chuỗi ASCII Base64.",
    "BGd7dP9": "Thao tác này mã hóa dữ liệu thô thành chuỗi ASCII {0}.",
    "BGdd7dP9": "Thao tác này mã hóa dữ liệu thô thành chuỗi ASCII {0}.",
    "BShq3M": "Các vấn đề",
    "BW3bpT": "Đọc file từ đĩa...",
    "Bd9h-": "Thêm nó vào bộ sưu tập yêu thích của tôi",
    "BuihG": "Cài đặt hệ thống",
    "C3L9MmdDU7": "Sổ tay",
    "CASef": "Được rồi, hoạt động đã được kích hoạt.",
    "CEv8B": "Bạn có chắc chắn xóa bản ghi này không? Nếu có, hãy nhấp vào nút này một lần nữa.",
    "CFg8B": "Kích thước phải nằm trong khoảng từ 0 đến 512",
    "CVUl0": "LafCông cụ",
    "CWoqhy": "Danh sách Exts theo CategoryID đã chọn",
    "CfZAX": "Tệp {0} đã được chọn, chúng tôi đang tải tệp đó lên dịch vụ cốt lõi.",
    "CidOqAZ": "Với tư cách là người tạo ra LafTools, tôi rất cảm động khi bạn sẵn sàng hỗ trợ chúng tôi. Chúng tôi có những người giỏi trong nhóm làm việc chăm chỉ để liên tục cải tiến LafTools.",
    "Cide2w": "Để xem có vấn đề gì trong khi thực hiện hành động của bạn không.",
    "DIQFq": "Vui lòng kiểm tra xem tham số URL đã được cung cấp đúng chưa, có vẻ như bạn không có quyền điền vào biểu mẫu này. Theo mặc định, bạn sẽ có thể thấy thông báo bên dưới trong đầu ra của dịch vụ khi nó vừa khởi chạy.",
    "DIweGq": "Bảo mật LafTools của bạn",
    "DSEtLTxUU": "Thời gian là tiền tệ của cuộc đời bạn, hãy sử dụng nó một cách khôn ngoan.",
    "DTTPW": "Thiết lập trạng thái",
    "DVoKw": "Đăng xuất hệ thống này",
    "DadYp": "Gỡ lỗi theo thời gian thực",
    "DqFI5": "Cấp độ phải lớn hơn 0",
    "DrXAq": "Chào mừng bạn đến sử dụng LafTools!",
    "DrbEr": "Mật khẩu bạn cung cấp trống, vui lòng kiểm tra và thử lại.",
    "DtlAc": "Đang tải tài nguyên hệ thống",
    "Dxlw0": "Hoàn thành",
    "E62ej": "Lọc lệnh Shell",
    "E6F9B": "Thêm nó vào quy trình làm việc",
    "EEQkeW": "Thuật toán MD6 (Message-Digest 6) là hàm băm mật mã. Nó sử dụng cấu trúc giống cây Merkle để cho phép tính toán băm song song rất lớn cho các đầu vào rất dài.",
    "ERK7E": "Nếu bạn gặp bất kỳ vấn đề nào hoặc có bất kỳ đề xuất nào khi sử dụng LafTools, vui lòng liên hệ với chúng tôi qua EMail hoặc GitHub bất cứ lúc nào, chúng tôi rất vui lòng được giúp đỡ bạn.",
    "EgBXL": "Chọn hoặc cung cấp thẻ.",
    "Ewvgo": "Vẫn chưa bắt đầu.",
    "ExqvX": "Danh sách phím nóng",
    "Eyq856": "Chúng tôi vẫn chưa hoàn thành - chúng tôi nỗ lực cung cấp các tính năng mới nhất và tuyệt vời nhất, đồng thời chúng tôi sẽ tiếp tục phát hành các bản cập nhật để đảm bảo bạn có trải nghiệm tốt nhất có thể.",
    "F-OUm": "Thiết lập nhanh cho LafTools",
    "F0CCF": "Danh sách phím nóng",
    "F4uS2": "Tập tin mới",
    "FBVyc": "Vui lòng nhập lại mã xác minh",
    "FDlRI": "Đặt tên cho tab mới này và nhấn vào để xác nhận.",
    "FOyHW": "Tìm kiếm mọi nơi",
    "FQzhg": "Bỏ qua đầu vào trống",
    "FYRoL": "Thụt lề và chỉnh sửa mã Cascading Style Sheets (CSS).",
    "FhVWl": "Mã hóa mật khẩu của bạn",
    "FjYbR": "đầu ra",
    "Fv-zz": "Sao chép kết quả",
    "Fy217": "Cấu hình công cụ này",
    "Fzp3t": "Cung cấp giá trị",
    "G3MJN": "Hiển thị bảng đầu ra",
    "G9QVo": "Quản lý tab",
    "GR7jK": "Kiểu",
    "Ggob_": "Hủy bỏ",
    "H-Ae75": "Vui lòng xác nhận mật khẩu cục bộ của bạn.",
    "H-qA75": "Vui lòng cung cấp mật khẩu cục bộ.",
    "H8fQ4": "Chuyển sang chế độ Sáng hoặc Tối",
    "HEAhr": "Sau khi dịch xong kết quả sẽ hiện ra ở đây.",
    "HIc3c": "Hoàn thành",
    "HNDat": "Để thực hiện thay đổi, vui lòng nhấp vào nút \"{0}\". Nếu không, hãy nhấp vào \"{1}\" để áp dụng các thay đổi của bạn. Chúc bạn có thời gian vui vẻ với hộp công cụ này!",
    "Hflf2": "Vì mục đích bảo mật mạng, chúng tôi sẽ không giúp đặt lại mật khẩu của bạn thông qua API hoặc các trang ở đây trừ khi bạn cập nhật tệp được hệ thống bảo vệ theo cách thủ công.",
    "HjvV3": "Chúng tôi sẽ không xóa các tập tin của nó trên đĩa, chỉ xóa bản ghi này khỏi danh sách.",
    "HyIC_": "Phím gạch chéo (/)",
    "HyIC_d": "Phím gạch chéo (/)",
    "I8FLi": "Bây giờ, đã đến lúc thiết lập quản trị viên của bạn, vui lòng đặt mật khẩu phức tạp nhất có thể để có thể khiến những kẻ tấn công bất lịch sự đó bối rối.",
    "IAC0A": "Công cụ tìm kiếm",
    "ICefi": "Đã hủy",
    "IKqqATS": "Làm mới dữ liệu trang hiện tại",
    "IOOrz": "(Nó có gây hại cho hệ thống của bạn không? Chúng tôi không nghĩ như vậy, miễn là bạn có thể sửa đổi tệp cấu hình được bảo toàn hệ thống, điều đó có nghĩa là bạn được cấp quyền đọc mọi thứ về tệp dữ liệu LafTools.)",
    "IWUH5": "Hiển thị ví dụ",
    "IaSyO": "Hủy bỏ",
    "IfsGO": "Yêu thích",
    "IfsdGO": "Yêu thích",
    "ImUmf": "Mới",
    "IxAJswoSh": "Phân tích cú pháp và in đẹp mã JavaScript hợp lệ. Cũng hoạt động với Ký hiệu đối tượng JavaScript (JSON).",
    "J-3KA": "Vui lòng cung cấp tên cho tập lệnh này, điều này sẽ hữu ích hơn.",
    "J164i": "ví dụ. Sao chép tập tin vào máy chủ từ xa",
    "J2xoL": "Vui lòng xem lỗi: {0}",
    "JA_Bp": "Trước tiên, vui lòng cung cấp tên cho thẻ mới.",
    "JQEVK": "Mã số",
    "JQLmS": "Đã điều chỉnh kích thước",
    "JQLmSq": "Hoàn thành.",
    "JTBRh": "LafTools đã lưu trữ giá trị mật khẩu vào tệp cục bộ, nhưng đừng lo lắng, chúng tôi đã áp dụng cơ chế mã hóa mật khẩu một chiều, nghĩa là không ai có thể đọc được mật khẩu của phiên bản văn bản thuần túy. Để đặt lại mật khẩu, vui lòng làm theo các công cụ bên dưới để đặt lại mật khẩu theo cách thủ công.",
    "JYqxz2": "Chào mừng bạn đến với LafTools, đây là phiên bản nội bộ.",
    "JdqiUE8": "Thao tác này giải mã dữ liệu từ chuỗi ASCII (với bảng chữ cái bạn chọn, bao gồm các giá trị đặt trước) trở lại dạng thô.",
    "JdqidUE8": "Thao tác này giải mã dữ liệu từ chuỗi ASCII (với bảng chữ cái bạn chọn, bao gồm các giá trị đặt trước) trở lại dạng thô.",
    "JfFHw": "Nhận yêu cầu thông tin về không gian làm việc",
    "JiUE8": "Thao tác này giải mã dữ liệu từ chuỗi ASCII {0} trở lại định dạng thô.",
    "K1qJZI": "Chào mừng đến với LafTools, thưa Ngài.",
    "KGS2-": "Sau khi hoàn thành các bước trên, bạn có thể sử dụng mật khẩu mới để đăng nhập vào hệ thống của mình. Nếu bạn không thể truy cập hệ thống tệp, vui lòng yêu cầu quản trị viên hoặc bộ phận hỗ trợ CNTT của bạn tạo tệp đó. Nếu tập tin đã tồn tại thì hãy xóa nó đi và tạo lại tập tin mới.",
    "KIc63": "Chức năng chưa được hỗ trợ",
    "KYh1N": "Tất cả ghi chú",
    "KcqrRr": "Thẩm quyền giải quyết",
    "KcrRr": "Truy xuất dữ liệu triển khai mã",
    "KmEUF": "Cung cấp tổng quan nhanh về các công cụ hệ thống hiện tại.",
    "Kw4OJr": "Phần cuối",
    "Kyd9H": "Mã nguồn trên GitHub",
    "L-p-Y": "Sao chép nội dung của lệnh shell hiện tại vào clipboard",
    "L3zEM": "Hiển thị ví dụ",
    "L42mxa": "Vui lòng nhập văn bản nguồn của bạn vào trường này.",
    "L49kCq": "Vui lòng cung cấp và xác nhận mật khẩu khóa trong biểu mẫu này để bảo mật LafTools của bạn.",
    "L71q_N": "Mật khẩu bạn cung cấp trống, vui lòng kiểm tra và thử lại.",
    "L9bQku": "Giải mã {0}",
    "L9qbQku": "Giải mã {0}",
    "LAc1m": "Đã làm mới chế độ xem ứng dụng.",
    "LFdvM": "Chưa đăng nhập",
    "LM715": "Truy xuất cấu hình i18n từ API máy chủ cục bộ",
    "LPJrV": "Sao chép kết quả",
    "LU9Jj": "Base85 (còn gọi là Ascii85) là ký hiệu để mã hóa dữ liệu byte tùy ý. Base64 thường hiệu quả hơn.<br><br>Thao tác này giải mã dữ liệu từ chuỗi ASCII (với bảng chữ cái bạn chọn, bao gồm các giá trị đặt trước). Base85 thường được sử dụng ở các định dạng tệp PostScript và PDF của Adobe.",
    "LWaeFqd": "Chuyển sang ngôn ngữ ưa thích của bạn",
    "Le71_N-": "Mật khẩu bạn cung cấp không giống với mật khẩu đã xác nhận, vui lòng kiểm tra và thử lại.",
    "LnJ4H": "Lưu ý rằng tài khoản cục bộ hoàn toàn không giống với người dùng đã đăng ký trên trang web của chúng tôi, tài khoản trước chỉ được xác định trên PC của bạn trong khi tài khoản sau có thể được sử dụng để đồng bộ hóa trên đám mây.",
    "LqWaFd": "Cài đặt hệ thống",
    "M3qytc": "Mã hóa {0}",
    "M3ytc": "Đến Base64",
    "M4ywN1": "Máy tính, Lịch, Đồng hồ, Thời tiết, v.v.",
    "M6MrW": "Tốt",
    "M7jct": "Vào chế độ toàn màn hình",
    "MN2lT": "Độ dài của Mật khẩu không thể nhỏ hơn 6",
    "Ma5mv": "Chuyển đổi chế độ hiển thị của các tab thanh công cụ",
    "Mq9pdpT": "Liệt kê tất cả các tài nguyên có liên quan cho menu chức năng bạn đã chọn.",
    "Mq9ppT": "Xem nhanh trạng thái dịch vụ của bạn",
    "Mqq9pdpT": "Giúp bạn bắt đầu với LafTools.",
    "MrgmU": "Xác nhận",
    "NMLOn": "Sao chép đường dẫn tệp",
    "NMLOn1": "Không gian làm việc mở",
    "NNfJo": "Tải dữ liệu từ tệp",
    "Nq1IR": "Không thể tải tiện ích mở rộng VM",
    "Nqc0LqwX": "Nếu bạn cho rằng có lỗ hổng trong quá trình này, vui lòng liên hệ với chúng tôi qua EMail hoặc GitHub bất kỳ lúc nào, chúng tôi muốn cải thiện lỗ hổng đó một cách khẩn cấp.",
    "O02-W": "Không tải...",
    "O94Yx": "TRÊN",
    "OO0qPN": "Ví dụ đã được tải",
    "OQWm4": "Báo cáo lỗi",
    "OSHOI": "Trang chào mừng",
    "OSqZQM": "Mật khẩu cục bộ",
    "OeO0PeN": "Được rồi, ví dụ được hiển thị trong trình soạn thảo đầu vào.",
    "OeOQY": "LÀM",
    "Ol1ZcWomT": "{0} Làm đẹp",
    "OpPFe": "Nếu bạn thích LafTools, hãy chia sẻ nó với bạn bè của bạn và cho chúng tôi một ngôi sao, cảm ơn!",
    "Opcty": "Các tập tin",
    "OqqGx2qg": "Đang tải tài nguyên tĩnh, vui lòng đợi...",
    "OrCt5": "Đang chuyển hướng đến bàn làm việc...",
    "Ot6EP": "Dụng cụ đánh bóng",
    "P4ROa": "Vùng đầu ra",
    "PM_N5": "Phiên - {0}",
    "PUxuU": "Đang lấy dữ liệu cho gói ngôn ngữ...",
    "PapkF": "Nếu bạn có bất kỳ câu hỏi hoặc đề xuất nào về LafTools, vui lòng cho chúng tôi biết. Chúng tôi luôn tìm cách cải thiện sản phẩm của mình và cung cấp trải nghiệm tốt nhất có thể cho người dùng. Bạn có thể liên hệ với chúng tôi tại work7z@outlook.com. Cảm ơn bạn đã sử dụng LafTools!",
    "PpCHA": "Khóa câu hỏi(?)",
    "PqazM-": "Trước hết, vui lòng sử dụng các điều khiển biểu mẫu bên dưới để mã hóa mật khẩu của bạn",
    "QL9Sn": "Hiện tại, dường như không có mô tả nào.",
    "QLKzF": "Nó có rất nhiều tính năng đáp ứng nhu cầu của cả nhà phát triển mới làm quen và nhà phát triển có kinh nghiệm, khiến nó trở thành công cụ bắt buộc phải có trong kho vũ khí của bất kỳ lập trình viên nào.",
    "QM2Ob": "Công cụ gần đây",
    "QM2Oq": "Ghi chú gần đây",
    "QRAdA": "từ tiếng Anh sang tiếng Trung",
    "QhdpH": "Ấn bản cộng đồng",
    "QzlA3": "Đã xảy ra lỗi",
    "R12bq": "Liệt kê các tab không được hiển thị",
    "RNBze0": "Công cụ",
    "RNeBze0": "Tab đã mở",
    "RNewBze0": "Cấu hình công cụ",
    "RO4ZP": "Đã xảy ra lỗi",
    "RPVRl": "Có vẻ như tiện ích mở rộng này không tương thích với phiên bản hiện tại của LafTools. Vui lòng xem xét cài đặt phiên bản mới nhất để hỗ trợ tiện ích mở rộng này hoặc vui lòng liên hệ với chúng tôi bằng cách nêu vấn đề trên GitHub.",
    "RhqzcdD": "Cài đặt hệ thống",
    "RjCO3": "Danh sách không gian làm việc",
    "S4MMV": "Ối! Chúng tôi đã tìm thấy một số vấn đề khi tải tệp.",
    "SAnnQ": "Đang tải tệp {0}",
    "SBsDz": "Thiết lập cho tài khoản quản trị viên của bạn.",
    "SGs7B": "Thiết lập LafTools của bạn một cách nhanh chóng",
    "SMqD13": "Nhập để lọc",
    "SPem9": "Lĩnh vực này vẫn chưa sẵn sàng.",
    "SQAw7": "Ngôn ngữ nguồn",
    "SYSq1": "Ví dụ",
    "SZgXb": "Thiết lập mật khẩu cục bộ",
    "SdGcT": "Phần khác",
    "Sm9tq": "Vui lòng cung cấp mật khẩu tài khoản tại đây",
    "Sm9tqq": "Vui lòng cung cấp mật khẩu để mở khóa LafTools của bạn",
    "Spcfdee": "Chế độ sáng hoặc tối",
    "TBPqy7": "Ngôn ngữ",
    "TD7DA": "Ngôn ngữ",
    "TNoePE": "Đám mây LafTools",
    "Ttrqqet": "Viết và lưu suy nghĩ của bạn ở đây!",
    "TwFcr": "Ngôn ngữ mục tiêu",
    "TyqvWY3": "Tệp cục bộ",
    "U2ZNl": "Tìm hiểu thêm trên Wikipedia",
    "U4qqq9": "Xóa tab này khỏi danh sách",
    "U7zP2": "Vui lòng cung cấp tên người dùng tài khoản tại đây",
    "UF_Dp": "Đã xảy ra lỗi: {0}, thời gian bị từ chối là {1}",
    "UZ2Ig": "Tài khoản cục bộ mới",
    "Ugpng": "Yêu thích",
    "V6U_f": "Điều khoản dịch vụ",
    "V6XEO": "Nhập tên người dùng hoặc Email",
    "VAZq8r": "Nó cho phép các nhà phát triển thực thi nhiều lệnh khác nhau, chẳng hạn như chạy tập lệnh, cài đặt gói và điều hướng hệ thống tệp, tất cả đều từ bên trong trình chỉnh sửa.",
    "VEfeqZG": "Ghi chú",
    "VI6VT": "Lịch sử",
    "VOsZc": "Báo cáo phát hành",
    "VSZ": "Bấm để kích hoạt lại",
    "VZtqg6": "Tạo biểu mẫu tập lệnh mới",
    "Vaf2y": "Tên tab không được để trống.",
    "VeY9K": "Điều khoản sử dụng",
    "VgG5y": "Nhấp vào đây để làm mới trạng thái tiện ích mở rộng của bạn",
    "VjZCv": "Chuyển đổi thời gian thực",
    "Vvt09V2Qo": "Mã chung",
    "WFUWzv_px": "Phân tích cú pháp và in đẹp mã JavaScript hợp lệ. Cũng hoạt động với Ký hiệu đối tượng JavaScript (JSON).",
    "WPrTW": "Trang web chính thức",
    "WXo6D": "Đã làm mới",
    "WYCVL": "Cài đặt nhanh",
    "X4L_Z": "VM mở rộng không được cung cấp.",
    "X6Fq4j": "Sau nhiều năm phát triển và cải tiến tận tâm, chúng tôi tin tưởng rằng LafTools có thể nâng cao đáng kể trải nghiệm lập trình của bạn bằng cách mang lại sự thuận tiện và hiệu quả hơn cho quy trình làm việc của bạn.",
    "XKpI0": "Nhấp để xử lý văn bản của bạn trong vùng nhập",
    "XLWoR": "Chọn cái bạn thích và tiếp tục",
    "XQxJB": "Không gian làm việc của tôi",
    "X_HGx": "LafTools là một hộp công cụ đa năng được thiết kế để đáp ứng nhiều nhu cầu khác nhau. Nó hoàn toàn là nguồn mở, đảm bảo tính minh bạch và bảo mật. Mặc dù có thời gian chạy nhẹ nhưng nó cung cấp hỗ trợ nền tảng đầy đủ, bao gồm ARMv8 và hỗ trợ AI gốc tương tự như ChatGPT. LafTools được tích hợp cao với giao diện người dùng hiệu quả và được cập nhật liên tục với các công cụ mới. Nó có thể được sử dụng trên web và với Docker, đồng thời cung cấp các tài nguyên bổ sung như ghi chú và hướng dẫn sử dụng.",
    "XeXF77": "Cài đặt",
    "XikdD": "Xin vui lòng chờ một chút, chúng ta sắp đến nơi rồi!",
    "Y5GAC": "Tên người dùng của bạn",
    "Y9mQ2": "Vui lòng cung cấp tên người dùng tài khoản tại đây",
    "YAAU3q": "Mật khẩu cục bộ",
    "YHCjT": "LafTools hỗ trợ chủ đề sáng và tối toàn cầu, đặc biệt hữu ích với các lập trình viên làm ca đêm.",
    "YNwKz": "Ngôn ngữ không được hỗ trợ: {0}, sẽ sử dụng tiếng Anh theo mặc định.",
    "YOYTp": "Cài đặt nhanh",
    "YPPPL": "Chuyển đổi chế độ hiển thị của các tab thanh công cụ",
    "YQN9u": "Đã xảy ra lỗi khi tải {0}, vui lòng kiểm tra chi tiết bên dưới.",
    "Y_k0z": "Quên mật khẩu?",
    "Ye3TXses": "Để định cấu hình xem quá trình chuyển đổi có được thực hiện tự động hay không khi văn bản đầu vào được thay đổi.",
    "Ylq2X": "Sửa lỗi",
    "YquQqTXq": "Tự động chạy?",
    "YrTdq": "Tất cả",
    "YrVq683": "Thư",
    "YrVqdd683": "Hướng dẫn sử dụng",
    "Z2QTU": "Về",
    "Z3rhY": "Tin nhắn",
    "Z7ALO": "Đã chuyển sang không gian làm việc đã chọn",
    "Z7OTt": "Tệp bạn chọn quá lớn, vui lòng chọn tệp nhỏ hơn 30MB.",
    "ZAGva": "Bạn có chắc chắn xóa không gian làm việc này không?",
    "ZAKaFq": "Tài khoản đám mây của tôi",
    "ZW1Dgz": "Không có tin nhắn nào",
    "ZXRGC": "Vui lòng xem lỗi: {0}",
    "ZbD3F": "{0}, được tạo bởi nhóm LafTools",
    "Zk7JI": "Nó vẫn chưa được hỗ trợ",
    "ZrbduC": "Đóng tất cả cửa sổ",
    "ZrbuC": "Đóng tab",
    "_5OqeG": "Bỏ đánh dấu nó",
    "_LFF3": "Nếu bạn gặp bất kỳ vấn đề nào hoặc có bất kỳ đề xuất nào khi sử dụng LafTools, vui lòng liên hệ với chúng tôi qua EMail hoặc GitHub bất cứ lúc nào, chúng tôi sẵn sàng cải thiện nó.",
    "_trez": "Hoán đổi văn bản",
    "_trqL": "Đang truy xuất dữ liệu về tài nguyên hệ thống...",
    "_z3lR": "Làm mới mã",
    "a3yqoz": "tiếng Ba Tư",
    "a3z-3k12": "Công cụ địa chỉ IP",
    "a4jbpq": "tiếng Séc",
    "aCkOP": "Lối ra",
    "aHAfR": "Đang tìm nạp dữ liệu cho {0}...",
    "aSOpr": "Trình tạo mô hình dữ liệu",
    "about_LafTools_toolbox": "Giới thiệu về LafTools",
    "adpgq": "Tạo không gian làm việc mới",
    "ah-C4": "Ghi chú mới",
    "aj3nhd": "tiếng Đức",
    "aked6": "Người giới thiệu",
    "aked61": "Giới thiệu",
    "asElV": "Di dời",
    "az4uS2": "Bạn có chắc chắn đăng xuất khỏi hệ thống này không? Lưu ý rằng bạn sẽ được chuyển hướng đến trang đăng nhập.",
    "azpNX": "Hoàn thành.",
    "b0qjSL": "Vui lòng nhập thư mục {1} và tạo tệp {2}, đặt mật khẩu được mã hóa của bạn làm toàn bộ nội dung tệp.",
    "b6sx9b": "Tiếng Philippin",
    "bP_6qG": "Lời khuyên cho việc quên mật khẩu của bạn",
    "bT4R6": "Tab mới",
    "bVlBN": "Tiếng Trung sang tiếng Anh",
    "bhojei1": "Truyền thống Trung Quốc",
    "bjZyW": "Dịch",
    "bors14": "tiếng Thổ Nhĩ Kỳ",
    "bp_-b": "Để quản lý đầy đủ LafTools, bạn cần thiết lập quản trị viên của mình khi bắt đầu quy trình thiết lập. Chúng tôi đã xác minh danh tính của bạn bằng mã thông báo tham số URL, hãy yên tâm rằng không ai khác có thể thiết lập quyền root của bạn trừ khi họ có được mã thông báo thiết lập.",
    "bqqrij": "tiếng Swahili",
    "c0eCw": "Dịch văn bản của bạn sang bất kỳ ngôn ngữ nào bạn muốn.",
    "c5meku": "Tiếng Sundan",
    "c7Uoqqe": "Trước khi sử dụng LafTools, vui lòng cung cấp và xác nhận mật khẩu cục bộ của bạn như bên dưới.",
    "cMBqyyFae": "Thụt lề và chỉnh sửa mã Ngôn ngữ truy vấn có cấu trúc (SQL).",
    "cNQp_": "Tài nguyên",
    "cPS6q": "Tất cả công cụ",
    "cQqwI8r": "Đang tải trạng thái của Dịch vụ đầu cuối",
    "cfYYN": "Khám phá nhiều hơn",
    "ciZV2": "Base32 là ký hiệu để mã hóa dữ liệu byte tùy ý bằng cách sử dụng một bộ ký hiệu hạn chế mà con người có thể sử dụng thuận tiện và được máy tính xử lý. Nó sử dụng bộ ký tự nhỏ hơn Base64, thường là bảng chữ cái viết hoa và các số từ 2 đến 7.",
    "ciZV21": "Base45 là ký hiệu để mã hóa dữ liệu byte tùy ý bằng cách sử dụng một bộ ký hiệu hạn chế mà con người có thể sử dụng thuận tiện và được máy tính xử lý. Cơ sở số cao dẫn đến các chuỗi ngắn hơn so với hệ thập phân hoặc thập lục phân. Base45 được tối ưu hóa để sử dụng với mã QR.",
    "ciZV2deq1": "Base58 (tương tự Base64) là ký hiệu dùng để mã hóa dữ liệu byte tùy ý. Nó khác với Base64 ở chỗ loại bỏ các ký tự dễ đọc sai (tức là l, I, 0 và O) để cải thiện khả năng đọc của con người. Base58 thường được sử dụng trong tiền điện tử (Bitcoin, Ripple, v.v.).",
    "cj1pd": "Làm mới hoạt động",
    "cjzqj9": "tiếng Bosnia",
    "cmxzpg": "Mã Lai",
    "coM2I": "Sử dụng Trình chỉnh sửa thông minh",
    "crD7I": "Để định cấu hình xem phép chuyển đổi có nên bỏ qua văn bản đầu vào trống có độ dài bằng 0 hay không.",
    "cuRCb": "Không tìm thấy danh mục.",
    "cuRCqb": "Danh mục không tồn tại",
    "cxqhqa": "Myanmar (Miến Điện)",
    "d-l2l": "Xác nhận",
    "d-qPr": "Bố cục không xác định: {0}",
    "d5KZH": "Cảm ơn bạn đã sử dụng LafTools!",
    "d5LAU": "Được cấp phép theo AGPLv3",
    "d5fmq2": "người Ý",
    "d5hit": "Phiên - {0}",
    "d5x1rl": "người Tây Ban Nha",
    "dCFIC": "Mã đẹp hơn",
    "dCFIwC": "Trình tạo mã",
    "dGKMx": "đầu ra",
    "dGVUB": "Công cụ mạng",
    "dQwjNbi0y": "Tìm hiểu thêm về Tài liệu",
    "dV5Eq": "Làm mới danh sách không gian làm việc",
    "dk122q": "Quản lý quy trình công việc của bạn để kết hợp nhiều công cụ với nhau.",
    "dkarh": "Okie, hộp công cụ đã mở thư mục. Nếu không có cửa sổ bật lên, vui lòng kiểm tra xem nền tảng của bạn có hỗ trợ chức năng này hay thư mục có trong máy chủ hay không.",
    "dkjk12": "đây là bài kiểm tra",
    "dkkq12": "Định cấu hình công cụ của bạn trong tab này.",
    "dl4kr": "Quên mật khẩu?",
    "dpRY4": "Từ điển",
    "dqTqyvWY": "Menu ngăn kéo",
    "dsdpA_eJ": "Điều chỉnh kích thước",
    "dtjdt4": "Kazakhstan",
    "dxLQq": "Quyền gốc",
    "dzjTo": "Vui lòng cung cấp mật khẩu tài khoản tại đây",
    "e--gB": "ID tiện ích mở rộng không được cung cấp.",
    "e4Cd8t": "Base85",
    "e5rycw": "Tiếng Kyrgyzstan",
    "e8Crq": "Vui lòng điền vào trường tên người dùng và mật khẩu bên dưới để tiếp tục.",
    "eTmq": "Lịch sử của Hộp công cụ CodeGen",
    "e_8pZ": "Một hộp công cụ đa năng dành cho các nhà phát triển để cải thiện năng suất.",
    "ediql2": "người Hungary",
    "egkqC8t": "cơ sở58",
    "egkqCd8t": "cơ sở62",
    "eifoni": "tiếng Catalan",
    "eqkqd4W": "Vui lòng cung cấp tên cho thẻ mới",
    "etV-l": "Sao chép tập tin vào SIT2",
    "eu5mh0": "Người Belarus",
    "euaI8": "Tạo tài khoản cục bộ mới",
    "euhy9v": "tiếng Estonia",
    "f3ttw8": "người Maori",
    "f5bLC": "Tài liệu",
    "f7akol": "Tiếng Anh",
    "fBP5h": "tên tài khoản",
    "fEr5j": "Tạo tập lệnh mới",
    "fV_1P": "Đăng nhập",
    "fdxluz": "người Rumani",
    "ff02c": "Đã hủy",
    "fgj880": "tiếng Telugu",
    "fqV_1P": "Mở khóa LafTools của bạn",
    "g2_aX": "Sao chép mật khẩu được mã hóa vào tập tin",
    "g5SK9": "Mở gần đây",
    "gDjbs": "Dữ liệu lịch sử",
    "gK3dNQ": "Sao chép",
    "gQhfS": "Công cụ tập tin",
    "gU1O2": "bị kích hoạt",
    "generic-NI-UFPTe0": "Làm đẹp mã chung",
    "generic-code-beautify.desc.2b3c": "Hoạt động này định dạng mã bằng nhiều ngôn ngữ lập trình khác nhau để cải thiện khả năng đọc bằng cách áp dụng thụt lề, ngắt dòng nhất quán và tuân thủ các nguyên tắc về văn phong dành riêng cho ngôn ngữ.",
    "gkC8t": "cơ sở64",
    "gkdqqC8t": "cơ sở45",
    "gkqC8t": "Cơ sở32",
    "gnKMZ": "Đã làm mới.",
    "h6AeI": "Kết nối Websocket đã đóng lúc {0}",
    "hJUMN": "Ngôn ngữ mục tiêu",
    "hMvh1": "Sao lưu cơ sở dữ liệu",
    "hRFxV": "Để biết thêm thông tin, vui lòng truy cập trang web của chúng tôi",
    "hX1CWGAhl": "Thụt lề và chỉnh sửa mã Ngôn ngữ đánh dấu mở rộng (XML).",
    "hcnt1k": "Tiếng Macedonia",
    "hhOT3": "Tìm kiếm theo tên",
    "htt1d2": "Quốc tế ngữ",
    "hu-iz": "hẹn giờ",
    "huE6U": "Biến đổi",
    "hyV-d": "Xong",
    "hyirc0": "tiếng Thụy Điển",
    "i27qmr": "tiếng Frisia",
    "i6hMN": "Mã xác minh hình ảnh",
    "i88tb": "Xuất kết quả sang tệp",
    "i8q8tb": "Định cấu hình quy trình làm việc cho đầu vào",
    "iNQvo": "Hiển thị một ví dụ để bắt đầu.",
    "iNqF1T": "Quản lý tài khoản đám mây",
    "iOEjZ": "Không có sẵn mã",
    "iQL2c": "Chúng tôi vẫn đang khám phá đầy đủ các chức năng cho nút này - nếu bạn có bất kỳ phản hồi hoặc đề xuất nào về cách chúng tôi có thể cải thiện nút này, vui lòng cho chúng tôi biết!",
    "i_lang_": "Gói ngôn ngữ",
    "ib135dq": "Thông báo trạng thái của bạn sẽ được hiển thị ở đây",
    "iknTS": "Trình quản lý mật khẩu",
    "init_env": "Đang tải tài nguyên hệ thống",
    "ip2g1": "Đã sao chép",
    "ipOSQE": "Phiên bản chuyên nghiệp",
    "it8ths": "tiếng Indonesia",
    "ixyP0": "Tự động xử lý hành động theo thời gian thực",
    "jJuNz": "Ngôn ngữ nguồn",
    "jO5eP": "ĐƯỢC RỒI",
    "jPNCb": "Đã thử lại.",
    "jQXdi": "Chế độ sáng",
    "jR1zX": "Phòng thí nghiệm AI",
    "jaj7M": "Đã đăng ký Bản quyền.",
    "jb392": "Tên",
    "jfpqt": "Điều hướng ghi chú",
    "jgDoEq": "Không có dữ liệu câu hỏi thường gặp",
    "jhDoE": "Truy xuất dữ liệu Câu hỏi thường gặp",
    "jlxvpk": "Hàn Quốc",
    "json-beautify.desc.0912": "Thao tác này định dạng dữ liệu JSON để cải thiện khả năng đọc bằng cách thêm thụt lề, ngắt dòng và sắp xếp khóa thích hợp một cách nhất quán.",
    "json-beautify.name.0912": "Định dạng SQL",
    "json-beautify.text.93kq": "Làm đẹp dữ liệu JSON",
    "k17PG": "Đã đóng kết nối Websocket.",
    "k2SVY": "tắt",
    "k2ku5p": "tiếng Séc",
    "k41a5": "LafCông cụ",
    "k4s5rx": "tiếng Slovenia",
    "kLH79": "E-mail",
    "kOi5A": "Trang in",
    "kPD22": "Từ điển",
    "kPJ-A4": "Làm cho khỏe lại",
    "kcHxr": "Vui lòng cung cấp tên người dùng tài khoản quản trị viên tại đây",
    "kjks1": "Truy xuất cấu hình i18n từ API máy chủ cục bộ",
    "kqv5ht": "tiếng Yiddish",
    "krxSK": "Trợ lý AI",
    "ks12d": "An ninh mạng",
    "kv4wag": "tiếng Hà Lan",
    "l3akoa": "tiếng Amharic",
    "l6Djb": "Chọn một trong các tùy chọn làm chủ đề ưa thích của bạn:",
    "lIn3_": "Tên người dùng quản trị viên",
    "lQFII": "Kích hoạt lại quá trình khởi tạo",
    "lRHDQ": "Thoát chế độ toàn màn hình",
    "lUh5c": "Tổng quan",
    "lkuulh": "người Pháp",
    "lp0qmd0": "Đánh dấu nó là yêu thích",
    "lpKAz": "Cài đặt",
    "lpzg83": "Tiếng Samoa",
    "lzGS2": "Chi tiết tiện ích mở rộng",
    "m0106": "Bộ chuyển đổi",
    "m0107": "Máy phát điện",
    "m0108": "Trình định dạng",
    "m7WZw": "Hệ thống Websocket bị hỏng",
    "m8rTc1": "Khi trình quản lý tập lệnh shell được triển khai, bạn có thể sử dụng nó để quản lý các lệnh shell của mình.",
    "mBgF1": "Hành động chuột",
    "mSFei": "Mã nguồn trên GitHub",
    "mWXeh": "ID không gian làm việc: {0}",
    "mabHq": "Tìm tập tin cũ",
    "mbzCv": "Đã xảy ra lỗi: {0}, thời gian bị từ chối là {1}",
    "md2.desc.1039": "Thao tác này mã hóa dữ liệu thành hàm băm {0}.",
    "md2.text.192d3": "Tạo hàm băm {0}",
    "md2aO2NaJITm": "Thụt lề và chỉnh sửa mã Cascading Style Sheets (CSS), giúp dễ đọc và dễ hiểu hơn.",
    "md4.desc.1039": "Thao tác này băm dữ liệu thành hàm băm {0}.",
    "md4.text.192d3": "Tạo hàm băm {0}",
    "md5.desc.rxsHq": "Thao tác này băm dữ liệu thành hàm băm {0}.",
    "md5.textiDjMIo": "Tạo hàm băm {0}",
    "md6.desc.1039": "Thao tác này băm dữ liệu thành hàm băm {0}.",
    "md6.text.192d3": "Tạo hàm băm {0}",
    "mihc3": "Đã hoàn thành thao tác này",
    "mjHoR": "Ngoài ra, về mặt kỹ thuật, không ai có thể đọc được mã thông báo này nếu không họ đã tấn công và kiểm soát máy tính của bạn.",
    "mnb19i": "tiếng Đức",
    "mslw4o": "người Hy Lạp",
    "mwn7iv": "Tiếng Zulu",
    "myxedr": "tiếng Mông Cổ",
    "n1jA9": "Xác nhận",
    "n24tes": "Tiếng Bồ Đào Nha (Brazil)",
    "n94an4": "Đánh bóng",
    "n98EW": "Hoán đổi văn bản của vùng đầu vào và vùng đầu ra.",
    "nSeIq8-": "Và quan trọng nhất, nó là nguồn mở và miễn phí. Bạn có thể sử dụng nó cho mục đích cá nhân hoặc thương mại của bạn.",
    "nTvw4": "Để bảo vệ và lưu riêng dữ liệu cũng như cài đặt của bạn, bạn có thể sử dụng tài khoản cục bộ của mình để đạt được điều đó. Ngoài ra, LafTools sẽ hỗ trợ các tiện ích tin nhắn tức thời giữa những người dùng trong tương lai.",
    "nmb1wx": "Tiếng Yoruba",
    "nodBw": "Thao tác này mã hóa dữ liệu thô thành chuỗi ASCII {0}.",
    "nrix6l": "Chichewa",
    "nxJC7": "Hành động mặc định được thực hiện khi máy biến áp được thực hiện.",
    "o1umzi": "người Pháp",
    "o52xW": "Xuất khẩu",
    "o8xyzu": "Tiếng Luxembourg",
    "oBz8D": "Đang tải",
    "oNLxH": "tên tài khoản",
    "oNg3f": "Trang web chính thức",
    "ocxsw3": "người Ireland",
    "of_ox": "Nói chung, LafTools là giải pháp toàn diện cho mọi nhu cầu của bạn.",
    "oj23X": "Khôi phục cơ sở dữ liệu",
    "ooiFU": "Khởi động lại dịch vụ Java",
    "oqHqVq": "Sắp xếp theo",
    "oqHqqV": "Tổng cộng: {0} Lệnh",
    "oqHqqVq": "Sao chép lần",
    "oqjbcj": "tiếng Lào",
    "os8h6u": "người Đan Mạch",
    "p8Exxc1s": "Có nhiều công cụ khác nhau tận dụng công nghệ AI để thực hiện các nhiệm vụ hiệu quả hơn trong Phòng thí nghiệm AI.",
    "pANmj": "Thẻ có thể được xác định dựa trên loại máy chủ, cách sử dụng tập lệnh hoặc bất kỳ tiêu chí nào khác mà bạn thích.",
    "pA_deJ": "Xuất sang bảng nhớ tạm",
    "pA_feeJ": "Kết nối lại thiết bị đầu cuối",
    "pA_qweJ": "Xóa bộ đệm",
    "pDBSWq": "không có nội dung có sẵn cho bảng bên phải",
    "pEk1kk": "LafTools giới thiệu các chức năng hữu ích cho bạn tại đây.",
    "pEk1qkk": "Liệt kê tất cả các tab đã mở",
    "pHZDB": "Hành động thời gian thực",
    "pJoOz": "Mở tệp",
    "pKHRT": "Đi tới Công cụ",
    "pKqHRq": "Tìm kiếm ghi chú",
    "pL6qH": "Hoàn thành.",
    "pZ4d616m-": "Làm đẹp {0}",
    "ph5jH": "Xử lý phần này",
    "piih4x": "Tiếng Tajik",
    "pmAee": "Đọc thêm thông tin về công cụ này.",
    "pmnp4b": "tiếng Ukraina",
    "ppmz8e": "Tiếng Creole Haiti",
    "pqs7y3": "Vui lòng xem xét việc đăng ký trang web này dưới dạng PWA để được hỗ trợ sơ đồ bàn phím đầy đủ.",
    "psA_eJ": "Xuất dưới dạng tệp",
    "psZoP": "Thả tập tin vào đây để xử lý chúng",
    "psqqpq_o": "Được rồi, kết quả đã được sao chép vào khay nhớ tạm của bạn {0} lần.",
    "pzn2IpkDo": "Thụt lề và in đẹp mã Ký hiệu đối tượng JavaScript (JSON).<br><br>Thẻ: trình xem json, làm đẹp, tô sáng cú pháp",
    "q12beqwR": "Không có công cụ nào",
    "q29t31": "Đánh bóng",
    "q6K7o": "Tải từ ghi chú",
    "q9iuti": "người xứ Wales",
    "qDrbEr": "Tên người dùng bạn cung cấp trống, vui lòng kiểm tra và thử lại.",
    "qF4uS2": "Tạo không gian làm việc",
    "qF4uS23": "Cửa sổ mới",
    "qHoktx": "Cảm ơn!",
    "qN1LdZ2": "Sửa đổi lần cuối",
    "qQmBr": "Dịch văn bản",
    "qTqyvWdY": "Chưa hoàn thành",
    "qWemXE4": "Ngày 1 tháng 1 năm 2024",
    "qWw3eTH": "Phần này giúp duy trì các tệp trên đĩa cục bộ hoặc đĩa đám mây của bạn.",
    "qdeFXx": "Hiện tại, trang bạn đang tìm kiếm này chưa được triển khai đầy đủ.",
    "qpDBSW": "không có bảng điều khiển có sẵn",
    "qpDBSWe1": "không có bảng điều khiển có sẵn",
    "qqK_x_": "Đăng nhập",
    "qqqwYoz": "Giúp đỡ",
    "qqwYoz": "Tab",
    "qqwYqwe": "Không gian làm việc",
    "qtpmvP": "Xác nhận mật khẩu cục bộ",
    "qubSJ": "VM mở rộng không phải là ID. (REF: IQnMH).",
    "qzshys": "tiếng Urdu",
    "r1GLS": "Thẻ",
    "rE6fUsSGl": "Thụt lề và chỉnh sửa mã Ngôn ngữ truy vấn có cấu trúc (SQL).",
    "rK6cx": "{0}, được thiết kế và phát triển bởi nhóm LafTools",
    "rQkas": "Chào mừng đến với LafTools",
    "rR1vd": "Nhập từ tập tin",
    "rT34qnO": "Nhập văn bản để xử lý. Kết quả sẽ hiển thị trong trình chỉnh sửa đầu ra.",
    "rVqlu": "Giải mã {0}",
    "rYSpwq": "Thuật toán MD2 (Message-Digest 2) là hàm băm mật mã được phát triển bởi Ronald Rivest vào năm 1989. Thuật toán được tối ưu hóa cho máy tính 8 bit. Mặc dù MD2 không còn được coi là an toàn, kể từ năm 2014, nó vẫn được sử dụng rộng rãi cơ sở hạ tầng quan trọng như một phần của chứng chỉ được tạo bằng MD2 và RSA. Theo mặc định, thuật toán phân loại tin nhắn bao gồm 18 vòng.",
    "r_n6h": "Chế độ sáng hoặc tối",
    "rf0mql3": "Chủ đề sáng hoặc tối",
    "rpG0G": "Chúng tôi đánh giá cao phản hồi của bạn và muốn nghe suy nghĩ của bạn về cách chúng tôi có thể cải thiện sản phẩm của mình - vui lòng chia sẻ phản hồi của bạn với chúng tôi!",
    "rub76Z8zx": "Cố gắng in đẹp các ngôn ngữ kiểu C như C, C++, C#, Java, PHP, JavaScript, v.v. Điều này sẽ không thực hiện công việc hoàn hảo và mã kết quả có thể không hoạt động nữa. Hoạt động này được thiết kế hoàn toàn để làm cho mã bị xáo trộn hoặc rút gọn dễ đọc và dễ hiểu hơn. Những thứ sẽ không hoạt động bình thường: Đối với định dạng vòng lặp, định dạng vòng lặp Do-while, thụt lề Switch/Case, một số toán tử dịch chuyển bit nhất định",
    "run_text": "Trước khi vào bàn làm việc của bạn, trước tiên chúng tôi muốn tải trước các tài nguyên hệ thống cần thiết. Vui lòng đợi một lát, nó sẽ sớm được hoàn thành, chi tiết có thể xem được như bên dưới.",
    "rycJy": "LafTools là một hộp công cụ đa năng được thiết kế dành riêng cho các lập trình viên. Nó đại diện cho phiên bản thứ hai của Hộp công cụ CodeGen, giờ đây có thời gian chạy nhẹ hơn được viết bằng Golang và JavaScript.",
    "ryhkqb": "tiếng Bungari",
    "s0vrf9": "tiếng Do Thái",
    "s4OeX": "Đăng nhập hệ thống thành công",
    "sHoxxW": "Chuyển đổi",
    "sO0MOe": "Mỗi khi bạn ở trong một cửa sổ lâu hơn 5 giây, nó sẽ được hiển thị ở đây.",
    "sR8yc": "Đóng",
    "sc49my": "tiếng Sindhi",
    "sdfk1": "Cuộn tab sang trái",
    "sdfk13": "Cuộn tab sang phải",
    "sglMS": "Tạo thời gian",
    "sk123": "Chưa hoàn thành",
    "slqcWD": "Phần logic này chưa được hỗ trợ, vui lòng theo dõi.",
    "sojBI": "Chuyển đổi",
    "spCqEa": "LÀM",
    "spdh98": "Tiếng Trung giản thể",
    "ssDaOq": "Bạn mới sử dụng LafTools?",
    "ssm80i": "Tiếng Basque",
    "svqh06": "Tiếng Azerbaijan",
    "sys_updates": "Cập nhật hệ thống mới nhất",
    "t63Qw": "Miễn nhiệm",
    "t6wczq": "Xhosa",
    "t84q1z": "tiếng Armenia",
    "t8c6xc": "tiếng Somali",
    "tBIX-d": "các cửa sổ",
    "tEiv_": "Truy xuất chi tiết tiện ích mở rộng",
    "tIy3Q": "Gặp phải lỗi",
    "tIyq3Q": "Gặp phải lỗi",
    "tWe1yF": "Không có lệnh shell có sẵn.",
    "tY3p1": "Thêm thông tin",
    "tiaiB": "Hủy bỏ",
    "tn7duf": "tiếng Croatia",
    "ttAre": "Nhập mật khẩu văn bản gốc của bạn vào đây",
    "twamg": "Trợ lý AI, nâng cao khả năng sáng tạo của bạn",
    "tyhgpr": "tiếng Java",
    "uCEe8": "Chuyển đổi thời gian thực",
    "uFcDQ": "Đang khởi tạo dữ liệu trạng thái...",
    "uV5Bi": "Không thể tải tiện ích mở rộng",
    "uVseB": "Nhấn {0} để hiển thị danh sách phím nóng",
    "ucDLv": "Bạn đã sao chép mục này {0} lần",
    "ui5pZ": "Trình phân tích lệnh",
    "ulah0q": "tiếng Nhật",
    "unc9E": "Văn bản ngẫu nhiên",
    "usr_defined": "Tùy chọn hệ thống",
    "uwqGE": "Đi tới Công cụ",
    "v7q3db": "tiếng Thái",
    "vOjNC": "Nhập mật khẩu hoặc khóa bảo mật",
    "vTsQU": "Vui lòng cung cấp mã lời mời từ quản trị viên của bạn",
    "vU17B": "Không thể gửi yêu cầu",
    "vWqac": "Trước khi vào bàn làm việc của bạn, trước tiên chúng tôi muốn tải trước các tài nguyên hệ thống cần thiết. Vui lòng đợi một lát, nó sẽ sớm được hoàn thành, chi tiết có thể xem được như bên dưới.",
    "vaP0vq": "Thiết lập mật khẩu cục bộ thành công.",
    "vci8rd": "tiếng Hà Lan",
    "vh9j4": "Đầu vào",
    "vo1prl": "người Tây Ban Nha",
    "vr93oi": "tiếng Phần Lan",
    "vrfjnf": "người Ý",
    "w6otqn": "tiếng Corse",
    "w92j07": "tiếng Nga",
    "w9qudj": "Tiếng Punjab",
    "wAxtg": "Ban đầu, chúng tôi đã tạo UUID làm mã thông báo được ủy quyền để bạn thực hiện thiết lập này. Từ những gì LafTools đã nhận được, mã thông báo bạn cung cấp là {0}, nó đã được LafTools xác minh thành công và do đó bạn có thể tiếp tục thiết lập biểu mẫu này.",
    "wI1eh": "Kế tiếp",
    "wQYoz": "Tài liệu",
    "wQdYoz": "Biên tập",
    "wQdqwYoz": "Xem",
    "wcl1K": "Cách sử dụng",
    "wgkk6y": "cây nho",
    "wj3VS": "Thao tác này giải mã dữ liệu từ chuỗi ASCII {0} trở lại định dạng thô.",
    "wsWcXd": "Thông báo",
    "x009": "Để truy cập tài liệu sử dụng của chúng tôi",
    "x5alzu": "Tiếng Kurd (Kurmanji)",
    "x5tHV": "Tổng quan về hệ thống",
    "xMBv0": "Đang tải các tài nguyên liên quan...",
    "xOJqG1": "Các câu hỏi thường gặp",
    "xPHqP": "Mô tả vẫn chưa được xác định.",
    "xQ_ls": "Sao lưu Redis",
    "xbz0B": "Đóng tất cả cửa sổ",
    "xbz0B2": "Đóng tab",
    "xdqwe": "Chào mừng bạn đến sử dụng LafTools!",
    "xeP4zV": "Xem nhanh các mục TODO của bạn",
    "xeP4zVd": "Tra cứu nhanh từ vựng tiếng Anh.",
    "xlqtA": "Nhận xét",
    "xml-beautify.desc.2a5f9": "Hoạt động này định dạng dữ liệu XML để cải thiện khả năng đọc bằng cách thêm thụt lề, ngắt dòng thích hợp và đảm bảo cấu trúc được định dạng đúng.",
    "xs22XLF": "Không có sẵn dữ liệu cho ID mặt hàng này, vui lòng xem xét chọn các mặt hàng khác.",
    "y3qjdd": "Mật khẩu cục bộ của bạn đã được xác minh thành công.",
    "y8Ir5": "Phần này được sử dụng để khởi tạo tài khoản quản trị viên của bạn, tuy nhiên, hiện tại, không có gì cần phải tạo hoặc điều chỉnh ở đây vì nó đã được quản trị viên của bạn thiết lập trước đó, vui lòng bỏ qua phần này và tiếp tục các bước còn lại.",
    "yMZW-GEgf": "Định dạng XML",
    "ySVf-": "Thử lại yêu cầu này",
    "yTsqFO": "Thuật toán MD4 (Message-Digest 4) là hàm băm mật mã được phát triển bởi Ronald Rivest vào năm 1990. Độ dài tóm tắt là 128 bit. Thuật toán này đã ảnh hưởng đến các thiết kế sau này, chẳng hạn như thuật toán MD5, SHA-1 và RIPEMD. Tính bảo mật của MD4 đã bị xâm phạm nghiêm trọng.",
    "yVprb": "Phần này vẫn đang được phát triển.",
    "y_2Q1": "Mã hóa và giải mã",
    "y_2Q2": "Tiền điện tử đối xứng",
    "y_2Q3": "Tiền điện tử bất đối xứng",
    "y_2Q4": "Thuật toán quốc gia Trung Quốc",
    "y_2Q5": "Xác thực web",
    "y_2Q5dqw": "Trình so khớp văn bản",
    "y_9YM": "Đầu ra sẽ được hiển thị ở đây.",
    "y_9YqM": "Đang tải các tập tin tĩnh...",
    "y_BN6": "Thuật toán tóm tắt",
    "ya0cwu": "Mã Lai",
    "yc7dqiu": "Tiếng Trung giản thể",
    "yfYeg": "Mẫu văn bản",
    "yiRso": "Ghi chú đám mây",
    "ykganl": "người Đan Mạch",
    "yqiRso": "Ghi chú địa phương",
    "yqrxl4": "tiếng Serbia",
    "yznU9": "Dữ liệu cây trống",
    "z-o28we": "Bảng quy trình",
    "z0j2nf": "Tiếng Hindi",
    "z1oFn": "Thoát và Unescape",
    "z2jzej": "Tiếng Marathi",
    "z79b1a": "tiếng Ả Rập",
    "zN2ES": "Không gian làm việc",
    "zaSKh": "Làm cho khỏe lại",
    "zc3Hf": "Mật khẩu",
    "zjDJk": "Vui lòng cung cấp đường dẫn thư mục không gian làm việc",
    "zkqUFa": "{0} chưa được định cấu hình",
    "zkv375": "tiếng Khmer",
    "zmDWx": "Liên hệ chúng tôi",
    "znVRwq": "Các tập tin",
    "zpyd34": "Tiếng Anh",
    "zqiIoqXw": "Chạy tính toán...",
    "zwd4v": "Chi tiết tiện ích mở rộng",
    "zwgYx": "Giá trị mật khẩu được mã hóa sẽ được hiển thị ở đây.",
    "zzcepr": "Cebuano"
}