{
    "": "Tin nhắn: {0}",
    "-8l11": "Đã sao chép",
    "-DqwwR": "Hoạt động đã hoàn tất.",
    "-GJ_72": "Đã chuyển sang không gian làm việc đã chọn {0}",
    "-Jx4J": "Tài khoản địa phương",
    "-Rj3y": "Chủ đề",
    "-XZnW": "Mặt sau",
    "-Yo129I": "Công cụ văn bản",
    "01do0y": "tiếng Kannada",
    "04SSf": "Quên mật khẩu?",
    "07naT": "Lỗi: {0}",
    "07ui6": "Thêm thông tin",
    "0Ceqru": "Base64 là ký hiệu để mã hóa dữ liệu byte tùy ý bằng cách sử dụng một bộ ký hiệu hạn chế mà con người có thể sử dụng thuận tiện và được máy tính xử lý.",
    "0PgZ_": "Dịch",
    "0gvcN": "Chào mừng bạn đến với trang tổng quan, nó vẫn đang được phát triển.",
    "0gywa": "Không tìm thấy không gian làm việc, bạn sẽ được chuyển hướng đến trang chỉ mục không gian làm việc.",
    "0pfdz7": "tiếng Uzbek",
    "123e4567": "Base64 là gì?",
    "13pmE": "Hỗ trợ chúng tôi",
    "1507oa": "tiếng Bengali",
    "1JOFP": "Mở không gian làm việc của tôi",
    "1NTgQ": "Không gian làm việc mở",
    "1Npez": "Vui lòng cung cấp đường dẫn",
    "1Tuab": "Đã sao chép",
    "1X8x7": "Ví dụ",
    "1YmJc": "Chọn một trong các tùy chọn làm ngôn ngữ ưa thích của bạn:",
    "1a2b3c4d": "Tại sao nên sử dụng Base64?",
    "1a3Sc": "Hủy tải",
    "1bd": "Quy trình làm việc",
    "1e3e5n": "Tiếng Hausa",
    "1h6jH": "Cảnh báo, đầu ra trống!",
    "1j62a": "Làm việc này vào lúc khác",
    "1jj0ri": "tiếng Nhật",
    "1k_44": "Hoạt động này giải mã dữ liệu từ chuỗi ASCII Base64 trở lại định dạng thô.",
    "1th2nw": "Sinhala",
    "1yIQu": "Bạn có thể thử xử lý lại hành động của mình hoặc nhấp vào nút bên dưới để loại bỏ lỗi.",
    "20nmcv": "Latin",
    "22XLF": "Chưa hoàn thành",
    "23fgh456": "Lịch sử của Base64",
    "24vLI": "Tạo",
    "27j7sy": "Shona",
    "2D9a6": "Quên mật khẩu?",
    "2D9qdk6": "Nó có đủ an toàn không?",
    "2IF6A": "Có vẻ như việc lưu trữ giả mạo gặp phải một số vấn đề",
    "2JyFN": "Sao chép kết quả vào Clipboard",
    "2Ocbey": "Phiên bản",
    "2RhAT": "Có vẻ như quá trình truy xuất giả mạo gặp phải một số vấn đề",
    "2Ruh6": "Tạo tài khoản cục bộ mới",
    "2S5ap": "Bật chế độ toàn màn hình",
    "2Y1mR": "Xóa văn bản",
    "2bcde3fg": "Nhược điểm của Base64",
    "2bqHk": "Tải từ tập tin",
    "2e4fb7": "người Igbo",
    "2giYv": "Kiểm tra mật khẩu: {0}",
    "2khdsv": "Tiếng Pa-tô",
    "2lehqwp": "Tiếng Việt",
    "2lhcqwp": "tiếng Thổ Nhĩ Kỳ",
    "2lhqqwp": "tiếng Indonesia",
    "2lhqqwqp": "Mã Lai",
    "2lhqwwp": "tiếng Thái",
    "2qdin8": "Vui lòng nhập mã xác nhận",
    "2tib5m": "tiếng Thụy Điển",
    "2ybu7j": "người Na Uy",
    "30eo2v": "tiếng Gujarati",
    "32D9a6": "Tạo một tài khoản",
    "33RXi": "Yêu cầu đã bị từ chối do các tham số không đạt yêu cầu.",
    "346qid": "tiếng Nga",
    "34wxyz56": "Làm cách nào để mã hóa/giải mã Base64 trong JavaScript?",
    "39dsCt": "Bạn sẽ nhận được thông báo mới nhất từ ​​các dịch vụ ứng dụng nếu có.",
    "3ii2tt": "Tiếng Gaelic của Scotland",
    "3umnB": "Mã thông báo không xác định",
    "441oja": "tiếng Gruzia",
    "44Ntqw-": "Xử lý thao tác.",
    "46bksi": "tiếng Litva",
    "4K_vhq": "Sao chép tab này",
    "4PIqD": "Đánh giá mã",
    "4UYIJ": "Chưa hoàn thành.",
    "4cGA_": "Đang truy xuất dữ liệu về tùy chọn hệ thống...",
    "4hijk5lm": "Tăng kích thước: Dữ liệu được mã hóa lớn hơn khoảng 33% so với dữ liệu nhị phân ban đầu.",
    "4kKe4": "Mật khẩu của bạn",
    "4tqb4x": "người Hungary",
    "4vdfwf": "ĐƯỢC RỒI",
    "4wlih": "Yêu cầu đã bị từ chối do các tham số không đạt yêu cầu.",
    "52OiQ": "Đã sao chép {0} lần",
    "54cwb": "API Websocket hệ thống đã gặp lỗi: {0}",
    "56ibcj": "Tiếng Việt",
    "58HQX": "Nếu bạn không biết giá trị của nó, vui lòng liên hệ với quản trị viên của bạn để biết thêm chi tiết, bạn có thể tìm thấy thông tin này trong cài đặt của anh ấy.",
    "5BOhl": "mã mời",
    "5Ih2u": "Công cụ điều hướng",
    "5NCPT": "Chế độ tối",
    "5NJeGsu1": "E-Mail, bạn có thể dễ dàng sắp xếp hộp thư đến, soạn và gửi thư cũng như luôn cập nhật thư từ của mình. Cho đến nay, nó chỉ được sử dụng như một công cụ giao tiếp giữa người dùng và nhóm của chúng tôi.",
    "5NJeddqGsu1": "Phần này bao gồm các tài liệu máy tính, bài viết wiki, hướng dẫn sử dụng, v.v.",
    "5NJedqddqGsu1": "Phần này bao gồm các tài nguyên máy tính có thể được sử dụng để xây dựng các dự án của riêng bạn.",
    "5Perd": "Rất tiếc, chức năng 'Sử dụng Trình chỉnh sửa Thông minh' hiện chưa khả dụng. Chúng tôi vẫn đang nỗ lực thực hiện nó. Cảm ơn vì sự kiên nhẫn của bạn.",
    "5ZBYR": "Mặt sau",
    "5dF7o": "Làm cho khỏe lại",
    "5e6f7g8h": "Base64 được sử dụng khi dữ liệu nhị phân cần được truyền qua các giao thức dựa trên văn bản như email hoặc JSON hoặc được nhúng ở những nơi chỉ cho phép văn bản.",
    "5eXVS": "Nội dung tập lệnh",
    "5ggegx": "Hàn Quốc",
    "5lW8qp": "Hiển thị một ví dụ cho công cụ này",
    "5q-Zxqa": "Trình quản lý tập lệnh",
    "5qPOJL": "Để hỗ trợ LafTools, hãy cân nhắc việc gắn sao cho kho lưu trữ của chúng tôi trên GitHub hoặc nâng cấp lên phiên bản chuyên nghiệp của chúng tôi thông qua đăng ký hàng tháng. Chúng tôi đánh giá rất cao sự giúp đỡ của bạn và chúng tôi hứa rằng LafTools sẽ còn trở nên tốt hơn nữa với số tiền quyên góp được.",
    "5qV5Sf": "Xóa bản ghi này khỏi danh sách",
    "5rg5mt": "Malagasy",
    "5srFq": "LafCông cụ",
    "5v8jl7": "người Mông",
    "6AumW": "Hành động mặc định",
    "6ClPV": "Tạo nên",
    "6hsnqWe": "Mặc dù LafTools là nguồn mở và miễn phí nhưng việc duy trì nó vẫn đòi hỏi một lượng thời gian và năng lượng đáng kể. Đặc biệt, chúng tôi cần tiền để thanh toán cho một số API đám mây nhất định. Nếu bạn đánh giá cao LafTools, hãy cân nhắc ủng hộ chúng tôi.",
    "6j13s3": "tiếng Iceland",
    "6nopqrst": "Không mã hóa: Base64 không phải là phương thức mã hóa; nó dễ dàng được giải mã và không cung cấp bảo mật.",
    "6qT9d-N": "Đối với notebook, LafTools không chỉ cung cấp trình quản lý lệnh shell mà còn sẽ bổ sung thêm các công cụ ghi chú mạnh mẽ vào đó trong thời gian tới như MarkDown, Latex, {0}, v.v.",
    "6ulj8i": "tiếng Nepal",
    "6yOXx": "Cái tên không quen biết",
    "71x7x": "Mã nguồn trên GitHub",
    "78abcdef": "JavaScript cung cấp các hàm tích hợp sẵn như btoa() và atob() để mã hóa và giải mã Base64 tương ứng.",
    "78ijk9lm": "Base64 lần đầu tiên được định nghĩa trong RFC 1421 (1993) và sau đó được chuẩn hóa trong RFC 4648 (2006).",
    "7MOO1": "Đăng nhập",
    "7dm0d8": "Truyền thống Trung Quốc",
    "7g5w22": "người Na Uy",
    "7k56u3": "tiếng Galicia",
    "7q40W": "Không thể khởi tạo quản trị viên",
    "7u4vzu": "Tiếng Slovak",
    "7x3f6": "Tab - 1",
    "82r0C": "Quản lý danh sách TODO của bạn và hoàn thành công việc hiệu quả hơn.",
    "83dNp": "Không thể tải ID tiện ích mở rộng. (Tham khảo: 1dl1f)",
    "8LdRj": "Tổng quan",
    "8LdRjq": "Tính toán",
    "8LdevRj": "Dịch vụ",
    "8M1wY": "Nhà ga địa phương",
    "8eeL1Kk": "Về",
    "8mn_qa": "Đang lấy dữ liệu từ các dịch vụ đầu cuối...",
    "8qzWJu": "Rất tiếc, hiện tại chúng tôi chưa hỗ trợ thiết bị màn hình nhỏ, vui lòng sử dụng PC để truy cập trang này.",
    "8veXac": "Thời gian là nguồn tài nguyên quý giá nhất, hãy quản lý nó một cách khôn ngoan.",
    "97um9v": "tiếng Hawaii",
    "9Xv8-": "Lưu dưới dạng ghi chú",
    "9_qaj": "Thoát khỏi biểu mẫu này",
    "9a335": "Vui lòng nhấp vào bất kỳ mục tiện ích mở rộng nào ở menu đầu tiên bên trái, mục hiện tại trống hoặc không hợp lệ.",
    "9e4fcl": "Tiếng Tamil",
    "9eZHM": "Ối! Có vẻ như chúng tôi gặp phải một số cảnh báo hoặc lỗi.",
    "9gqo8x": "tiếng Latvia",
    "9i0j1k2l": "Nó cũng được sử dụng để nhúng các hình ảnh nhỏ trực tiếp vào HTML hoặc CSS dưới dạng URL dữ liệu.",
    "9m85mf": "Sesotho",
    "9qy1xn": "tiếng Bồ Đào Nha",
    "9tbbkt": "tiếng Phần Lan",
    "9zCSc": "Không có không gian làm việc có sẵn",
    "A69UZ": "Biến",
    "AVUvu": "Base62 là ký hiệu để mã hóa dữ liệu byte tùy ý bằng cách sử dụng một bộ ký hiệu hạn chế mà con người có thể sử dụng thuận tiện và được máy tính xử lý. Cơ sở số cao dẫn đến các chuỗi ngắn hơn so với hệ thập phân hoặc thập lục phân.",
    "AW9N8": "Vùng đầu vào",
    "AfPC0": "Mật khẩu văn bản đơn giản của bạn",
    "Ahrjc": "Thư mục không tồn tại, bạn có muốn tạo nó không?",
    "AkXgF": "Đang tiến hành: {0}%",
    "Apx8D": "Làm cách nào để đặt lại mật khẩu của bạn theo cách thủ công?",
    "B0s0z": "Mục đích của trang này:",
    "BGd7P9": "Hoạt động này mã hóa dữ liệu thô thành chuỗi ASCII Base64.",
    "BGd7dP9": "Thao tác này mã hóa dữ liệu thô thành chuỗi ASCII {0}.",
    "BGdd7dP9": "Thao tác này mã hóa dữ liệu thô thành chuỗi ASCII {0}.",
    "BShq3M": "Các vấn đề",
    "BW3bpT": "Đọc file từ đĩa...",
    "Bd9h-": "Thêm nó vào bộ sưu tập yêu thích của tôi",
    "BuihG": "Cài đặt hệ thống",
    "CASef": "Được rồi, hoạt động đã được kích hoạt.",
    "CEv8B": "Bạn có chắc chắn xóa bản ghi này không? Nếu có, hãy nhấp vào nút này một lần nữa.",
    "CVUl0": "LafCông cụ",
    "CWohyqde": "Công cụ",
    "CWoqhy": "Danh sách Exts theo CategoryID đã chọn",
    "CfZAX": "Tệp {0} đã được chọn, chúng tôi đang tải tệp đó lên dịch vụ cốt lõi.",
    "CidOqAZ": "Với tư cách là người tạo ra LafTools, tôi rất cảm động khi bạn sẵn sàng hỗ trợ chúng tôi. Chúng tôi có những người giỏi trong nhóm làm việc chăm chỉ để liên tục cải tiến LafTools.",
    "Cide2w": "Để xem có vấn đề gì trong khi thực hiện hành động của bạn không.",
    "DIQFq": "Vui lòng kiểm tra xem tham số URL đã được cung cấp đúng chưa, có vẻ như bạn không có quyền điền vào biểu mẫu này. Theo mặc định, bạn sẽ có thể thấy thông báo bên dưới trong đầu ra của dịch vụ khi nó vừa khởi chạy.",
    "DIweGq": "Bảo mật LafTools của bạn",
    "DTTPW": "Thiết lập trạng thái",
    "DVoKw": "Đăng xuất hệ thống này",
    "DadYp": "Gỡ lỗi theo thời gian thực",
    "DrXAq": "Chào mừng bạn đến sử dụng LafTools!",
    "DrbEr": "Mật khẩu bạn cung cấp trống, vui lòng kiểm tra và thử lại.",
    "DtlAc": "Đang tải tài nguyên hệ thống",
    "Dxlw0": "Hoàn thành",
    "E62ej": "Lọc lệnh Shell",
    "E6F9B": "Thêm nó vào quy trình làm việc",
    "ERK7E": "Nếu bạn gặp bất kỳ vấn đề nào hoặc có bất kỳ đề xuất nào khi sử dụng LafTools, vui lòng liên hệ với chúng tôi qua EMail hoặc GitHub bất cứ lúc nào, chúng tôi rất vui lòng được giúp đỡ bạn.",
    "EgBXL": "Chọn hoặc cung cấp thẻ.",
    "Ewvgo": "Vẫn chưa bắt đầu.",
    "ExqvX": "Danh sách phím nóng",
    "Eyq856": "Chúng tôi vẫn chưa hoàn thành - chúng tôi nỗ lực cung cấp các tính năng mới nhất và tuyệt vời nhất, đồng thời chúng tôi sẽ tiếp tục phát hành các bản cập nhật để đảm bảo bạn có trải nghiệm tốt nhất có thể.",
    "F-OUm": "Thiết lập nhanh cho LafTools",
    "F0CCF": "Danh sách phím nóng",
    "F4uS2": "Tập tin mới",
    "FBVyc": "Vui lòng nhập lại mã xác minh",
    "FDlRI": "Đặt tên cho tab mới này và nhấn vào để xác nhận.",
    "FOyHW": "Tìm kiếm mọi nơi",
    "FQzhg": "Bỏ qua đầu vào trống",
    "FhVWl": "Mã hóa mật khẩu của bạn",
    "FjYbR": "đầu ra",
    "Fv-zz": "Sao chép kết quả",
    "Fy217": "Cấu hình công cụ này",
    "Fzp3t": "Cung cấp giá trị",
    "G3MJN": "Hiển thị bảng đầu ra",
    "G9QVo": "Quản lý tab",
    "GR7jK": "Kiểu",
    "Ggob_": "Hủy bỏ",
    "H-Ae75": "Vui lòng xác nhận mật khẩu cục bộ của bạn.",
    "H-qA75": "Vui lòng cung cấp mật khẩu cục bộ.",
    "H8fQ4": "Chuyển sang chế độ Sáng hoặc Tối",
    "HEAhr": "Sau khi dịch xong kết quả sẽ hiện ra ở đây.",
    "HIc3c": "Hoàn thành",
    "HNDat": "Để thực hiện thay đổi, vui lòng nhấp vào nút \"{0}\". Nếu không, hãy nhấp vào \"{1}\" để áp dụng các thay đổi của bạn. Chúc bạn có thời gian vui vẻ với hộp công cụ này!",
    "Hflf2": "Vì mục đích bảo mật mạng, chúng tôi sẽ không giúp đặt lại mật khẩu của bạn thông qua API hoặc các trang ở đây trừ khi bạn cập nhật tệp được hệ thống bảo vệ theo cách thủ công.",
    "HjvV3": "Chúng tôi sẽ không xóa các tập tin của nó trên đĩa, chỉ xóa bản ghi này khỏi danh sách.",
    "HyIC_": "Phím gạch chéo (/)",
    "HyIC_d": "Phím gạch chéo (/)",
    "I8FLi": "Bây giờ, đã đến lúc thiết lập quản trị viên của bạn, vui lòng đặt mật khẩu phức tạp nhất có thể để có thể khiến những kẻ tấn công bất lịch sự đó bối rối.",
    "IAC0A": "Công cụ tìm kiếm",
    "ICefi": "Đã hủy",
    "IKqqATS": "Làm mới dữ liệu trang hiện tại",
    "IOOrz": "(Nó có gây hại cho hệ thống của bạn không? Chúng tôi không nghĩ như vậy, miễn là bạn có thể sửa đổi tệp cấu hình được bảo toàn hệ thống, điều đó có nghĩa là bạn được cấp quyền đọc mọi thứ về tệp dữ liệu LafTools.)",
    "IWUH5": "Hiển thị ví dụ",
    "IaSyO": "Hủy bỏ",
    "IfsGO": "Yêu thích",
    "IfsdGO": "Yêu thích",
    "ImUmf": "Mới",
    "J-3KA": "Vui lòng cung cấp tên cho tập lệnh này, điều này sẽ hữu ích hơn.",
    "J164i": "ví dụ. Sao chép tập tin vào máy chủ từ xa",
    "J2xoL": "Vui lòng xem lỗi: {0}",
    "JA_Bp": "Trước tiên, vui lòng cung cấp tên cho thẻ mới.",
    "JQEVK": "Mã số",
    "JQLmS": "Đã điều chỉnh kích thước",
    "JQLmSq": "Hoàn thành.",
    "JTBRh": "LafTools đã lưu trữ giá trị mật khẩu vào tệp cục bộ, nhưng đừng lo lắng, chúng tôi đã áp dụng cơ chế mã hóa mật khẩu một chiều, nghĩa là không ai có thể đọc được mật khẩu của phiên bản văn bản thuần túy. Để đặt lại mật khẩu, vui lòng làm theo các công cụ bên dưới để đặt lại mật khẩu theo cách thủ công.",
    "JYqxz2": "Chào mừng bạn đến với LafTools, đây là phiên bản nội bộ.",
    "JdqiUE8": "Thao tác này giải mã dữ liệu từ chuỗi ASCII (với bảng chữ cái bạn chọn, bao gồm các giá trị đặt trước) trở lại dạng thô.",
    "JdqidUE8": "Thao tác này giải mã dữ liệu từ chuỗi ASCII (với bảng chữ cái bạn chọn, bao gồm các giá trị đặt trước) trở lại dạng thô.",
    "JfFHw": "Nhận yêu cầu thông tin về không gian làm việc",
    "JiUE8": "Thao tác này giải mã dữ liệu từ chuỗi ASCII {0} trở lại định dạng thô.",
    "K1qJZI": "Chào mừng đến với LafTools, thưa Ngài.",
    "KGS2-": "Sau khi hoàn thành các bước trên, bạn có thể sử dụng mật khẩu mới để đăng nhập vào hệ thống của mình. Nếu bạn không thể truy cập hệ thống tệp, vui lòng yêu cầu quản trị viên hoặc bộ phận hỗ trợ CNTT của bạn tạo tệp đó. Nếu tập tin đã tồn tại thì hãy xóa nó đi và tạo lại tập tin mới.",
    "KIc63": "Chức năng chưa được hỗ trợ",
    "KYh1N": "Tất cả ghi chú",
    "KcqrRr": "Thẩm quyền giải quyết",
    "KcrRr": "Truy xuất dữ liệu triển khai mã",
    "KmEUF": "Cung cấp tổng quan nhanh về các công cụ hệ thống hiện tại.",
    "Kw4OJr": "Phần cuối",
    "Kyd9H": "Mã nguồn trên GitHub",
    "L-p-Y": "Sao chép nội dung của lệnh shell hiện tại vào clipboard",
    "L3zEM": "Hiển thị ví dụ",
    "L42mxa": "Vui lòng nhập văn bản nguồn của bạn vào trường này.",
    "L49kCq": "Vui lòng cung cấp và xác nhận mật khẩu khóa trong biểu mẫu này để bảo mật LafTools của bạn.",
    "L71q_N": "Mật khẩu bạn cung cấp trống, vui lòng kiểm tra và thử lại.",
    "L9bQku": "Giải mã {0}",
    "L9qbQku": "Giải mã {0}",
    "LAc1m": "Đã làm mới chế độ xem ứng dụng.",
    "LFdvM": "Chưa đăng nhập",
    "LM715": "Truy xuất cấu hình i18n từ API máy chủ cục bộ",
    "LPJrV": "Sao chép kết quả",
    "LU9Jj": "Base85 (còn gọi là Ascii85) là ký hiệu để mã hóa dữ liệu byte tùy ý. Base64 thường hiệu quả hơn.<br><br>Thao tác này giải mã dữ liệu từ chuỗi ASCII (với bảng chữ cái bạn chọn, bao gồm các giá trị đặt trước). Base85 thường được sử dụng ở các định dạng tệp PostScript và PDF của Adobe.",
    "LWaeFqd": "Chuyển sang ngôn ngữ ưa thích của bạn",
    "Le71_N-": "Mật khẩu bạn cung cấp không giống với mật khẩu đã xác nhận, vui lòng kiểm tra và thử lại.",
    "LnJ4H": "Lưu ý rằng tài khoản cục bộ hoàn toàn không giống với người dùng đã đăng ký trên trang web của chúng tôi, tài khoản trước chỉ được xác định trên PC của bạn trong khi tài khoản sau có thể được sử dụng để đồng bộ hóa trên đám mây.",
    "LqWaFd": "Cài đặt hệ thống",
    "M3qytc": "Mã hóa {0}",
    "M3ytc": "Đến Base64",
    "M4ywN1": "Máy tính, Lịch, Đồng hồ, Thời tiết, v.v.",
    "M6MrW": "Tốt",
    "M7jct": "Vào chế độ toàn màn hình",
    "MN2lT": "Độ dài của Mật khẩu không thể nhỏ hơn 6",
    "Ma5mv": "Chuyển đổi chế độ hiển thị của các tab thanh công cụ",
    "Mq9pdpT": "Liệt kê tất cả các tài nguyên có liên quan cho menu chức năng bạn đã chọn.",
    "Mq9ppT": "Xem nhanh trạng thái dịch vụ của bạn",
    "MrgmU": "Xác nhận",
    "NMLOn": "Sao chép đường dẫn tệp",
    "NMLOn1": "Không gian làm việc mở",
    "NNfJo": "Tải dữ liệu từ tệp",
    "Nq1IR": "Không thể tải tiện ích mở rộng VM",
    "Nqc0LqwX": "Nếu bạn cho rằng có lỗ hổng trong quá trình này, vui lòng liên hệ với chúng tôi qua EMail hoặc GitHub bất kỳ lúc nào, chúng tôi muốn cải thiện lỗ hổng đó một cách khẩn cấp.",
    "O02-W": "Không tải...",
    "O94Yx": "TRÊN",
    "OO0qPN": "Ví dụ đã được tải",
    "OQWm4": "Báo cáo lỗi",
    "OSHOI": "Trang chào mừng",
    "OSqZQM": "Mật khẩu cục bộ",
    "OeO0PeN": "Được rồi, ví dụ được hiển thị trong trình soạn thảo đầu vào.",
    "OeOQY": "LÀM",
    "OpPFe": "Nếu bạn thích LafTools, hãy chia sẻ nó với bạn bè của bạn và cho chúng tôi một ngôi sao, cảm ơn!",
    "Opcty": "Các tập tin",
    "OqqGx2qg": "Đang tải tài nguyên tĩnh, vui lòng đợi...",
    "OrCt5": "Đang chuyển hướng đến bàn làm việc...",
    "Ot6EP": "Dụng cụ đánh bóng",
    "P4ROa": "Vùng đầu ra",
    "PM_N5": "Phiên - {0}",
    "PUxuU": "Đang lấy dữ liệu cho gói ngôn ngữ...",
    "PapkF": "Nếu bạn có bất kỳ câu hỏi hoặc đề xuất nào về LafTools, vui lòng cho chúng tôi biết. Chúng tôi luôn tìm cách cải thiện sản phẩm của mình và cung cấp trải nghiệm tốt nhất có thể cho người dùng. Bạn có thể liên hệ với chúng tôi tại work7z@outlook.com. Cảm ơn bạn đã sử dụng LafTools!",
    "PpCHA": "Khóa câu hỏi(?)",
    "PqazM-": "Trước hết, vui lòng sử dụng các điều khiển biểu mẫu bên dưới để mã hóa mật khẩu của bạn",
    "QL9Sn": "Hiện tại, dường như không có mô tả nào.",
    "QLKzF": "Nó có rất nhiều tính năng đáp ứng nhu cầu của cả nhà phát triển mới làm quen và nhà phát triển có kinh nghiệm, khiến nó trở thành công cụ bắt buộc phải có trong kho vũ khí của bất kỳ lập trình viên nào.",
    "QM2Ob": "Công cụ gần đây",
    "QM2Oq": "Ghi chú gần đây",
    "QRAdA": "từ tiếng Anh sang tiếng Trung",
    "QhdpH": "Ấn bản cộng đồng",
    "QzlA3": "Đã xảy ra lỗi",
    "R12bq": "Liệt kê các tab không được hiển thị",
    "RNBze0": "Công cụ",
    "RNeBze0": "Tab đã mở",
    "RNewBze0": "Cấu hình công cụ",
    "RO4ZP": "Đã xảy ra lỗi",
    "RPVRl": "Có vẻ như tiện ích mở rộng này không tương thích với phiên bản hiện tại của LafTools. Vui lòng xem xét cài đặt phiên bản mới nhất để hỗ trợ tiện ích mở rộng này hoặc vui lòng liên hệ với chúng tôi bằng cách nêu vấn đề trên GitHub.",
    "RhqzcdD": "Cài đặt hệ thống",
    "RjCO3": "Danh sách không gian làm việc",
    "S4MMV": "Ối! Chúng tôi đã tìm thấy một số vấn đề khi tải tệp.",
    "SAnnQ": "Đang tải tệp {0}",
    "SBsDz": "Thiết lập cho tài khoản quản trị viên của bạn.",
    "SGs7B": "Thiết lập LafTools của bạn một cách nhanh chóng",
    "SMqD13": "Nhập để lọc",
    "SPem9": "Lĩnh vực này vẫn chưa sẵn sàng.",
    "SQAw7": "Ngôn ngữ nguồn",
    "SYSq1": "Ví dụ",
    "SZgXb": "Thiết lập mật khẩu cục bộ",
    "SdGcT": "Phần khác",
    "Sm9tq": "Vui lòng cung cấp mật khẩu tài khoản tại đây",
    "Sm9tqq": "Vui lòng cung cấp mật khẩu để mở khóa LafTools của bạn",
    "Spcfdee": "Chế độ sáng hoặc tối",
    "TBPqy7": "Ngôn ngữ",
    "TD7DA": "Ngôn ngữ",
    "TNoePE": "Đám mây LafTools",
    "Ttrqqet": "Viết và lưu suy nghĩ của bạn ở đây!",
    "TwFcr": "Ngôn ngữ mục tiêu",
    "TyqvWY3": "Tệp cục bộ",
    "U2ZNl": "Tìm hiểu thêm trên Wikipedia",
    "U4qqq9": "Xóa tab này khỏi danh sách",
    "U7zP2": "Vui lòng cung cấp tên người dùng tài khoản tại đây",
    "UF_Dp": "Đã xảy ra lỗi: {0}, thời gian bị từ chối là {1}",
    "UU_7h": "Vui lòng nhấp vào bất kỳ mục danh mục nào ở menu đầu tiên bên trái, danh mục hiện tại trống hoặc không hợp lệ.",
    "UZ2Ig": "Tài khoản cục bộ mới",
    "Ugpng": "Yêu thích",
    "Uzqjy": "Thực hiện",
    "V6U_f": "Điều khoản dịch vụ",
    "V6XEO": "Nhập tên người dùng hoặc Email",
    "VAZq8r": "Nó cho phép các nhà phát triển thực thi nhiều lệnh khác nhau, chẳng hạn như chạy tập lệnh, cài đặt gói và điều hướng hệ thống tệp, tất cả đều từ bên trong trình chỉnh sửa.",
    "VEfeqZG": "Ghi chú",
    "VI6VT": "Lịch sử",
    "VOsZc": "Báo cáo phát hành",
    "VSZ": "Bấm để kích hoạt lại",
    "VZtqg6": "Tạo biểu mẫu tập lệnh mới",
    "Vaf2y": "Tên tab không được để trống.",
    "VeY9K": "Điều khoản sử dụng",
    "VgG5y": "Nhấp vào đây để làm mới trạng thái tiện ích mở rộng của bạn",
    "VjZCv": "Chuyển đổi thời gian thực",
    "WPrTW": "Trang web chính thức",
    "WXo6D": "Đã làm mới",
    "WYCVL": "Cài đặt nhanh",
    "X4L_Z": "VM mở rộng không được cung cấp.",
    "X6Fq4j": "Sau nhiều năm phát triển và cải tiến tận tâm, chúng tôi tin tưởng rằng LafTools có thể nâng cao đáng kể trải nghiệm lập trình của bạn bằng cách mang lại sự thuận tiện và hiệu quả hơn cho quy trình làm việc của bạn.",
    "XKpI0": "Nhấp để xử lý văn bản của bạn trong vùng nhập",
    "XLWoR": "Chọn cái bạn thích và tiếp tục",
    "XQxJB": "Không gian làm việc của tôi",
    "X_HGx": "LafTools là một hộp công cụ đa năng được thiết kế để đáp ứng nhiều nhu cầu khác nhau. Nó hoàn toàn là nguồn mở, đảm bảo tính minh bạch và bảo mật. Mặc dù có thời gian chạy nhẹ nhưng nó cung cấp hỗ trợ nền tảng đầy đủ, bao gồm ARMv8 và hỗ trợ AI gốc tương tự như ChatGPT. LafTools được tích hợp cao với giao diện người dùng hiệu quả và được cập nhật liên tục với các công cụ mới. Nó có thể được sử dụng trên web và với Docker, đồng thời cung cấp các tài nguyên bổ sung như ghi chú và hướng dẫn sử dụng.",
    "XeXF77": "Cài đặt",
    "XikdD": "Xin vui lòng chờ một chút, chúng ta sắp đến nơi rồi!",
    "Y5GAC": "Tên người dùng của bạn",
    "Y9mQ2": "Vui lòng cung cấp tên người dùng tài khoản tại đây",
    "YAAU3q": "Mật khẩu cục bộ",
    "YHCjT": "LafTools hỗ trợ chủ đề sáng và tối toàn cầu, đặc biệt hữu ích với các lập trình viên làm ca đêm.",
    "YNwKz": "Ngôn ngữ không được hỗ trợ: {0}, sẽ sử dụng tiếng Anh theo mặc định.",
    "YOYTp": "Cài đặt nhanh",
    "YPPPL": "Chuyển đổi chế độ hiển thị của các tab thanh công cụ",
    "YQN9u": "Đã xảy ra lỗi khi tải {0}, vui lòng kiểm tra chi tiết bên dưới.",
    "Y_k0z": "Quên mật khẩu?",
    "Ye3TXses": "Để định cấu hình xem quá trình chuyển đổi có được thực hiện tự động hay không khi văn bản đầu vào được thay đổi.",
    "Ylq2X": "Sửa lỗi",
    "YquQqTXq": "Tự động chạy?",
    "YrTdq": "Tất cả",
    "YrVq683": "Thư",
    "YrVqdd683": "Hướng dẫn sử dụng",
    "Z2QTU": "Về",
    "Z3rhY": "Tin nhắn",
    "Z7ALO": "Đã chuyển sang không gian làm việc đã chọn",
    "Z7OTt": "Tệp bạn chọn quá lớn, vui lòng chọn tệp nhỏ hơn 30MB.",
    "ZAGva": "Bạn có chắc chắn xóa không gian làm việc này không?",
    "ZAKaFq": "Tài khoản đám mây của tôi",
    "ZW1Dgz": "Không có tin nhắn nào",
    "ZXRGC": "Vui lòng xem lỗi: {0}",
    "ZbD3F": "{0}, được tạo bởi nhóm LafTools",
    "Zk7JI": "Nó vẫn chưa được hỗ trợ",
    "ZrbduC": "Đóng tất cả cửa sổ",
    "ZrbuC": "Đóng tab",
    "_5OqeG": "Bỏ đánh dấu nó",
    "_LFF3": "Nếu bạn gặp bất kỳ vấn đề nào hoặc có bất kỳ đề xuất nào khi sử dụng LafTools, vui lòng liên hệ với chúng tôi qua EMail hoặc GitHub bất cứ lúc nào, chúng tôi sẵn sàng cải thiện nó.",
    "_trez": "Hoán đổi văn bản",
    "_trqL": "Đang truy xuất dữ liệu về tài nguyên hệ thống...",
    "_z3lR": "Làm mới mã",
    "a3yqoz": "tiếng Ba Tư",
    "a3z-3k12": "Công cụ địa chỉ IP",
    "a4jbpq": "tiếng Séc",
    "a4r9t": "Base45 có thể giải mã bất kỳ chuỗi được mã hóa Base45 nào bất kể nguồn gốc của nó không?",
    "a4s6x": "Base32 hoạt động như thế nào?",
    "a8b7z": "Do đó, việc đệm chỉ cần thiết nếu nhóm bit cuối cùng được mã hóa không chia hết cho 40 bit (vì 8 ký tự Base32 đại diện cho 40 bit). Phần đệm sẽ bao gồm từ 0 đến 6 ký tự '=' ở cuối chuỗi được mã hóa.",
    "aCkOP": "Lối ra",
    "aHAfR": "Đang tìm nạp dữ liệu cho {0}...",
    "aSOpr": "Trình tạo mô hình dữ liệu",
    "ab9c0d1e": "Các hoạt động chính bao gồm mã hóa (chuyển đổi nhị phân sang Base64) và giải mã (chuyển đổi Base64 trở lại nhị phân).",
    "abc12345": "Base64 là sơ đồ mã hóa biểu diễn dữ liệu nhị phân dưới dạng một chuỗi các ký tự ASCII.",
    "abcdef12": "Base64 hoạt động như thế nào?",
    "about_LafTools_toolbox": "Giới thiệu về LafTools",
    "adpgq": "Tạo không gian làm việc mới",
    "ah-C4": "Ghi chú mới",
    "aj3nhd": "tiếng Đức",
    "aked6": "Người giới thiệu",
    "aked61": "Giới thiệu",
    "asElV": "Di dời",
    "az4uS2": "Bạn có chắc chắn đăng xuất khỏi hệ thống này không? Lưu ý rằng bạn sẽ được chuyển hướng đến trang đăng nhập.",
    "azpNX": "Hoàn thành.",
    "b0qjSL": "Vui lòng nhập thư mục {1} và tạo tệp {2}, đặt mật khẩu được mã hóa của bạn làm toàn bộ nội dung tệp.",
    "b6sx9b": "Tiếng Philippin",
    "b8g2k": "Kịch bản sử dụng cho Base32",
    "bP_6qG": "Lời khuyên cho việc quên mật khẩu của bạn",
    "bT4R6": "Tab mới",
    "bVlBN": "Tiếng Trung sang tiếng Anh",
    "bcdef01a": "Base64 hoạt động bằng cách chia dữ liệu nhị phân thành các nhóm 6 bit và ánh xạ mỗi nhóm tới một ký tự cụ thể từ bảng chữ cái gồm 64 ký tự (A-Za-z0-9+/).",
    "bhojei1": "Truyền thống Trung Quốc",
    "bjZyW": "Dịch",
    "bors14": "tiếng Thổ Nhĩ Kỳ",
    "bp_-b": "Để quản lý đầy đủ LafTools, bạn cần thiết lập quản trị viên của mình khi bắt đầu quy trình thiết lập. Chúng tôi đã xác minh danh tính của bạn bằng mã thông báo tham số URL, hãy yên tâm rằng không ai khác có thể thiết lập quyền root của bạn trừ khi họ có được mã thông báo thiết lập.",
    "bqqrij": "tiếng Swahili",
    "c0eCw": "Dịch văn bản của bạn sang bất kỳ ngôn ngữ nào bạn muốn.",
    "c0v2p": "Các thao tác phổ biến với Base32",
    "c1p3b": "Sau khi được tích hợp, hãy sao chép mẫu được cung cấp vào chương trình C++ của bạn và thay thế trình giữ chỗ bằng giá trị được mã hóa thực tế trước khi chạy chương trình.",
    "c1p4b": "Mỗi số thập phân sau đó được chuyển đổi thành một chuỗi duy nhất gồm năm ký tự Base85. Nếu còn lại ít hơn bốn byte ở cuối, phần đệm có thể được áp dụng.",
    "c2tpr": "Thư viện Apache Commons Codec cung cấp chức năng mã hóa và giải mã Base32 trong Java.",
    "c2vw9k": "Mặc dù Base45 không được triển khai rộng rãi như Base64 hoặc Base32, nhưng các thư viện nguồn mở vẫn tồn tại cho một số ngôn ngữ.",
    "c5m1b": "Một biến thể khác, Base58Flickr, hơi khác một chút về bộ ký tự. Nó thay thế '+' bằng ',' và '/' bằng '-', thích ứng với nhu cầu URL của Flickr.",
    "c5meku": "Tiếng Sundan",
    "c5p1b": "Phần đệm không được sử dụng; độ dài của đầu ra được mã hóa phụ thuộc trực tiếp vào kích thước của dữ liệu đầu vào.",
    "c6p4n": "Sau khi cài đặt thư viện, hãy sao chép mẫu được cung cấp vào tập lệnh Python của bạn và chạy nó. Thư viện cung cấp các hàm dựng sẵn để chuyển đổi giữa các byte và chuỗi được mã hóa Base45.",
    "c6p9b": "Nếu độ dài của dữ liệu đầu vào không chia hết cho 8 thì phần đệm sẽ không được sử dụng; thay vào đó, mỗi nhóm không đầy đủ sẽ được xử lý độc lập.",
    "c7Uoqqe": "Trước khi sử dụng LafTools, vui lòng cung cấp và xác nhận mật khẩu cục bộ của bạn như bên dưới.",
    "c8me6b": "Các lược đồ giống Base62 tùy chỉnh có thể được điều chỉnh cho các ứng dụng cụ thể nhưng nhìn chung chúng tuân thủ cùng một nguyên tắc sử dụng bộ ký tự lớn hơn Base64 hoặc Base32.",
    "c9j5k": "Tải xuống và đưa tiêu đề 'base32.h' cũng như cách triển khai tương ứng vào dự án của bạn.",
    "c9j5v": "Cài đặt nó thông qua Composer bằng cách thêm 'composer require christian-riesen/base32' vào dự án của bạn.",
    "c9q7w": "Tại sao Base45 được tạo ra?",
    "cNQp_": "Tài nguyên",
    "cPS6q": "Tất cả công cụ",
    "cQqwI8r": "Đang tải trạng thái của Dịch vụ đầu cuối",
    "cbaq54321": "Không, Base64 không phải là một kỹ thuật nén, nó chỉ thay đổi cách biểu diễn dữ liệu chứ không thay đổi kích thước của nó.",
    "cdefg234": "Các ký tự đệm (=) được thêm vào cuối để đảm bảo độ dài dữ liệu được mã hóa là bội số của 4 ký tự.",
    "cfYYN": "Khám phá nhiều hơn",
    "ciZV2": "Base32 là ký hiệu để mã hóa dữ liệu byte tùy ý bằng cách sử dụng một bộ ký hiệu hạn chế mà con người có thể sử dụng thuận tiện và được máy tính xử lý. Nó sử dụng bộ ký tự nhỏ hơn Base64, thường là bảng chữ cái viết hoa và các số từ 2 đến 7.",
    "ciZV21": "Base45 là ký hiệu để mã hóa dữ liệu byte tùy ý bằng cách sử dụng một bộ ký hiệu hạn chế mà con người có thể sử dụng thuận tiện và được máy tính xử lý. Cơ sở số cao dẫn đến các chuỗi ngắn hơn so với hệ thập phân hoặc thập lục phân. Base45 được tối ưu hóa để sử dụng với mã QR.",
    "ciZV2deq1": "Base58 (tương tự Base64) là ký hiệu dùng để mã hóa dữ liệu byte tùy ý. Nó khác với Base64 ở chỗ loại bỏ các ký tự dễ đọc sai (tức là l, I, 0 và O) để cải thiện khả năng đọc của con người. Base58 thường được sử dụng trong tiền điện tử (Bitcoin, Ripple, v.v.).",
    "cj1pd": "Làm mới hoạt động",
    "cjzqj9": "tiếng Bosnia",
    "cmxzpg": "Mã Lai",
    "coM2I": "Sử dụng Trình chỉnh sửa thông minh",
    "crD7I": "Để định cấu hình xem phép chuyển đổi có nên bỏ qua văn bản đầu vào trống có độ dài bằng 0 hay không.",
    "cuRCb": "Không tìm thấy danh mục.",
    "cuRCqb": "Danh mục không tồn tại",
    "cxqhqa": "Myanmar (Miến Điện)",
    "d-l2l": "Xác nhận",
    "d-qPr": "Bố cục không xác định: {0}",
    "d1x7v": "Một ví dụ khác là trong Git, nơi các đối tượng băm đôi khi được lưu trữ ở định dạng Base32 để tránh các vấn đề về kết thúc dòng và hạn chế tên tệp. Ngoài ra, HashiCorp Vault sử dụng Base32 để tạo khóa phái sinh.",
    "d2w4e": "Tương tự như các hệ thống chuyển đổi cơ sở khác, Base62 hoạt động bằng cách chuyển đổi byte đầu vào thành một số nguyên lớn, sau đó biểu thị nó dưới dạng kết hợp các ký tự từ bộ 62 ký tự của nó.",
    "d2w6e": "Sao chép/tải xuống kho lưu trữ và đưa tệp tiêu đề được cung cấp vào dự án của bạn. Biên dịch và liên kết với các tệp nguồn theo tài liệu của dự án.",
    "d3w2e": "Base58 hoạt động bằng cách chuyển đổi byte đầu vào thành một số nguyên lớn, sau đó biểu thị số nguyên đó dưới dạng kết hợp các ký tự từ bộ 58 ký tự của nó (A-Z, a-z, 1-9).",
    "d5KZH": "Cảm ơn bạn đã sử dụng LafTools!",
    "d5LAU": "Được cấp phép theo AGPLv3",
    "d5fmq2": "người Ý",
    "d5hit": "Phiên - {0}",
    "d5x1rl": "người Tây Ban Nha",
    "d6g0w": "Đoạn mã này có thể được thực thi trong mọi môi trường Python, bao gồm tập lệnh, phiên tương tác hoặc trong một ứng dụng lớn hơn.",
    "d6y9k": "Nếu không có đủ byte để điền vào nhóm cuối cùng thì phần đệm sẽ không được sử dụng; thay vào đó, các bit còn lại được xử lý và ánh xạ tới (các) ký tự tương ứng của chúng.",
    "d7w2e": "Base85 hoạt động bằng cách chia dữ liệu đầu vào thành các nhóm bốn byte và chuyển đổi mỗi nhóm thành số thập phân trong khoảng từ 0 đến 2^32-1.",
    "d8w1b": "Bạn có thể thực hiện việc này bằng pip bằng cách chạy `pip install base45` hoặc `python -m pip install base45`.",
    "d9w7m": "Hơn nữa, vì nó chỉ sử dụng các chữ cái viết hoa nên nó không thể sử dụng tất cả các kết hợp có thể có của phân biệt chữ hoa chữ thường như một biện pháp bảo mật bổ sung như Base64 đôi khi thực hiện với việc gấp chữ hoa trong quá trình giải mã.",
    "dCFIC": "Mã đẹp hơn",
    "dCFIwC": "Trình tạo mã",
    "dGKMx": "đầu ra",
    "dGVUB": "Công cụ mạng",
    "dV5Eq": "Làm mới danh sách không gian làm việc",
    "dWbBm": "C# bao gồm lớp 'System.Convert' với các phương thức tích hợp ToBase64String và FromBase64String cho phép bạn mã hóa và giải mã dữ liệu Base64. Chuỗi đầu vào trước tiên được chuyển đổi thành mảng byte bằng cách sử dụng mã hóa UTF-8, sau đó được mã hóa và giải mã tương ứng.",
    "dk122q": "Quản lý quy trình công việc của bạn để kết hợp nhiều công cụ với nhau.",
    "dkarh": "Okie, hộp công cụ đã mở thư mục. Nếu không có cửa sổ bật lên, vui lòng kiểm tra xem nền tảng của bạn có hỗ trợ chức năng này hay thư mục có trong máy chủ hay không.",
    "dkjk12": "đây là bài kiểm tra",
    "dkkq12": "Định cấu hình công cụ của bạn trong tab này.",
    "dl4kr": "Quên mật khẩu?",
    "dpRY4": "Từ điển",
    "dqTqyvWY": "Menu ngăn kéo",
    "dsdpA_eJ": "Điều chỉnh kích thước",
    "dtjdt4": "Kazakhstan",
    "dxLQq": "Quyền gốc",
    "dzjTo": "Vui lòng cung cấp mật khẩu tài khoản tại đây",
    "e--gB": "ID tiện ích mở rộng không được cung cấp.",
    "e4Cd8t": "Base85",
    "e5c7r": "Base32 là sơ đồ mã hóa nhị phân thành văn bản biểu thị dữ liệu trong chuỗi ASCII bằng cách sử dụng tập hợp con gồm 32 ký tự. Nó được thiết kế để con người có thể đọc được và an toàn với URL.",
    "e5rycw": "Tiếng Kyrgyzstan",
    "e8Crq": "Vui lòng điền vào trường tên người dùng và mật khẩu bên dưới để tiếp tục.",
    "e8x2v": "Base45 hoạt động bằng cách chia dữ liệu đầu vào thành các nhóm, mỗi nhóm 5 byte. Sau đó, nó chuyển đổi từng nhóm thành số thập phân và ánh xạ nó thành ký tự tương ứng từ bộ 45 ký tự của nó.",
    "eN4fM": "Trong Rust, bạn có thể sử dụng thùng 'base64' để mã hóa và giải mã Base64. Thêm 'base64 = \\\"1.x\\\"' vào tệp Cargo.toml của bạn trong phần [phụ thuộc], chạy 'cargo build' và bao gồm các mục nhập cần thiết trong mã của bạn để sử dụng các chức năng này.",
    "eTmq": "Lịch sử của Hộp công cụ CodeGen",
    "e_8pZ": "Một hộp công cụ đa năng dành cho các nhà phát triển để cải thiện năng suất.",
    "ediql2": "người Hungary",
    "efg45678": "So sánh với Base32",
    "efghi678": "Biến thể này thường được sử dụng cho tên tệp, URL hoặc các tình huống phải tránh các ký tự đặc biệt.",
    "egkqC8t": "cơ sở58",
    "egkqCd8t": "cơ sở62",
    "eifoni": "tiếng Catalan",
    "eqkqd4W": "Vui lòng cung cấp tên cho thẻ mới",
    "etV-l": "Sao chép tập tin vào SIT2",
    "eu5mh0": "Người Belarus",
    "euaI8": "Tạo tài khoản cục bộ mới",
    "euhy9v": "tiếng Estonia",
    "f0q4w": "Một tình huống sử dụng phổ biến là tạo khóa bí mật cho Xác thực hai yếu tố (2FA), trong đó các dịch vụ như Google Authenticator và Yubikey sử dụng bí mật được mã hóa Base32.",
    "f1t2z": "Base62 được phát triển để cung cấp giải pháp thay thế ngắn hơn, an toàn cho URL cho Base64, đặc biệt đối với số nhận dạng duy nhất và URL ngắn.",
    "f3ttw8": "người Maori",
    "f4t7z": "Base58 ban đầu được phát triển cho Bitcoin để đại diện cho các địa chỉ công khai và khóa riêng mà không có sự mơ hồ.",
    "f5a0s": "Ngoài ra, Base32 tạo ra đầu ra dài hơn nhưng có thể phù hợp hơn cho các ứng dụng cụ thể như tên tệp do thiếu các ký tự đặc biệt có thể xung đột với các quy tắc hệ thống tệp.",
    "f5bLC": "Tài liệu",
    "f7akol": "Tiếng Anh",
    "f7t1z": "Thêm thư viện vào dự án Xcode của bạn theo cách thủ công hoặc thông qua trình quản lý gói như Trình quản lý gói Swift (SPM).",
    "f8n4m": "Tính nhỏ gọn của nó cho phép sử dụng không gian hiệu quả hơn trong mã QR trong khi vẫn duy trì khả năng đọc được bằng máy quét mã vạch tiêu chuẩn.",
    "f8wne": "Bao gồm gói bằng cách chạy 'Cài đặt gói BouncyCastle' trong Bảng điều khiển quản lý gói hoặc thêm gói đó vào tệp .csproj của bạn.",
    "f9t1z": "Base85 ban đầu được phát triển để thể hiện hiệu quả dữ liệu nhị phân trong tài liệu PostScript để có tỷ lệ nén tốt hơn.",
    "f9t2z": "Thêm phần sau vào tệp pom.xml của bạn: `<dependency> <groupId>org.iso</groupId> <artifactId>iso-base45</artifactId> <version>...</version> </dependency>` trong đó phiên bản là phiên bản mới nhất.",
    "fBP5h": "tên tài khoản",
    "fEr5j": "Tạo tập lệnh mới",
    "fTt2N": "Perl yêu cầu mô-đun 'MIME::Base64' để mã hóa và giải mã Base64. Cài đặt nó bằng cách chạy 'cpan install MIME::Base64' nếu chưa được cài đặt.",
    "fV_1P": "Đăng nhập",
    "fdxluz": "người Rumani",
    "ff02c": "Đã hủy",
    "fghi6789": "Nó được sử dụng để truyền hoặc lưu trữ các tệp nhị phân ở định dạng dựa trên văn bản, đảm bảo khả năng tương thích trên nhiều hệ thống khác nhau.",
    "fgj880": "tiếng Telugu",
    "fqV_1P": "Mở khóa LafTools của bạn",
    "g1h5n": "Base45 hoạt động như thế nào?",
    "g2_aX": "Sao chép mật khẩu được mã hóa vào tập tin",
    "g3h5s": "Base85 hoạt động như thế nào?",
    "g4h7s": "Đối với C++, bạn có thể sử dụng thư viện 'base45-cpp' có sẵn dưới dạng kho lưu trữ GitHub.",
    "g5SK9": "Mở gần đây",
    "g5ybh": "Thêm phần phụ thuộc vào dự án của bạn (Maven: 'org.apache.commons:commons-codec').",
    "g6f0r": "Không cần cài đặt bổ sung cho các thư viện lõi của Ruby. Chỉ cần thay thế 'TEST12345' bằng giá trị bạn mong muốn.",
    "g6f0t": "Chạy 'go get github.com/mitchellh/go-base32' để thêm phần phụ thuộc vào dự án của bạn.",
    "g6v3b": "Tuy nhiên, bộ ký tự lớn hơn của Base45 có thể làm tăng khả năng xảy ra lỗi khi xử lý các ký tự không phải chữ và số. Đây có thể là sự cố trong một số môi trường hoặc kênh truyền.",
    "g7h5k": "Base58 hoạt động như thế nào?",
    "g8h7s": "Base62 hoạt động như thế nào?",
    "g8r3e": "Nhược điểm chính của Base32 là hiệu quả không gian tương đối kém; nó mở rộng dữ liệu đầu vào nhiều hơn khoảng 25% so với Base64. Điều này có nghĩa là nó chiếm nhiều dung lượng lưu trữ hoặc băng thông hơn cho cùng một lượng dữ liệu được mã hóa.",
    "gDjbs": "Dữ liệu lịch sử",
    "gK3dNQ": "Sao chép",
    "gQhfS": "Công cụ tập tin",
    "gT6re": "C++ không có triển khai Base64 nguyên gốc. Ví dụ này sử dụng thư viện OpenSSL để thực hiện mã hóa và giải mã Base64. Để sử dụng OpenSSL, hãy cài đặt nó trên hệ thống của bạn và liên kết với các thư viện thích hợp khi biên dịch chương trình của bạn.",
    "gU1O2": "bị kích hoạt",
    "gkC8t": "cơ sở64",
    "gkdqqC8t": "cơ sở45",
    "gkqC8t": "Cơ sở32",
    "gnKMZ": "Đã làm mới.",
    "gsHQM": "Đã tải dữ liệu mẫu thành công",
    "h4e1b": "Tính năng này cũng hữu ích trong các trường hợp trong đó các chuỗi chữ và số phân biệt chữ hoa chữ thường dễ xử lý hơn chuỗi thập lục phân hoặc base64, có thể chứa các ký tự không phải chữ và số có thể gây ra sự cố trong một số ngữ cảnh nhất định (như URL hoặc tên tệp).",
    "h6AeI": "Kết nối Websocket đã đóng lúc {0}",
    "h7rUq": "Trong Node.js, lớp 'Bộ đệm' tích hợp có thể xử lý mã hóa và giải mã Base64 mà không yêu cầu bất kỳ thư viện bên ngoài nào. Đoạn mã này mã hóa chuỗi 'TEST12345' thành Base64 và sau đó giải mã nó trở lại chuỗi ban đầu.",
    "h9j3m": "Phần đệm trong Base32",
    "hJUMN": "Ngôn ngữ mục tiêu",
    "hMvh1": "Sao lưu cơ sở dữ liệu",
    "hRFxV": "Để biết thêm thông tin, vui lòng truy cập trang web của chúng tôi",
    "hcnt1k": "Tiếng Macedonia",
    "hhOT3": "Tìm kiếm theo tên",
    "hij90klm": "Base32 sử dụng bảng chữ cái nhỏ hơn (A-Z2-7), dẫn đến các chuỗi dài hơn nhưng dễ đọc hơn.",
    "htt1d2": "Quốc tế ngữ",
    "hu-iz": "hẹn giờ",
    "huE6U": "Biến đổi",
    "hyV-d": "Xong",
    "hyirc0": "tiếng Thụy Điển",
    "i27qmr": "tiếng Frisia",
    "i6hMN": "Mã xác minh hình ảnh",
    "i7w2m": "Có thư viện Base45 tích hợp nào trong các ngôn ngữ lập trình phổ biến không?",
    "i88tb": "Xuất kết quả sang tệp",
    "i8q8tb": "Định cấu hình quy trình làm việc cho đầu vào",
    "i9o7k": "Ưu điểm của Base32 so với Base64",
    "iNQvo": "Hiển thị một ví dụ để bắt đầu.",
    "iNqF1T": "Quản lý tài khoản đám mây",
    "iOEjZ": "Không có sẵn mã",
    "iQL2c": "Chúng tôi vẫn đang khám phá đầy đủ các chức năng cho nút này - nếu bạn có bất kỳ phản hồi hoặc đề xuất nào về cách chúng tôi có thể cải thiện nút này, vui lòng cho chúng tôi biết!",
    "i_lang_": "Gói ngôn ngữ",
    "ib135dq": "Thông báo trạng thái của bạn sẽ được hiển thị ở đây",
    "iknTS": "Trình quản lý mật khẩu",
    "init_env": "Đang tải tài nguyên hệ thống",
    "ip2g1": "Đã sao chép",
    "ipOSQE": "Phiên bản chuyên nghiệp",
    "it8ths": "tiếng Indonesia",
    "ixyP0": "Tự động xử lý hành động theo thời gian thực",
    "j1b5k": "Các hoạt động phổ biến nhất liên quan đến Base32 bao gồm mã hóa dữ liệu nhị phân thành chuỗi Base32 và giải mã chuỗi Base32 trở lại định dạng nhị phân ban đầu.",
    "j4s6r": "Làm cách nào để mã hóa/giải mã bằng Base62 trong JavaScript?",
    "j5s7r": "Làm cách nào để mã hóa/giải mã bằng Base85 trong JavaScript?",
    "j6s3r": "Làm cách nào để mã hóa/giải mã bằng Base58 trong JavaScript?",
    "j7k2t": "Để mã hóa dữ liệu bằng Base45, bạn cần có thư viện hoặc hàm triển khai thuật toán Base45.",
    "j8s6r": "Đối với Kotlin, bạn có thể sử dụng thư viện 'barcode-core' có chức năng Base45.",
    "j9s5r": "Đối với C#, bạn có thể sử dụng thư viện 'Base45' có sẵn trên NuGet.",
    "jJuNz": "Ngôn ngữ nguồn",
    "jO5eP": "ĐƯỢC RỒI",
    "jOXj0": "Rất tiếc, đã xảy ra lỗi.",
    "jPNCb": "Đã thử lại.",
    "jQXdi": "Chế độ sáng",
    "jR1zX": "Phòng thí nghiệm AI",
    "jRzgS": "Khung Foundation của Swift bao gồm các phương thức tích hợp để mã hóa và giải mã Base64. Không cần thư viện bên ngoài; chỉ cần nhập 'Nền tảng' để sử dụng các tính năng này.",
    "jZvLJ": "PHP đi kèm với các hàm dựng sẵn 'base64_encode()' và 'base64_decode()' để xử lý các hoạt động Base64. Các chức năng này có sẵn và không cần thiết lập hoặc cài đặt bổ sung.",
    "jaj7M": "Đã đăng ký Bản quyền.",
    "jb392": "Tên",
    "jfpqt": "Điều hướng ghi chú",
    "jgDoEq": "Không có dữ liệu câu hỏi thường gặp",
    "jhDoE": "Truy xuất dữ liệu Câu hỏi thường gặp",
    "jlxvpk": "Hàn Quốc",
    "k17PG": "Đã đóng kết nối Websocket.",
    "k1k239q": "Vui lòng tải lại trang hoặc khởi động lại ứng dụng để áp dụng thay đổi này.",
    "k1m4e": "Tuy nhiên, nó không mang lại hiệu quả về không gian tương tự như Base64 hoặc Base32 vì nó sử dụng ít ký tự hơn trong bảng chữ cái.",
    "k2SVY": "tắt",
    "k2em5e": "Điều này dẫn đến các chuỗi đầu ra ngắn hơn cho cùng một lượng dữ liệu đầu vào, điều này có thể có lợi trong các trường hợp cần giảm thiểu kích thước.",
    "k2ku5p": "tiếng Séc",
    "k3m2e": "Sao chép mẫu được cung cấp vào tệp Go mới, thay thế trình giữ chỗ bằng giá trị được mã hóa thực tế, sau đó chạy tệp bằng cách sử dụng `go run yourfile.go`",
    "k41a5": "LafCông cụ",
    "k4s5rx": "tiếng Slovenia",
    "k7d9f": "Thư viện 'base32' tích hợp của Ruby cung cấp các phương thức mã hóa và giải mã Base32.",
    "k7d9r": "Gói 'go-base32' cung cấp khả năng mã hóa và giải mã Base32 trong Go.",
    "k7g0n": "Trong Base32, cứ 5 bit dữ liệu đầu vào được ánh xạ tới một trong 32 ký tự từ bộ 'ABCDEFGHIJKLMNOPQRSTUVWXYZ234567='.",
    "k9em5e": "Điều này làm cho nó trở nên lý tưởng cho các tình huống yêu cầu mã định danh ngắn gọn, thân thiện với URL mà không làm mất đi khả năng đọc.",
    "k9jtr": "Gói npm 'mã hóa base32' được sử dụng để mã hóa và giải mã Base32 trong Node.js.",
    "kLH79": "E-mail",
    "kOi5A": "Trang in",
    "kPD22": "Từ điển",
    "kPJ-A4": "Làm cho khỏe lại",
    "kZd9G": "Ruby có thư viện 'base64' tích hợp cung cấp các phương thức mã hóa và giải mã Base64. Bao gồm thư viện có 'require \\\"base64\\'' trong tập lệnh của bạn.",
    "kcHxr": "Vui lòng cung cấp tên người dùng tài khoản quản trị viên tại đây",
    "kjks1": "Truy xuất cấu hình i18n từ API máy chủ cục bộ",
    "kqv5ht": "tiếng Yiddish",
    "krxSK": "Trợ lý AI",
    "ks12d": "An ninh mạng",
    "kv4wag": "tiếng Hà Lan",
    "l1p9z": "Base32 là gì?",
    "l3akoa": "tiếng Amharic",
    "l6Djb": "Chọn một trong các tùy chọn làm chủ đề ưa thích của bạn:",
    "lIn3_": "Tên người dùng quản trị viên",
    "lQFII": "Kích hoạt lại quá trình khởi tạo",
    "lRHDQ": "Thoát chế độ toàn màn hình",
    "lUh5c": "Tổng quan",
    "lkuulh": "người Pháp",
    "lp0qmd0": "Đánh dấu nó là yêu thích",
    "lpKAz": "Cài đặt",
    "lpzg83": "Tiếng Samoa",
    "lzGS2": "Chi tiết tiện ích mở rộng",
    "m0106": "Bộ chuyển đổi",
    "m0107": "Máy phát điện",
    "m0108": "Trình định dạng",
    "m6d8b": "Mỗi giá trị 5 bit được biểu thị bằng một ký tự đơn, cho phép mã hóa và giải mã hiệu quả cho các hệ thống thích làm việc với octet (đơn vị 8 bit).",
    "m6t1b": "Thư viện 'base32' của Daniel R. Collins cung cấp chức năng mã hóa và giải mã Base32 trong C++.",
    "m7WZw": "Hệ thống Websocket bị hỏng",
    "m8rTc1": "Khi trình quản lý tập lệnh shell được triển khai, bạn có thể sử dụng nó để quản lý các lệnh shell của mình.",
    "m9k1z": "Tuy nhiên, nếu dữ liệu được giải mã chứa ngữ nghĩa ứng dụng cụ thể (ví dụ: các định dạng mã QR cụ thể), việc xử lý bổ sung có thể cần thiết sau khi giải mã.",
    "mBgF1": "Hành động chuột",
    "mSFei": "Mã nguồn trên GitHub",
    "mWXeh": "ID không gian làm việc: {0}",
    "mabHq": "Tìm tập tin cũ",
    "mbzCv": "Đã xảy ra lỗi: {0}, thời gian bị từ chối là {1}",
    "mihc3": "Đã hoàn thành thao tác này",
    "mjHoR": "Ngoài ra, về mặt kỹ thuật, không ai có thể đọc được mã thông báo này nếu không họ đã tấn công và kiểm soát máy tính của bạn.",
    "mnb19i": "tiếng Đức",
    "mno34567": "Ưu điểm của Base64",
    "mnoijklm": "Có mã hóa BaseXX nào khác không?",
    "mslw4o": "người Hy Lạp",
    "mwn7iv": "Tiếng Zulu",
    "myxedr": "tiếng Mông Cổ",
    "n0pqrstu": "Ví dụ sử dụng Base64",
    "n1jA9": "Xác nhận",
    "n24tes": "Tiếng Bồ Đào Nha (Brazil)",
    "n3e7r": "Lịch sử của Base32",
    "n94an4": "Đánh bóng",
    "n98EW": "Hoán đổi văn bản của vùng đầu vào và vùng đầu ra.",
    "nSeIq8-": "Và quan trọng nhất, nó là nguồn mở và miễn phí. Bạn có thể sử dụng nó cho mục đích cá nhân hoặc thương mại của bạn.",
    "nTvw4": "Để bảo vệ và lưu riêng dữ liệu cũng như cài đặt của bạn, bạn có thể sử dụng tài khoản cục bộ của mình để đạt được điều đó. Ngoài ra, LafTools sẽ hỗ trợ các tiện ích tin nhắn tức thời giữa những người dùng trong tương lai.",
    "nmb1wx": "Tiếng Yoruba",
    "nodBw": "Thao tác này mã hóa dữ liệu thô thành chuỗi ASCII {0}.",
    "nopqrs01": "Trong khi Base64 tối ưu hóa để thu gọn thì Base32 được chọn khi việc giảm thiểu các lỗi đầu vào, chẳng hạn như nhập thủ công, là rất quan trọng.",
    "nrix6l": "Chichewa",
    "nxJC7": "Hành động mặc định được thực hiện khi máy biến áp được thực hiện.",
    "o1umzi": "người Pháp",
    "o52xW": "Xuất khẩu",
    "o8xyzu": "Tiếng Luxembourg",
    "oBz8D": "Đang tải",
    "oNLxH": "tên tài khoản",
    "oNg3f": "Trang web chính thức",
    "ocxsw3": "người Ireland",
    "of_ox": "Nói chung, LafTools là giải pháp toàn diện cho mọi nhu cầu của bạn.",
    "oj23X": "Khôi phục cơ sở dữ liệu",
    "ooiFU": "Khởi động lại dịch vụ Java",
    "oqHqVq": "Sắp xếp theo",
    "oqHqqV": "Tổng cộng: {0} Lệnh",
    "oqHqqVq": "Sao chép lần",
    "oqjbcj": "tiếng Lào",
    "os8h6u": "người Đan Mạch",
    "p5e9n": "Thêm thư viện làm phần phụ thuộc trong tập lệnh bản dựng Gradle của bạn. Ví dụ: trong tệp build.gradle cấp ứng dụng, hãy thêm `implementation 'com.bottlerocketstudios:barcode-core:...'` với số phiên bản mới nhất.",
    "p6e3n": "Để cài đặt nó, hãy chạy `Install-Package Base45` trong Bảng điều khiển Trình quản lý gói hoặc thêm phần phụ thuộc thông qua Trình quản lý gói NuGet.",
    "p8Exxc1s": "Có nhiều công cụ khác nhau tận dụng công nghệ AI để thực hiện các nhiệm vụ hiệu quả hơn trong Phòng thí nghiệm AI.",
    "p8eq9n": "Bạn có thể sử dụng các thư viện như 'base85' hoặc 'ascii85' để mã hóa và giải mã Base85 trong JavaScript.",
    "p9e1n": "Bạn có thể sử dụng các thư viện như 'base-x' (<a href='https://github.com/cryptocoinjs/base-x'>Liên kết GitHub</a>) hoặc 'base62' (<a href='https: //www.npmjs.com/package/base62'>npm link</a>) để mã hóa và giải mã Base62 bằng JavaScript.",
    "p9s5t": "Base32 được phát triển bởi Douglas Crockford, được biết đến với những đóng góp của ông cho JavaScript, vào năm 2001. Nó được tạo ra như một giải pháp thay thế đáng tin cậy hơn cho các mã hóa hiện có như Base64, đặc biệt đối với các tình huống yêu cầu biểu diễn dữ liệu nhị phân dựa trên văn bản.",
    "pANmj": "Thẻ có thể được xác định dựa trên loại máy chủ, cách sử dụng tập lệnh hoặc bất kỳ tiêu chí nào khác mà bạn thích.",
    "pA_deJ": "Xuất sang bảng nhớ tạm",
    "pA_feeJ": "Kết nối lại thiết bị đầu cuối",
    "pA_qweJ": "Xóa bộ đệm",
    "pDBSWq": "không có nội dung có sẵn cho bảng bên phải",
    "pEk1kk": "LafTools giới thiệu các chức năng hữu ích cho bạn tại đây.",
    "pEk1qkk": "Liệt kê tất cả các tab đã mở",
    "pHZDB": "Hành động thời gian thực",
    "pJoOz": "Mở tệp",
    "pKHRT": "Đi tới Công cụ",
    "pKqHRq": "Tìm kiếm ghi chú",
    "pL6qH": "Hoàn thành.",
    "ph5jH": "Xử lý phần này",
    "piih4x": "Tiếng Tajik",
    "pmAee": "Đọc thêm thông tin về công cụ này.",
    "pmnp4b": "tiếng Ukraina",
    "ppmz8e": "Tiếng Creole Haiti",
    "pq5e9n": "Bạn có thể sử dụng các thư viện như 'bs58' để thực hiện mã hóa và giải mã Base58 trong JavaScript.",
    "pqrs890t": "Khả năng tương thích toàn cầu: Base64 được công nhận và hỗ trợ rộng rãi trong tất cả các ngôn ngữ lập trình chính.",
    "pqs7y3": "Vui lòng xem xét việc đăng ký trang web này dưới dạng PWA để được hỗ trợ sơ đồ bàn phím đầy đủ.",
    "psA_eJ": "Xuất dưới dạng tệp",
    "psZoP": "Thả tập tin vào đây để xử lý chúng",
    "psqqpq_o": "Được rồi, kết quả đã được sao chép vào khay nhớ tạm của bạn {0} lần.",
    "q12beqwR": "Không có công cụ nào",
    "q29t31": "Đánh bóng",
    "q2n3r": "Ngày nay, nó được sử dụng trong nhiều ứng dụng khác nhau, nơi mà hiệu quả về không gian và khả năng đọc là rất quan trọng, chẳng hạn như tài liệu PDF và một số giao thức mạng nhất định.",
    "q2n9r": "Sau khi thêm, hãy sao chép mẫu được cung cấp vào tệp Swift. Lưu ý rằng trong ví dụ này, chúng tôi đang sử dụng một kịch bản giả định trong đó bạn có biểu diễn base64 của chuỗi Base45; thay thế nó bằng giá trị được mã hóa thực tế trước khi chạy mã.",
    "q2w5m": "Mục đích sử dụng Base32?",
    "q2x8k": "Việc sử dụng nó đã mở rộng sang các loại tiền điện tử và các tình huống khác, nơi mong muốn các chuỗi chống lỗi, có thể đọc được của con người.",
    "q5h8n": "Ưu điểm chính là giảm độ dài chuỗi cho cùng một lượng dữ liệu được mã hóa, khiến nó phù hợp với các ứng dụng yêu cầu hiệu quả về không gian.",
    "q6K7o": "Tải từ ghi chú",
    "q6n1r": "Thư viện cung cấp các lớp bộ mã hóa và bộ giải mã xử lý chuyển đổi Base45. Sau khi phần phụ thuộc được thêm vào, hãy sao chép mã mẫu vào một lớp Java và thực thi nó.",
    "q7n3r": "Nó cũng tránh các ký tự mơ hồ như 'O' và '0', 'I' và 'l', có thể dẫn đến lỗi phiên âm của con người.",
    "q9iuti": "người xứ Wales",
    "qDrbEr": "Tên người dùng bạn cung cấp trống, vui lòng kiểm tra và thử lại.",
    "qF4uS2": "Tạo không gian làm việc",
    "qF4uS23": "Cửa sổ mới",
    "qHoktx": "Cảm ơn!",
    "qN1LdZ2": "Sửa đổi lần cuối",
    "qQmBr": "Dịch văn bản",
    "qTqyvWdY": "Chưa hoàn thành",
    "qWemXE4": "Ngày 1 tháng 1 năm 2024",
    "qWw3eTH": "Phần này giúp duy trì các tệp trên đĩa cục bộ hoặc đĩa đám mây của bạn.",
    "qdeFXx": "Hiện tại, trang bạn đang tìm kiếm này chưa được triển khai đầy đủ.",
    "qpDBSW": "không có bảng điều khiển có sẵn",
    "qpDBSWe1": "không có bảng điều khiển có sẵn",
    "qqK_x_": "Đăng nhập",
    "qqqwYoz": "Giúp đỡ",
    "qqwYoz": "Tab",
    "qqwYqwe": "Không gian làm việc",
    "qrstuvwx": "Có, ngoài Base64 và Base32, còn có Base16 (Thập lục phân), Base58 và Base85, mỗi loại được thiết kế cho các tình huống khác nhau.",
    "qtpmvP": "Xác nhận mật khẩu cục bộ",
    "qubSJ": "VM mở rộng không phải là ID. (REF: IQnMH).",
    "qv1p5n": "Ví dụ: trong Java, bạn có thể sử dụng thư viện 'org.iso.base45' để mã hóa dữ liệu của mình.",
    "qzshys": "tiếng Urdu",
    "r1GLS": "Thẻ",
    "r2n7v": "Ưu điểm chính là tăng khả năng đọc do loại trừ các ký tự trông giống nhau, giảm lỗi khi nhập thủ công.",
    "r4n6v": "Thêm phần phụ thuộc vào dự án của bạn bằng cách chạy `go get github.com/btcsuite/btcutil`. Điều này sẽ tải xuống và cài đặt gói.",
    "r6nq2v": "Ưu điểm chính của Base62 là tăng hiệu quả không gian do bộ ký tự lớn hơn Base32 nhưng không có ký tự không phải chữ và số trong Base64.",
    "r6tq9z": "<b>Ví dụ:</b> Để mã hóa 'TEST12345' trong Base32, bạn có thể sử dụng các thư viện như base32-encode trong Node.js hoặc các hàm tích hợp sẵn trong các ngôn ngữ khác như base64.b32encode của Python.",
    "r8c6z": "Thay thế 'TEST12345' bằng chuỗi của riêng bạn và thực thi lớp này dưới dạng chương trình Java để xem kết quả.",
    "r8y2w": "Thư viện PHP 'Base32' được sử dụng ở đây để mã hóa và giải mã Base32.",
    "r9a3t": "Base45 là sơ đồ mã hóa dựa trên văn bản mã hóa dữ liệu nhị phân thành các ký tự ASCII.",
    "r9qn8v": "Ưu điểm chính của Base85 là hiệu quả không gian được cải thiện nhờ bộ ký tự lớn hơn (85 so với 64 trong Base64 hoặc 32 trong Base32).",
    "rK6cx": "{0}, được thiết kế và phát triển bởi nhóm LafTools",
    "rLXJN": "Trong Kotlin, lớp 'android.util.Base64' tích hợp của Android có thể được sử dụng để mã hóa và giải mã Base64. Ví dụ này giả định môi trường Android; đối với các dự án Kotlin không phải Android, hãy cân nhắc sử dụng 'java.util.Base64'.",
    "rQkas": "Chào mừng đến với LafTools",
    "rR1vd": "Nhập từ tập tin",
    "rT34qnO": "Nhập văn bản để xử lý. Kết quả sẽ hiển thị trong trình chỉnh sửa đầu ra.",
    "rVqlu": "Giải mã {0}",
    "rYSpw": "Thuật toán MD2 (Message-Digest 2) là hàm băm mật mã được Ronald Rivest phát triển vào năm 1989. Thuật toán này được tối ưu hóa cho máy tính 8 bit.<br><br>Mặc dù MD2 không còn được coi là an toàn nữa, ngay cả kể từ năm 2014, nó vẫn được sử dụng trong cơ sở hạ tầng khóa công khai như một phần của chứng chỉ được tạo bằng MD2 và RSA. Theo mặc định, thuật toán phân loại tin nhắn bao gồm 18 vòng.",
    "r_n6h": "Chế độ sáng hoặc tối",
    "rf0mql3": "Chủ đề sáng hoặc tối",
    "rpG0G": "Chúng tôi đánh giá cao phản hồi của bạn và muốn nghe suy nghĩ của bạn về cách chúng tôi có thể cải thiện sản phẩm của mình - vui lòng chia sẻ phản hồi của bạn với chúng tôi!",
    "run_text": "Trước khi vào bàn làm việc của bạn, trước tiên chúng tôi muốn tải trước các tài nguyên hệ thống cần thiết. Vui lòng đợi một lát, nó sẽ sớm được hoàn thành, chi tiết có thể xem được như bên dưới.",
    "rycJy": "LafTools là một hộp công cụ đa năng được thiết kế dành riêng cho các lập trình viên. Nó đại diện cho phiên bản thứ hai của Hộp công cụ CodeGen, giờ đây có thời gian chạy nhẹ hơn được viết bằng Golang và JavaScript.",
    "ryhkqb": "tiếng Bungari",
    "s0vrf9": "tiếng Do Thái",
    "s1b3m": "Không giống như Base64 hoặc Base32, nó loại trừ các ký tự '0', 'O', 'I' và 'l' dễ bị nhầm lẫn, làm cho nó phù hợp với URL và mã QR.",
    "s3e6r": "Làm cách nào để mã hóa dữ liệu bằng Base45?",
    "s4OeX": "Đăng nhập hệ thống thành công",
    "s5b8m": "Thay thế 'TEST12345' bằng dữ liệu của riêng bạn và thực thi tập lệnh này trong môi trường PHP để thực hiện các thao tác Base32.",
    "s5e8r": "Thay thế 'TEST12345' bằng dữ liệu thực tế của bạn và chạy đoạn mã này trong ngữ cảnh ứng dụng Swift để thực hiện các thao tác Base32.",
    "s5t0n": "Phần đệm trong Base32 liên quan đến việc thêm các ký tự '=' để đảm bảo rằng đoạn dữ liệu được mã hóa cuối cùng vẫn chứa bội số của 8 bit. Tuy nhiên, không giống như Base64, phần đệm Base32 là tối thiểu vì mỗi ký tự Base32 đã mã hóa 5 bit.",
    "s7e9r": "Không cần thư viện bên ngoài. Chỉ cần thay thế 'b'TEST12345'' bằng đối tượng giống byte thực tế của bạn để mã hóa/giải mã.",
    "sBxHr": "Scala sử dụng lớp 'java.util.Base64' tích hợp của Java cho các hoạt động Base64. Đảm bảo bạn đang chạy trên nền tảng JVM có Java 8 trở lên.",
    "sHoxxW": "Chuyển đổi",
    "sKx5t": "Lớp 'java.util.Base64' tích hợp của Java, có sẵn kể từ Java 8, cung cấp các phương thức mã hóa và giải mã Base64. Chuỗi đầu vào được chuyển đổi thành byte bằng cách sử dụng mã hóa UTF-8, sau đó được mã hóa và giải mã nếu cần.",
    "sO0MOe": "Mỗi khi bạn ở trong một cửa sổ lâu hơn 5 giây, nó sẽ được hiển thị ở đây.",
    "sR8yc": "Đóng",
    "sc49my": "tiếng Sindhi",
    "sdfk1": "Cuộn tab sang trái",
    "sdfk13": "Cuộn tab sang phải",
    "sglMS": "Tạo thời gian",
    "sk123": "Chưa hoàn thành",
    "slqcWD": "Phần logic này chưa được hỗ trợ, vui lòng theo dõi.",
    "sojBI": "Chuyển đổi",
    "spCqEa": "LÀM",
    "spdh98": "Tiếng Trung giản thể",
    "ssDaOq": "Bạn mới sử dụng LafTools?",
    "ssm80i": "Tiếng Basque",
    "svqh06": "Tiếng Azerbaijan",
    "sys_updates": "Cập nhật hệ thống mới nhất",
    "t63Qw": "Miễn nhiệm",
    "t6wczq": "Xhosa",
    "t7m4g": "Thùng 'base32' được sử dụng để mã hóa và giải mã Base32 trong Rust.",
    "t84q1z": "tiếng Armenia",
    "t8c6xc": "tiếng Somali",
    "t8z1v": "Khi không còn đủ bit ở cuối để điền vào nhóm 5 bit đầy đủ, các ký tự đệm '=' sẽ được thêm vào. Ví dụ: một byte yêu cầu hai ký tự Base32 và chuỗi 3 byte sẽ cần bốn ký tự Base32.",
    "t9m3g": "CryptoSwift là gói Swift phổ biến bao gồm chức năng mã hóa và giải mã Base32.",
    "tBIX-d": "các cửa sổ",
    "tEiv_": "Truy xuất chi tiết tiện ích mở rộng",
    "tIy3Q": "Gặp phải lỗi",
    "tIyq3Q": "Gặp phải lỗi",
    "tR8pY": "Go cung cấp gói thư viện tiêu chuẩn 'encoding/base64' với các chức năng mã hóa và giải mã Base64. Không cần phụ thuộc bên ngoài; chỉ cần nhập gói này vào chương trình Go của bạn và gọi các hàm thích hợp.",
    "tWe1yF": "Không có lệnh shell có sẵn.",
    "tY3p1": "Thêm thông tin",
    "tiaiB": "Hủy bỏ",
    "tn7duf": "tiếng Croatia",
    "ttAre": "Nhập mật khẩu văn bản gốc của bạn vào đây",
    "tuv23456": "Biến thể an toàn URL Base64",
    "twamg": "Trợ lý AI, nâng cao khả năng sáng tạo của bạn",
    "tyhgpr": "tiếng Java",
    "u1i2b": "Ưu điểm của việc sử dụng Base85 so với Base64 hoặc Base32 là gì?",
    "u2l8s": "Base45 là gì?",
    "u3i8b": "Ưu điểm của việc sử dụng Base62 so với Base64 hoặc Base32 là gì?",
    "u3j9p": "Base32 thường được sử dụng khi bạn cần một bản trình bày văn bản nhỏ gọn của dữ liệu nhị phân có thể được nhập hoặc in mà không làm mất thông tin, như trong kiểm tra tính toàn vẹn của tệp, bộ đệm địa lý và tạo mật khẩu an toàn.",
    "u7i9b": "Đối với Go, hãy sử dụng gói 'btcutil' có sẵn trên GitHub, cụ thể là mô-đun base58.",
    "u7vwx8yz": "Hoạt động Base64 phổ biến",
    "u8i5b": "Ưu điểm của việc sử dụng Base58 so với Base64 hoặc Base32 là gì?",
    "u9g6t": "Để chạy mã này, bạn cần cài đặt gói '@digitalbazaar/base45'.",
    "uCEe8": "Chuyển đổi thời gian thực",
    "uFcDQ": "Đang khởi tạo dữ liệu trạng thái...",
    "uV5Bi": "Không thể tải tiện ích mở rộng",
    "uVseB": "Nhấn {0} để hiển thị danh sách phím nóng",
    "uW7eZ": "Trong C, không có triển khai Base64 gốc. Ví dụ này sử dụng thư viện OpenSSL để mã hóa và giải mã Base64. Để sử dụng đoạn mã này, hãy cài đặt OpenSSL trên hệ thống của bạn và liên kết với các thư viện thích hợp khi biên dịch chương trình của bạn bằng lệnh tương tự như 'gcc -o base64_example base64_example.c -lssl -lcrypto'.",
    "ucDLv": "Bạn đã sao chép mục này {0} lần",
    "ui5pZ": "Trình phân tích lệnh",
    "ulah0q": "tiếng Nhật",
    "unc9E": "Văn bản ngẫu nhiên",
    "usr_defined": "Tùy chọn hệ thống",
    "uvwxyza1": "Không mất dữ liệu: Vì đây là quy trình có thể đảo ngược nên mã hóa Base64 không dẫn đến bất kỳ mất mát thông tin nào.",
    "uwqGE": "Đi tới Công cụ",
    "v3k5r": "Bộ ký tự bao gồm tất cả các chữ cái viết hoa và viết thường (A-Z, a-z) và các chữ số (0-9), cung cấp cách trình bày nhỏ gọn hơn so với Base64 hoặc Base32.",
    "v4k6r": "Nó mã hóa dữ liệu thành dạng nhỏ gọn hơn so với Base64 hoặc Base32 bằng cách sử dụng bộ ký tự lớn hơn.",
    "v4n9t": "Base58 là sơ đồ mã hóa biểu diễn dữ liệu nhị phân dưới dạng một chuỗi các ký tự chữ và số.",
    "v5k3r": "Thư viện này cung cấp một API đơn giản để mã hóa và giải mã Base45 trong các ứng dụng Node.js. Sau khi cài đặt, sao chép mẫu được cung cấp vào tập lệnh của bạn và thực thi nó bằng trình thông dịch Node.js.",
    "v6qkl": "Gói BouncyCastle NuGet cung cấp mã hóa và giải mã Base32 trong C#.",
    "v7q3db": "tiếng Thái",
    "v9b7t": "Thay thế 'TEST12345' bằng chuỗi của riêng bạn và chạy ứng dụng bảng điều khiển này để thực hiện các hoạt động mã hóa và giải mã Base32.",
    "vOjNC": "Nhập mật khẩu hoặc khóa bảo mật",
    "vTsQU": "Vui lòng cung cấp mã lời mời từ quản trị viên của bạn",
    "vU17B": "Không thể gửi yêu cầu",
    "vWqac": "Trước khi vào bàn làm việc của bạn, trước tiên chúng tôi muốn tải trước các tài nguyên hệ thống cần thiết. Vui lòng đợi một lát, nó sẽ sớm được hoàn thành, chi tiết có thể xem được như bên dưới.",
    "vaP0vq": "Thiết lập mật khẩu cục bộ thành công.",
    "vci8rd": "tiếng Hà Lan",
    "vh9j4": "Đầu vào",
    "vo1prl": "người Tây Ban Nha",
    "vr93oi": "tiếng Phần Lan",
    "vrfjnf": "người Ý",
    "vwx1yza2": "Một ví dụ là mã hóa một tệp hình ảnh để nhúng nó vào thẻ HTML <img>:",
    "w1x4k": "Có, tồn tại một số biến thể, bao gồm Ascii85 (được sử dụng trong PostScript và PDF), Z85 (ZeroMQ) và UUencode (định dạng cũ hơn). Mỗi người có một bộ ký tự và quy tắc hơi khác nhau.",
    "w2x9qk": "Mặc dù bản thân Base62 không có biến thể quan trọng nhưng một số cách triển khai có thể hơi khác nhau trong cách lựa chọn bộ ký tự, chẳng hạn như loại trừ '+' hoặc '/' thường được sử dụng trong Base64.",
    "w3x7k": "Có, một số biến thể phổ biến bao gồm Base58Check, bổ sung tổng kiểm tra để phát hiện lỗi, thường được sử dụng trong Bitcoin.",
    "w6otqn": "tiếng Corse",
    "w92j07": "tiếng Nga",
    "w9qudj": "Tiếng Punjab",
    "wAxtg": "Ban đầu, chúng tôi đã tạo UUID làm mã thông báo được ủy quyền để bạn thực hiện thiết lập này. Từ những gì LafTools đã nhận được, mã thông báo bạn cung cấp là {0}, nó đã được LafTools xác minh thành công và do đó bạn có thể tiếp tục thiết lập biểu mẫu này.",
    "wI1eh": "Kế tiếp",
    "wQYoz": "Tài liệu",
    "wQdYoz": "Biên tập",
    "wQdqwYoz": "Xem",
    "wcl1K": "Cách sử dụng",
    "wgkk6y": "cây nho",
    "wj3VS": "Thao tác này giải mã dữ liệu từ chuỗi ASCII {0} trở lại định dạng thô.",
    "wsWcXd": "Thông báo",
    "wxyzabcd": "Có một phiên bản Base64 an toàn cho URL thay thế '+' bằng '-' và '/' bằng '_', đồng thời bỏ qua phần đệm '=', làm cho phiên bản này phù hợp với URL web.",
    "x009": "Để truy cập tài liệu sử dụng của chúng tôi",
    "x2c5e": "Để sử dụng Base45 trong Python, bạn cần cài đặt thư viện 'base45'.",
    "x2z6r": "Base58 là gì?",
    "x5alzu": "Tiếng Kurd (Kurmanji)",
    "x5tHV": "Tổng quan về hệ thống",
    "x5z1b": "Base45 được phát triển chủ yếu để sử dụng mã QR trong bối cảnh chứng chỉ COVID kỹ thuật số.",
    "x6v2w": "Không có thư viện Base32 tiêu chuẩn trong C, vì vậy chúng tôi đang sử dụng thư viện 'libbase32' giả định ở đây.",
    "x7n1m": "Base62 là sơ đồ mã hóa biểu diễn dữ liệu nhị phân dưới dạng một chuỗi gồm 62 ký tự chữ và số.",
    "x8mdg": "Mô-đun 'base64' tích hợp của Python cung cấp mã hóa và giải mã Base32 thông qua các hàm 'b32encode' và 'b32decode'.",
    "x9g7e": "Tải xuống mã nguồn từ GitHub (https://github.com/dankamongmen/libbase32) hoặc cài đặt mã nguồn dưới dạng gói nếu có sẵn cho nền tảng của bạn.",
    "x9n1b": "Base85 là sơ đồ mã hóa thể hiện dữ liệu nhị phân bằng cách sử dụng bộ 85 ký tự ASCII có thể in được.",
    "xMBv0": "Đang tải các tài nguyên liên quan...",
    "xOJqG1": "Các câu hỏi thường gặp",
    "xPHqP": "Mô tả vẫn chưa được xác định.",
    "xQ_ls": "Sao lưu Redis",
    "xbz0B": "Đóng tất cả cửa sổ",
    "xbz0B2": "Đóng tab",
    "xdqwe": "Chào mừng bạn đến sử dụng LafTools!",
    "xeP4zV": "Xem nhanh các mục TODO của bạn",
    "xeP4zVd": "Tra cứu nhanh từ vựng tiếng Anh.",
    "xlqtA": "Nhận xét",
    "xs22XLF": "Không có sẵn dữ liệu cho ID mặt hàng này, vui lòng xem xét chọn các mặt hàng khác.",
    "y3b6n": "Có, miễn là chuỗi mã hóa được tạo theo thông số kỹ thuật Base45 thì bất kỳ bộ giải mã tuân thủ nào cũng có thể giải mã được chuỗi đó.",
    "y3m7k": "Đối với Java, hãy sử dụng thư viện 'iso-base45' có thể được đưa vào dự án của bạn dưới dạng phụ thuộc Maven.",
    "y3m9k": "Tại sao Base62 được tạo ra?",
    "y3qjdd": "Mật khẩu cục bộ của bạn đã được xác minh thành công.",
    "y5nne": "Mã này có thể được chạy trực tiếp trong môi trường Node.js hoặc là một phần của dự án lớn hơn mà bạn cần chức năng Base32.",
    "y6m8k": "Tại sao Base85 được tạo ra?",
    "y6t1n": "Nhược điểm của Base32",
    "y8Ir5": "Phần này được sử dụng để khởi tạo tài khoản quản trị viên của bạn, tuy nhiên, hiện tại, không có gì cần phải tạo hoặc điều chỉnh ở đây vì nó đã được quản trị viên của bạn thiết lập trước đó, vui lòng bỏ qua phần này và tiếp tục các bước còn lại.",
    "y8b1m": "Thay thế 'TEST12345' bằng dữ liệu của riêng bạn và đảm bảo rằng các chức năng thư viện được triển khai và liên kết chính xác để biên dịch và thực thi chương trình này cho các hoạt động Base32.",
    "y9m1n": "Tại sao Base58 được tạo ra?",
    "y9m3k": "Đối với Swift, bạn có thể sử dụng thư viện “Base45” có sẵn trên GitHub.",
    "y9z2e": "Thay thế 'TEST12345' bằng lát byte thực tế của bạn và chạy chương trình Go này để mã hóa và giải mã bằng cách sử dụng mã hóa tiêu chuẩn Base32.",
    "y9z2t": "Thực thi tập lệnh này trong môi trường Ruby chẳng hạn như IRB hoặc lưu nó dưới dạng tệp .rb và chạy với 'ruby filename.rb'.",
    "ySVf-": "Thử lại yêu cầu này",
    "yVprb": "Phần này vẫn đang được phát triển.",
    "y_2Q1": "Mã hóa và giải mã",
    "y_2Q2": "Tiền điện tử đối xứng",
    "y_2Q3": "Tiền điện tử bất đối xứng",
    "y_2Q4": "Thuật toán quốc gia Trung Quốc",
    "y_2Q5": "Xác thực web",
    "y_2Q5dqw": "Trình so khớp văn bản",
    "y_9YM": "Đầu ra sẽ được hiển thị ở đây.",
    "y_9YqM": "Đang tải các tập tin tĩnh...",
    "y_BN6": "Thuật toán tóm tắt",
    "ya0cwu": "Mã Lai",
    "yc7dqiu": "Tiếng Trung giản thể",
    "yfYeg": "Mẫu văn bản",
    "yiRso": "Ghi chú đám mây",
    "ykganl": "người Đan Mạch",
    "yqiRso": "Ghi chú địa phương",
    "yqrxl4": "tiếng Serbia",
    "yznU9": "Dữ liệu cây trống",
    "z-o28we": "Bảng quy trình",
    "z0j2nf": "Tiếng Hindi",
    "z1m2t": "Cách sử dụng ví dụ: `const được mã hóa = bs58.encode('your-data'); const đã giải mã = ​​bs58.decode(được mã hóa);`",
    "z1n5qr": "Các ví dụ bao gồm gói npm base45 cho JavaScript và dotnet-base45 cho .NET.",
    "z1oFn": "Thoát và Unescape",
    "z2jzej": "Tiếng Marathi",
    "z2m7t": "Cách sử dụng ví dụ: `const base62 = require('base62'); const được mã hóa = base62.encode('your-data'); const được giải mã = ​​base62.decode(được mã hóa);`",
    "z2t7m": "Base85 là gì?",
    "z2x8c": "Base32 có ít sự mơ hồ về mặt hình ảnh hơn vì nó chỉ sử dụng chữ in hoa và chữ số, giúp đọc và chép lại bằng tay hoặc qua điện thoại dễ dàng hơn so với Base64 bao gồm '+', '/' và chữ thường.",
    "z3m1t": "Sau khi thêm phần phụ thuộc và đồng bộ hóa dự án, hãy sao chép mẫu được cung cấp vào lớp Kotlin, thay thế phần giữ chỗ bằng giá trị được mã hóa thực tế trước khi chạy mã.",
    "z4t9b": "Base62 là gì?",
    "z5b7m": "Nó sử dụng bảng chữ cái lớn hơn (0-9, A-Z, a-z, -, ., $, /, +, % và *) so với Base64 hoặc Base32, dẫn đến các chuỗi được mã hóa ngắn hơn cho cùng một dữ liệu đầu vào.",
    "z5bvb": "Cài đặt nó bằng cách chạy 'npm install base32-encoding'. Thay thế 'TEST12345' bằng dữ liệu đầu vào mà bạn mong muốn trong đoạn mã.",
    "z5m6t": "Ví dụ sử dụng: `const base85 = require('base85'); const được mã hóa = base85.encode('your-data'); const được giải mã = ​​base85.decode(được mã hóa);`",
    "z6m1c": "Các biến thể sau này như z-base-32 đã được giới thiệu để cải thiện khả năng sử dụng, thay thế một số ký tự ít đáng nhớ hơn bằng những ký tự khác, nhưng đặc điểm kỹ thuật ban đầu của Crockford vẫn được sử dụng rộng rãi cho đến ngày nay.",
    "z79b1a": "tiếng Ả Rập",
    "z7n1m": "Sử dụng npm hoặc sợi để cài đặt nó bằng cách chạy `npm install @digitalbazaar/base45` hoặc `yarn add @digitalbazaar/base45`.",
    "z7t1p": "Có biến thể cụ thể nào của Base62 không?",
    "z8m2t": "Ưu điểm của việc sử dụng Base45 so với Base64 hoặc Base32 là gì?",
    "z8n6k": "Thay thế 'TEST12345' bằng chuỗi bạn muốn, biên dịch và chạy chương trình này để xem kết quả mã hóa và giải mã Base32.",
    "z9b6n": "Thêm phần phụ thuộc vào dự án Xcode của bạn thông qua Trình quản lý gói Swift ('https://github.com/krzyzanowskim/CryptoSwift').",
    "z9kVv": "Python có mô-đun 'base64' tích hợp cung cấp các phương thức mã hóa và giải mã Base64. Chuỗi đầu vào trước tiên được chuyển đổi thành byte bằng cách sử dụng mã hóa UTF-8 trước khi được mã hóa thành Base64, sau đó được giải mã trở lại dạng ban đầu.",
    "z9t2p": "Có biến thể cụ thể nào của Base58 không?",
    "z9t7p": "Có biến thể cụ thể nào của Base85 không?",
    "zN2ES": "Không gian làm việc",
    "zaSKh": "Làm cho khỏe lại",
    "zc3Hf": "Mật khẩu",
    "zjDJk": "Vui lòng cung cấp đường dẫn thư mục không gian làm việc",
    "zkqUFa": "{0} chưa được định cấu hình",
    "zkv375": "tiếng Khmer",
    "zmDWx": "Liên hệ chúng tôi",
    "znVRwq": "Các tập tin",
    "zpyd34": "Tiếng Anh",
    "zqiIoqXw": "Chạy tính toán...",
    "zwd4v": "Chi tiết tiện ích mở rộng",
    "zwgYx": "Giá trị mật khẩu được mã hóa sẽ được hiển thị ở đây.",
    "zyx98765": "Base64 có thể được sử dụng để nén không?",
    "zzcepr": "Cebuano"
}