{
    "-dxG-aEe4w": "Bylo dosaženo maximálního počtu dnes odeslaných SMS ověřovacích kódů.",
    "-wHWkv2OC": "Proč se nemohu přihlásit?",
    "-wdkeq": "Je tato komunita nezisková?",
    "2RbUh6TyJ": "{0} Nepřečtená oznámení",
    "3I-dkqkwr": "Upozorňujeme, že na této webové stránce NEPOSKYTUJEME žádné komerční kurzy ke zkouškám z angličtiny ani ke zkouškám z jiných předmětů a ani to v budoucnu neplánujeme.",
    "43be5": "Deník",
    "4N79HNWiA": "Abychom zajistili, že se jedná o neziskovou komunitu, otevíráme také celý její zdrojový kód na GitHubu, který najdete v patičce této stránky.",
    "4sQWoTgfr": "Platnost ověřovacího kódu vypršela, obnovte stránku a zkuste to znovu",
    "4sdQWoTgfr": "Platnost ověřovacího kódu vypršela, obnovte stránku a zkuste to znovu.",
    "5pevqzFXX": "Pokud si také myslíte, že je pro vás smysluplné se k nám připojit, pokračujte v aktualizaci svého profilu kliknutím na tlačítko níže, děkujeme!",
    "6h14B_t4I": "Připojeno dnes",
    "7BtpddC": "Samozřejmě se v této komunitě nebavíme o politice ani o jiných citlivých tématech a samozřejmě nevítáme spam ani reklamu. Proto pro registraci požadujeme platné telefonní číslo, abychom předešli jakékoli nezákonné nebo nevhodné činnosti.",
    "7flKa": "LafTools - Všemocný pro všechny profesionály a inženýry",
    "7zqdufsdddJ": "Ano, jistě. Webové stránky ELB3.com jsou odvozeny od neziskové chatovací skupiny WeChat, {0}, jejímž cílem je vytvořit přátelskou a pohodlnou atmosféru pro výuku angličtiny bez reklam.",
    "8s1R5nChx": "Kód pozvánky je prázdný, tato komunita není otevřená veřejnosti, ale je omezena na pozvané uživatele.",
    "8s1dX": "Kód pozvánky v systému neexistuje, zkontrolujte, zda se nevyskytl problém s rozlišováním malých a velkých písmen.",
    "8sVG1RXhx": "heslo by mělo mít alespoň 6 znaků",
    "8sVG1RdXhx": "ID uživatele již existuje",
    "8sVG1kqXhx": "ID uživatele by mělo mít alespoň 2 znaky",
    "8sVGdXhx": "ID uživatele by mělo obsahovat pouze písmena a čísla",
    "8saIR-LCjyChx": "Platnost kódu pozvánky vypršela",
    "8saIt5r5nGxwwChx": "Kód pozvánky byl vyčerpán",
    "9YPgsPid2M": "SMS kód",
    "9pBpiYcCy": "Abychom zabránili spamu a reklamě, vyžadujeme kód pozvánky k registraci vašeho účtu.",
    "BqWGnXEzV": "Město",
    "Bz_WdwvAPn": "Zkontrolujte, zda je správně zadán CAPTCHA.",
    "C7jECCVt9": "Važte si svého času a nikdy navždy nedělejte v této komunitě nic nezákonného.",
    "CK5NCw519": "Komunitní příběh",
    "CQ44pYZYj": "přihlásit se",
    "CuHqw9m": "{0} není platné telefonní číslo, v současné době systém přijímá pouze 11místné telefonní číslo.",
    "Cz_qjjFw7": "O {0}",
    "DYaOL4Yp7": "Registrovat",
    "D_9sNBiZj": "Zkusili jste to příliš mnohokrát, zkuste to znovu později.",
    "F-D-AewqL": "Udělejte si zpětný pohled na to, co jste v poslední době udělali. Nemůžeme snášet jakékoli chování, které lze považovat za obtěžování, reklamy nebo osobní zneužívání atd...",
    "GaySMPQHo": "Trendy",
    "Gy45ssBPS": "Vytvořit nové téma",
    "H39ddc0df": "Pokuste se přihlásit později, pokud se nezdařilo příliš mnohokrát.",
    "HaU4NMabv": "Ověřovací kód je nesprávný, zadejte prosím znovu nebo obnovte obrázek.",
    "IWPP6V-tR": "Zdrojový kód",
    "IcvP2d-QY": "Chcete-li se připojit k diskusi, {0} nebo {1}",
    "IugAFc4OT": "Při odesílání vašich dat došlo k problému.",
    "Jf4iDTZ28": "Kromě toho si můžete být jisti, že vaše telefonní číslo nikdy neprodáme ani jej nezveřejníme.",
    "Jfr4RzEZG": "V současné době přijímáme k registraci vašeho účtu pouze telefonní číslo {0}.",
    "JuZAli3": "Uživatelská příručka",
    "K2UEY4ddl": "ID uživatele obsahuje neplatná slova, nepoužívejte prosím {0}",
    "KAiEq6dcwL5": "A konečně, jako přátelská připomínka, každý uživatel by měl převzít odpovědnost za svá vlastní slova a činy.",
    "MnVg5i": "Ahoj rád tě poznávám! Je nám potěšením pozvat vás do této komunity.",
    "MnVqwid": "Dobrý den, {0}. Rád vás poznávám! Je nám potěšením pozvat vás do této komunity.",
    "NdqZcRL2QN": "V případě, že jste zapomněli své heslo, můžete je resetovat kliknutím na odkaz 'Zapomenuté heslo'.",
    "OBjaZqTvx": "Domov",
    "OPevedpOM": "Co když nemám telefonní číslo?",
    "P1zxX2IQ5": "Ale pro tento web je odvozením od původní skupiny a neomezuje se na výuku angličtiny, ale i na jiná témata.",
    "Pu0pj23rR": "Proč je vyžadováno telefonní číslo?",
    "RYlJHHwg3": "SMS kód není správný.",
    "RjdigcxfV": "Kontaktujte nás",
    "TV09-obNr": "Milník",
    "TXdh_K": "Heslo",
    "TdXddh_wK": "Telefonní číslo",
    "Te3h_wK": "Telefonní číslo",
    "TqXdd3h_wK": "Telefonní číslo",
    "TqXddh_K": "Ověřovací kód",
    "TqXdh_K": "Potvrďte heslo",
    "UED59zbd-": "LafTools",
    "UjkOS50wO": "Domov",
    "VndKeCfb-": "Pro aktivaci účtu ověřte telefon",
    "VnddCfb-": "Momentálně máte na nějakou dobu zákaz",
    "W3M4ivK9U": "Aktualizovat profil",
    "WKG7e": "Pravidla",
    "Wpdsp3g5U": "Vítejte v komunitě {0}!",
    "XIzgAAR": "Obvykle může být dostupný kód pozvánky poskytnut webmasterem nebo jinými uživateli.",
    "Xddh_wK": "Kód pozvánky",
    "Y-svpKvUz": "dvě hesla se neshodují",
    "Y0drdCSiu": "Témata",
    "Yc5uMym": "Možná se divíte, co znamená ELB3. Stručně řečeno, je to zkratka pro neziskovou skupinu WeChat {0}, která je zajímavou platformou pro anglické nadšence a studenty, aby se naučili a ocenili angličtinu!",
    "ZCzH8": "Nejnovější",
    "ZaS8MP8cr": "Poznámka: Ověřovací kód je obnoven, upravte prosím hodnoty formuláře a znovu zadejte kód, abyste mohli pokračovat.",
    "aISK9iYc_": "Zpráva o nezákonných informacích",
    "aUdtds_qwY": "Normálně se můžete úspěšně přihlásit pomocí svého uživatelského ID nebo telefonního čísla, i když jste porušili pravidla v této komunitě.",
    "b7wgrhuXl": "Tech",
    "b_vts": "Přihlásit se",
    "dHWho": "Přihlásit se",
    "dldeoeqwc": "Přátelské připomenutí",
    "dnsz7fwNx": "ID uživatele rozlišuje malá a velká písmena.",
    "dsdfqw": "Uživatel neexistuje",
    "dwJucRtar": "Tato část stále probíhá, vítáme vás, abyste přispěli k projektu této části.",
    "dzIC7qPQ": "Pokud se k nám chcete připojit, pokuste se kontaktovat webmastera na jeho e-mailu {0} nebo účtu WeChat {1} a získat kód pozvánky.",
    "englishcorner": "Angličtina",
    "eqwee": "Heslo není správné",
    "fcGTPc7HP": "Kde mohu získat kód pozvánky?",
    "gTOv6abWT": "Přihlásit se",
    "gTOv6adbWT": "Registrovat",
    "geHXwByxy": "Nastavení",
    "gmK3pKyRI": "{0} Špičkový počet online",
    "groupnote": "Memo",
    "hxCMxpW6Sq": "Připojil se před {0} dny",
    "jRFk519Bj-": "Tato komunita je poháněna plně mezinárodním bezplatným projektem s otevřeným zdrojovým kódem.",
    "jdbef_PBl": "Fotbalová branka",
    "ky6JphiKk": "{0} Online uživatelé",
    "lEDpJMRfG": "Pokud jste zmateni, dejte nám prosím vědět zasláním e-mailu.",
    "lWqYc": "Tento web poskytuje nástroje JSON včetně JSON do XML, JSON do CSV, JSON do YAML.",
    "lastreplyby": "Poslední odpověď od",
    "lidydVO": "Proč jsem blokován nebo omezen?",
    "lu2T6idPY": "Pokud si myslíte, že je problém s vaším účtem, kontaktujte prosím webmastera.",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "Počet uživatelů: {0}",
    "nncQE": "Život",
    "o4GdNzX6xS": "Za prvé, vzhledem k dobře známému regulačnímu požadavku na Zemi je každý uživatel povinen uvést platné telefonní číslo pro registraci.",
    "oHQNQ4mRw": "uživatelské ID",
    "p1Jyl4uMv": "Odhlaste svůj účet",
    "pNwe3": "jiný",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "Vyberte Jazyk webových stránek",
    "uefFV1": "Později",
    "ufSPh0ad": "Pokud není možné zaregistrovat váš účet prostřednictvím vašeho aktuálního telefonního čísla, kontaktujte prosím webmastera na jeho e-mailu {0} nebo účtu WeChat {1}. Můžeme vám pomoci zaregistrovat váš účet ručně.",
    "wCcPJZK": "{0} není platný e-mail",
    "wCctGPJZK": "{0} by nemělo být prázdné",
    "xhxY6iLDH": "Odhlásit se",
    "yOdwRB": "Vítejte v komunitě ELB3!",
    "zr3ZBdUoT": "Uživatelská příručka",
    "zuxd0y-kmA": "ID uživatele nebo telefonní číslo neobsahuje žádné mezery."
}