{
    "-dxG-aEe4w": "Det maksimale antal SMS-bekræftelseskoder sendt i dag er nået.",
    "-wHWkv2OC": "Hvorfor kan jeg ikke logge ind?",
    "-wdkeq": "Er dette fællesskab non-profit?",
    "2RbUh6TyJ": "{0} Ulæste meddelelser",
    "2S_7EVIsK": "JSON Validator",
    "3I-dkqkwr": "Bemærk, at vi IKKE tilbyder kommercielle uddannelseskurser til engelskeksamener eller andre fageksamener på denne hjemmeside, og vi planlægger ikke at gøre det i fremtiden.",
    "43be5": "Dagbog",
    "4N79HNWiA": "For at sikre, at det er et non-profit-fællesskab, åbner vi også hele kildekoden på GitHub, som kan findes nederst på denne side.",
    "4sQWoTgfr": "Bekræftelseskoden er udløbet. Opdater siden og prøv igen",
    "4sdQWoTgfr": "Bekræftelseskoden er udløbet. Opdater siden og prøv igen.",
    "5pevqzFXX": "Hvis du også synes, det er meningsfuldt for dig at slutte dig til os, så fortsæt venligst med at opdatere din profil ved at klikke på knappen nedenfor, tak!",
    "6h14B_t4I": "Tiltrådte i dag",
    "7BtpddC": "For det andet, i dette fællesskab taler vi ikke om politik eller andre følsomme emner, og vi byder naturligvis ikke spam eller reklame velkommen. Derfor kræver vi et gyldigt telefonnummer til registrering for at forhindre ulovlige eller upassende aktiviteter.",
    "7flKa": "LafTools - Den almægtige for alle fagfolk og ingeniører",
    "7fldKa": "LafTools - Den førende alt-i-en værktøjskasse til programmører",
    "7zqdufsdddJ": "Ja helt sikkert. Hjemmesiden ELB3.com er afledt af den almennyttige WeChat-chatgruppe, {0}, som har til formål at skabe en venlig, ads-fri og behagelig atmosfære for engelsk læring.",
    "8s1R5nChx": "Invitationskoden er tom, dette fællesskab er ikke åbent for offentligheden, men begrænset til inviterede brugere.",
    "8s1dX": "Invitationskoden findes ikke i systemet. Tjek venligst, om der er et problem, der skelner mellem store og små bogstaver.",
    "8sVG1RXhx": "adgangskoden skal være på mindst 6 tegn",
    "8sVG1RdXhx": "Bruger-id findes allerede",
    "8sVG1kqXhx": "Bruger-id skal være på mindst 2 tegn",
    "8sVGdXhx": "Bruger-id må kun indeholde bogstaver og tal",
    "8saIR-LCjyChx": "Invitationskoden er udløbet",
    "8saIt5r5nGxwwChx": "Invitationskoden er brugt op",
    "9YPgsPid2M": "SMS kode",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Base64 Encoder",
    "9b_7a0sdf": "Base64 dekoder",
    "9pBpiYcCy": "For at forhindre spam og reklamer kræver vi en invitationskode for at registrere din konto.",
    "BqWGnXEzV": "By",
    "Bz_WdwvAPn": "Tjek, om CAPTCHA er angivet korrekt.",
    "C7jECCVt9": "Værdsæt din tid og gør aldrig for evigt noget ulovligt i dette fællesskab.",
    "CK5NCw519": "Fællesskabshistorie",
    "CQ44pYZYj": "Log på",
    "CuHqw9m": "{0} er ikke et gyldigt telefonnummer. Systemet accepterer i øjeblikket kun et 11-cifret telefonnummer.",
    "Cz_qjjFw7": "Om {0}",
    "DYaOL4Yp7": "Tilmeld",
    "D_9sNBiZj": "Du prøvede for mange gange, prøv venligst igen senere.",
    "F-D-AewqL": "Gør tilbageblik med, hvad du har gjort for nylig. Vi kan ikke udholde nogen adfærd, der kan betragtes som chikane, reklamer eller personligt misbrug osv.",
    "GaySMPQHo": "Trending",
    "Gy45ssBPS": "Opret nyt emne",
    "H39ddc0df": "Prøv at logge ind senere, hvis det mislykkedes for mange gange.",
    "HaU4NMabv": "Bekræftelseskoden er forkert. Indtast venligst eller opdater billedet igen.",
    "IWPP6V-tR": "Kildekode",
    "Ibzs2-Ho1": "CSV-værktøjer",
    "IcvP2d-QY": "{0} eller {1} for at deltage i diskussionen",
    "IugAFc4OT": "Der er opstået et problem under indsendelse af dine data.",
    "Jbor69IBw": "Formatere",
    "Jf4iDTZ28": "Derudover kan du helt sikkert være sikker på, at vi aldrig vil sælge dit telefonnummer ud eller offentliggøre det.",
    "Jfr4RzEZG": "I øjeblikket accepterer vi kun {0} telefonnummer for at registrere din konto.",
    "JuZAli3": "Bruger manual",
    "K2UEY4ddl": "Bruger-id'et indeholder ugyldige ord. Undgå venligst at bruge {0}",
    "KAiEq6dcwL5": "Til sidst, som en venlig påmindelse, bør hver bruger tage ansvaret for deres egne ord og handlinger.",
    "MnVg5i": "Hej godt at møde dig! Det er os en fornøjelse at invitere dig til dette fællesskab.",
    "MnVqwid": "Hej {0}. Dejligt at møde dig! Det er os en fornøjelse at invitere dig til dette fællesskab.",
    "NdqZcRL2QN": "Hvis du har glemt din adgangskode, kan du nulstille den ved at klikke på linket 'Glemt adgangskode'.",
    "OBjaZqTvx": "Hjem",
    "OPevedpOM": "Hvad hvis jeg ikke har et telefonnummer?",
    "P1zxX2IQ5": "Men for denne hjemmeside er det en afledning af den oprindelige gruppe og ikke begrænset til engelskindlæring, men også til andre emner.",
    "Pu0pj23rR": "Hvorfor kræves et telefonnummer?",
    "RYlJHHwg3": "SMS-koden er ikke korrekt.",
    "RjdigcxfV": "Kontakt os",
    "TV09-obNr": "Milepæl",
    "TXdh_K": "Adgangskode",
    "TdXddh_wK": "Telefon nummer",
    "Te3h_wK": "Telefon nummer",
    "TqXdd3h_wK": "Telefon nummer",
    "TqXddh_K": "Verifikationskode",
    "TqXdh_K": "Bekræft kodeord",
    "UED59zbd-": "LafTools",
    "UjkOS50wO": "Hjem",
    "VndKeCfb-": "Bekræft telefon for at aktivere konto",
    "VnddCfb-": "Du er i øjeblikket udelukket i et stykke tid",
    "W3M4ivK9U": "Opdater profil",
    "WKG7e": "Regler",
    "Wpdsp3g5U": "Velkommen til {0}-fællesskabet!",
    "XIzgAAR": "Normalt kan en tilgængelig invitationskode gives fra webmasteren eller andre brugere.",
    "Xddh_wK": "invitations kode",
    "Y-svpKvUz": "to adgangskoder stemmer ikke overens",
    "Y0drdCSiu": "Emner",
    "Yc5uMym": "Du undrer dig måske over, hvad ELB3 står for, kort sagt er det en forkortelse for den non-profit WeChat-gruppe {0}, som er en interessant platform for engelske entusiaster og eksaminander til at lære og værdsætte engelsk!",
    "ZCzH8": "Nyeste",
    "ZaS8MP8cr": "Bemærk: Bekræftelseskoden er opdateret. Juster venligst dine formularværdier og indtast koden igen for at fortsætte med.",
    "aISK9iYc_": "Rapport om ulovlige oplysninger",
    "aUdtds_qwY": "Normalt kan du logge ind med dit bruger-id eller telefonnummer, selvom du har overtrådt reglerne i dette fællesskab.",
    "b7wgrhuXl": "Tech",
    "b_vts": "Log ind",
    "dHWho": "Tilmelde",
    "dldeoeqwc": "Venlige påmindelser",
    "dnsz7fwNx": "Bruger-id skelner mellem store og små bogstaver.",
    "dsdfqw": "bruger eksisterer ikke",
    "dwJucRtar": "Denne del er stadig i gang, velkommen til at bidrage til projektet for denne del.",
    "dzIC7qPQ": "Hvis du ønsker at slutte dig til os, så prøv at kontakte webmasteren på hans e-mail {0} eller WeChat-konto {1} for at få en invitationskode.",
    "englishcorner": "engelsk",
    "eqwee": "Adgangskoden er ikke korrekt",
    "fcGTPc7HP": "Hvor kan jeg få invitationskoden?",
    "gTOv6abWT": "Log på",
    "gTOv6adbWT": "Tilmeld",
    "geHXwByxy": "Indstillinger",
    "gmK3pKyRI": "{0} Top antal online",
    "groupnote": "Memo",
    "hxCMxpW6Sq": "Tilmeldte sig for {0} dage siden",
    "iZXig7E2JF": "LafTools tilbyder en omfattende suite af udviklingsværktøjer, herunder codecs, formatere, billedbehandlingsværktøjer og løsninger til computerressourcestyring. Designet til at strømline og forbedre dit udviklingsworkflow, er LafTools din foretrukne ressource til effektiv softwareudvikling af høj kvalitet.",
    "jRFk519Bj-": "Dette fællesskab er drevet af et fuldt internationalt gratis open source-kodeprojekt.",
    "jdbef_PBl": "Mål",
    "jr_7Y98yZ": "LafTools",
    "ky6JphiKk": "{0} Onlinebrugere",
    "lEDpJMRfG": "Hvis du er forvirret, er du velkommen til at give os besked ved at sende en e-mail til os.",
    "lWqYc": "Denne hjemmeside tilbyder JSON-værktøjer, herunder JSON til XML, JSON til CSV, JSON til YAML.",
    "lastreplyby": "Sidste svar af",
    "lidydVO": "Hvorfor er jeg blokeret eller begrænset?",
    "lu2T6idPY": "Hvis du mener, der er et problem med din konto, bedes du kontakte webmasteren.",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "{0} Brugere",
    "nncQE": "Liv",
    "o4GdNzX6xS": "For det første, på grund af det velkendte reguleringskrav på jorden, er hver bruger forpligtet til at angive et gyldigt telefonnummer for at registrere sig.",
    "oHQNQ4mRw": "bruger ID",
    "p1Jyl4uMv": "Log af din konto",
    "pNwe3": "Andet",
    "t8DUz20a-": "JSON-formater",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "Vælg webstedssprog",
    "uefFV1": "Senere",
    "ufSPh0ad": "Hvis det er umuligt at registrere din konto via dit nuværende telefonnummer, bedes du kontakte webmasteren på hans e-mail {0} eller WeChat-konto {1}. Vi kan hjælpe dig med at registrere din konto manuelt.",
    "wCcPJZK": "{0} er ikke en gyldig e-mail",
    "wCctGPJZK": "{0} skal ikke være tom",
    "wi28h5_S2": "Codecs",
    "xhxY6iLDH": "Log ud",
    "yOdwRB": "Velkommen til ELB3-fællesskabet!",
    "zr3ZBdUoT": "Bruger manual",
    "zuxd0y-kmA": "Bruger-id eller telefonnummer har ingen mellemrum."
}