{
    "-dxG-aEe4w": "Die maximale Anzahl der heute gesendeten SMS-Bestätigungscodes wurde erreicht.",
    "-wHWkv2OC": "Warum kann ich mich nicht anmelden?",
    "-wdkeq": "Ist diese Community gemeinnützig?",
    "2RbUh6TyJ": "{0} Ungelesene Benachrichtigungen",
    "2S_7EVIsK": "JSON-Validator",
    "3I-dkqkwr": "Bitte beachten Sie, dass wir auf dieser Website KEINE kommerziellen Schulungskurse für Englischprüfungen oder andere Fachprüfungen anbieten und dies auch in Zukunft nicht planen.",
    "43be5": "Tagebuch",
    "4N79HNWiA": "Um sicherzustellen, dass es sich um eine gemeinnützige Community handelt, öffnen wir außerdem den gesamten Quellcode auf GitHub, den Sie in der Fußzeile dieser Seite finden.",
    "4sQWoTgfr": "Der Bestätigungscode ist abgelaufen. Bitte aktualisieren Sie die Seite und versuchen Sie es erneut",
    "4sdQWoTgfr": "Der Bestätigungscode ist abgelaufen. Bitte aktualisieren Sie die Seite und versuchen Sie es erneut.",
    "5pevqzFXX": "Wenn Sie auch der Meinung sind, dass es für Sie sinnvoll ist, sich uns anzuschließen, aktualisieren Sie bitte Ihr Profil weiter, indem Sie auf die Schaltfläche unten klicken. Vielen Dank!",
    "6h14B_t4I": "Heute beigetreten",
    "7BtpddC": "Selbstverständlich reden wir in dieser Community nicht über Politik oder andere sensible Themen und begrüßen natürlich auch keinen Spam oder Werbung. Deshalb benötigen wir für die Registrierung eine gültige Telefonnummer, um illegalen oder missbräuchlichen Aktivitäten vorzubeugen.",
    "7flKa": "LafTools – Das Allmächtige für alle Profis und Ingenieure",
    "7fldKa": "LafTools – Die führende All-In-One-ToolBox für Programmierer",
    "7zqdufsdddJ": "Ja sicher. Die Website ELB3.com ist von der gemeinnützigen WeChat-Chat-Gruppe {0} abgeleitet, deren Ziel es ist, eine freundliche, werbefreie und komfortable Englisch-Lernatmosphäre zu schaffen.",
    "8s1R5nChx": "Der Einladungscode ist leer. Diese Community ist nicht öffentlich, sondern auf eingeladene Benutzer beschränkt.",
    "8s1dX": "Der Einladungscode ist nicht im System vorhanden. Bitte prüfen Sie, ob die Groß-/Kleinschreibung beachtet wird.",
    "8sVG1RXhx": "Das Passwort sollte mindestens 6 Zeichen lang sein",
    "8sVG1RdXhx": "Benutzer-ID existiert bereits",
    "8sVG1kqXhx": "Die Benutzer-ID sollte mindestens 2 Zeichen lang sein",
    "8sVGdXhx": "Die Benutzer-ID sollte nur Buchstaben und Zahlen enthalten",
    "8saIR-LCjyChx": "Der Einladungscode ist abgelaufen",
    "8saIt5r5nGxwwChx": "Der Einladungscode ist aufgebraucht",
    "9YPgsPid2M": "SMS-Code",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Base64-Encoder",
    "9b_7a0sdf": "Base64-Decoder",
    "9pBpiYcCy": "Um Spam und Werbung zu verhindern, benötigen wir zur Registrierung Ihres Kontos einen Einladungscode.",
    "BqWGnXEzV": "Stadt",
    "Bz_WdwvAPn": "Überprüfen Sie, ob CAPTCHA korrekt bereitgestellt wird.",
    "C7jECCVt9": "Schätzen Sie Ihre Zeit und tun Sie in dieser Community niemals etwas Illegales.",
    "CK5NCw519": "Community-Geschichte",
    "CQ44pYZYj": "Anmeldung",
    "CuHqw9m": "{0} ist keine gültige Telefonnummer. Das System akzeptiert derzeit nur 11-stellige Telefonnummern.",
    "Cz_qjjFw7": "Über {0}",
    "DYaOL4Yp7": "registrieren",
    "D_9sNBiZj": "Sie haben es zu oft versucht. Bitte versuchen Sie es später noch einmal.",
    "F-D-AewqL": "Machen Sie einen Rückblick auf das, was Sie kürzlich getan haben. Wir können kein Verhalten ertragen, das als Belästigung, Werbung oder persönlicher Missbrauch usw. angesehen werden kann.",
    "GaySMPQHo": "Im Trend",
    "Gy45ssBPS": "Neues Thema erstellen",
    "H39ddc0df": "Versuchen Sie, sich später anzumelden, wenn dies zu oft fehlschlägt.",
    "HaU4NMabv": "Der Bestätigungscode ist falsch. Bitte geben Sie das Bild erneut ein oder aktualisieren Sie es.",
    "IWPP6V-tR": "Quellcode",
    "Ibzs2-Ho1": "CSV-Tools",
    "IcvP2d-QY": "Bitte {0} oder {1}, um an der Diskussion teilzunehmen",
    "IugAFc4OT": "Beim Übermitteln Ihrer Daten ist ein Problem aufgetreten.",
    "Jbor69IBw": "Formatierer",
    "Jf4iDTZ28": "Seien Sie außerdem versichert, dass wir Ihre Telefonnummer niemals verkaufen oder veröffentlichen werden.",
    "Jfr4RzEZG": "Derzeit akzeptieren wir nur die Telefonnummer {0}, um Ihr Konto zu registrieren.",
    "JuZAli3": "Bedienungsanleitung",
    "K2UEY4ddl": "Die Benutzer-ID enthält ungültige Wörter. Bitte vermeiden Sie die Verwendung von {0}.",
    "KAiEq6dcwL5": "Abschließend möchten wir Sie daran erinnern, dass jeder Benutzer die Verantwortung für seine eigenen Worte und Taten übernehmen sollte.",
    "MnVg5i": "Hallo, schön dich kennen zu lernen! Es ist uns eine Freude, Sie in diese Gemeinschaft einzuladen.",
    "MnVqwid": "Hallo, {0}. Freut mich, Sie kennenzulernen! Es ist uns eine Freude, Sie in diese Gemeinschaft einzuladen.",
    "NdqZcRL2QN": "Falls Sie Ihr Passwort vergessen haben, können Sie es zurücksetzen, indem Sie auf den Link „Passwort vergessen“ klicken.",
    "OBjaZqTvx": "Heim",
    "OPevedpOM": "Was ist, wenn ich keine Telefonnummer habe?",
    "P1zxX2IQ5": "Bei dieser Website handelt es sich jedoch um eine Ableitung der ursprünglichen Gruppe und nicht nur auf das Englischlernen, sondern auch auf andere Themen.",
    "Pu0pj23rR": "Warum ist eine Telefonnummer erforderlich?",
    "RYlJHHwg3": "Der SMS-Code ist nicht korrekt.",
    "RjdigcxfV": "Kontaktiere uns",
    "TV09-obNr": "Meilenstein",
    "TXdh_K": "Passwort",
    "TdXddh_wK": "Telefonnummer",
    "Te3h_wK": "Telefonnummer",
    "TqXdd3h_wK": "Telefonnummer",
    "TqXddh_K": "Bestätigungscode",
    "TqXdh_K": "Bestätige das Passwort",
    "UED59zbd-": "LafTools",
    "UjkOS50wO": "Heim",
    "VndKeCfb-": "Überprüfen Sie die Telefonnummer, um das Konto zu aktivieren",
    "VnddCfb-": "Du bist derzeit für eine Weile gesperrt",
    "W3M4ivK9U": "Profil aktualisieren",
    "WKG7e": "Regeln",
    "Wpdsp3g5U": "Willkommen in der {0}-Community!",
    "XIzgAAR": "Normalerweise kann ein verfügbarer Einladungscode vom Webmaster oder anderen Benutzern bereitgestellt werden.",
    "Xddh_wK": "Einladungscode",
    "Y-svpKvUz": "Zwei Passwörter stimmen nicht überein",
    "Y0drdCSiu": "Themen",
    "Yc5uMym": "Sie fragen sich vielleicht, wofür ELB3 steht. Kurz gesagt, es ist die Abkürzung für die gemeinnützige WeChat-Gruppe {0}, die eine interessante Plattform für Englischbegeisterte und Prüflinge ist, um Englisch zu lernen und zu schätzen!",
    "ZCzH8": "Neueste",
    "ZaS8MP8cr": "Hinweis: Der Bestätigungscode wird aktualisiert. Bitte passen Sie Ihre Formularwerte an und geben Sie den Code erneut ein, um fortzufahren.",
    "aISK9iYc_": "Bericht über illegale Informationen",
    "aUdtds_qwY": "Normalerweise können Sie sich mit Ihrer Benutzer-ID oder Telefonnummer erfolgreich anmelden, auch wenn Sie in dieser Community gegen Regeln verstoßen haben.",
    "b7wgrhuXl": "Technik",
    "b_vts": "Anmelden",
    "dHWho": "Melden Sie sich an",
    "dldeoeqwc": "Freundliche Erinnerungen",
    "dnsz7fwNx": "Bei der Benutzer-ID muss die Groß-/Kleinschreibung beachtet werden.",
    "dsdfqw": "Benutzer existiert nicht",
    "dwJucRtar": "Dieser Teil ist noch in Bearbeitung. Gerne können Sie für diesen Teil zum Projekt beitragen.",
    "dzIC7qPQ": "Wenn Sie sich uns anschließen möchten, versuchen Sie bitte, den Webmaster über seine E-Mail-Adresse {0} oder sein WeChat-Konto {1} zu erreichen, um einen Einladungscode zu erhalten.",
    "englishcorner": "Englisch",
    "eqwee": "Das Passwort ist nicht korrekt",
    "fcGTPc7HP": "Wo bekomme ich den Einladungscode?",
    "gTOv6abWT": "Anmeldung",
    "gTOv6adbWT": "Registrieren",
    "geHXwByxy": "Einstellungen",
    "gmK3pKyRI": "{0} Höchste Online-Anzahl",
    "groupnote": "Memo",
    "hxCMxpW6Sq": "Beigetreten vor {0} Tagen",
    "iZXig7E2JF": "LafTools bietet eine umfassende Suite von Entwicklungsdienstprogrammen, darunter Codecs, Formatierer, Bildverarbeitungstools und Lösungen für die Verwaltung von Computerressourcen. LafTools wurde zur Rationalisierung und Verbesserung Ihres Entwicklungsworkflows entwickelt und ist Ihre Anlaufstelle für effiziente, qualitativ hochwertige Softwareentwicklung.",
    "jRFk519Bj-": "Diese Community wird von einem vollständig internationalen, kostenlosen Open-Source-Code-Projekt angetrieben.",
    "jdbef_PBl": "Ziel",
    "jr_7Y98yZ": "LafTools",
    "ky6JphiKk": "{0} Online-Benutzer",
    "lEDpJMRfG": "Wenn Sie verwirrt sind, teilen Sie uns dies bitte per E-Mail mit.",
    "lWqYc": "Diese Website bietet JSON-Tools, einschließlich JSON zu XML, JSON zu CSV, JSON zu YAML.",
    "lastreplyby": "Letzte Antwort von",
    "lidydVO": "Warum bin ich blockiert oder eingeschränkt?",
    "lu2T6idPY": "Wenn Sie glauben, dass ein Problem mit Ihrem Konto vorliegt, wenden Sie sich bitte an den Webmaster.",
    "m2LEjrKDS": "Nein",
    "nIDKbSXTw": "{0} Benutzer",
    "nncQE": "Leben",
    "o4GdNzX6xS": "Erstens muss jeder Benutzer aufgrund der bekannten Regulierungspflicht auf der Erde eine gültige Telefonnummer angeben, um sich zu registrieren.",
    "oHQNQ4mRw": "Benutzer-ID",
    "p1Jyl4uMv": "Melden Sie Ihr Konto ab",
    "pNwe3": "Andere",
    "t8DUz20a-": "JSON-Formatierer",
    "tip_JkgcP": "Nein",
    "tiv188Gz5": "Wählen Sie Website-Sprache aus",
    "uefFV1": "Später",
    "ufSPh0ad": "Wenn es nicht möglich ist, Ihr Konto über Ihre aktuelle Telefonnummer zu registrieren, kontaktieren Sie den Webmaster bitte über seine E-Mail-Adresse {0} oder sein WeChat-Konto {1}. Wir können Ihnen bei der manuellen Registrierung Ihres Kontos behilflich sein.",
    "wCcPJZK": "{0} ist keine gültige E-Mail",
    "wCctGPJZK": "{0} sollte nicht leer sein",
    "wi28h5_S2": "Codecs",
    "xhxY6iLDH": "Ausloggen",
    "yOdwRB": "Willkommen in der ELB3-Community!",
    "zr3ZBdUoT": "Bedienungsanleitung",
    "zuxd0y-kmA": "Benutzer-ID oder Telefonnummer enthalten kein Leerzeichen."
}