{
    "-dxG-aEe4w": "Se ha alcanzado el número máximo de códigos de verificación por SMS enviados hoy.",
    "-wHWkv2OC": "¿Por qué no puedo iniciar sesión?",
    "-wdkeq": "¿Esta comunidad es sin fines de lucro?",
    "2RbUh6TyJ": "{0} Notificaciones no leídas",
    "2S_7EVIsK": "Validador JSON",
    "3I-dkqkwr": "Tenga en cuenta que NO ofrecemos ningún curso de formación comercial para exámenes de inglés ni de ninguna otra materia en este sitio web, y no planeamos hacerlo en el futuro.",
    "43be5": "Diario",
    "4N79HNWiA": "Para garantizar que sea una comunidad sin fines de lucro, también abrimos su código fuente completo en GitHub, que se puede encontrar al pie de página de esta página.",
    "4sQWoTgfr": "El código de verificación ha caducado. Actualiza la página e inténtalo de nuevo.",
    "4sdQWoTgfr": "El código de verificación ha caducado, actualice la página e inténtelo de nuevo.",
    "5pevqzFXX": "Si también cree que es significativo para usted unirse a nosotros, continúe actualizando su perfil haciendo clic en el botón a continuación, ¡gracias!",
    "6h14B_t4I": "Se unió hoy",
    "7BtpddC": "En segundo lugar, en esta comunidad no hablamos de política ni de ningún otro tema delicado y, por supuesto, no damos la bienvenida al spam ni a la publicidad. Es por eso que requerimos un número de teléfono válido para el registro, para evitar actividades ilícitas o indebidas.",
    "7flKa": "LafTools: el omnipotente para todos los profesionales e ingenieros",
    "7fldKa": "LafTools: la caja de herramientas todo en uno líder para programadores",
    "7zqdufsdddJ": "Si por su puesto. El sitio web ELB3.com se deriva del grupo de chat WeChat sin fines de lucro, {0}, cuyo objetivo es crear una atmósfera de aprendizaje de inglés cómoda, cómoda y sin anuncios publicitarios.",
    "8s1R5nChx": "El código de invitación está vacío, esta comunidad no está abierta al público sino limitada a usuarios invitados.",
    "8s1dX": "El código de invitación no existe en el sistema; verifique si hay un problema que distingue entre mayúsculas y minúsculas.",
    "8sVG1RXhx": "la contraseña debe tener al menos 6 caracteres",
    "8sVG1RdXhx": "El ID de usuario ya existe",
    "8sVG1kqXhx": "El ID de usuario debe tener al menos 2 caracteres",
    "8sVGdXhx": "La identificación de usuario solo debe contener letras y números.",
    "8saIR-LCjyChx": "El código de invitación ha caducado",
    "8saIt5r5nGxwwChx": "El código de invitación se ha agotado.",
    "9YPgsPid2M": "Código SMS",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Codificador Base64",
    "9b_7a0sdf": "Decodificador Base64",
    "9pBpiYcCy": "Para evitar spam y publicidad, necesitamos un código de invitación para registrar su cuenta.",
    "BqWGnXEzV": "Ciudad",
    "Bz_WdwvAPn": "Compruebe si CAPTCHA se proporciona correctamente.",
    "C7jECCVt9": "Valore su tiempo y nunca jamás haga nada ilegal en esta comunidad.",
    "CK5NCw519": "Historia de la comunidad",
    "CQ44pYZYj": "acceso",
    "CuHqw9m": "{0} no es un número de teléfono válido; actualmente el sistema acepta solo números de teléfono de 11 dígitos.",
    "Cz_qjjFw7": "Acerca de {0}",
    "DYaOL4Yp7": "registro",
    "D_9sNBiZj": "Lo intentaste demasiadas veces, inténtalo de nuevo más tarde.",
    "F-D-AewqL": "Haz una retrospectiva de lo que has hecho recientemente. No podemos soportar ninguna conducta que pueda ser considerada como acoso, ADs o abuso personal, etc…",
    "GaySMPQHo": "Tendencias",
    "Gy45ssBPS": "Crear nuevo tema",
    "H39ddc0df": "Intente iniciar sesión más tarde si falló demasiadas veces.",
    "HaU4NMabv": "El código de verificación es incorrecto. Vuelva a ingresar o actualice la imagen.",
    "IWPP6V-tR": "Código fuente",
    "Ibzs2-Ho1": "Herramientas CSV",
    "IcvP2d-QY": "Por favor {0} o {1} para unirse a la discusión",
    "IugAFc4OT": "Se ha producido un problema al enviar sus datos.",
    "Jbor69IBw": "Formateadores",
    "Jf4iDTZ28": "Además, tenga la seguridad de que nunca venderemos su número de teléfono ni lo haremos público.",
    "Jfr4RzEZG": "Actualmente, solo aceptamos {0} número de teléfono para registrar su cuenta.",
    "JuZAli3": "Guía de usuario",
    "K2UEY4ddl": "El ID de usuario contiene palabras no válidas; evite utilizar {0}",
    "KAiEq6dcwL5": "Por último, a modo de recordatorio amistoso, cada usuario debe asumir la responsabilidad de sus propias palabras y acciones.",
    "MnVg5i": "¡Hola mucho gusto! Es un placer para nosotros invitarte a esta comunidad.",
    "MnVqwid": "Hola, {0}. ¡Encantado de conocerlo! Es un placer para nosotros invitarte a esta comunidad.",
    "NdqZcRL2QN": "En caso de que haya olvidado su contraseña, puede restablecerla haciendo clic en el enlace \"Olvidé mi contraseña\".",
    "OBjaZqTvx": "Hogar",
    "OPevedpOM": "¿Qué pasa si no tengo un número de teléfono?",
    "P1zxX2IQ5": "Pero para este sitio web, es una derivación del grupo original y no se limita al aprendizaje del inglés, sino también a otros temas.",
    "Pu0pj23rR": "¿Por qué se requiere el número de teléfono?",
    "RYlJHHwg3": "El código SMS no es correcto.",
    "RjdigcxfV": "Contáctenos",
    "TV09-obNr": "Hito",
    "TXdh_K": "Contraseña",
    "TdXddh_wK": "Número de teléfono",
    "Te3h_wK": "Número de teléfono",
    "TqXdd3h_wK": "Número de teléfono",
    "TqXddh_K": "Código de verificación",
    "TqXdh_K": "confirmar Contraseña",
    "UED59zbd-": "LafHerramientas",
    "UjkOS50wO": "Hogar",
    "VndKeCfb-": "Verificar teléfono para activar cuenta",
    "VnddCfb-": "Actualmente estás baneado por un tiempo.",
    "W3M4ivK9U": "Actualización del perfil",
    "WKG7e": "Normas",
    "Wpdsp3g5U": "¡Bienvenido a la comunidad {0}!",
    "XIzgAAR": "Por lo general, el webmaster u otros usuarios pueden proporcionar un código de invitación disponible.",
    "Xddh_wK": "código de invitación",
    "Y-svpKvUz": "dos contraseñas no coinciden",
    "Y0drdCSiu": "Temas",
    "Yc5uMym": "Quizás se pregunte qué significa ELB3; en resumen, es la abreviatura del grupo WeChat sin fines de lucro {0}, que es una plataforma interesante para que los entusiastas y examinados del inglés aprendan y aprecien el inglés.",
    "ZCzH8": "El más nuevo",
    "ZaS8MP8cr": "Nota: El código de verificación se actualiza, ajuste los valores de su formulario y vuelva a ingresar el código para continuar.",
    "aISK9iYc_": "Informe de información ilegal",
    "aUdtds_qwY": "Normalmente, puede iniciar sesión con su ID de usuario o número de teléfono correctamente incluso si ha violado las reglas de esta comunidad.",
    "b7wgrhuXl": "tecnología",
    "b_vts": "Iniciar sesión",
    "dHWho": "Inscribirse",
    "dldeoeqwc": "Recordatorios amistosos",
    "dnsz7fwNx": "La identificación de usuario distingue entre mayúsculas y minúsculas.",
    "dsdfqw": "el usuario no existe",
    "dwJucRtar": "Esta parte aún está en progreso, bienvenido a contribuir al proyecto de esta parte.",
    "dzIC7qPQ": "Si desea unirse a nosotros, intente comunicarse con el webmaster en su correo electrónico {0} o en su cuenta de WeChat {1} para obtener un código de invitación.",
    "englishcorner": "Inglés",
    "eqwee": "La contraseña no es correcta",
    "fcGTPc7HP": "¿Dónde puedo conseguir el código de invitación?",
    "gTOv6abWT": "Acceso",
    "gTOv6adbWT": "Registro",
    "geHXwByxy": "Ajustes",
    "gmK3pKyRI": "{0} Recuento máximo en línea",
    "groupnote": "Memorándum",
    "hxCMxpW6Sq": "Se unió hace {0} días",
    "iZXig7E2JF": "LafTools ofrece un conjunto completo de utilidades de desarrollo que incluyen códecs, formateadores, herramientas de procesamiento de imágenes y soluciones de gestión de recursos informáticos. Diseñado para agilizar y mejorar su flujo de trabajo de desarrollo, LafTools es su recurso de referencia para un desarrollo de software eficiente y de alta calidad.",
    "jRFk519Bj-": "Esta comunidad está impulsada por un proyecto de código abierto gratuito totalmente internacional.",
    "jdbef_PBl": "Meta",
    "jr_7Y98yZ": "LafHerramientas",
    "ky6JphiKk": "{0} Usuarios en línea",
    "lEDpJMRfG": "Si está confundido, no dude en hacérnoslo saber enviándonos un correo electrónico.",
    "lWqYc": "Este sitio web proporciona herramientas JSON que incluyen JSON a XML, JSON a CSV, JSON a YAML.",
    "lastreplyby": "Última respuesta de",
    "lidydVO": "¿Por qué estoy bloqueado o limitado?",
    "lu2T6idPY": "Si cree que hay un problema con su cuenta, comuníquese con el webmaster.",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "{0} usuarios",
    "nncQE": "Vida",
    "o4GdNzX6xS": "En primer lugar, debido al conocido requisito regulatorio en la Tierra, cada usuario debe proporcionar un número de teléfono válido para registrarse.",
    "oHQNQ4mRw": "ID de usuario",
    "p1Jyl4uMv": "Cerrar sesión en su cuenta",
    "pNwe3": "Otro",
    "t8DUz20a-": "Formateador JSON",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "Seleccione el idioma del sitio web",
    "uefFV1": "Más tarde",
    "ufSPh0ad": "Si es imposible registrar su cuenta a través de su número de teléfono actual, comuníquese con el webmaster en su correo electrónico {0} o cuenta de WeChat {1}. Podemos ayudarle a registrar su cuenta manualmente.",
    "wCcPJZK": "{0} no es un correo electrónico válido",
    "wCctGPJZK": "{0} no debe estar vacío",
    "wi28h5_S2": "Códecs",
    "xhxY6iLDH": "Cerrar sesión",
    "yOdwRB": "¡Bienvenido a la comunidad ELB3!",
    "zr3ZBdUoT": "Guía de usuario",
    "zuxd0y-kmA": "El ID de usuario o el número de teléfono no tienen espacios en blanco."
}