{
    "-dxG-aEe4w": "Le nombre maximum de codes de vérification SMS envoyés aujourd'hui a été atteint.",
    "-wHWkv2OC": "Pourquoi ne puis-je pas me connecter ?",
    "-wdkeq": "Cette communauté est-elle à but non lucratif ?",
    "2RbUh6TyJ": "{0} Notifications non lues",
    "2S_7EVIsK": "Validateur JSON",
    "3I-dkqkwr": "Notez que nous ne proposons AUCUN cours de formation commerciale pour les examens d’anglais ou d’autres matières sur ce site Web, et nous ne prévoyons pas de le faire à l’avenir.",
    "43be5": "Agenda",
    "4N79HNWiA": "Pour garantir qu'il s'agit d'une communauté à but non lucratif, nous ouvrons également l'intégralité de son code source sur GitHub, qui se trouve au pied de cette page.",
    "4sQWoTgfr": "Le code de vérification est expiré, veuillez actualiser la page et réessayer",
    "4sdQWoTgfr": "Le code de vérification est expiré, veuillez actualiser la page et réessayer.",
    "5pevqzFXX": "Si vous pensez également qu'il est intéressant pour vous de nous rejoindre, continuez à mettre à jour votre profil en cliquant sur le bouton ci-dessous, merci !",
    "6h14B_t4I": "Inscrit aujourd'hui",
    "7BtpddC": "Deuxièmement, dans cette communauté, nous ne parlons pas de politique ou de tout autre sujet sensible, et bien sûr, nous n'acceptons pas le spam ou la publicité. C'est pourquoi nous exigeons un numéro de téléphone valide pour l'inscription, afin d'éviter toute activité illicite ou inappropriée.",
    "7flKa": "LafTools - L'Omnipotent pour tous les professionnels et ingénieurs",
    "7fldKa": "LafTools - La principale boîte à outils tout-en-un pour les programmeurs",
    "7zqdufsdddJ": "Oui bien sûr. Le site Web ELB3.com est dérivé du groupe de discussion WeChat à but non lucratif, {0}, qui vise à créer une atmosphère d'apprentissage de l'anglais conviviale, sans publicité et confortable.",
    "8s1R5nChx": "Le code d'invitation est vide, cette communauté n'est pas ouverte au public mais limitée aux utilisateurs invités.",
    "8s1dX": "Le code d'invitation n'existe pas dans le système, veuillez vérifier s'il existe un problème sensible à la casse.",
    "8sVG1RXhx": "le mot de passe doit contenir au moins 6 caractères",
    "8sVG1RdXhx": "L'ID utilisateur existe déjà",
    "8sVG1kqXhx": "L'ID utilisateur doit comporter au moins 2 caractères",
    "8sVGdXhx": "L'ID utilisateur ne doit contenir que des lettres et des chiffres",
    "8saIR-LCjyChx": "Le code d'invitation a expiré",
    "8saIt5r5nGxwwChx": "Le code d'invitation a été utilisé",
    "9YPgsPid2M": "Code SMS",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Encodeur Base64",
    "9b_7a0sdf": "Décodeur Base64",
    "9pBpiYcCy": "Pour éviter le spam et la publicité, nous avons besoin d'un code d'invitation pour enregistrer votre compte.",
    "BqWGnXEzV": "Ville",
    "Bz_WdwvAPn": "Vérifiez si CAPTCHA est fourni correctement.",
    "C7jECCVt9": "Valorisez votre temps et ne faites jamais rien d’illégal dans cette communauté.",
    "CK5NCw519": "Histoire de la communauté",
    "CQ44pYZYj": "se connecter",
    "CuHqw9m": "{0} n'est pas un numéro de téléphone valide. Actuellement, le système n'accepte que les numéros de téléphone à 11 chiffres.",
    "Cz_qjjFw7": "Environ {0}",
    "DYaOL4Yp7": "registre",
    "D_9sNBiZj": "Vous avez essayé trop de fois, veuillez réessayer plus tard.",
    "F-D-AewqL": "Faites du rétrospection sur ce que vous avez fait récemment. Nous ne pouvons supporter aucun comportement pouvant être considéré comme du harcèlement, des AD ou de la maltraitance personnelle, etc...",
    "GaySMPQHo": "Tendance",
    "Gy45ssBPS": "Créer un nouveau sujet",
    "H39ddc0df": "Essayez de vous connecter plus tard si vous échouez trop souvent.",
    "HaU4NMabv": "Le code de vérification est incorrect, veuillez saisir à nouveau ou actualiser l'image.",
    "IWPP6V-tR": "Code source",
    "Ibzs2-Ho1": "Outils CSV",
    "IcvP2d-QY": "Veuillez {0} ou {1} pour rejoindre la discussion",
    "IugAFc4OT": "Un problème est survenu lors de la soumission de vos données.",
    "Jbor69IBw": "Formateurs",
    "Jf4iDTZ28": "De plus, soyez assuré que nous ne vendrons jamais votre numéro de téléphone ni ne le rendrons public.",
    "Jfr4RzEZG": "Actuellement, nous n'acceptons que {0} numéro de téléphone pour enregistrer votre compte.",
    "JuZAli3": "Guide de l'utilisateur",
    "K2UEY4ddl": "L'ID utilisateur contient des mots non valides, veuillez éviter d'utiliser {0}",
    "KAiEq6dcwL5": "Enfin, pour rappel amical, chaque utilisateur doit assumer la responsabilité de ses propres paroles et actes.",
    "MnVg5i": "Bonjour heureux de vous rencontrer! C'est avec plaisir que nous vous invitons à rejoindre cette communauté.",
    "MnVqwid": "Bonjour, {0}. Ravi de vous rencontrer! C'est avec plaisir que nous vous invitons à rejoindre cette communauté.",
    "NdqZcRL2QN": "Si vous avez oublié votre mot de passe, vous pouvez le réinitialiser en cliquant sur le lien « Mot de passe oublié ».",
    "OBjaZqTvx": "Maison",
    "OPevedpOM": "Que faire si je n'ai pas de numéro de téléphone ?",
    "P1zxX2IQ5": "Mais pour ce site, il s'agit d'une dérivation du groupe original et ne se limite pas à l'apprentissage de l'anglais, mais aussi à d'autres sujets.",
    "Pu0pj23rR": "Pourquoi un numéro de téléphone est-il requis ?",
    "RYlJHHwg3": "Le code SMS n'est pas correct.",
    "RjdigcxfV": "Contactez-nous",
    "TV09-obNr": "Jalon",
    "TXdh_K": "Mot de passe",
    "TdXddh_wK": "Numéro de téléphone",
    "Te3h_wK": "Numéro de téléphone",
    "TqXdd3h_wK": "Numéro de téléphone",
    "TqXddh_K": "Le code de vérification",
    "TqXdh_K": "Confirmez le mot de passe",
    "UED59zbd-": "LafOutils",
    "UjkOS50wO": "Maison",
    "VndKeCfb-": "Vérifier le téléphone pour activer le compte",
    "VnddCfb-": "Vous êtes actuellement banni pendant un certain temps",
    "W3M4ivK9U": "Mettre à jour le profil",
    "WKG7e": "Règles",
    "Wpdsp3g5U": "Bienvenue dans la communauté {0} !",
    "XIzgAAR": "Habituellement, un code d'invitation disponible peut être fourni par le webmaster ou d'autres utilisateurs.",
    "Xddh_wK": "code d'invitation",
    "Y-svpKvUz": "deux mots de passe ne correspondent pas",
    "Y0drdCSiu": "Les sujets",
    "Yc5uMym": "Vous vous demandez peut-être ce que ELB3 signifie. En bref, c'est l'abréviation du groupe WeChat à but non lucratif {0} qui est une plate-forme intéressante pour les passionnés d'anglais et les candidats souhaitant apprendre et apprécier l'anglais !",
    "ZCzH8": "Le plus récent",
    "ZaS8MP8cr": "Remarque : Le code de vérification est actualisé, veuillez ajuster les valeurs de votre formulaire et ressaisir le code pour continuer.",
    "aISK9iYc_": "Rapport d'informations illégales",
    "aUdtds_qwY": "Normalement, vous pouvez vous connecter avec votre identifiant ou votre numéro de téléphone avec succès, même si vous avez enfreint les règles de cette communauté.",
    "b7wgrhuXl": "Technologie",
    "b_vts": "Se connecter",
    "dHWho": "S'inscrire",
    "dldeoeqwc": "Rappels amicaux",
    "dnsz7fwNx": "L'ID utilisateur est sensible à la casse.",
    "dsdfqw": "L'utilisateur n'existe pas",
    "dwJucRtar": "Cette partie est toujours en cours, bienvenue pour contribuer au projet pour cette partie.",
    "dzIC7qPQ": "Si vous souhaitez nous rejoindre, essayez de contacter le webmaster sur son adresse e-mail {0} ou sur son compte WeChat {1} pour obtenir un code d'invitation.",
    "englishcorner": "Anglais",
    "eqwee": "Le mot de passe n'est pas correct",
    "fcGTPc7HP": "Où puis-je obtenir le code d'invitation ?",
    "gTOv6abWT": "Se connecter",
    "gTOv6adbWT": "Registre",
    "geHXwByxy": "Paramètres",
    "gmK3pKyRI": "{0} Nombre maximal de connexions en ligne",
    "groupnote": "Note",
    "hxCMxpW6Sq": "Inscrit il y a {0} jours",
    "iZXig7E2JF": "LafTools propose une suite complète d'utilitaires de développement comprenant des codecs, des formateurs, des outils de traitement d'images et des solutions de gestion des ressources informatiques. Conçu pour rationaliser et améliorer votre flux de travail de développement, LafTools est votre ressource incontournable pour un développement logiciel efficace et de haute qualité.",
    "jRFk519Bj-": "Cette communauté est animée par un projet de code open source gratuit et entièrement international.",
    "jdbef_PBl": "But",
    "jr_7Y98yZ": "LafOutils",
    "ky6JphiKk": "{0} Utilisateurs en ligne",
    "lEDpJMRfG": "Si vous êtes confus, n'hésitez pas à nous le faire savoir en nous envoyant un e-mail.",
    "lWqYc": "Ce site Web fournit des outils JSON, notamment JSON vers XML, JSON vers CSV, JSON vers YAML.",
    "lastreplyby": "Dernière réponse par",
    "lidydVO": "Pourquoi suis-je bloqué ou limité ?",
    "lu2T6idPY": "Si vous pensez qu'il y a un problème avec votre compte, veuillez contacter le webmaster.",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "{0} Utilisateurs",
    "nncQE": "Vie",
    "o4GdNzX6xS": "Premièrement, en raison de l'exigence réglementaire bien connue sur Terre, chaque utilisateur est tenu de fournir un numéro de téléphone valide pour s'inscrire.",
    "oHQNQ4mRw": "ID de l'utilisateur",
    "p1Jyl4uMv": "Déconnectez-vous de votre compte",
    "pNwe3": "Autre",
    "t8DUz20a-": "Formateur JSON",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "Sélectionnez la langue du site Web",
    "uefFV1": "Plus tard",
    "ufSPh0ad": "S'il est impossible d'enregistrer votre compte via votre numéro de téléphone actuel, veuillez contacter le webmaster sur son adresse e-mail {0} ou sur son compte WeChat {1}. Nous pouvons vous aider à enregistrer votre compte manuellement.",
    "wCcPJZK": "{0} n'est pas une adresse e-mail valide",
    "wCctGPJZK": "{0} ne doit pas être vide",
    "wi28h5_S2": "Codecs",
    "xhxY6iLDH": "Se déconnecter",
    "yOdwRB": "Bienvenue dans la communauté ELB3 !",
    "zr3ZBdUoT": "Guide de l'utilisateur",
    "zuxd0y-kmA": "L’ID utilisateur ou le numéro de téléphone n’a pas d’espace."
}