{
    "-dxG-aEe4w": "Elérte a ma elküldött SMS-ellenőrző kódok maximális számát.",
    "-wHWkv2OC": "Miért nem tudok bejelentkezni?",
    "-wdkeq": "Ez a közösség non-profit?",
    "2RbUh6TyJ": "{0} Olvasatlan értesítések",
    "3I-dkqkwr": "Felhívjuk figyelmét, hogy ezen a weboldalon NEM biztosítunk kereskedelmi képzési kurzusokat angol nyelvvizsgákhoz vagy bármely más tantárgyi vizsgához, és a jövőben sem tervezünk ilyet.",
    "43be5": "Napló",
    "4N79HNWiA": "Annak érdekében, hogy ez egy non-profit közösség, megnyitjuk a teljes forráskódot a GitHubon, amely az oldal láblécében található.",
    "4sQWoTgfr": "Az ellenőrző kód lejárt, kérjük, frissítse az oldalt, és próbálja újra",
    "4sdQWoTgfr": "Az ellenőrző kód lejárt, kérjük, frissítse az oldalt, és próbálja újra.",
    "5pevqzFXX": "Ha Ön is úgy gondolja, hogy érdemes csatlakozni hozzánk, kérjük, továbbra is frissítse profilját az alábbi gombra kattintva! Köszönjük!",
    "6h14B_t4I": "Ma csatlakozott",
    "7BtpddC": "Másodszor, ebben a közösségben nem beszélünk politikáról vagy más kényes témákról, és természetesen nem fogadjuk a spamet vagy a reklámot. Éppen ezért a regisztrációhoz érvényes telefonszámra van szükségünk, hogy megakadályozzuk a tiltott vagy helytelen tevékenységeket.",
    "7flKa": "LafTools – A mindenható minden szakember és mérnök számára",
    "7zqdufsdddJ": "Persze. Az ELB3.com webhely a non-profit WeChat csevegőcsoportból ({0}) származik, amelynek célja egy barátságos, hirdetésektől mentes és kényelmes angoltanulási légkör megteremtése.",
    "8s1R5nChx": "A meghívó kódja üres, ez a közösség nem nyilvános, de csak meghívott felhasználók számára.",
    "8s1dX": "A meghívó kód nem létezik a rendszerben, kérjük, ellenőrizze, hogy nincs-e kis- és nagybetűérzékeny probléma.",
    "8sVG1RXhx": "a jelszónak legalább 6 karakterből kell állnia",
    "8sVG1RdXhx": "A felhasználói azonosító már létezik",
    "8sVG1kqXhx": "A felhasználói azonosítónak legalább 2 karakterből kell állnia",
    "8sVGdXhx": "A felhasználói azonosító csak betűket és számokat tartalmazhat",
    "8saIR-LCjyChx": "A meghívó kódja lejárt",
    "8saIt5r5nGxwwChx": "A meghívó kódja elfogyott",
    "9YPgsPid2M": "SMS kód",
    "9pBpiYcCy": "A spam és a hirdetések elkerülése érdekében a fiók regisztrálásához meghívó kódra van szükségünk.",
    "BqWGnXEzV": "Város",
    "Bz_WdwvAPn": "Ellenőrizze, hogy a CAPTCHA megfelelően van-e megadva.",
    "C7jECCVt9": "Értékelje az idejét, és soha ne csináljon semmi illegálisat ebben a közösségben.",
    "CK5NCw519": "Közösségi történet",
    "CQ44pYZYj": "Belépés",
    "CuHqw9m": "A(z) {0} nem érvényes telefonszám, jelenleg a rendszer csak 11 számjegyű telefonszámot fogad el.",
    "Cz_qjjFw7": "Körülbelül {0}",
    "DYaOL4Yp7": "Regisztráció",
    "D_9sNBiZj": "Túl sokszor próbálkozott, kérjük, próbálja újra később.",
    "F-D-AewqL": "Tekintsd vissza azt, amit mostanában csináltál. Nem tudunk elviselni olyan viselkedést, amely zaklatásnak, reklámozásnak vagy személyes visszaélésnek, stb.",
    "GaySMPQHo": "Felkapott",
    "Gy45ssBPS": "Új téma létrehozása",
    "H39ddc0df": "Próbáljon meg később bejelentkezni, ha túl sokszor nem sikerült.",
    "HaU4NMabv": "Az ellenőrző kód helytelen, kérjük, adja meg újra, vagy frissítse a képet.",
    "IWPP6V-tR": "Forráskód",
    "IcvP2d-QY": "Kérjük, {0} vagy {1} csatlakozzon a beszélgetéshez",
    "IugAFc4OT": "Hiba történt az adatok elküldése során.",
    "Jf4iDTZ28": "Mindemellett biztos lehet benne, hogy soha nem adjuk el telefonszámát, és nem tesszük nyilvánossá.",
    "Jfr4RzEZG": "Jelenleg csak a(z) {0} telefonszámot fogadjuk el fiókja regisztrálásához.",
    "JuZAli3": "Felhasználói kézikönyv",
    "K2UEY4ddl": "A felhasználói azonosító érvénytelen szavakat tartalmaz, kérjük, ne használja a következőt: {0}",
    "KAiEq6dcwL5": "Végül, barátságos emlékeztetőül, minden felhasználónak vállalnia kell a felelősséget saját szavaiért és tetteiért.",
    "MnVg5i": "Szia! Örvendek! Örömünkre szolgál, hogy meghívhattuk Önt ebbe a közösségbe.",
    "MnVqwid": "Üdvözöljük, {0}! Örvendek! Örömünkre szolgál, hogy meghívhattuk Önt ebbe a közösségbe.",
    "NdqZcRL2QN": "Ha elfelejtette jelszavát, az \"Elfelejtett jelszó\" linkre kattintva visszaállíthatja azt.",
    "OBjaZqTvx": "itthon",
    "OPevedpOM": "Mi van, ha nincs telefonszámom?",
    "P1zxX2IQ5": "De ennél a webhelynél ez az eredeti csoport származéka, és nem korlátozódik az angoltanulásra, hanem más témákra is.",
    "Pu0pj23rR": "Miért van szükség telefonszámra?",
    "RYlJHHwg3": "Az SMS kód nem megfelelő.",
    "RjdigcxfV": "Lépjen kapcsolatba velünk",
    "TV09-obNr": "Mérföldkő",
    "TXdh_K": "Jelszó",
    "TdXddh_wK": "Telefonszám",
    "Te3h_wK": "Telefonszám",
    "TqXdd3h_wK": "Telefonszám",
    "TqXddh_K": "Ellenőrző kód",
    "TqXdh_K": "Jelszó megerősítése",
    "UED59zbd-": "LafTools",
    "UjkOS50wO": "itthon",
    "VndKeCfb-": "A fiók aktiválásához ellenőrizze a telefonszámot",
    "VnddCfb-": "Jelenleg egy időre kitiltva vagy",
    "W3M4ivK9U": "Profil frissítése",
    "WKG7e": "Szabályok",
    "Wpdsp3g5U": "Üdvözöljük a {0} közösségben!",
    "XIzgAAR": "Általában egy elérhető meghívó kódot a webmester vagy más felhasználók adhatnak meg.",
    "Xddh_wK": "Meghívó kód",
    "Y-svpKvUz": "két jelszó nem egyezik",
    "Y0drdCSiu": "Témák",
    "Yc5uMym": "Kíváncsi lehet, mit jelent az ELB3, röviden a non-profit WeChat csoport rövidítése {0}, amely érdekes platform az angol rajongók és vizsgázók számára, hogy megtanulják és értékeljék az angol nyelvet!",
    "ZCzH8": "Legújabb",
    "ZaS8MP8cr": "Megjegyzés: Az ellenőrző kód frissül. Kérjük, módosítsa az űrlap értékeit, és adja meg újra a kódot a folytatáshoz.",
    "aISK9iYc_": "Illegális információs jelentés",
    "aUdtds_qwY": "Általában sikeresen bejelentkezhet felhasználói azonosítójával vagy telefonszámával, még akkor is, ha megszegte a közösség szabályait.",
    "b7wgrhuXl": "Tech",
    "b_vts": "Bejelentkezés",
    "dHWho": "Regisztrálj",
    "dldeoeqwc": "Barátságos emlékeztetők",
    "dnsz7fwNx": "A felhasználói azonosító megkülönbözteti a kis- és nagybetűket.",
    "dsdfqw": "A felhasználó nem létezik",
    "dwJucRtar": "Ez a rész még folyamatban van, üdvözlöm, hogy hozzájáruljon a rész projektjéhez.",
    "dzIC7qPQ": "Ha szeretne csatlakozni hozzánk, kérjük, próbálja meg elérni a webmestert e-mail-címén {0} vagy WeChat-fiókjában {1}, hogy megkapja a meghívó kódját.",
    "englishcorner": "angol",
    "eqwee": "A jelszó nem megfelelő",
    "fcGTPc7HP": "Hol kaphatom meg a meghívó kódot?",
    "gTOv6abWT": "Belépés",
    "gTOv6adbWT": "Regisztráció",
    "geHXwByxy": "Beállítások",
    "gmK3pKyRI": "{0} Csúcs online szám",
    "groupnote": "Memo",
    "hxCMxpW6Sq": "{0} napja csatlakozott",
    "jRFk519Bj-": "Ezt a közösséget egy teljesen nemzetközi, ingyenes nyílt forráskódú projekt vezérli.",
    "jdbef_PBl": "Cél",
    "ky6JphiKk": "{0} Online felhasználók",
    "lEDpJMRfG": "Ha zavarban van, kérjük, tudassa velünk egy e-mailben.",
    "lWqYc": "Ez a webhely JSON-eszközöket kínál, beleértve a JSON-t XML-re, a JSON-t CSV-re, a JSON-t a YAML-re.",
    "lastreplyby": "Utolsó válasz:",
    "lidydVO": "Miért vagyok letiltva vagy korlátozva?",
    "lu2T6idPY": "Ha úgy gondolja, hogy probléma van fiókjával, forduljon a webmesterhez.",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "{0} Felhasználók",
    "nncQE": "Élet",
    "o4GdNzX6xS": "Először is, a Földön jól ismert szabályozási követelmény miatt minden felhasználónak érvényes telefonszámot kell megadnia a regisztrációhoz.",
    "oHQNQ4mRw": "Felhasználói azonosító",
    "p1Jyl4uMv": "Jelentkezzen ki fiókjából",
    "pNwe3": "Egyéb",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "Válassza a Webhely nyelve lehetőséget",
    "uefFV1": "A későbbiekben",
    "ufSPh0ad": "Ha nem tudja regisztrálni fiókját jelenlegi telefonszámán, kérjük, lépjen kapcsolatba a webmesterrel az e-mail címén {0} vagy a WeChat-fiókján {1}. Segítünk Önnek a fiók manuális regisztrációjában.",
    "wCcPJZK": "A(z) {0} nem érvényes e-mail-cím",
    "wCctGPJZK": "A(z) {0} nem lehet üres",
    "xhxY6iLDH": "Kijelentkezés",
    "yOdwRB": "Üdvözöljük az ELB3 közösségben!",
    "zr3ZBdUoT": "Felhasználói kézikönyv",
    "zuxd0y-kmA": "A felhasználói azonosító vagy a telefonszám nem tartalmaz szóközt."
}