{
    "-dxG-aEe4w": "Jumlah maksimum kode verifikasi SMS yang dikirim hari ini telah tercapai.",
    "-wHWkv2OC": "Mengapa saya tidak bisa masuk?",
    "-wdkeq": "Apakah komunitas ini nirlaba?",
    "2RbUh6TyJ": "{0} Notifikasi Belum Dibaca",
    "3I-dkqkwr": "Perhatikan bahwa kami TIDAK menyediakan kursus pelatihan komersial untuk ujian bahasa Inggris atau ujian mata pelajaran lainnya di situs web ini, dan kami tidak berencana untuk melakukannya di masa mendatang.",
    "43be5": "Buku harian",
    "4N79HNWiA": "Untuk memastikan ini adalah komunitas nirlaba, kami juga membuka seluruh kode sumbernya di GitHub, yang dapat ditemukan di bagian bawah halaman ini.",
    "4sQWoTgfr": "Kode verifikasi sudah habis masa berlakunya, harap segarkan halaman dan coba lagi",
    "4sdQWoTgfr": "Kode verifikasi sudah habis masa berlakunya, harap segarkan halaman dan coba lagi.",
    "5pevqzFXX": "Jika Anda juga merasa penting bagi Anda untuk bergabung dengan kami, silakan terus perbarui profil Anda dengan mengklik tombol di bawah, terima kasih!",
    "6h14B_t4I": "Bergabung Hari Ini",
    "7BtpddC": "Kedua, di komunitas ini, kami tidak membicarakan politik atau topik sensitif lainnya, dan tentu saja tidak menerima spam atau iklan. Itulah sebabnya kami memerlukan nomor telepon yang valid untuk pendaftaran, untuk mencegah aktivitas terlarang atau tidak patut.",
    "7flKa": "LafTools - Yang Mahakuasa untuk semua Profesional dan Insinyur",
    "7zqdufsdddJ": "Ya tentu saja. Situs web ELB3.com berasal dari grup obrolan WeChat nirlaba, {0}, yang bertujuan untuk menciptakan suasana belajar bahasa Inggris yang bersahabat, bebas iklan, dan nyaman.",
    "8s1R5nChx": "Kode undangan kosong, komunitas ini tidak terbuka untuk umum tetapi terbatas pada pengguna yang diundang.",
    "8s1dX": "Kode undangan tidak ada di sistem, harap periksa apakah ada masalah peka huruf besar-kecil.",
    "8sVG1RXhx": "kata sandi harus minimal 6 karakter",
    "8sVG1RdXhx": "ID Pengguna sudah ada",
    "8sVG1kqXhx": "ID Pengguna minimal harus 2 karakter",
    "8sVGdXhx": "ID Pengguna hanya boleh berisi huruf dan angka",
    "8saIR-LCjyChx": "Kode undangan telah kedaluwarsa",
    "8saIt5r5nGxwwChx": "Kode undangan telah habis",
    "9YPgsPid2M": "Kode SMS",
    "9pBpiYcCy": "Untuk mencegah spam dan iklan, kami memerlukan kode undangan untuk mendaftarkan akun Anda.",
    "BqWGnXEzV": "Kota",
    "Bz_WdwvAPn": "Periksa apakah CAPTCHA diberikan dengan benar.",
    "C7jECCVt9": "Hargai waktu Anda dan jangan pernah melakukan sesuatu yang ilegal di komunitas ini selamanya.",
    "CK5NCw519": "Kisah Komunitas",
    "CQ44pYZYj": "Gabung",
    "CuHqw9m": "{0} bukan nomor telepon yang valid, saat ini sistem hanya menerima 11 digit nomor telepon.",
    "Cz_qjjFw7": "Tentang {0}",
    "DYaOL4Yp7": "daftar",
    "D_9sNBiZj": "Anda mencoba terlalu sering, silakan coba lagi nanti.",
    "F-D-AewqL": "Lakukan retrospeksi terhadap apa yang telah Anda lakukan baru-baru ini. Kami tidak dapat mentolerir perilaku apa pun yang dapat dianggap sebagai pelecehan, iklan atau pelecehan pribadi, dll...",
    "GaySMPQHo": "Sedang tren",
    "Gy45ssBPS": "Buat Topik Baru",
    "H39ddc0df": "Coba masuk lagi nanti jika terlalu sering gagal.",
    "HaU4NMabv": "Kode verifikasi salah, silakan masukan ulang atau segarkan gambar.",
    "IWPP6V-tR": "Kode sumber",
    "IcvP2d-QY": "Silakan {0} atau {1} untuk bergabung dalam diskusi",
    "IugAFc4OT": "Terjadi masalah saat mengirimkan data Anda.",
    "Jf4iDTZ28": "Selain itu, yang pasti, yakinlah bahwa kami tidak akan pernah menjual nomor telepon Anda atau mempublikasikannya.",
    "Jfr4RzEZG": "Saat ini, kami hanya menerima {0} nomor telepon untuk mendaftarkan akun Anda.",
    "JuZAli3": "Panduan Pengguna",
    "K2UEY4ddl": "ID pengguna berisi kata-kata yang tidak valid, harap hindari penggunaan {0}",
    "KAiEq6dcwL5": "Terakhir, sebagai pengingat, setiap pengguna harus bertanggung jawab atas kata-kata dan tindakan mereka sendiri.",
    "MnVg5i": "Halo, senang bertemu dengan Anda! Dengan senang hati kami mengundang Anda ke komunitas ini.",
    "MnVqwid": "Halo, {0}. Senang berkenalan dengan Anda! Dengan senang hati kami mengundang Anda ke komunitas ini.",
    "NdqZcRL2QN": "Jika Anda lupa kata sandi, Anda dapat mengatur ulang kata sandi dengan mengeklik tautan 'Lupa Kata Sandi'.",
    "OBjaZqTvx": "Rumah",
    "OPevedpOM": "Bagaimana jika saya tidak mempunyai nomor telepon?",
    "P1zxX2IQ5": "Namun untuk website ini merupakan turunan dari grup aslinya dan tidak terbatas pada pembelajaran bahasa Inggris saja, tetapi juga untuk topik lainnya.",
    "Pu0pj23rR": "Mengapa nomor telepon diperlukan?",
    "RYlJHHwg3": "Kode SMS tidak benar.",
    "RjdigcxfV": "Hubungi kami",
    "TV09-obNr": "Tonggak pencapaian",
    "TXdh_K": "Kata sandi",
    "TdXddh_wK": "Nomor telepon",
    "Te3h_wK": "Nomor telepon",
    "TqXdd3h_wK": "Nomor telepon",
    "TqXddh_K": "Kode verifikasi",
    "TqXdh_K": "konfirmasi sandi",
    "UED59zbd-": "alat laf",
    "UjkOS50wO": "Rumah",
    "VndKeCfb-": "Verifikasi Telepon untuk Mengaktifkan Akun",
    "VnddCfb-": "Saat ini Anda dilarang untuk sementara waktu",
    "W3M4ivK9U": "Memperbaharui profil",
    "WKG7e": "Aturan",
    "Wpdsp3g5U": "Selamat datang di {0} Komunitas!",
    "XIzgAAR": "Biasanya kode undangan yang tersedia dapat diberikan dari webmaster atau pengguna lainnya.",
    "Xddh_wK": "Kode Undangan",
    "Y-svpKvUz": "dua kata sandi tidak cocok",
    "Y0drdCSiu": "Topik",
    "Yc5uMym": "Anda mungkin bertanya-tanya apa kepanjangan dari ELB3, singkatnya, ini adalah kependekan dari grup WeChat nirlaba {0} yang merupakan platform menarik bagi para penggemar dan peserta ujian bahasa Inggris untuk belajar dan mengapresiasi bahasa Inggris!",
    "ZCzH8": "Terbaru",
    "ZaS8MP8cr": "Catatan: Kode verifikasi telah disegarkan, harap sesuaikan nilai formulir Anda dan masukkan kembali kode untuk melanjutkan.",
    "aISK9iYc_": "Laporan Informasi Ilegal",
    "aUdtds_qwY": "Biasanya, Anda dapat berhasil masuk dengan ID pengguna atau nomor telepon Anda meskipun Anda telah melanggar aturan di komunitas ini.",
    "b7wgrhuXl": "Teknologi",
    "b_vts": "Masuk",
    "dHWho": "Mendaftar",
    "dldeoeqwc": "Pengingat Ramah",
    "dnsz7fwNx": "ID Pengguna peka huruf besar-kecil.",
    "dsdfqw": "pengguna tidak ada",
    "dwJucRtar": "Bagian ini masih dalam proses, selamat datang untuk berkontribusi pada proyek untuk bagian ini.",
    "dzIC7qPQ": "Jika Anda ingin bergabung dengan kami, cobalah menghubungi webmaster melalui emailnya {0} atau akun WeChat {1} untuk mendapatkan kode undangan.",
    "englishcorner": "Bahasa inggris",
    "eqwee": "Kata sandi salah",
    "fcGTPc7HP": "Dimana saya bisa mendapatkan kode undangannya?",
    "gTOv6abWT": "Gabung",
    "gTOv6adbWT": "Daftar",
    "geHXwByxy": "Pengaturan",
    "gmK3pKyRI": "{0} Jumlah Puncak Online",
    "groupnote": "Memo",
    "hxCMxpW6Sq": "Bergabung {0} hari yang lalu",
    "jRFk519Bj-": "Komunitas ini didorong oleh proyek kode sumber terbuka gratis yang sepenuhnya internasional.",
    "jdbef_PBl": "Sasaran",
    "ky6JphiKk": "{0} Pengguna Daring",
    "lEDpJMRfG": "Jika Anda bingung, silakan beritahu kami dengan mengirimkan email kepada kami.",
    "lWqYc": "Situs web ini menyediakan alat JSON termasuk JSON ke XML, JSON ke CSV, JSON ke YAML.",
    "lastreplyby": "Balasan terakhir oleh",
    "lidydVO": "Mengapa saya diblokir atau dibatasi?",
    "lu2T6idPY": "Jika menurut Anda ada masalah dengan akun Anda, silakan hubungi webmaster.",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "{0} Pengguna",
    "nncQE": "Kehidupan",
    "o4GdNzX6xS": "Pertama, Karena persyaratan peraturan yang terkenal di Bumi, setiap pengguna diharuskan memberikan nomor telepon yang valid untuk mendaftar.",
    "oHQNQ4mRw": "identitas pengguna",
    "p1Jyl4uMv": "Keluar dari Akun Anda",
    "pNwe3": "Lainnya",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "Pilih Bahasa Situs Web",
    "uefFV1": "Nanti",
    "ufSPh0ad": "Jika tidak mungkin mendaftarkan akun melalui nomor telepon Anda saat ini, harap hubungi webmaster melalui emailnya {0} atau akun WeChat {1}. Kami dapat membantu Anda untuk mendaftarkan akun Anda secara manual.",
    "wCcPJZK": "{0} bukan email yang valid",
    "wCctGPJZK": "{0} wajib diisi",
    "xhxY6iLDH": "Keluar",
    "yOdwRB": "Selamat datang di Komunitas ELB3!",
    "zr3ZBdUoT": "Panduan Pengguna",
    "zuxd0y-kmA": "ID Pengguna atau Nomor Telepon tidak memiliki spasi."
}