{
    "15424": "Itulah keseluruhan masalah sains. Ada sekelompok empiris yang mencoba menggambarkan hal-hal menakjubkan yang tak terbayangkan. – Bill Watterson",
    "15999": "Inovasi adalah proses melakukan perubahan pada sesuatu yang sudah mapan. -Tim Definisi Inovasi",
    "16987": "Kadang-kadang lebih bermanfaat untuk tetap di tempat tidur pada hari Senin, daripada menghabiskan sisa minggu itu untuk men-debug kode hari Senin. – Dan Salomon",
    "19775": "Sains adalah cara hidup. Ini adalah sebuah perspektif. Sains adalah proses yang membawa kita dari kebingungan menuju pemahaman dengan cara yang tepat, prediktif, dan dapat diandalkan – sebuah transformasi, bagi mereka yang cukup beruntung untuk mengalaminya, hal ini memberdayakan dan emosional. – Brian Greene",
    "38127": "Pengujian adalah proses mencoba memecahkan kode - Anonim",
    "42641": "Pengembangan web itu sulit, hanya saja menyenangkan untuk dilakukan. Anda hanya perlu menetapkan standar Anda. Jika itu mudah, adakah yang akan melakukannya? ― Olawale Daniel",
    "46367": "Inovasi adalah kunci untuk membuka potensi pertumbuhan. -Omar Ishrak",
    "57225": "Inovasi adalah sumber kehidupan bisnis yang berkembang. -Michael Dell",
    "63470": "Ilmuwan sejati memecahkan masalah, bukan meratapi masalah yang tidak dapat dipecahkan. – Anne McCaffrey",
    "66187": "Berbicara itu murah. Tunjukkan padaku kodenya. -Linus Torvalds",
    "68518": "Perangkat lunak dan katedral hampir sama – pertama kita membangunnya, lalu kita berdoa.",
    "77528": "Inovasi adalah kekuatan pendorong di balik kemajuan. -John F.Kennedy",
    "80972": "Tentu saja, kode yang buruk dapat dibersihkan. Tapi itu sangat mahal. — Robert C.Martin",
    "85805": "Seorang ahli adalah orang yang telah melakukan segala kesalahan yang dapat dilakukan dalam bidang yang sangat sempit. – Neils Bohr",
    "92941": "Ada puisi nyata di dunia nyata. Sains adalah puisi realitas. –Richard Dawkins",
    "": "Pesan: {0}",
    "-8l11": "Disalin",
    "-DqwwR": "Operasi Selesai.",
    "-GJ_72": "Beralih ke ruang kerja yang dipilih {0}",
    "-Jx4J": "Akun Lokal",
    "-Rj3y": "Tema",
    "-XZnW": "Kembali",
    "-Yo129I": "Alat Teks",
    "-nL_B5PoN": "Kompres {0}",
    "00d36": "Cara terbaik untuk memprediksi masa depan adalah dengan menciptakannya. -Alan Kay",
    "01do0y": "Kannada",
    "04SSf": "Tidak ingat kata sandi?",
    "07naT": "Kesalahan: {0}",
    "07ui6": "Info lebih lanjut",
    "0Ceqru": "Base64 adalah notasi untuk menyandikan data byte arbitrer menggunakan serangkaian simbol terbatas yang mudah digunakan oleh manusia dan diproses oleh komputer.",
    "0MO3jj": "MD5 (Message-Digest 5) adalah fungsi hash yang banyak digunakan. Ini telah digunakan dalam berbagai aplikasi keamanan dan juga biasa digunakan untuk memeriksa integritas file. Namun, MD5 tidak tahan benturan dan tidak cocok untuk aplikasi seperti sertifikat SSL/TLS atau tanda tangan digital yang mengandalkan properti ini.",
    "0PgZ_": "Terjemahan",
    "0YKce": "Mengonversi string Desimal Berkode Biner (BCD) menjadi angka desimal.",
    "0a310": "Tidak ada jalan istimewa menuju ilmu pengetahuan, dan hanya mereka yang tidak takut dengan pendakian curam yang melelahkan yang memiliki peluang untuk mencapai puncaknya yang cemerlang. –Karl Marx",
    "0a710": "Inovasi adalah sumber kehidupan organisasi mana pun. -Dr. R. L. Bhatia",
    "0ba15": "Inovasi yang sukses memerlukan pengambilan risiko yang diperhitungkan. -Harvard Pruden",
    "0e299": "Segala sesuatu secara teoritis tidak mungkin sampai hal itu dilakukan. – Robert A. Heinlein",
    "0gvcN": "Selamat datang di halaman ikhtisar, ini masih dalam pengembangan.",
    "0gywa": "Ruang kerja tidak ditemukan, Anda akan diarahkan ke halaman indeks ruang kerja.",
    "0pfdz7": "Uzbekistan",
    "114ee": "Pengkodean seperti puisi harus singkat dan ringkas. - Santosh Kalwar",
    "13pmE": "Dukung Kami",
    "149c0": "Dalam persoalan sains, otoritas ribuan orang tidak sebanding dengan penalaran sederhana dari satu individu. – Galileo Galilei",
    "1507oa": "Benggala",
    "1883d": "Sains jauh lebih merangsang imajinasi dibandingkan ilmu klasik. – JBS Haldane",
    "188cd": "Pemrograman dipelajari dengan menulis program. -Brian Kernighan",
    "18f46": "Roket itu keren. Tidak ada jalan keluarnya. – Elon Musk",
    "1JOFP": "Buka Ruang Kerja Saya",
    "1NTgQ": "Buka Ruang Kerja",
    "1Npez": "Tolong berikan jalannya",
    "1Tuab": "Disalin",
    "1X8x7": "Contoh",
    "1Xe82x7": "{0} Perkecil",
    "1Xe8wx7": "Tali Heksa",
    "1Xe8x7": "{0} Mempercantik",
    "1Xe8x7qe": "BCD",
    "1YmJc": "Pilih salah satu opsi sebagai bahasa pilihan Anda:",
    "1a3Sc": "Batalkan Memuat",
    "1a8b9": "Ilmuwan bukanlah orang yang memberikan jawaban yang benar, ia adalah orang yang mengajukan pertanyaan yang tepat. – Claude Levi-Strauss",
    "1bd": "Alur kerja",
    "1d71a": "Kita dilahirkan pada saat tertentu, di tempat tertentu, dan seperti anggur tahun-tahun kuno, kita memiliki kualitas tahun dan musim di mana kita dilahirkan. Astrologi tidak menuntut apa pun lagi. – Carl Jung",
    "1da5a": "Inovasi adalah landasan kemajuan dan kesuksesan dalam dunia bisnis modern. -Halaman Larry",
    "1e3e5n": "rumah",
    "1ff27": "Sains adalah apa yang kita pahami dengan cukup baik untuk dijelaskan pada komputer; seni adalah segalanya. – Donald E.Knuth",
    "1h6jH": "Peringatan, outputnya adalah nilai kosong yang panjangnya nol!",
    "1j62a": "Lakukan ini di lain waktu",
    "1jj0ri": "Jepang",
    "1k_44": "Operasi ini menerjemahkan data dari string ASCII Base64 kembali ke format mentahnya.",
    "1th2nw": "Sinhala",
    "1yIQu": "Anda dapat mencoba memproses ulang tindakan Anda atau klik tombol di bawah untuk menghilangkan kesalahan.",
    "20nmcv": "Latin",
    "22XLF": "Belum selesai",
    "22f3a": "Inovasi merupakan isu sentral dalam kemakmuran ekonomi. –Michael Porter",
    "23f61": "Inovasi bukan hanya soal memiliki ide bagus; ini tentang mewujudkan gagasan itu menjadi kenyataan. -Erik Qualman",
    "24vLI": "Dibuat",
    "277a9": "Sains tidak dapat memecahkan misteri utama alam. Dan itu karena, dalam analisa terakhir, kita sendiri adalah bagian dari misteri yang ingin kita pecahkan. – Max Planck",
    "27ef9": "Inovasi adalah kemampuan untuk mengubah ide menjadi faktur. -L. Duncan",
    "27j7sy": "Shona",
    "2D9a6": "Tidak ingat kata sandi?",
    "2D9qdk6": "Apakah Cukup Aman?",
    "2IF6A": "Sepertinya penyimpanan penyimpanan palsu mengalami beberapa masalah",
    "2JyFN": "Salin Hasil ke Clipboard",
    "2Ocbey": "Versi: kapan",
    "2RhAT": "Sepertinya proses pengambilan palsu mengalami beberapa masalah",
    "2Ruh6": "Buat Akun Lokal Baru",
    "2S5ap": "Alihkan Mode Layar Penuh",
    "2S_7EVIsK": "Validator JSON",
    "2Y1mR": "Teks bersih",
    "2b7f7": "Saya yakin alam semesta penuh dengan kehidupan berakal. Terlalu cerdas untuk datang ke sini. – Arthur C. Clarke",
    "2bqHk": "Muat dari File",
    "2e4fb7": "Igbo",
    "2giYv": "Uji Kata Sandi: {0}",
    "2khdsv": "pasto",
    "2lehqwp": "Orang Vietnam",
    "2lhcqwp": "Turki",
    "2lhqqwp": "bahasa Indonesia",
    "2lhqqwqp": "Melayu",
    "2lhqwwp": "Thai",
    "2qdin8": "Silakan masukkan kode verifikasi",
    "2tib5m": "Orang Swedia",
    "2ybu7j": "Norwegia",
    "30eo2v": "Gujarati",
    "321e0": "Proses debug dua kali lebih sulit daripada menulis kode. Oleh karena itu, jika Anda menulis kode secerdas mungkin, menurut definisi Anda tidak cukup pintar untuk melakukan debug - Brian W. Kernighan",
    "32D9a6": "Buat sebuah akun",
    "32c8d": "Jika debugging adalah proses menghilangkan bug, maka pemrograman harus menjadi proses memasukkannya ke dalam. – Sam Redwine",
    "33RXi": "Permintaan ditolak karena parameter tidak memuaskan.",
    "33aa4": "Sains hanyalah empirisme murni, dan berdasarkan metodenya, ia mengecualikan metafisika. –Steve Martin",
    "346qid": "Rusia",
    "380da": "Pemrograman saat ini adalah perlombaan antara insinyur perangkat lunak yang berusaha membangun program anti-idiot yang lebih besar dan lebih baik dan alam semesta yang berusaha menghasilkan orang-orang idiot yang lebih besar dan lebih baik. Sejauh ini, Semesta menang. -Rick Cook",
    "394b6": "Jika Anda berpikir bahwa sains itu pasti? ya, itu hanya kesalahanmu saja. – Richard Feynman",
    "398cc": "Pemrogram sepertinya sedang mengubah dunia. Akan melegakan, bagi mereka dan bagi kita semua, jika mereka mengetahui sesuatu tentang hal ini. – Ellen Ullman",
    "39dsCt": "Anda akan menerima pemberitahuan terbaru dari layanan aplikasi jika ada.",
    "3d297": "Hal yang saya sukai tentang sains adalah saat Anda belajar, Anda tidak benar-benar mendapatkan jawaban. Anda hanya mendapatkan pertanyaan yang lebih baik. – John Green",
    "3ii2tt": "Gaelik Skotlandia",
    "3umnB": "Tanda tidak diketahui",
    "40b7f": "Inovasi adalah satu-satunya cara untuk menang dalam jangka panjang. -Jeff Immelt",
    "420b0": "Inovasi yang sukses memerlukan komitmen terhadap kolaborasi dan komunikasi terbuka. -Rachel D.Ellison",
    "43be5": "Buku harian",
    "43e45": "Tidak ada hukum kecuali hukum yang tidak ada hukumnya. – John Archibald Wheeler",
    "441oja": "orang Georgia",
    "44Ntqw-": "Menangani operasi.",
    "45cb0": "Inovasi bukan hanya tentang menciptakan ide-ide baru, tetapi juga tentang bagaimana mengeksekusi ide-ide tersebut dengan sukses. -Arun Pandit",
    "46bksi": "Lithuania",
    "4K_vhq": "Gandakan tab ini",
    "4PIqD": "Tinjauan Kode",
    "4UYIJ": "Belum selesai.",
    "4cGA_": "Mengambil data untuk preferensi sistem...",
    "4cf03": "Sebenarnya segala sesuatu yang bisa diketahui sebagai angka; karena tidak mungkin memahami apa pun dengan pikiran atau mengenalinya tanpa pikiran. – Filolaus",
    "4d389": "Inovasi adalah cara hidup bagi pengusaha sukses. -John Rampton",
    "4da84": "Anda mungkin tidak berpikir bahwa programmer adalah seniman, namun pemrograman adalah profesi yang sangat kreatif. Ini adalah kreativitas berbasis logika. – John Romero",
    "4kKe4": "Kata sandi Anda",
    "4tqb4x": "Hongaria",
    "4vdfwf": "OKE",
    "4wlih": "Permintaan ditolak karena parameter tidak memuaskan.",
    "52OiQ": "Disalin {0} kali",
    "532fd": "Inovasi adalah kemampuan untuk melihat perubahan sebagai peluang, bukan ancaman. -Steve Pekerjaan",
    "54cwb": "API Websocket Sistem mengalami kesalahan: {0}",
    "56ibcj": "Orang Vietnam",
    "57eaa": "Kita hanyalah seekor monyet tingkat lanjut di sebuah planet kecil dengan bintang yang sangat rata-rata. Tapi kita bisa memahami Alam Semesta. Itu menjadikan kami sesuatu yang sangat istimewa. - Stephen Hawking",
    "58HQX": "Jika Anda tidak mengetahui nilainya, harap hubungi administrator Anda untuk detail lebih lanjut, yang dapat ditemukan di pengaturannya.",
    "58c03": "Inovasi adalah faktor kunci keberhasilan bisnis apa pun. -Ravi Venkatesan",
    "58c5f": "Jika pada awalnya Anda tidak berhasil, sebut saja versi 1.0. - Khayri RR Woulfe",
    "59f7d": "Inovasi adalah katalis untuk kemajuan dan pertumbuhan. -John Donahoe",
    "5BOhl": "Kode Undangan",
    "5Ih2u": "Alat Navigator",
    "5NCPT": "Mode Gelap",
    "5NJeGsu1": "E-Mail, Anda dapat dengan mudah mengatur kotak masuk, menulis dan mengirim pesan, serta memantau korespondensi Anda. Selama ini hanya digunakan sebagai alat komunikasi antara pengguna dan tim kami.",
    "5NJeddqGsu1": "Bagian ini mencakup materi komputer, artikel wiki, panduan penggunaan, dan banyak lagi.",
    "5NJedqddqGsu1": "Bagian ini mencakup sumber daya komputer yang dapat digunakan untuk membangun proyek Anda sendiri.",
    "5Perd": "Maaf, fungsi 'Gunakan Editor Cerdas' belum tersedia. Kami masih berupaya menerapkannya. Terima kasih atas kesabaran Anda.",
    "5ZBYR": "Kembali",
    "5a8a1": "Inovasi adalah proses mengambil ide dan mengubahnya menjadi kenyataan. -Kevin O'Leary",
    "5dF7o": "Menyegarkan",
    "5db54": "Sains adalah penawar ampuh terhadap racun antusiasme dan takhayul. –Adam Smith",
    "5eXVS": "Isi Naskah",
    "5ggegx": "Korea",
    "5lW8qp": "Tunjukkan contoh alat ini",
    "5q-Zxqa": "Manajer Skrip",
    "5qPOJL": "Untuk mendukung LafTools, pertimbangkan untuk memberi bintang pada repositori kami di GitHub atau meningkatkan ke versi profesional kami melalui langganan bulanan. Kami sangat menghargai bantuan Anda, dan kami berjanji LafTools akan menjadi lebih baik lagi dengan dana yang terkumpul.",
    "5qV5Sf": "Hapus catatan ini dari daftar",
    "5rg5mt": "Malagasi",
    "5srFq": "alat laf",
    "5v8jl7": "Hmong",
    "626bf": "Jika kita mengetahui apa yang sedang kita lakukan, hal itu tidak akan disebut penelitian, bukan? - Albert Einstein",
    "63d47": "Kualitas adalah hasil konflik antara pemrogram dan penguji. - Yegor Bugayenk",
    "662f9": "Anda hanya hidup sekali tetapi jika Anda melakukannya dengan benar sekali sudah cukup. — Mae Barat",
    "66ef1": "Kode yang baik adalah dokumentasi terbaiknya. Saat Anda hendak menambahkan komentar, tanyakan pada diri Anda, 'Bagaimana cara meningkatkan kode sehingga komentar ini tidak diperlukan? ' -Steve McConnell",
    "66f12": "Sains adalah pengetahuan yang terorganisir. Kebijaksanaan adalah kehidupan yang terorganisir. – Akankah Durant",
    "6AumW": "Tindakan Bawaan",
    "6ClPV": "Membuat",
    "6MrfIfGc6": "Perkecil Kode",
    "6UICxHzVR.name": "Mempercantik {0}",
    "6a0da": "Seni dan ilmu mengajukan pertanyaan adalah sumber segala pengetahuan. – Thomas Berger",
    "6cOPZ": "Desimal Berkode Biner (BCD) adalah kelas pengkodean biner angka desimal di mana setiap digit desimal diwakili oleh sejumlah bit tetap, biasanya empat atau delapan. Pola bit khusus terkadang digunakan untuk sebuah tanda",
    "6hsnqWe": "Meskipun LafTools gratis dan open source, pemeliharaannya tetap memerlukan banyak waktu dan tenaga. Secara khusus, kami memerlukan dana untuk membayar API cloud tertentu. Jika Anda menghargai LafTools, mohon pertimbangkan untuk mendukung kami.",
    "6j13s3": "Islandia",
    "6qT9d-N": "Untuk notebook, LafTools tidak hanya menyediakan pengelola perintah shell, tetapi juga akan menambahkan alat catatan canggih ke dalamnya dalam waktu dekat seperti MarkDown, Latex, {0}, dan seterusnya.",
    "6ulj8i": "Nepal",
    "6wdtJ4vmg.name.0912": "Perkecil {0}",
    "6yOXx": "Nama Tidak Dikenal",
    "71L3OI9T7": "Menelaah perdamaian, meningkatkan kerja sama dan mengupayakan pembangunan telah menjadi tema era saat ini.",
    "71x7x": "Kode Sumber di GitHub",
    "72bee": "Saya bukan seorang programmer hebat; Saya hanya seorang programmer yang baik dengan kebiasaan yang baik. -Kent Beck",
    "74a91": "Pengujian membawa pada kegagalan, dan kegagalan membawa pada pemahaman - Burt Rutan",
    "74f90": "Ilmu pengetahuan saat ini adalah teknologi masa depan. – Edward Teller",
    "7714b": "Inovasi adalah kunci untuk membuka peluang baru dan mendorong pertumbuhan.",
    "79f2d": "Kebanyakan programmer yang baik melakukan pemrograman bukan karena mereka mengharapkan bayaran atau pujian dari masyarakat, tetapi karena pemrograman itu menyenangkan. – Linus Torvalds",
    "7MOO1": "Masuk",
    "7affb": "Dunia tidak akan menunggu kita. Revolusi teknologi akan meninggalkan kita jika kita tidak mengejar ketertinggalannya. – Kofi Annan",
    "7c59e": "Pengalaman adalah nama yang orang berikan untuk kesalahan mereka. –Oscar Wilde",
    "7d4e4": "Inovasi adalah tentang menemukan cara-cara baru dan lebih baik dalam melakukan sesuatu. -Jim Rohn",
    "7dm0d8": "Cina tradisional",
    "7e19d": "Kebingungan adalah bagian dari pemrograman. - Felienne Hermans",
    "7flKa": "LafTools - Yang Mahakuasa untuk semua Profesional dan Insinyur",
    "7g5w22": "Norwegia",
    "7k56u3": "Galisia",
    "7q40W": "Tidak dapat menginisialisasi administrator",
    "7u4vzu": "Orang Slovakia",
    "7x3f6": "Tab - 1",
    "8259a": "Programmer: Mesin yang mengubah kopi menjadi kode. – Anonim",
    "82r0C": "Kelola daftar TODO Anda, dan selesaikan segala sesuatunya dengan lebih efisien.",
    "83dNp": "Tidak Dapat Memuat ID Ekstensi. (REF: 1dl1f)",
    "850c1": "Ilmuwan hanya memaksakan dua hal yaitu kebenaran dan keikhlasan, memaksakannya pada dirinya sendiri dan pada ilmuwan lain. - Erwin Schrödinger",
    "8582b": "Jika kita ingin pengguna menyukai perangkat lunak kita, kita harus merancangnya agar berperilaku seperti orang yang menyenangkan. – Alan Cooper",
    "8692e": "Ada banyak pengoceh, yang sama sekali tidak paham matematika, yang berani mengutuk hipotesis saya, berdasarkan otoritas beberapa bagian Alkitab yang diputarbalikkan agar sesuai dengan tujuan mereka. Saya tidak menghargai mereka dan mencemooh penilaian mereka yang tidak berdasar. –Nicholas Copernicus",
    "886d1": "Kami merasa bahwa meskipun semua pertanyaan ilmiah telah terjawab, permasalahan kehidupan masih belum terjamah sama sekali. – Ludwig Wittgenstein",
    "8LdRj": "Ringkasan",
    "8LdRjq": "Menghitung",
    "8LdevRj": "Melayani",
    "8M1wY": "Terminal Lokal",
    "8OqB7hN1s": "Halaman ini menyediakan gaya IDE UI untuk LafTools, tingkat abstraksi yang lebih tinggi untuk LafTools.",
    "8c224": "Apa pun bidang pekerjaan yang ingin Anda geluti, mempelajari setidaknya satu bahasa pemrograman sangatlah penting. - Ram Ray",
    "8e5d0": "Inovasi adalah panggilan masa depan. – Kofi Annan",
    "8eeL1Kk": "Tentang",
    "8mn_qa": "Mengambil data dari layanan terminal...",
    "8qzWJu": "Maaf, saat ini kami belum mendukung perangkat layar kecil, silakan gunakan PC untuk mengunjungi halaman ini.",
    "90b5e": "Ini bukan bug; itu adalah fitur yang tidak terdokumentasi. ― Anonim",
    "91f08": "Hal terbaik tentang teknologi adalah memungkinkan Anda berkonsentrasi pada visi Anda dan melupakan mesin. – John Landis",
    "9251d": "Inovasi adalah faktor kunci dalam kemampuan perusahaan mana pun untuk sukses dalam jangka panjang. -Elon Musk",
    "92b29": "Inovasi adalah proses mengambil ide kreatif dan mengubahnya menjadi kesuksesan komersial. -Richard Branson",
    "9334e": "Kemuliaan terbesar dalam hidup bukan terletak pada tidak pernah terjatuh, namun pada bangkit setiap kali kita terjatuh. - Nelson Mandela",
    "9412b": "Pertama, selesaikan masalahnya. Kemudian, tulis kodenya. – John Johnson",
    "9469a": "Setiap orang harus belajar memprogram komputer karena komputer mengajarkan Anda cara berpikir. –Steve Jobs",
    "97um9v": "Hawaii",
    "98KcL": "Mengonversi bilangan desimal menjadi Desimal Berkode Biner (BCD).",
    "98d3f": "Sains adalah keajaiban yang berhasil. – Kurt Vonnegut",
    "9Xv8-": "Simpan Sebagai Catatan",
    "9YPgsPid2M": "Kode SMS",
    "9_qaj": "Keluar dari Formulir ini",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Pembuat Enkode Base64",
    "9b_7a0sdf": "Dekoder Base64",
    "9cb71": "Inovasi adalah tentang menciptakan nilai bagi pelanggan dan meningkatkan kehidupan mereka. -Reed Hastings",
    "9d18a": "Perangkat lunak datang dari surga ketika Anda memiliki perangkat keras yang bagus. – Ken Olsen",
    "9e4fcl": "Tamil",
    "9eZHM": "Ups! Sepertinya kami menemui beberapa peringatan atau kesalahan.",
    "9gqo8x": "Latvia",
    "9m85mf": "Sesoto",
    "9qy1xn": "Portugis",
    "9tbbkt": "Finlandia",
    "9zCSc": "Tidak ada ruang kerja yang tersedia",
    "A69UZ": "Variabel",
    "AVUvu": "Base62 adalah notasi untuk menyandikan data byte arbitrer menggunakan serangkaian simbol terbatas yang mudah digunakan oleh manusia dan diproses oleh komputer. Basis angka yang tinggi menghasilkan string yang lebih pendek dibandingkan dengan sistem desimal atau heksadesimal.",
    "AW9N8": "Wilayah Masukan",
    "AfPC0": "Kata sandi teks biasa Anda",
    "Ahrjc": "Direktorinya tidak ada, apakah Anda ingin membuatnya?",
    "AkXgF": "Sedang Berlangsung: {0}%",
    "Apx8D": "Bagaimana Cara Mengatur Ulang Kata Sandi Anda Secara Manual?",
    "AvsWiJHLZ": "Sumber daya",
    "B-GCloBBt": "Mengompresi kode eXtensible Markup Language (XML).",
    "B0s0z": "Tujuan halaman ini:",
    "BGd7P9": "Operasi ini mengkodekan data mentah ke dalam string ASCII Base64.",
    "BGd7dP9": "Operasi ini mengkodekan data mentah ke dalam string ASCII {0}.",
    "BGdd7dP9": "Operasi ini mengkodekan data mentah ke dalam string ASCII {0}.",
    "BJbgR": "Laporkan Masalah",
    "BQs6go-dk": "Unduh Gratis LafTools untuk Windows, Linux, dan macOS.",
    "BShq3M": "Masalah",
    "BW3bpT": "Membaca file dari disk...",
    "Bd9h-": "Tambahkan ke koleksi favorit saya",
    "BuihG": "Pengaturan sistem",
    "C3L9MmdDU7": "Buku Pegangan",
    "CASef": "Oke, operasinya dipicu.",
    "CEv8B": "Apakah Anda yakin akan menghapus catatan ini? Jika ya, klik tombol ini lagi.",
    "CFg8B": "Ukuran harus antara 0 dan 512",
    "CK5NCw519": "Kisah Komunitas",
    "CVUl0": "alat laf",
    "CWoqhy": "Daftar Exts berdasarkan ID Kategori yang dipilih",
    "C_qzLO7yw": "Silakan gunakan Chrome, Firefox, atau Edge untuk pengalaman terbaik.",
    "CfZAX": "File {0} Dipilih, kami mengunggahnya ke layanan inti.",
    "CidOqAZ": "Sebagai pencipta LafTools, saya sangat tersentuh karena Anda bersedia mendukung kami. Kami memiliki orang-orang baik di tim kami yang bekerja keras untuk terus meningkatkan LafTools.",
    "Cide2w": "Untuk melihat apakah ada masalah saat menjalankan tindakan Anda.",
    "CqFdiBu6M": "Melihat",
    "Cz_qjjFw7": "Tentang {0}",
    "DIQFq": "Silakan periksa apakah parameter URL telah diberikan dengan benar, sepertinya Anda tidak memiliki izin untuk mengisi formulir ini. Secara default, Anda akan dapat melihat pesan di bawah ini pada keluaran layanan ketika baru saja diluncurkan.",
    "DIweGq": "Amankan LafTools Anda",
    "DSEtLTxUU": "Waktu adalah mata uang hidup Anda, gunakanlah dengan bijak.",
    "DTTPW": "Setel ulang status",
    "DVoKw": "Keluar dari Sistem ini",
    "DadYp": "Debounce Waktu Nyata",
    "DqFI5": "Level harus lebih besar dari 0",
    "DrXAq": "Selamat menggunakan LafTools!",
    "DrbEr": "Kata sandi yang Anda berikan kosong, silakan periksa dan coba lagi.",
    "DtlAc": "Memuat Sumber Daya Sistem",
    "Dxlw0": "Menyelesaikan",
    "E62ej": "Filter Perintah Shell",
    "E6F9B": "Tambahkan ke alur kerja",
    "EEQkeW": "Algoritma MD6 (Message-Digest 6) adalah fungsi hash kriptografi. Ia menggunakan struktur seperti pohon Merkle untuk memungkinkan komputasi hash paralel yang sangat besar untuk input yang sangat panjang.",
    "EO6Qv5dCA": "Memperkecil kode JSON, mengurangi ukuran bundel kode JSON Anda.",
    "ERK7E": "Jika Anda mengalami masalah apa pun atau memiliki saran saat menggunakan LafTools, jangan ragu untuk menghubungi kami melalui EMail atau GitHub kapan saja, kami bersedia untuk segera memperbaikinya.",
    "EgBXL": "Pilih atau berikan tag.",
    "Ewvgo": "Belum dimulai.",
    "ExqvX": "Daftar Tombol Pintas",
    "Eyq856": "Kami belum selesai - kami berdedikasi untuk menyediakan fitur terbaru dan terhebat, dan kami akan terus merilis pembaruan untuk memastikan Anda mendapatkan pengalaman terbaik.",
    "Ezsn81tfc": "Melihat",
    "F-OUm": "Pengaturan Cepat untuk LafTools",
    "F0CCF": "Daftar Tombol Pintas",
    "F4uS2": "File baru",
    "FAQ": "Pertanyaan yang Sering Diajukan",
    "FBVyc": "Silakan masukkan kembali kode verifikasi",
    "FDlRI": "Beri nama tab baru ini dan klik untuk mengonfirmasinya.",
    "FLsbFsOZq": "IDE",
    "FOyHW": "Cari Di Mana Saja",
    "FQzhg": "Abaikan Input Kosong",
    "FYRoL": "Mengindentasi dan mempercantik kode Cascading Style Sheets (CSS).",
    "FhVWl": "Enkripsi Kata Sandi Anda",
    "FjYbR": "Keluaran",
    "Fv-zz": "Salin Hasil",
    "Fy217": "Konfigurasikan Alat ini",
    "Fzp3t": "Harap berikan nilai di bidang ini",
    "G2dvTUljF": "Peralatan",
    "G3MJN": "Tampilkan Panel Keluaran",
    "G9QVo": "Kelola Tab",
    "GR7jK": "Jenis",
    "GaySMPQHo": "Sedang tren",
    "Ggob_": "Membatalkan",
    "H-Ae75": "Harap konfirmasi kata sandi lokal Anda.",
    "H-qA75": "Harap berikan kata sandi lokal.",
    "H8fQ4": "Beralih ke Mode Terang atau Gelap",
    "HEAhr": "Setelah diterjemahkan, hasilnya akan muncul di sini.",
    "HIc3c": "Lengkap",
    "HNDat": "Untuk melakukan perubahan, klik tombol \"{0}\". Jika tidak, klik \"{1}\" untuk menerapkan perubahan Anda. Semoga Anda bersenang-senang dengan kotak peralatan ini!",
    "Hflf2": "Demi keamanan cyber, kami tidak akan membantu mengatur ulang kata sandi Anda melalui API atau halaman di sini kecuali Anda memperbarui file yang dilindungi sistem secara manual.",
    "HjvV3": "Kami tidak akan menghapus file-filenya di disk, cukup hapus catatan ini dari daftar.",
    "HyIC_": "Tombol Tebas (/)",
    "HyIC_d": "Tombol Tebas (/)",
    "I8FLi": "Sekarang saatnya mengatur administrator Anda, harap atur kata sandi serumit mungkin sehingga Anda dapat membingungkan para penyerang yang tidak sopan itu.",
    "IAC0A": "Alat pencari",
    "ICefi": "Dibatalkan",
    "IEFy5k39X": "Generator",
    "IKqqATS": "Segarkan Data Halaman Saat Ini",
    "IOOrz": "(Apakah ini akan membahayakan sistem Anda? Menurut kami tidak, selama Anda dapat memodifikasi file konfigurasi yang disimpan sistem, itu berarti Anda diperbolehkan membaca segala sesuatu tentang file data LafTools.)",
    "IWPP6V-tR": "Kode sumber",
    "IWUH5": "Tunjukkan Contoh",
    "IaSyO": "Membatalkan",
    "Ibzs2-Ho1": "Alat CSV",
    "IfsGO": "Favorit",
    "IfsdGO": "Favorit",
    "ImUmf": "Baru",
    "IugAFc4OT": "Terjadi masalah saat mengirimkan data Anda.",
    "IxAJswoSh": "Parsing dan cetak cantik kode JavaScript yang valid. Juga berfungsi dengan Notasi Objek JavaScript (JSON).",
    "J-3KA": "Harap berikan nama untuk skrip ini, yang akan lebih membantu.",
    "J164i": "misalnya Salin file ke server jauh",
    "J2xoL": "Silakan lihat kesalahannya: {0}",
    "JA_Bp": "Harap berikan nama untuk tag baru terlebih dahulu.",
    "JQEVK": "Kode",
    "JQLmS": "Menyesuaikan ukurannya",
    "JQLmSq": "Lengkap.",
    "JTBRh": "LafTools menyimpan nilai kata sandi ke dalam file lokal, tapi jangan khawatir, kami mengadopsi mekanisme enkripsi kata sandi satu arah, artinya tidak ada yang bisa membaca kata sandi versi teks biasa. Untuk mengatur ulang kata sandi, silakan ikuti instrumen di bawah ini untuk mengatur ulang kata sandi Anda secara manual.",
    "JYqxz2": "Selamat datang di LafTools, ini adalah versi orang dalam.",
    "Jbor69IBw": "Pemformat",
    "JdqiUE8": "Operasi ini menerjemahkan data dari string ASCII (dengan alfabet pilihan Anda, termasuk preset) kembali ke bentuk aslinya.",
    "JdqidUE8": "Operasi ini menerjemahkan data dari string ASCII (dengan alfabet pilihan Anda, termasuk preset) kembali ke bentuk aslinya.",
    "JfFHw": "Dapatkan Permintaan Info Ruang Kerja",
    "JiUE8": "Operasi ini mendekode data dari string ASCII {0} kembali ke format aslinya.",
    "Jq7x3Igk0": "Coba Gaya UI Klien",
    "JuZAli3": "Panduan Pengguna",
    "K1qJZI": "Selamat datang di LafTools, Yang Mulia.",
    "KGS2-": "Setelah Anda menyelesaikan langkah-langkah di atas, Anda dapat menggunakan kata sandi baru untuk masuk ke sistem Anda. Jika Anda tidak dapat mengakses sistem file, mintalah administrator atau dukungan TI Anda untuk membuat file tersebut. Jika file sudah ada, hapus dan buat kembali yang baru.",
    "KIc63": "Fungsi belum didukung",
    "KYh1N": "Semua Catatan",
    "KcqrRr": "Referensi",
    "KcrRr": "Mengambil Data Implementasi Kode",
    "KmEUF": "Memberikan gambaran singkat tentang alat sistem saat ini.",
    "Kw4OJr": "Terminal",
    "Kyd9H": "Kode Sumber di GitHub",
    "L-p-Y": "Salin konten perintah shell saat ini ke clipboard",
    "L3zEM": "Tunjukkan Contoh",
    "L42mxa": "Silakan masukkan teks sumber Anda di bidang ini.",
    "L49kCq": "Harap berikan dan konfirmasi kata sandi kunci dalam formulir ini untuk mengamankan LafTools Anda.",
    "L71q_N": "Kata sandi yang Anda berikan kosong, silakan periksa dan coba lagi.",
    "L9bQku": "Dekode {0}",
    "L9qbQku": "Dekode {0}",
    "LAc1m": "Menyegarkan tampilan aplikasi.",
    "LFdvM": "Belum masuk",
    "LM715": "Mengambil konfigurasi i18n dari API server lokal",
    "LPJrV": "Salin Hasil",
    "LSohY6eZW": "Hex String adalah string byte heksadesimal yang dipisahkan oleh pembatas, yang dapat berupa spasi, koma, titik koma, atau titik dua.",
    "LU9Jj": "Base85 (juga disebut Ascii85) adalah notasi untuk menyandikan data byte arbitrer. Biasanya lebih efisien daripada Base64. Operasi ini mendekode data dari string ASCII (dengan alfabet pilihan Anda, termasuk preset). Base85 umumnya digunakan dalam format file Adobe PostScript dan PDF.",
    "LWaeFqd": "Beralih ke bahasa pilihan Anda",
    "Le71_N-": "Kata sandi yang Anda berikan tidak sama dengan kata sandi yang telah dikonfirmasi, silakan periksa dan coba lagi.",
    "LnJ4H": "Perhatikan bahwa akun lokal sama sekali tidak sama dengan pengguna terdaftar di situs web kami, akun lokal hanya ditentukan di PC Anda sedangkan akun lokal dapat digunakan untuk sinkronisasi cloud.",
    "LqWaFd": "Pengaturan sistem",
    "LxaEFHbfa": "Memperkecil kode SQL, mengurangi ukuran bundel kode SQL Anda.",
    "M3qytc": "Menyandikan {0}",
    "M3ytc": "Menyandikan {0}",
    "M4ywN1": "Kalkulator, Kalender, Jam, Cuaca, dan lainnya.",
    "M6MrW": "Bagus",
    "M7jct": "Masuk ke Mode Layar Penuh",
    "MN2lT": "Panjang Kata Sandi tidak boleh kurang dari 6",
    "Ma5mv": "Alihkan visibilitas tab toolbar",
    "Mq9pdpT": "Cantumkan semua sumber daya yang relevan untuk menu fungsional yang Anda pilih.",
    "Mq9ppT": "Lihat status layanan Anda dengan cepat",
    "Mqq9pdpT": "Membantu Anda memulai dengan LafTools.",
    "MrgmU": "Mengonfirmasi",
    "NMLOn": "Salin Jalur File",
    "NMLOn1": "Buka Ruang Kerja",
    "NNfJo": "Muat Data dari File",
    "Nq1IR": "Tidak Dapat Memuat VM Ekstensi",
    "Nqc0LqwX": "Jika menurut Anda ada kerentanan dalam proses ini, jangan ragu untuk menghubungi kami melalui EMail atau GitHub kapan saja, kami ingin segera memperbaikinya.",
    "NrQc8OJfZ": "Mengompresi kode Notasi Objek JavaScript (JSON).",
    "O02-W": "Tidak memuat...",
    "O94Yx": "pada",
    "OBjaZqTvx": "Rumah",
    "OO0qPN": "Contoh Dimuat",
    "OQWm4": "Laporkan Bug",
    "OSHOI": "Halaman Selamat Datang",
    "OSqZQM": "Kata Sandi Lokal",
    "OeO0PeN": "Oke, contohnya ditampilkan di editor input.",
    "OeOQY": "MELAKUKAN",
    "Ol1ZcWomT": "{0} Mempercantik",
    "OpPFe": "Jika Anda menyukai LafTools, silakan bagikan dengan teman Anda dan beri kami bintang, terima kasih!",
    "Opcty": "File",
    "OqqGx2qg": "Memuat sumber daya statis, harap tunggu...",
    "OrCt5": "Mengarahkan ke meja kerja...",
    "Ot6EP": "Alat Polandia",
    "OyZLZokUQ": "Berdayakan Pembangunan dengan LafTools!",
    "P4ROa": "Wilayah Keluaran",
    "PM_N5": "Sesi - {0}",
    "PUxuU": "Mengambil data untuk paket bahasa...",
    "PapkF": "Jika Anda memiliki pertanyaan atau saran tentang LafTools, silakan beri tahu kami. Kami selalu mencari cara untuk meningkatkan produk kami dan memberikan pengalaman terbaik bagi pengguna kami. Anda dapat menghubungi kami di work7z@outlook.com. Terima kasih telah menggunakan LafTools!",
    "PpCHA": "Kunci Pertanyaan(?)",
    "PqazM-": "Pertama-tama, silakan gunakan kontrol formulir di bawah ini untuk mengenkripsi kata sandi Anda",
    "QL9Sn": "Saat ini, tampaknya belum ada deskripsi yang tersedia.",
    "QLKzF": "Ini dikemas dengan fitur-fitur yang memenuhi kebutuhan pengembang pemula dan berpengalaman, menjadikannya alat yang harus dimiliki di gudang senjata programmer mana pun.",
    "QM2Ob": "Alat Terbaru",
    "QM2Oq": "Catatan Terbaru",
    "QRAdA": "Bahasa Inggris ke Bahasa Mandarin",
    "QZK58Gemi": "Mengompresi kode Structured Query Language (SQL).",
    "QhdpH": "Edisi Komunitas",
    "QkJ-TOduip6z_": "IDE LafTools",
    "QvBKp9BBp": "Pelajari lebih lanjut tentang perencanaan pengembangan LafTools.",
    "QzlA3": "Terjadi kesalahan",
    "R12bq": "Daftar tab yang tidak ditampilkan",
    "RNBze0": "Peralatan",
    "RNeBze0": "Tab yang Dibuka",
    "RNewBze0": "Konfigurasi Alat",
    "RO4ZP": "Terjadi kesalahan",
    "RPVRl": "Tampaknya ekstensi ini tidak kompatibel dengan versi LafTools saat ini. Harap pertimbangkan untuk menginstal versi terbaru untuk mendukung ekstensi ini, atau jangan ragu untuk menghubungi kami dengan menyampaikan masalah di GitHub.",
    "RhqzcdD": "Pengaturan sistem",
    "RjCO3": "Daftar Ruang Kerja",
    "RjdigcxfV": "Hubungi kami",
    "S4MMV": "Ups! Kami menemukan beberapa masalah saat memuat file.",
    "SAnnQ": "Memuat berkas {0}",
    "SBsDz": "Pengaturan untuk Akun Admin Anda.",
    "SGs7B": "Siapkan LafTools Anda dengan Cepat",
    "SMqD13": "Masukkan untuk memfilter",
    "SPem9": "Bidang ini belum siap.",
    "SQAw7": "Bahasa sumber",
    "SYSq1": "Contoh",
    "SZgXb": "Siapkan Kata Sandi Lokal",
    "SdGcT": "Bagian lain",
    "Sm9tq": "Silakan berikan kata sandi akun di sini",
    "Sm9tqq": "Harap berikan kata sandi untuk membuka kunci LafTools Anda",
    "Spcfdee": "Mode Terang atau Gelap",
    "TBPqy7": "Bahasa",
    "TD7DA": "Bahasa",
    "TNoePE": "Awan LafTools",
    "TV09-obNr": "Tonggak pencapaian",
    "Ttrqqet": "Tulis dan Simpan pemikiran Anda di sini!",
    "TwFcr": "Bahasa Sasaran",
    "TyqvWY3": "File Lokal",
    "U2ZNl": "Pelajari lebih lanjut di Wikipedia",
    "U4qqq9": "Hapus tab ini dari daftar",
    "U7zP2": "Harap berikan nama pengguna akun di sini",
    "UED59zbd-": "alat laf",
    "UF_Dp": "Terjadi Kesalahan: {0}, waktu yang ditolak adalah {1}",
    "UVvJp-vtF": "{0} Perkecil",
    "UZ2Ig": "Akun Lokal Baru",
    "Ugpng": "Favorit",
    "UjkOS50wO": "Rumah",
    "V2A74ySoN": "Melihat",
    "V6U_f": "Ketentuan Layanan",
    "V6XEO": "Masukkan nama pengguna atau Email",
    "VAZq8r": "Hal ini memungkinkan pengembang untuk menjalankan berbagai perintah, seperti menjalankan skrip, menginstal paket, dan menavigasi sistem file, semuanya dari dalam editor.",
    "VEfeqZG": "Catatan",
    "VI6VT": "Sejarah",
    "VOsZc": "Laporkan Masalah",
    "VSZ": "Klik untuk memicu kembali",
    "VZtqg6": "Buat Formulir Skrip Baru",
    "Vaf2y": "Nama tab wajib diisi.",
    "VeY9K": "Syarat Penggunaan",
    "VgG5y": "Klik di sini untuk menyegarkan status ekstensi Anda",
    "VjZCv": "Konversi Waktu Nyata",
    "Vvt09V2Qo": "Kode Generik",
    "WFUWzv_px": "Parsing dan cetak cantik kode JavaScript yang valid. Juga berfungsi dengan Notasi Objek JavaScript (JSON).",
    "WKG7e": "Aturan",
    "WPrTW": "Situs Resmi",
    "WXo6D": "Disegarkan",
    "WYCVL": "Pengaturan Cepat",
    "X4L_Z": "Ekstensi VM tidak disediakan.",
    "X6Fq4j": "Setelah bertahun-tahun melakukan pengembangan dan penyempurnaan khusus, kami yakin bahwa LafTools dapat meningkatkan pengalaman pemrograman Anda secara signifikan dengan menghadirkan lebih banyak kenyamanan dan efisiensi pada alur kerja Anda.",
    "XKpI0": "Klik untuk memproses teks Anda di wilayah input",
    "XLWoR": "Pilih yang Anda sukai dan lanjutkan",
    "XQxJB": "Ruang Kerja Saya",
    "X_HGx": "LafTools adalah kotak peralatan serbaguna yang dirancang untuk memenuhi berbagai kebutuhan. Ini sepenuhnya open-source, memastikan transparansi dan keamanan. Meskipun runtimenya ringan, ia menawarkan dukungan platform penuh, termasuk ARMv8, dan dukungan AI asli yang mirip dengan ChatGPT. LafTools sangat terintegrasi dengan UI yang produktif dan terus diperbarui dengan alat-alat baru. Ini dapat digunakan melalui web dan dengan Docker, dan menyediakan sumber daya tambahan seperti catatan dan manual.",
    "XeXF77": "Pengaturan",
    "XikdD": "Mohon tunggu sebentar, kita hampir sampai!",
    "Y5GAC": "Nama pengguna Anda",
    "Y9mQ2": "Harap berikan nama pengguna akun di sini",
    "YAAU3q": "Kata Sandi Lokal",
    "YHCjT": "LafTools mendukung tema terang dan gelap global, ini berguna khususnya dengan pembuat kode shift malam.",
    "YNwKz": "Bahasa tidak didukung: {0}, akan menggunakan bahasa Inggris secara default.",
    "YOYTp": "Pengaturan Cepat",
    "YPPPL": "Alihkan visibilitas tab toolbar",
    "YQN9u": "Terjadi Kesalahan saat memuat {0}, silakan periksa detail di bawah.",
    "Y__Zb1_4Q": "Meminimalkan kode Cascading Style Sheets (CSS), menghapus semua karakter yang tidak perlu.",
    "Y_k0z": "Tidak ingat kata sandi?",
    "Ye3TXses": "Untuk mengonfigurasi apakah transformasi akan dijalankan secara otomatis ketika teks input diubah.",
    "Ylq2X": "Koreksi kesalahan",
    "YquQqTXq": "Jalankan Otomatis?",
    "YrTdq": "Semua",
    "YrVq683": "Surat",
    "YrVqdd683": "manual",
    "Z2QTU": "Tentang",
    "Z3rhY": "Pesan",
    "Z7ALO": "Beralih ke ruang kerja yang dipilih",
    "Z7OTt": "File yang Anda pilih terlalu besar, silakan pilih file kurang dari 30MB.",
    "ZAGva": "Apakah Anda yakin akan menghapus ruang kerja ini?",
    "ZAKaFq": "Akun Cloud Saya",
    "ZCzH8": "Terbaru",
    "ZW1Dgz": "Tidak Ada Pesan yang Tersedia",
    "ZXRGC": "Silakan lihat kesalahannya: {0}",
    "ZaS8MP8cr": "Catatan: Kode verifikasi telah disegarkan, harap sesuaikan nilai formulir Anda dan masukkan kembali kode untuk melanjutkan.",
    "ZbD3F": "{0}, dibuat oleh tim LafTools",
    "Zk7JI": "Itu belum didukung",
    "ZrbduC": "Tutup semua tab",
    "ZrbuC": "Tutup Tab",
    "_5OqeG": "Hapus tanda itu",
    "_LFF3": "Jika Anda mengalami masalah apa pun atau memiliki saran saat menggunakan LafTools, jangan ragu untuk menghubungi kami melalui EMail atau GitHub kapan saja, kami bersedia memperbaikinya.",
    "_trez": "Tukar Teks",
    "_trqL": "Mengambil data untuk sumber daya sistem...",
    "_z3lR": "Segarkan Kode",
    "a0ab0": "Seni adalah pohon kehidupan. Sains adalah pohon kematian. –William Blake",
    "a2849": "Sains adalah penerimaan terhadap apa yang berhasil dan penolakan terhadap apa yang tidak berhasil. Hal ini membutuhkan lebih banyak keberanian daripada yang kita kira. –Jacob Bronowski",
    "a3508": "Berbekal panca inderanya, manusia menjelajahi alam semesta di sekelilingnya dan menyebut petualangan itu Sains. –Edwin Hubble",
    "a3yqoz": "Orang Persia",
    "a3z-3k12": "Alat Alamat IP",
    "a4jbpq": "Ceko",
    "a5354": "Sungguh aneh bahwa hanya penemuan-penemuan luar biasa buatan manusia yang kemudian muncul begitu mudah dan sederhana. – George C.Lichtenberg",
    "a7062": "Inovasi adalah percikan yang memicu kemajuan. -Robyn M. D'Angelo",
    "a8a34": "Inovasi adalah kartu panggil masa depan. -Anna Eshoo",
    "a8dd9": "Kehidupan tidak bisa mempunyai awal yang acak... masalahnya adalah ada sekitar 2000 enzim, dan peluang untuk memperoleh semuanya dalam percobaan acak hanya satu bagian dalam 10^40.000 suatu kemungkinan yang sangat kecil yang tidak dapat dihadapi bahkan jika seluruh alam semesta terdiri dari sup organik. –Fred Hoyle",
    "aCkOP": "KELUAR",
    "aHAfR": "Mengambil data untuk {0}...",
    "aISK9iYc_": "Laporan Informasi Ilegal",
    "aSOpr": "Penghasil Model Data",
    "aa2f1": "Eksplorasi adalah apa yang Anda lakukan ketika Anda tidak tahu apa yang Anda lakukan. Itulah yang dilakukan para ilmuwan setiap hari. Jika seorang ilmuwan sudah mengetahui apa yang mereka lakukan, mereka tidak akan menemukan apa pun, karena mereka sudah mengetahui apa yang mereka lakukan. – Neil deGrasse Tyson",
    "aa3a4": "Kode itu seperti humor. Ketika Anda harus menjelaskannya, itu buruk. – Rumah Cory",
    "ab5f7": "Aspek kehidupan yang paling menyedihkan saat ini adalah sains mengumpulkan pengetahuan lebih cepat daripada masyarakat mengumpulkan kebijaksanaan. – Ishak Asimov",
    "about_LafTools_toolbox": "Tentang LafTools",
    "ac615": "Jadikan berhasil, lakukan dengan benar, lakukan dengan cepat. – Kent Beck",
    "adcca": "Orang bodoh mana pun bisa menulis kode yang bisa dimengerti komputer. Pemrogram yang baik menulis kode yang dapat dipahami manusia. -Martin Fowler",
    "adpgq": "Buat ruang kerja baru",
    "af3158": "Semuanya ditentukan... oleh kekuatan yang tidak dapat kita kendalikan. -Albert Einstein",
    "afcb9": "Tidak ada yang memiliki kekuatan untuk memperluas pikiran selain kemampuan untuk menyelidiki secara sistematis dan sungguh-sungguh semua yang Anda amati dalam hidup. – Marcus Aurelius",
    "afe52": "Selalu ada satu bug lagi yang harus diperbaiki. – Ellen Ullman",
    "ah-C4": "Catatan Baru",
    "aj3nhd": "Jerman",
    "aked6": "Referensi",
    "aked61": "Perkenalan",
    "asElV": "Menghapus",
    "az4uS2": "Apakah Anda yakin untuk keluar dari sistem ini? Perhatikan bahwa Anda akan diarahkan ke halaman login.",
    "azpNX": "Lengkap.",
    "azsd": "Navigasi Cepat",
    "b0qjSL": "Silakan masuk ke direktori {1} dan buat berkas {2}, masukkan kata sandi terenkripsi Anda sebagai seluruh isi berkasnya.",
    "b194e": "Inovasi datang dari produsen – bukan dari pelanggan. -W. Edwards Deming",
    "b19bb": "Saat ilmu pengetahuan mulai mempelajari fenomena non-fisik, ilmu pengetahuan akan mengalami kemajuan lebih besar dalam satu dekade dibandingkan abad-abad sebelumnya keberadaannya. – Nikola Tesla",
    "b2724": "Pemrograman adalah seni memberitahu manusia lain apa yang diinginkan komputer untuk dilakukan. - Donald Ervin Knuth",
    "b4603": "Hidup adalah apa yang terjadi ketika Anda sibuk membuat rencana lain. —John Lennon",
    "b5014": "Banyak dari kegagalan hidup adalah orang-orang yang tidak menyadari betapa dekatnya mereka dengan kesuksesan ketika mereka menyerah.– Thomas A. Edison",
    "b6sx9b": "Filipina",
    "b7wgrhuXl": "Teknologi",
    "bP_6qG": "Tips Lupa Kata Sandi Anda",
    "bT4R6": "Tab baru",
    "bVlBN": "Bahasa Cina ke Bahasa Inggris",
    "bWQunyU10": "Laboratorium AI",
    "bc574": "Inovasi adalah sumber kehidupan bisnis yang sehat. -Tandai Kuba",
    "bc92f": "Inovasi yang sukses dimulai dengan kebutuhan pelanggan. -Michael Dell",
    "be-Favourite-it": "Tambahkan ke Favorit",
    "beb6e": "Ide itu mudah. Implementasinya sulit. -Pria Kawasaki",
    "bfb8e": "Inovasi adalah kunci untuk tetap relevan dan kompetitif di pasar. -Mark Zuckerberg",
    "bhojei1": "Cina tradisional",
    "bjZyW": "Menerjemahkan",
    "bors14": "Turki",
    "bp_-b": "Untuk mengelola LafTools sepenuhnya, Anda perlu menyiapkan administrator Anda di awal alur penyiapan. Kami telah memverifikasi identifikasi Anda dengan token parameter URL, yakinlah bahwa tidak ada orang lain yang dapat mengatur izin root Anda kecuali dia mendapatkan token pengaturan.",
    "bqqrij": "Swahili",
    "bsWpBA73s": "Mengompresi kode JavaScript.",
    "c0eCw": "Terjemahkan teks Anda ke dalam bahasa apa pun yang Anda inginkan.",
    "c5meku": "Sunda",
    "c7Uoqqe": "Sebelum menggunakan LafTools, harap berikan dan konfirmasi kata sandi lokal Anda seperti di bawah ini.",
    "c7cfc": "Tes yang baik adalah tes yang memiliki kemungkinan besar memecahkan kode jika ada masalah - Michael Bolton",
    "cMBqyyFae": "Mengindentasi dan mempercantik kode Structured Query Language (SQL).",
    "cNQp_": "Sumber daya",
    "cPS6q": "Semua Alat",
    "cQqwI8r": "Memuat status Layanan Terminal",
    "cae2c": "Inovasi adalah proses mengambil ide dan mengubahnya menjadi kenyataan. -Neil Lawrence",
    "cd4d1": "Inovasi adalah kunci pertumbuhan bisnis. -Andrew R.Steinberg",
    "cfYYN": "Temukan Lebih Banyak",
    "ciZV2": "Base32 adalah notasi untuk menyandikan data byte arbitrer menggunakan serangkaian simbol terbatas yang mudah digunakan oleh manusia dan diproses oleh komputer. Ini menggunakan kumpulan karakter yang lebih kecil dari Base64, biasanya alfabet huruf besar dan angka 2 hingga 7.",
    "ciZV21": "Base45 adalah notasi untuk menyandikan data byte arbitrer menggunakan serangkaian simbol terbatas yang mudah digunakan oleh manusia dan diproses oleh komputer. Basis angka yang tinggi menghasilkan string yang lebih pendek dibandingkan dengan sistem desimal atau heksadesimal. Base45 dioptimalkan untuk penggunaan dengan kode QR.",
    "ciZV2deq1": "Base58 (mirip dengan Base64) adalah notasi untuk menyandikan data byte arbitrer. Ini berbeda dari Base64 dengan menghapus karakter yang mudah salah dibaca (yaitu l, I, 0 dan O) untuk meningkatkan keterbacaan manusia. Base58 umumnya digunakan dalam cryptocurrency (Bitcoin, Ripple, dll).",
    "cj1pd": "Segarkan Operasi",
    "cjzqj9": "Bosnia",
    "cmxzpg": "Malayalam",
    "coM2I": "Gunakan Editor Cerdas",
    "crD7I": "Untuk mengonfigurasi apakah transformasi harus mengabaikan teks masukan kosong yang panjangnya nol.",
    "cuRCb": "Kategori tidak ditemukan.",
    "cuRCqb": "Kategori tidak ada",
    "cxqhqa": "Myanmar (Burma)",
    "d-l2l": "Mengonfirmasi",
    "d-qPr": "Tata letak tidak diketahui: {0}",
    "d0624": "Inovasi bukan sekedar menghasilkan ide-ide baru, namun juga bagaimana mengeksekusi ide-ide tersebut secara efektif. -Jeff Bezos",
    "d10c9": "Inovasi adalah kunci untuk membuka potensi baru dan membuka pasar baru. -Tim Masak",
    "d1820": "Sampai manusia menduplikasi sehelai rumput, alam dapat menertawakan apa yang disebut sebagai pengetahuan ilmiah. – Thomas Edison",
    "d366a": "Inovasi adalah kunci untuk membuka pertumbuhan baru. -Philip Kotler",
    "d5KZH": "Terima kasih telah menggunakan LafTools!",
    "d5LAU": "Berlisensi di bawah AGPLv3",
    "d5fmq2": "Italia",
    "d5hit": "Sesi - {0}",
    "d5x1rl": "Orang Spanyol",
    "d7dc4": "Pengujian adalah proses mengevaluasi suatu sistem atau komponennya dengan maksud untuk mengetahui apakah memenuhi persyaratan yang ditentukan atau tidak - Anonymous",
    "dCFIC": "Kode Lebih Cantik",
    "dCFIwC": "Pembuat Kode",
    "dGKMx": "Keluaran",
    "dGVUB": "Alat Jaringan",
    "dO6b2Tkqwe": "Alat yang Baru Digunakan",
    "dQwjNbi0y": "Pelajari lebih lanjut tentang Dokumentasi",
    "dV5Eq": "Segarkan daftar ruang kerja",
    "da74c": "Spekulasi dan eksplorasi ide-ide di luar apa yang kita ketahui dengan pasti itulah yang membawa kemajuan. –Lisa Randall",
    "dc662": "Satu-satunya kesalahan nyata adalah kesalahan yang tidak membuat kita belajar apa pun - John Powell",
    "dcebe": "Jika debugging adalah proses menghilangkan bug perangkat lunak, maka pemrograman harus menjadi proses memasukkannya ke dalam - Edsger Dijkstra",
    "ddcc7": "Inovasi adalah kunci keberhasilan dalam perekonomian modern. -Satya Nadella",
    "ddsdf3159": "Fisika sebenarnya tidak lebih dari pencarian kesederhanaan tertinggi, namun sejauh ini yang kita miliki hanyalah kekacauan yang elegan. -Bill Bryson",
    "de47c": "Pengujian adalah seni menemukan kotak hitam dan membuatnya bernyanyi - James Bach",
    "dk122q": "Kelola alur kerja Anda untuk menggabungkan beberapa alat secara bersamaan.",
    "dkarh": "Oke, kotak alat membuka direktori. Jika tidak ada jendela pop-up, periksa apakah platform Anda mendukung fungsi ini, atau direktorinya ada di server.",
    "dkjk12": "ini adalah ujian",
    "dkkq12": "Konfigurasikan alat Anda di tab ini.",
    "dl4kr": "Tidak ingat kata sandi?",
    "download-local": "Download Gratis",
    "dpRY4": "Kamus",
    "dqTqyvWY": "Menu Laci",
    "dsdpA_eJ": "Sesuaikan Ukuran",
    "dtjdt4": "Kazakh",
    "dxLQq": "Izin Akar",
    "dzjTo": "Silakan berikan kata sandi akun di sini",
    "e--gB": "ID Ekstensi tidak diberikan.",
    "e097e": "Inovasi adalah tentang menciptakan kemungkinan-kemungkinan baru, bukan sekedar produk baru. -Tony Robbins",
    "e2379": "Kita hidup dalam masyarakat yang sangat bergantung pada ilmu pengetahuan dan teknologi, dimana hampir tidak ada orang yang mengetahui apapun tentang ilmu pengetahuan dan teknologi. – Carl Sagan",
    "e3WgQaZlb": "Kompres {0}",
    "e4Cd8t": "Basis85",
    "e5rycw": "Kirgistan",
    "e8Crq": "Silakan isi kolom nama pengguna dan kata sandi di bawah ini untuk melanjutkan.",
    "e984f": "Kode yang bersih selalu terlihat seperti ditulis oleh seseorang yang peduli. — Robert C.Martin",
    "eTmq": "Sejarah Kotak Alat CodeGen",
    "e_8pZ": "Kotak peralatan serbaguna bagi pengembang untuk meningkatkan produktivitas.",
    "ea227": "Cara terbaik untuk memprediksi masa depan adalah dengan menciptakannya. -Peter Drucker",
    "ediql2": "Hongaria",
    "ee7d0": "Perasaan kagum yang dapat diberikan sains kepada kita adalah salah satu pengalaman tertinggi yang mampu dimiliki oleh jiwa manusia. –Richard Dawkins",
    "egkqC8t": "Basis58",
    "egkqCd8t": "Basis62",
    "eifoni": "Katalan",
    "englishcorner": "Bahasa inggris",
    "eqkqd4W": "Harap berikan nama untuk tag baru",
    "etV-l": "Salin File ke SIT2",
    "eu5mh0": "Belarusia",
    "euaI8": "Buat Akun Lokal Baru",
    "euhy9v": "Estonia",
    "f0d15": "Komputer itu cepat; pengembang membuatnya tetap lambat. – Anonim",
    "f12bb": "Inovasi adalah kekuatan pendorong kemajuan dalam dunia bisnis. Ini adalah proses menghasilkan ide-ide baru dan mengubahnya menjadi produk, layanan, atau proses nyata yang memberikan nilai kepada pelanggan.",
    "f23c2": "Inovasi membedakan antara pemimpin dan pengikut. -Steve Pekerjaan",
    "f29b1": "Kemajuan dicapai melalui percobaan dan kegagalan; kegagalan umumnya seratus kali lebih banyak dibandingkan keberhasilan, namun kegagalan tersebut biasanya tidak dicatat. –William Ramsay",
    "f3151": "Resiko terbesar adalah tidak mengambil resiko apapun. -Mark Zuckerberg",
    "f3159": "Matematika adalah permainan yang dimainkan menurut aturan sederhana tertentu dengan tanda tidak berarti di atas kertas. -David Hilbert",
    "f315e7": "Matematika tidak mengenal ras atau batasan geografis. -David Hilbert",
    "f3160": "Matematika adalah hakim tertinggi; dari keputusannya tidak ada banding. -Tobias Dantzig",
    "f3161": "Dalam matematika, seni mengajukan pertanyaan harus mempunyai nilai yang lebih tinggi daripada menyelesaikannya. -Georg Penyanyi",
    "f3162": "Matematika adalah tempat di mana Anda dapat melakukan hal-hal yang tidak dapat Anda lakukan di dunia nyata. -Marcus du Sautoy",
    "f3163": "Kemajuan dan kesempurnaan matematika erat kaitannya dengan kesejahteraan negara. -Napoleon Bonaparte",
    "f3164": "Hakikat matematika terletak pada kebebasannya. -Georg Penyanyi",
    "f3165": "Matematika adalah ilmu tentang apa yang jelas dengan sendirinya. -Carl Jacobi",
    "f3166": "Matematika, jika dilihat dengan benar, tidak hanya memiliki kebenaran, namun juga keindahan tertinggi. -Bertrand Russel",
    "f3167": "Matematika adalah alat yang secara khusus cocok untuk menangani konsep-konsep abstrak apa pun. -P. Dirak",
    "f3168": "Matematika mengungkap rahasianya hanya kepada mereka yang mendekatinya dengan cinta murni, demi keindahannya sendiri. -Archimedes",
    "f3169": "Matematika adalah ciptaan jiwa manusia yang paling indah dan paling kuat. -Stefan Banach",
    "f3170": "Ahli matematika tidak mempelajari matematika murni karena berguna; dia mempelajarinya karena dia menyukainya dan dia menyukainya karena itu indah. -Henri Poincare",
    "f3171": "Pembelajaran matematika, seperti Sungai Nil, dimulai dari hal yang kecil namun berakhir dengan keagungan. -Charles Caleb Colton",
    "f318e4": "Biologi adalah teknologi paling kuat yang pernah diciptakan. DNA adalah perangkat lunak, protein adalah perangkat keras, sel adalah pabrik. -Arvind Gupta",
    "f31d71": "Fisika, mudah-mudahan, sederhana. Fisikawan tidak. -Edward Teller",
    "f31d75": "Fisika sebenarnya tidak lebih dari pencarian kesederhanaan tertinggi, namun sejauh ini yang kita miliki hanyalah kekacauan yang elegan. -Bill Bryson",
    "f31e53": "Matematika adalah ratunya ilmu pengetahuan. -Carl Friedrich Gauss",
    "f31q52": "Matematika murni, pada hakikatnya, adalah puisi ide-ide logis. -Albert Einstein",
    "f31q54": "Kitab alam ditulis dalam bahasa matematika. -Galileo Galilei",
    "f31q56": "Matematika adalah musik nalar. -James Joseph Sylvester",
    "f31q58": "Matematika bukan tentang angka, persamaan, perhitungan, atau algoritma: matematika adalah tentang pemahaman. -William Paul Thurston",
    "f31q70": "Biologi adalah ilmu. Evolusi adalah konsep yang menjadikan biologi unik. -Jared Berlian",
    "f31q72": "Biologi adalah puisi dunia fisik, dan biologi manusia adalah puisi alam semesta kita. -Julian Casablancas",
    "f31q74": "Biologi hanyalah fisika yang mulai berbau tidak sedap. -Nigel Calder",
    "f31q81": "Fisika adalah ilmu tentang gerak dan tindakan benda fisik yang dipahami berdasarkan sebab dan akibat. -Arthur Compton",
    "f31qe82": "Biologi adalah proses perangkat lunak. Tubuh kita terdiri dari triliunan sel, yang masing-masing diatur oleh proses ini. Anda dan saya berjalan-jalan dengan perangkat lunak usang yang berjalan di tubuh kita, yang berkembang di era yang sangat berbeda. -Ray Kurzweil",
    "f31r83": "Fisika menjadi terlalu sulit bagi para fisikawan. -David Hilbert",
    "f31sq66": "Biologi itu kimia, kimia itu fisika, fisika itu matematika. -Matt Ridley",
    "f31x76": "Biologi adalah ilmu yang mempelajari hal-hal kompleks di alam semesta. Fisika adalah ilmu yang mempelajari hal-hal sederhana. -Richard Dawkins",
    "f31x77": "Fisika adalah pengalaman, disusun dalam tatanan ekonomis. -Ernst Mach",
    "f3d169": "Fisika adalah satu-satunya ilmu pengetahuan yang nyata. Selebihnya hanya sekedar mengoleksi prangko. -Ernest Rutherford",
    "f3d179": "Fisika menjadi begitu rumit sehingga dibutuhkan waktu lebih lama untuk melatih seorang fisikawan. Faktanya, dibutuhkan waktu yang sangat lama untuk melatih seorang fisikawan agar ia memahami hakikat permasalahan fisika sehingga ia sudah terlalu tua untuk menyelesaikannya. -Eugene Wigner",
    "f3d180": "Biologi adalah ilmu tentang kehidupan, namun banyak dari kita yang tidak memahami dasar-dasar tubuh kita sendiri. -Kathy Reichs",
    "f3e155": "Matematika adalah pintu dan kunci ilmu pengetahuan. -Roger Bacon",
    "f3q178": "Biologi bukanlah takdir. Itu tidak lebih dari sekedar kecenderungan. Itu hanyalah cara alam yang cepat dan kotor untuk menghitung daging. Keripik adalah takdir. -Bart Kosko",
    "f3sd162": "Biologi adalah studi tentang hal-hal rumit yang tampaknya dirancang dengan suatu tujuan. -Richard Dawkins",
    "f3sd164": "Biologi memberi Anda otak. Hidup mengubahnya menjadi pikiran. -Jeffrey Eugenides",
    "f3sd165": "Dalam fisika, Anda tidak perlu membuat masalah untuk diri Anda sendiri - alam melakukannya untuk Anda. -Frank Wilczek",
    "f3sq167": "Hal yang baik tentang sains adalah bahwa sains itu benar, terlepas dari apakah Anda mempercayainya atau tidak. -Neil deGrasse Tyson",
    "f3ttw8": "Maori",
    "f477b": "Pemrograman adalah seni desain algoritme dan keahlian men-debug kode yang salah. – Ellen Ullman",
    "f5bLC": "Dokumentasi",
    "f7akol": "Bahasa inggris",
    "f7cf7": "Sebenarnya ada dua hal, sains dan opini; yang pertama menghasilkan pengetahuan, yang kedua menghasilkan ketidaktahuan. – Hipokrates",
    "f814a": "Ketika saya menulis kode ini, hanya Tuhan dan saya yang mengerti apa yang saya lakukan. Sekarang hanya alat Tuhan. – Anonim",
    "f96ff": "Inovasi adalah pendorong kemajuan dan kesuksesan dalam bisnis. -Satya Nadella",
    "fBP5h": "Nama belakang",
    "fEr5j": "Buat Skrip Baru",
    "fV_1P": "Masuk",
    "fa94e": "Inovasi adalah kunci untuk tetap menjadi yang terdepan dalam persaingan yang kompetitif. -Paul Sloane",
    "fc805": "Inovasi adalah kreativitas dengan tugas yang harus dilakukan. –Tom Peters.",
    "fd3173": "Fisika adalah imajinasi dalam jaket lurus. -John Moffat",
    "fdd2b": "Sains adalah pengetahuan yang terorganisir. Kebijaksanaan adalah kehidupan yang terorganisir. – Immanuel Kant",
    "fdxluz": "Rumania",
    "ff02c": "Dibatalkan",
    "fgj880": "Telugu",
    "forever-foss": "Selamanya FOSS!",
    "fqV_1P": "Buka kunci LafTools Anda",
    "g2_aX": "Salin kata sandi terenkripsi ke dalam file",
    "g5SK9": "Buka Terbaru",
    "gDjbs": "Data historis",
    "gK3dNQ": "Menyalin",
    "gQhfS": "Alat Berkas",
    "gTOv6abWT": "Gabung",
    "gTOv6adbWT": "Daftar",
    "gU1O2": "Dipicu",
    "geHXwByxy": "Pengaturan",
    "generic-NI-UFPTe0": "Mempercantik Kode Generik",
    "generic-code-beautify.desc.2b3c": "Operasi ini memformat kode dalam berbagai bahasa pemrograman untuk meningkatkan keterbacaan dengan menerapkan indentasi yang konsisten, jeda baris, dan mengikuti pedoman gaya bahasa tertentu.",
    "giveas3tar": "Beri kami bintang di GitHub jika Anda menyukai LafTools.",
    "gkC8t": "Basis64",
    "gkdqqC8t": "Basis45",
    "gkqC8t": "Basis32",
    "gmK3pKyRI": "{0} Jumlah Puncak Online",
    "gms7_9n5v": "Mengonversi string byte heksadesimal kembali ke nilai mentahnya.",
    "gnKMZ": "Disegarkan.",
    "groupnote": "Memo",
    "h6AeI": "Sambungan websocket ditutup pada {0}",
    "hJUMN": "Bahasa Sasaran",
    "hMvh1": "Basis Data Cadangan",
    "hRFxV": "Untuk informasi lebih lanjut, silakan kunjungi situs web kami",
    "hX1CWGAhl": "Mengindentasi dan mempercantik kode eXtensible Markup Language (XML).",
    "hcnt1k": "Makedonia",
    "hhOT3": "Cari berdasarkan nama",
    "htTmvWjsS": "Mengompresi kode Cascading Style Sheets (CSS).",
    "htt1d2": "Esperanto",
    "hu-iz": "pengatur waktu",
    "huE6U": "Variabel",
    "hyV-d": "Selesai",
    "hyirc0": "Orang Swedia",
    "i27qmr": "Frisia",
    "i6hMN": "Kode Verifikasi Gambar",
    "i88tb": "Ekspor Hasil ke File",
    "i8q8tb": "Konfigurasikan Alur Kerja untuk Input",
    "iNQvo": "Tunjukkan contoh untuk memulai.",
    "iNqF1T": "Kelola Akun Cloud",
    "iOEjZ": "Tidak Ada Kode yang Tersedia",
    "iQL2c": "Kami masih mengeksplorasi berbagai fungsi tombol ini - jika Anda memiliki masukan atau saran tentang bagaimana kami dapat memperbaikinya, beri tahu kami!",
    "iZXig7E2JF": "LafTools menawarkan rangkaian utilitas pengembangan yang komprehensif termasuk codec, formatter, alat pemrosesan gambar, dan solusi manajemen sumber daya komputer. Dirancang untuk menyederhanakan dan meningkatkan alur kerja pengembangan Anda, LafTools adalah sumber daya utama Anda untuk pengembangan perangkat lunak yang efisien dan berkualitas tinggi.",
    "i_lang_": "Paket Bahasa",
    "ib135dq": "Pesan Status Anda akan ditampilkan di sini",
    "iknTS": "Pengelola Kata Sandi",
    "init_env": "Memuat Sumber Daya Sistem",
    "ip2g1": "Disalin",
    "ipOSQE": "Edisi Pro",
    "it8ths": "bahasa Indonesia",
    "ixyP0": "Memproses tindakan realtime secara otomatis",
    "jJuNz": "Bahasa sumber",
    "jO5eP": "OKE",
    "jPNCb": "Mencoba lagi.",
    "jQXdi": "Modus Cahaya",
    "jR1zX": "laboratorium AI",
    "jRFk519Bj-": "Komunitas ini didorong oleh proyek kode sumber terbuka gratis yang sepenuhnya internasional.",
    "jaj7M": "Seluruh hak cipta.",
    "jb392": "Nama",
    "jfpqt": "Navigator Catatan",
    "jgDoEq": "Tidak ada Data Pertanyaan Umum",
    "jhDoE": "Mengambil Data FAQ",
    "jlxvpk": "Korea",
    "jr_7Y98yZ": "alat laf",
    "json-beautify.desc.0912": "Operasi ini memformat data JSON untuk meningkatkan keterbacaan dengan menambahkan indentasi yang tepat, jeda baris, dan kunci pengurutan secara konsisten.",
    "json-beautify.name.0912": "Memformat SQL",
    "json-beautify.text.93kq": "Mempercantik Data JSON",
    "k17PG": "Koneksi soket web ditutup.",
    "k2SVY": "mati",
    "k2ku5p": "Ceko",
    "k41a5": "alat laf",
    "k4s5rx": "Slovenia",
    "kLH79": "Surel",
    "kOi5A": "Halaman Cetak",
    "kPD22": "Kamus",
    "kPJ-A4": "Menyegarkan",
    "kcHxr": "Silakan berikan nama pengguna akun admin di sini",
    "kjks1": "Mengambil konfigurasi i18n dari API server lokal",
    "kqv5ht": "Yiddi",
    "krxSK": "Asisten AI",
    "ks12d": "Keamanan cyber",
    "kv4wag": "Belanda",
    "ky6JphiKk": "{0} Pengguna Daring",
    "l3akoa": "Amharik",
    "l6Djb": "Pilih salah satu opsi sebagai tema pilihan Anda:",
    "lDXWMq43S": "Kalender Hari Ini",
    "lIn3_": "Nama Pengguna Admin",
    "lQFII": "Picu kembali inisialisasi",
    "lRHDQ": "Keluar dari Mode Layar Penuh",
    "lUh5c": "Generator",
    "lWqYc": "Situs web ini menyediakan alat JSON termasuk JSON ke XML, JSON ke CSV, JSON ke YAML.",
    "lastreplyby": "Balasan terakhir oleh",
    "lkuulh": "Perancis",
    "lp0qmd0": "Tandai sebagai favorit",
    "lpKAz": "Pengaturan",
    "lpzg83": "Samoa",
    "lzGS2": "Detil Ekstensi",
    "m0106": "Konverter",
    "m0107": "pembangkit",
    "m0108": "Pemformat",
    "m7WZw": "Soket Web Sistem Rusak",
    "m8rTc1": "Setelah manajer skrip shell diimplementasikan, Anda dapat menggunakannya untuk mengelola perintah shell Anda.",
    "mBgF1": "Aksi Tikus",
    "mSFei": "Kode Sumber di GitHub",
    "mWXeh": "ID Ruang Kerja: {0}",
    "mabHq": "Temukan File Lama",
    "mbzCv": "Terjadi Kesalahan: {0}, waktu yang ditolak adalah {1}",
    "md2.desc.1039": "Operasi ini meng-hash data menjadi hash {0}.",
    "md2.text.192d3": "Hasilkan {0} Hash",
    "md2aO2NaJITm": "Mengindentasi dan mempercantik kode Cascading Style Sheets (CSS), sehingga lebih mudah dibaca dan dipahami.",
    "md4.desc.1039": "Operasi ini meng-hash data menjadi hash {0}.",
    "md4.text.192d3": "Hasilkan {0} Hash",
    "md5.desc.rxsHq": "Operasi ini meng-hash data menjadi hash {0}.",
    "md5.textiDjMIo": "Hasilkan {0} Hash",
    "md6.desc.1039": "Operasi ini meng-hash data menjadi hash {0}.",
    "md6.text.192d3": "Hasilkan {0} Hash",
    "meeMC1Uk7.text.93kq": "Perkecil {0}",
    "mhWk4dtid": "Pengkodean",
    "mihc3": "Menyelesaikan operasi ini",
    "mjHoR": "Selain itu, secara teknis, tidak ada seorang pun yang dapat membaca token ini jika tidak, dia telah menyerang dan mengendalikan komputer Anda.",
    "mnb19i": "Jerman",
    "mslw4o": "Orang yunani",
    "mwn7iv": "Zulu",
    "myxedr": "Mongolia",
    "n1jA9": "Mengonfirmasi",
    "n24tes": "Portugis (Brasil)",
    "n28g4di0L": "manual",
    "n94an4": "Polandia",
    "n98EW": "Tukar teks wilayah masukan dan wilayah keluaran.",
    "nIDKbSXTw": "{0} Pengguna",
    "nSeIq8-": "Yang terpenting, ini gratis dan open source. Anda dapat menggunakannya untuk tujuan pribadi atau komersial.",
    "nTvw4": "Untuk melindungi dan menyimpan data dan pengaturan Anda secara terpisah, Anda dapat menggunakan akun lokal Anda untuk mencapainya. Selain itu, LafTools akan mendukung widget pesan instan antar pengguna di masa depan.",
    "nh1W-": "Pengujian hanya dapat membuktikan adanya bug, bukan ketidakhadirannya - Edsger Dijkstra",
    "nmb1wx": "Yoruba",
    "nncQE": "Kehidupan",
    "nodBw": "Operasi ini mengkodekan data mentah ke dalam string ASCII {0}.",
    "nrix6l": "Chichewa",
    "nxJC7": "Tindakan default yang akan dijalankan saat transformator dijalankan.",
    "o1umzi": "Perancis",
    "o52xW": "Ekspor",
    "o8xyzu": "Luksemburg",
    "oBz8D": "Memuat",
    "oNLxH": "Nama belakang",
    "oNg3f": "Situs Resmi",
    "ocxsw3": "orang Irlandia",
    "of_ox": "Secara keseluruhan, LafTools adalah solusi terpadu untuk semua kebutuhan Anda.",
    "oj23X": "Pulihkan Basis Data",
    "ojCWEFdVe": "Mengompresi kode JavaScript, menghapus semua karakter yang tidak perlu.",
    "ooiFU": "Mulai ulang Layanan Java",
    "oqHqVq": "Sortir dengan",
    "oqHqqV": "Total: {0} Perintah",
    "oqHqqVq": "Salin Waktu",
    "oqjbcj": "Laos",
    "os8h6u": "Orang Denmark",
    "p8Exxc1s": "Ada berbagai alat yang memanfaatkan teknologi AI untuk melakukan tugas dengan lebih efisien di Laboratorium AI.",
    "pANmj": "Tag dapat ditentukan berdasarkan jenis server, penggunaan skrip, atau kriteria lain yang Anda inginkan.",
    "pA_deJ": "Ekspor ke Papan Klip",
    "pA_feeJ": "Hubungkan kembali Terminal",
    "pA_qweJ": "Hapus Penyangga",
    "pDBSWq": "tidak ada konten yang tersedia untuk panel kanan",
    "pEk1kk": "LafTools menghadirkan fungsionalitas yang berguna untuk Anda di sini.",
    "pEk1qkk": "Daftar semua tab yang dibuka",
    "pHZDB": "Aksi Waktu Nyata",
    "pJoOz": "Membuka file",
    "pKHRT": "Buka Alat",
    "pKqHRq": "Catatan Pencarian",
    "pL6qH": "Lengkap.",
    "pNwe3": "Lainnya",
    "pZ4d616m-": "Mempercantik {0}",
    "ph5jH": "Menangani bagian ini",
    "piih4x": "Tajik",
    "pmAee": "Baca informasi lebih lanjut tentang alat ini.",
    "pmnp4b": "Orang Ukraina",
    "ppmz8e": "Kreol Haiti",
    "pqs7y3": "Mohon pertimbangkan untuk mendaftarkan halaman web ini sebagai PWA untuk mendapatkan dukungan keymap penuh.",
    "psA_eJ": "Ekspor sebagai File",
    "psZoP": "Letakkan file di sini untuk memprosesnya",
    "psqqpq_o": "Oke, hasilnya telah disalin ke clipboard Anda sebanyak {0} kali.",
    "pzn2IpkDo": "Membuat indentasi dan cetakan cantik kode JavaScript Object Notation (JSON).<br><br>Tag: json viewer, prettify, penyorotan sintaksis",
    "q0zA1kML_": "Kotak Alat Online",
    "q12beqwR": "Tidak Ada Alat yang Tersedia",
    "q29t31": "Polandia",
    "q3VjkLMsP": "Persahabatan, pertukaran, kerjasama dan pengembangan",
    "q6K7o": "Muat Dari Catatan",
    "q9iuti": "bahasa Wales",
    "qDrbEr": "Nama pengguna yang Anda berikan kosong, silakan periksa dan coba lagi.",
    "qF4uS2": "Buat Ruang Kerja",
    "qF4uS23": "Jendela baru",
    "qHoktx": "Terima kasih!",
    "qN1LdZ2": "Terakhir diubah",
    "qQmBr": "Terjemahan Teks",
    "qTqyvWdY": "Belum selesai",
    "qWemXE4": "1 Januari 2024",
    "qWw3eTH": "Bagian ini membantu memelihara file di disk lokal atau disk cloud Anda.",
    "qdeFXx": "Saat ini, halaman yang Anda cari belum sepenuhnya diterapkan.",
    "qpDBSW": "tidak ada panel yang tersedia",
    "qpDBSWe1": "tidak ada panel yang tersedia",
    "qqK_x_": "Masuk",
    "qqqwYoz": "Membantu",
    "qqwYoz": "tab",
    "qqwYqwe": "Ruang kerja",
    "qtpmvP": "Konfirmasi Kata Sandi Lokal",
    "quality-first": "Kualitas Pertama",
    "qubSJ": "Ekstensi VM bukan ID. (REF: IQnMH).",
    "qzshys": "bahasa Urdu",
    "r1GLS": "Tag",
    "rE6fUsSGl": "Mengindentasi dan mempercantik kode Structured Query Language (SQL).",
    "rK6cx": "{0}, dirancang dan dikembangkan oleh tim LafTools",
    "rQkas": "Selamat datang di LafTools",
    "rR1vd": "Masukan Dari File",
    "rT34qnO": "Masukkan teks untuk diproses. Hasilnya akan ditampilkan di editor keluaran.",
    "rVqlu": "Dekode {0}",
    "rYSpwq": "Algoritme MD2 (Message-Digest 2) adalah fungsi hash kriptografi yang dikembangkan oleh Ronald Rivest pada tahun 1989. Algoritme ini dioptimalkan untuk komputer 8-bit. Meskipun MD2 tidak lagi dianggap aman, bahkan mulai tahun 2014, MD2 tetap digunakan di publik. infrastruktur utama sebagai bagian dari sertifikat yang dihasilkan dengan MD2 dan RSA. Algoritma intisari pesan, secara default, terdiri dari 18 putaran.",
    "r_n6h": "Mode Terang atau Gelap",
    "rf0mql3": "Tema Terang atau Gelap",
    "rpG0G": "Kami menghargai masukan Anda dan ingin mendengar pendapat Anda tentang bagaimana kami dapat meningkatkan produk kami - jangan ragu untuk menyampaikan masukan Anda kepada kami!",
    "rub76Z8zx": "Mencoba mencetak bahasa gaya C seperti C, C++, C#, Java, PHP, JavaScript, dll. Ini tidak akan berfungsi dengan sempurna, dan kode yang dihasilkan mungkin tidak berfungsi lagi. Operasi ini dirancang murni untuk membuat kode yang dikaburkan atau diperkecil menjadi lebih mudah dibaca dan dipahami. Hal-hal yang tidak akan berfungsi dengan baik: Untuk pemformatan loop, pemformatan loop Do-While, indentasi Switch/Case, Operator pergeseran bit tertentu",
    "run_text": "Sebelum memasuki meja kerja Anda, kami ingin memuat sumber daya sistem yang diperlukan terlebih dahulu. Mohon tunggu beberapa saat, akan segera selesai, detailnya dapat dilihat seperti di bawah ini.",
    "rycJy": "LafTools adalah kotak peralatan serbaguna yang dirancang khusus untuk programmer. Ini mewakili versi kedua dari CodeGen Toolbox, sekarang dengan runtime yang lebih ringan yang ditulis dalam Golang dan JavaScript.",
    "ryhkqb": "Bulgaria",
    "rzoFmjStq": "Alat yang Relevan",
    "s-fxP80Dd": "IDE LafTools",
    "s0vrf9": "Ibrani",
    "s4OeX": "Berhasil masuk ke sistem",
    "sHoxxW": "Sejarah",
    "sO0MOe": "Setiap kali Anda berada di jendela lebih dari 5 detik, itu akan ditampilkan di sini.",
    "sR8yc": "Menutup",
    "sc49my": "Sindhi",
    "sdf3160": "Tugas para ahli teori, khususnya di bidang biologi, adalah menyarankan eksperimen baru. Teori yang baik tidak hanya menghasilkan prediksi, namun juga prediksi mengejutkan yang kemudian menjadi kenyataan. -Francis Crick",
    "sdfk1": "Gulir tab ke kiri",
    "sdfk13": "Gulir tab ke kanan",
    "sglMS": "Ciptakan Waktu",
    "share-this-page": "Bagikan halaman ini",
    "sk123": "Belum selesai",
    "slqcWD": "Bagian logika ini belum didukung, harap pantau terus.",
    "sojBI": "Konversi",
    "spCqEa": "MELAKUKAN",
    "spdh98": "Cina disederhanakan",
    "ssDaOq": "Baru mengenal LafTools?",
    "ssm80i": "Basque",
    "str.codecs": "Codec",
    "str.converters": "Pengonversi",
    "str.formatter": "Pemformat",
    "str.login": "Gabung",
    "str.mostused": "Paling Banyak Digunakan",
    "str.parsers": "Parser",
    "str.register": "Daftar",
    "str.remarks": "Favorit",
    "str.usercentre": "Pusat Pengguna",
    "svqh06": "Azerbaijan",
    "sys_updates": "Pembaruan Sistem Terbaru",
    "t63Qw": "Membubarkan",
    "t6wczq": "Xhosa",
    "t84q1z": "orang Armenia",
    "t8DUz20a-": "Pemformat JSON",
    "t8c6xc": "Somalia",
    "tBIX-d": "jendela",
    "tEiv_": "Mengambil Detail Ekstensi",
    "tIy3Q": "Mengalami kesalahan",
    "tIyq3Q": "Mengalami kesalahan",
    "tWe1yF": "Tidak ada perintah shell yang tersedia.",
    "tY3p1": "Informasi Lebih Lanjut",
    "tiaiB": "Membatalkan",
    "title-laftools": "LafTools - ToolBox All-In-One Terkemuka untuk Pemrogram",
    "tn7duf": "Kroasia",
    "try.laftools.ide": "Coba LafTools IDE",
    "trywithclassicalwebui": "Coba dengan UI Web Klasik",
    "ttAre": "Masukkan kata sandi teks biasa Anda di sini",
    "twamg": "Asisten AI, Memberdayakan Kreativitas Anda",
    "tyhgpr": "Jawa",
    "uCEe8": "Konversi Waktu Nyata",
    "uFcDQ": "Menginisialisasi data status...",
    "uV5Bi": "Tidak Dapat Memuat Ekstensi",
    "uVseB": "Tekan {0} untuk menampilkan daftar tombol pintas",
    "ucDLv": "Anda telah menyalin data ini sebanyak {0} kali",
    "ui5pZ": "Pengurai Perintah",
    "ulah0q": "Jepang",
    "unc9E": "Teks Acak",
    "usr_defined": "Preferensi Sistem",
    "uwqGE": "Buka Alat",
    "v7q3db": "Thai",
    "vOjNC": "Masukkan kata sandi atau kunci aman",
    "vTsQU": "Silakan berikan kode undangan dari administrator Anda",
    "vU17B": "Tidak dapat mengirim permintaan",
    "vWqac": "Sebelum memasuki meja kerja Anda, kami ingin memuat sumber daya sistem yang diperlukan terlebih dahulu. Mohon tunggu beberapa saat, akan segera selesai, detailnya dapat dilihat seperti di bawah ini.",
    "vaP0vq": "Atur kata sandi lokal berhasil.",
    "vci8rd": "Belanda",
    "vh9j4": "Memasukkan",
    "vo1prl": "Orang Spanyol",
    "vr93oi": "Finlandia",
    "vrfjnf": "Italia",
    "w6otqn": "Korsika",
    "w92j07": "Rusia",
    "w9qudj": "Punjabi",
    "wAxtg": "Awalnya, kami membuat UUID sebagai token resmi agar Anda dapat melakukan penyiapan ini. Dari apa yang diterima LafTools, token yang Anda berikan adalah {0}, berhasil diverifikasi oleh LafTools dan akibatnya Anda dapat melanjutkan menyiapkan formulir ini.",
    "wI1eh": "Berikutnya",
    "wQYoz": "Mengajukan",
    "wQdYoz": "Sunting",
    "wQdqwYoz": "Melihat",
    "wcl1K": "Penggunaan",
    "wgkk6y": "Malta",
    "wi28h5_S2": "Codec",
    "wj3VS": "Operasi ini mendekode data dari string ASCII {0} kembali ke format aslinya.",
    "wsWcXd": "Pemberitahuan",
    "x009": "Untuk mengakses dokumentasi penggunaan kami",
    "x5alzu": "Kurdi (Kurmanji)",
    "x5tHV": "Ikhtisar Sistem",
    "xMBv0": "Memuat sumber daya terkait...",
    "xOJqG1": "Pertanyaan yang Sering Diajukan",
    "xPHqP": "Deskripsinya belum ditentukan.",
    "xQ_ls": "Cadangan Redis",
    "xbz0B": "Tutup semua tab",
    "xbz0B2": "Tutup Tab",
    "xdqwe": "Selamat menggunakan LafTools!",
    "xeP4zV": "Lihat item TODO Anda dengan cepat",
    "xeP4zVd": "Cari kosakata bahasa Inggris dengan cepat.",
    "xhxY6iLDH": "Keluar",
    "xlqtA": "Masukan",
    "xml-bdeautify.desc.2a5f9": "Perkecil Kode XML",
    "xml-beautify.desc.2a5f9": "Operasi ini memformat data XML untuk meningkatkan keterbacaan dengan menambahkan indentasi yang tepat, jeda baris, dan memastikan struktur terbentuk dengan baik.",
    "xs22XLF": "Tidak ada data yang tersedia untuk ID item ini, harap pertimbangkan untuk memilih item lainnya.",
    "y3qjdd": "Kata sandi lokal Anda telah berhasil diverifikasi.",
    "y8Ir5": "Bagian ini digunakan untuk menginisialisasi akun administrator Anda, namun untuk saat ini, tidak ada yang perlu dibuat atau disesuaikan di sini seperti yang telah diatur sebelumnya oleh administrator Anda, harap abaikan bagian ini dan lanjutkan dengan langkah selanjutnya.",
    "yCsTC": "Pengoptimalan dini adalah akar segala kejahatan.",
    "yMZW-GEgf": "Format XML",
    "ySVf-": "Coba lagi Permintaan ini",
    "yTsqFO": "Algoritma MD4 (Message-Digest 4) adalah fungsi hash kriptografi yang dikembangkan oleh Ronald Rivest pada tahun 1990. Panjang intisari adalah 128 bit. Algoritma ini telah mempengaruhi desain selanjutnya, seperti algoritma MD5, SHA-1 dan RIPEMD. Keamanan MD4 telah sangat terganggu.",
    "yVprb": "Bagian ini masih dalam pengembangan.",
    "y_2Q1": "Menyandikan dan Mendekode",
    "y_2Q2": "Kripto Simetris",
    "y_2Q3": "Kripto Asimetris",
    "y_2Q4": "Algoritma Nasional Tiongkok",
    "y_2Q5": "Otentikasi Web",
    "y_2Q5dqw": "Pencocokan Teks",
    "y_9YM": "Output akan ditampilkan di sini.",
    "y_9YqM": "Memuat sumber daya statis...",
    "y_BN6": "Algoritma Intisari",
    "ya0cwu": "Melayu",
    "yc7dqiu": "Cina disederhanakan",
    "yfYeg": "Templat Teks",
    "yiRso": "Catatan Awan",
    "ykganl": "Orang Denmark",
    "ymyfghy1r": "Catatan",
    "yqiRso": "Catatan Lokal",
    "yqrxl4": "Orang Serbia",
    "yznU9": "Data Pohon Kosong",
    "z-o28we": "Panel Proses",
    "z0j2nf": "Hindi",
    "z1oFn": "Melarikan diri dan tidak melarikan diri",
    "z2jzej": "Marathi",
    "z79b1a": "Arab",
    "zN2ES": "Ruang kerja",
    "zaSKh": "Menyegarkan",
    "zc3Hf": "Kata sandi",
    "zjDJk": "Harap berikan jalur direktori ruang kerja",
    "zkqUFa": "{0} belum dikonfigurasi",
    "zkv375": "Khmer",
    "zmDWx": "Hubungi kami",
    "znVRwq": "File",
    "zpyd34": "Bahasa inggris",
    "zqiIoqXw": "Menjalankan perhitungan...",
    "zwd4v": "Detil Ekstensi",
    "zwgYx": "Nilai kata sandi terenkripsi akan ditampilkan di sini.",
    "zzcepr": "Cebuano"
}