{
    "-dxG-aEe4w": "È stato raggiunto il numero massimo di codici di verifica SMS inviati oggi.",
    "-wHWkv2OC": "Perché non riesco ad accedere?",
    "-wdkeq": "Questa comunità è senza scopo di lucro?",
    "2RbUh6TyJ": "{0} Notifiche non lette",
    "2S_7EVIsK": "Convalidatore JSON",
    "3I-dkqkwr": "Tieni presente che NON forniamo corsi di formazione commerciale per esami di inglese o esami di altre materie su questo sito Web e non abbiamo intenzione di farlo in futuro.",
    "43be5": "Diario",
    "4N79HNWiA": "Per garantire che sia una comunità senza fini di lucro, apriamo anche l'intero codice sorgente su GitHub, che può essere trovato a piè di pagina di questa pagina.",
    "4sQWoTgfr": "Il codice di verifica è scaduto, aggiorna la pagina e riprova",
    "4sdQWoTgfr": "Il codice di verifica è scaduto, aggiorna la pagina e riprova.",
    "5pevqzFXX": "Se anche tu pensi che sia significativo per te unirti a noi, continua ad aggiornare il tuo profilo facendo clic sul pulsante qui sotto, grazie!",
    "6h14B_t4I": "Iscritto oggi",
    "7BtpddC": "In secondo luogo, in questa comunità non si parla di politica o di altri argomenti delicati e, ovviamente, non si accettano spam o pubblicità. Per questo motivo richiediamo un numero di telefono valido per la registrazione, per prevenire eventuali attività illecite o improprie.",
    "7flKa": "LafTools - L'Onnipotente per tutti i Professionisti e Ingegneri",
    "7fldKa": "LafTools: il principale toolbox all-in-one per programmatori",
    "7zqdufsdddJ": "Sì certo. Il sito web ELB3.com deriva dal gruppo di chat WeChat senza scopo di lucro, {0}, che mira a creare un'atmosfera di apprendimento dell'inglese amichevole, senza pubblicità e confortevole.",
    "8s1R5nChx": "Il codice di invito è vuoto, questa community non è aperta al pubblico ma limitata agli utenti invitati.",
    "8s1dX": "Il codice di invito non esiste nel sistema, controlla se c'è un problema con la distinzione tra maiuscole e minuscole.",
    "8sVG1RXhx": "la password deve contenere almeno 6 caratteri",
    "8sVG1RdXhx": "L'ID utente esiste già",
    "8sVG1kqXhx": "L'ID utente deve contenere almeno 2 caratteri",
    "8sVGdXhx": "L'ID utente deve contenere solo lettere e numeri",
    "8saIR-LCjyChx": "Il codice di invito è scaduto",
    "8saIt5r5nGxwwChx": "Il codice di invito è stato esaurito",
    "9YPgsPid2M": "Codice SMS",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Codificatore Base64",
    "9b_7a0sdf": "Decodificatore Base64",
    "9pBpiYcCy": "Per prevenire spam e pubblicità, abbiamo bisogno di un codice di invito per registrare il tuo account.",
    "BqWGnXEzV": "Città",
    "Bz_WdwvAPn": "Controlla se il CAPTCHA è fornito correttamente.",
    "C7jECCVt9": "Dai valore al tuo tempo e non fare mai e poi mai nulla di illegale in questa comunità.",
    "CK5NCw519": "Storia della comunità",
    "CQ44pYZYj": "login",
    "CuHqw9m": "{0} non è un numero di telefono valido, attualmente il sistema accetta solo numeri di telefono di 11 cifre.",
    "Cz_qjjFw7": "Circa {0}",
    "DYaOL4Yp7": "Registrati",
    "D_9sNBiZj": "Hai provato troppe volte, riprova più tardi.",
    "F-D-AewqL": "Fai una retrospettiva su ciò che hai fatto di recente. Non possiamo sopportare alcun comportamento che possa essere considerato molestia, AD o abuso personale, ecc...",
    "GaySMPQHo": "Tendenza",
    "Gy45ssBPS": "Crea nuovo argomento",
    "H39ddc0df": "Prova ad accedere più tardi se fallisci troppe volte.",
    "HaU4NMabv": "Il codice di verifica non è corretto, inserisci nuovamente o aggiorna l'immagine.",
    "IWPP6V-tR": "Codice sorgente",
    "Ibzs2-Ho1": "Strumenti CSV",
    "IcvP2d-QY": "Per favore {0} o {1} per partecipare alla discussione",
    "IugAFc4OT": "Si è verificato un problema durante l'invio dei tuoi dati.",
    "Jbor69IBw": "Formattatori",
    "Jf4iDTZ28": "Inoltre, ti assicuriamo che non venderemo mai il tuo numero di telefono né lo renderemo pubblico.",
    "Jfr4RzEZG": "Al momento accettiamo solo il numero di telefono {0} per registrare il tuo account.",
    "JuZAli3": "Guida dell'utente",
    "K2UEY4ddl": "L'ID utente contiene parole non valide, evita di utilizzare {0}",
    "KAiEq6dcwL5": "Infine, come promemoria amichevole, ogni utente dovrebbe assumersi la responsabilità delle proprie parole e azioni.",
    "MnVg5i": "Ciao, piacere di conoscerti! È nostro piacere invitarti in questa comunità.",
    "MnVqwid": "Ciao, {0}. Piacere di conoscerti! È nostro piacere invitarti in questa comunità.",
    "NdqZcRL2QN": "Nel caso in cui hai dimenticato la password, puoi reimpostarla facendo clic sul collegamento \"Password dimenticata\".",
    "OBjaZqTvx": "Casa",
    "OPevedpOM": "Cosa succede se non ho un numero di telefono?",
    "P1zxX2IQ5": "Ma per questo sito web si tratta di una derivazione del gruppo originale e non si limita all'apprendimento dell'inglese, ma anche ad altri argomenti.",
    "Pu0pj23rR": "Perché è richiesto il numero di telefono?",
    "RYlJHHwg3": "Il codice SMS non è corretto.",
    "RjdigcxfV": "Contattaci",
    "TV09-obNr": "Pietra miliare",
    "TXdh_K": "Parola d'ordine",
    "TdXddh_wK": "Numero di telefono",
    "Te3h_wK": "Numero di telefono",
    "TqXdd3h_wK": "Numero di telefono",
    "TqXddh_K": "Codice di verifica",
    "TqXdh_K": "Conferma password",
    "UED59zbd-": "LafTools",
    "UjkOS50wO": "Casa",
    "VndKeCfb-": "Verifica il telefono per attivare l'account",
    "VnddCfb-": "Al momento sei bannato per un po'",
    "W3M4ivK9U": "Aggiorna il profilo",
    "WKG7e": "Regole",
    "Wpdsp3g5U": "Benvenuto nella community di {0}!",
    "XIzgAAR": "Di solito, un codice di invito disponibile può essere fornito dal webmaster o da altri utenti.",
    "Xddh_wK": "Codice Invito",
    "Y-svpKvUz": "due password non corrispondono",
    "Y0drdCSiu": "Temi",
    "Yc5uMym": "Potresti chiederti cosa rappresenta ELB3, in breve, è l'abbreviazione del gruppo WeChat senza scopo di lucro {0} che è un'interessante piattaforma per gli appassionati e gli esaminandi inglesi per imparare e apprezzare l'inglese!",
    "ZCzH8": "Più recente",
    "ZaS8MP8cr": "Nota: il codice di verifica è stato aggiornato, modifica i valori del modulo e inserisci nuovamente il codice per continuare.",
    "aISK9iYc_": "Segnalazione di informazioni illegali",
    "aUdtds_qwY": "Normalmente puoi accedere con il tuo ID utente o numero di telefono con successo anche se hai violato le regole di questa comunità.",
    "b7wgrhuXl": "Tecnologia",
    "b_vts": "Registrazione",
    "dHWho": "Iscrizione",
    "dldeoeqwc": "Promemoria amichevoli",
    "dnsz7fwNx": "L'ID utente fa distinzione tra maiuscole e minuscole.",
    "dsdfqw": "l'utente non esiste",
    "dwJucRtar": "Questa parte è ancora in corso, benvenuto per contribuire al progetto per questa parte.",
    "dzIC7qPQ": "Se desideri unirti a noi, prova a contattare il webmaster tramite la sua email {0} o il suo account WeChat {1} per ottenere un codice di invito.",
    "englishcorner": "Inglese",
    "eqwee": "La password non è corretta",
    "fcGTPc7HP": "Dove posso trovare il codice invito?",
    "gTOv6abWT": "Login",
    "gTOv6adbWT": "Registrati",
    "geHXwByxy": "Impostazioni",
    "gmK3pKyRI": "{0} Conteggio picco online",
    "groupnote": "Promemoria",
    "hxCMxpW6Sq": "Mi sono iscritto {0} giorni fa",
    "iZXig7E2JF": "LafTools offre una suite completa di utilità di sviluppo tra cui codec, formattatori, strumenti di elaborazione delle immagini e soluzioni di gestione delle risorse del computer. Progettato per semplificare e migliorare il flusso di lavoro di sviluppo, LafTools è la risorsa di riferimento per uno sviluppo software efficiente e di alta qualità.",
    "jRFk519Bj-": "Questa comunità è guidata da un progetto di codice open source gratuito completamente internazionale.",
    "jdbef_PBl": "Obiettivo",
    "jr_7Y98yZ": "LafTools",
    "ky6JphiKk": "{0} Utenti in linea",
    "lEDpJMRfG": "Se sei confuso, non esitare a farcelo sapere inviandoci un'e-mail.",
    "lWqYc": "Questo sito Web fornisce strumenti JSON tra cui JSON in XML, JSON in CSV, JSON in YAML.",
    "lastreplyby": "Ultima risposta di",
    "lidydVO": "Perché sono bloccato o limitato?",
    "lu2T6idPY": "Se ritieni che ci sia un problema con il tuo account, contatta il webmaster.",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "{0} utenti",
    "nncQE": "Vita",
    "o4GdNzX6xS": "Innanzitutto, a causa dei requisiti normativi ben noti sulla Terra, ogni utente è tenuto a fornire un numero di telefono valido per registrarsi.",
    "oHQNQ4mRw": "ID utente",
    "p1Jyl4uMv": "Esci dal tuo account",
    "pNwe3": "Altro",
    "t8DUz20a-": "Formattatore JSON",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "Seleziona la lingua del sito web",
    "uefFV1": "Dopo",
    "ufSPh0ad": "Se è impossibile registrare il tuo account tramite il tuo numero di telefono attuale, contatta il webmaster tramite la sua email {0} o l'account WeChat {1}. Possiamo aiutarti a registrare manualmente il tuo account.",
    "wCcPJZK": "{0} non è un indirizzo email valido",
    "wCctGPJZK": "{0} non deve essere vuoto",
    "wi28h5_S2": "Codec",
    "xhxY6iLDH": "Disconnettersi",
    "yOdwRB": "Benvenuto nella comunità ELB3!",
    "zr3ZBdUoT": "Guida dell'utente",
    "zuxd0y-kmA": "L'ID utente o il numero di telefono non hanno spazi bianchi."
}