{
    "-dxG-aEe4w": "Bilangan maksimum kod pengesahan SMS yang dihantar hari ini telah dicapai.",
    "-wHWkv2OC": "Mengapa saya tidak boleh log masuk?",
    "-wdkeq": "Adakah komuniti ini bukan untung?",
    "2RbUh6TyJ": "{0} Pemberitahuan Belum Dibaca",
    "3I-dkqkwr": "Ambil perhatian bahawa kami TIDAK menyediakan sebarang kursus latihan komersial untuk peperiksaan Bahasa Inggeris atau mana-mana peperiksaan mata pelajaran lain di laman web ini, dan kami tidak merancang untuk berbuat demikian pada masa hadapan.",
    "43be5": "Diari",
    "4N79HNWiA": "Untuk memastikan ia adalah komuniti bukan untung, kami juga membuka keseluruhan kod sumbernya di GitHub, yang boleh didapati di pengaki halaman ini.",
    "4sQWoTgfr": "Kod pengesahan telah tamat tempoh, sila muat semula halaman dan cuba lagi",
    "4sdQWoTgfr": "Kod pengesahan telah tamat tempoh, sila muat semula halaman dan cuba lagi.",
    "5pevqzFXX": "Jika anda juga fikir ia bermakna untuk anda menyertai kami, sila teruskan mengemas kini profil anda dengan mengklik butang di bawah, terima kasih!",
    "6h14B_t4I": "Menyertai Hari Ini",
    "7BtpddC": "Kedua, dalam komuniti ini, kami tidak bercakap tentang politik atau topik sensitif lain, dan sudah tentu tidak mengalu-alukan spam atau iklan. Itulah sebabnya kami memerlukan nombor telefon yang sah untuk pendaftaran, untuk mengelakkan sebarang aktiviti terlarang atau tidak wajar.",
    "7flKa": "LafTools - Yang Maha Kuasa untuk semua Profesional dan Jurutera",
    "7zqdufsdddJ": "Ya, sudah tentu. Tapak web ELB3.com berasal daripada kumpulan sembang WeChat bukan untung, {0}, yang bertujuan untuk mewujudkan suasana pembelajaran bahasa Inggeris yang mesra, bebas iklan dan selesa.",
    "8s1R5nChx": "Kod jemputan kosong, komuniti ini tidak terbuka kepada umum tetapi terhad kepada pengguna jemputan.",
    "8s1dX": "Kod jemputan tidak wujud dalam sistem, sila semak sama ada terdapat isu sensitif huruf kecil.",
    "8sVG1RXhx": "kata laluan hendaklah sekurang-kurangnya 6 aksara",
    "8sVG1RdXhx": "ID pengguna sudah wujud",
    "8sVG1kqXhx": "ID pengguna hendaklah sekurang-kurangnya 2 aksara",
    "8sVGdXhx": "ID Pengguna hendaklah hanya mengandungi huruf dan nombor",
    "8saIR-LCjyChx": "Kod jemputan telah tamat tempoh",
    "8saIt5r5nGxwwChx": "Kod jemputan telah digunakan",
    "9YPgsPid2M": "Kod SMS",
    "9pBpiYcCy": "Untuk mengelakkan spam dan iklan, kami memerlukan kod jemputan untuk mendaftarkan akaun anda.",
    "BqWGnXEzV": "Bandar",
    "Bz_WdwvAPn": "Semak sama ada CAPTCHA disediakan dengan betul.",
    "C7jECCVt9": "Hargai masa anda dan jangan sesekali melakukan sesuatu yang menyalahi undang-undang dalam komuniti ini.",
    "CK5NCw519": "Kisah Masyarakat",
    "CQ44pYZYj": "log masuk",
    "CuHqw9m": "{0} bukan nombor telefon yang sah, pada masa ini sistem menerima 11 digit nombor telefon sahaja.",
    "Cz_qjjFw7": "Kira-kira {0}",
    "DYaOL4Yp7": "mendaftar",
    "D_9sNBiZj": "Anda mencuba terlalu banyak kali, sila cuba lagi kemudian.",
    "F-D-AewqL": "Tinjau kembali dengan apa yang telah anda lakukan baru-baru ini. Kami tidak dapat menahan sebarang tingkah laku yang boleh dianggap sebagai gangguan, iklan atau penderaan peribadi, dsb...",
    "GaySMPQHo": "Trending",
    "Gy45ssBPS": "Buat Topik Baharu",
    "H39ddc0df": "Cuba log masuk kemudian jika gagal terlalu banyak kali.",
    "HaU4NMabv": "Kod pengesahan tidak betul, sila masukkan semula atau muat semula imej.",
    "IWPP6V-tR": "Kod sumber",
    "IcvP2d-QY": "Sila {0} atau {1} untuk menyertai perbincangan",
    "IugAFc4OT": "Masalah telah berlaku semasa menyerahkan data anda.",
    "Jf4iDTZ28": "Selain itu, pastinya, sila yakin bahawa kami tidak akan menjual nombor telefon anda atau mendedahkannya kepada umum.",
    "Jfr4RzEZG": "Pada masa ini, kami hanya menerima {0} nombor telefon untuk mendaftarkan akaun anda.",
    "JuZAli3": "Panduan pengguna",
    "K2UEY4ddl": "ID pengguna mengandungi perkataan yang tidak sah, sila elakkan menggunakan {0}",
    "KAiEq6dcwL5": "Akhir sekali, sebagai peringatan mesra, setiap pengguna harus bertanggungjawab atas kata-kata dan tindakan mereka sendiri.",
    "MnVg5i": "Hello, senang berkenalan! Kami berbesar hati untuk menjemput anda ke komuniti ini.",
    "MnVqwid": "Helo, {0}. Selamat berkenalan! Kami berbesar hati untuk menjemput anda ke komuniti ini.",
    "NdqZcRL2QN": "Sekiranya anda terlupa kata laluan anda, anda boleh menetapkannya semula dengan mengklik pautan 'Lupa Kata Laluan'.",
    "OBjaZqTvx": "Rumah",
    "OPevedpOM": "Bagaimana jika saya tidak mempunyai nombor telefon?",
    "P1zxX2IQ5": "Tetapi untuk laman web ini, ia adalah terbitan kumpulan asal dan tidak terhad kepada pembelajaran bahasa Inggeris, tetapi juga untuk topik lain.",
    "Pu0pj23rR": "Mengapa nombor telefon diperlukan?",
    "RYlJHHwg3": "Kod SMS tidak betul.",
    "RjdigcxfV": "Hubungi Kami",
    "TV09-obNr": "Pencapaian",
    "TXdh_K": "Kata laluan",
    "TdXddh_wK": "Nombor telefon",
    "Te3h_wK": "Nombor telefon",
    "TqXdd3h_wK": "Nombor telefon",
    "TqXddh_K": "Kod pengesahan",
    "TqXdh_K": "Sahkan Kata Laluan",
    "UED59zbd-": "LafTools",
    "UjkOS50wO": "Rumah",
    "VndKeCfb-": "Sahkan Telefon untuk Mengaktifkan Akaun",
    "VnddCfb-": "Anda sedang diharamkan buat sementara waktu",
    "W3M4ivK9U": "Kemas kini Profil",
    "WKG7e": "Peraturan",
    "Wpdsp3g5U": "Selamat datang ke {0} Komuniti!",
    "XIzgAAR": "Biasanya, kod jemputan yang tersedia boleh diberikan daripada juruweb atau pengguna lain.",
    "Xddh_wK": "Kod Jemputan",
    "Y-svpKvUz": "dua kata laluan tidak sepadan",
    "Y0drdCSiu": "Topik",
    "Yc5uMym": "Anda mungkin tertanya-tanya apakah maksud ELB3, secara ringkasnya, ia adalah singkatan kepada kumpulan WeChat bukan untung {0} yang merupakan platform menarik untuk peminat dan pemeriksa bahasa Inggeris untuk mempelajari dan menghargai bahasa Inggeris!",
    "ZCzH8": "Terbaru",
    "ZaS8MP8cr": "Nota: Kod pengesahan telah dimuat semula, sila laraskan nilai borang anda dan masukkan semula kod untuk meneruskan.",
    "aISK9iYc_": "Laporan Maklumat Haram",
    "aUdtds_qwY": "Biasanya, anda boleh log masuk dengan ID pengguna atau nombor telefon anda dengan jayanya walaupun anda telah melanggar peraturan dalam komuniti ini.",
    "b7wgrhuXl": "Tech",
    "b_vts": "Log Masuk",
    "dHWho": "Daftar",
    "dldeoeqwc": "Peringatan Mesra",
    "dnsz7fwNx": "ID pengguna adalah sensitif huruf besar-besaran.",
    "dsdfqw": "Pengguna tidak wujud",
    "dwJucRtar": "Bahagian ini masih dalam proses, dialu-alukan untuk menyumbang kepada projek untuk bahagian ini.",
    "dzIC7qPQ": "Jika anda ingin menyertai kami, sila cuba menghubungi juruweb melalui e-mel {0} atau akaun WeChat {1} beliau untuk mendapatkan kod jemputan.",
    "englishcorner": "Inggeris",
    "eqwee": "Kata laluan tidak betul",
    "fcGTPc7HP": "Di manakah saya boleh mendapatkan kod jemputan?",
    "gTOv6abWT": "Log masuk",
    "gTOv6adbWT": "Daftar",
    "geHXwByxy": "tetapan",
    "gmK3pKyRI": "{0} Kiraan Dalam Talian Puncak",
    "groupnote": "Memo",
    "hxCMxpW6Sq": "Menyertai {0} hari yang lalu",
    "jRFk519Bj-": "Komuniti ini didorong oleh projek kod sumber terbuka percuma antarabangsa sepenuhnya.",
    "jdbef_PBl": "Matlamat",
    "ky6JphiKk": "{0} Pengguna Dalam Talian",
    "lEDpJMRfG": "Jika anda keliru, sila beritahu kami dengan menghantar e-mel kepada kami.",
    "lWqYc": "Tapak web ini menyediakan alatan JSON termasuk JSON kepada XML, JSON kepada CSV, JSON kepada YAML.",
    "lastreplyby": "Balasan terakhir oleh",
    "lidydVO": "Mengapa saya disekat atau terhad?",
    "lu2T6idPY": "Jika anda rasa terdapat masalah dengan akaun anda, sila hubungi juruweb.",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "{0} Pengguna",
    "nncQE": "kehidupan",
    "o4GdNzX6xS": "Pertama, Disebabkan keperluan peraturan yang terkenal di Bumi, setiap pengguna dikehendaki memberikan nombor telefon yang sah untuk mendaftar.",
    "oHQNQ4mRw": "ID Pengguna",
    "p1Jyl4uMv": "Log Keluar Akaun Anda",
    "pNwe3": "Lain-lain",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "Pilih Bahasa Laman Web",
    "uefFV1": "Nanti",
    "ufSPh0ad": "Jika mustahil untuk mendaftarkan akaun anda melalui nombor telefon semasa anda, sila hubungi juruweb melalui e-melnya {0} atau akaun WeChat {1}. Kami boleh membantu anda mendaftar akaun anda secara manual.",
    "wCcPJZK": "{0} bukan e-mel yang sah",
    "wCctGPJZK": "{0} tidak sepatutnya kosong",
    "xhxY6iLDH": "Log keluar",
    "yOdwRB": "Selamat datang ke Komuniti ELB3!",
    "zr3ZBdUoT": "Panduan pengguna",
    "zuxd0y-kmA": "ID Pengguna atau Nombor Telefon tidak mempunyai ruang kosong."
}