{
    "-dxG-aEe4w": "Het maximale aantal sms-verificatiecodes dat vandaag is verzonden, is bereikt.",
    "-wHWkv2OC": "Waarom kan ik niet inloggen?",
    "-wdkeq": "Is deze gemeenschap non-profit?",
    "2RbUh6TyJ": "{0} Ongelezen meldingen",
    "3I-dkqkwr": "Houd er rekening mee dat we op deze website GEEN commerciële trainingen voor Engelse examens of examens voor andere vakken aanbieden, en dat we ook niet van plan zijn dit in de toekomst te doen.",
    "43be5": "Dagboek",
    "4N79HNWiA": "Om ervoor te zorgen dat het een non-profitgemeenschap is, openen we ook de volledige broncode op GitHub, die te vinden is onderaan deze pagina.",
    "4sQWoTgfr": "De verificatiecode is verlopen. Vernieuw de pagina en probeer het opnieuw",
    "4sdQWoTgfr": "De verificatiecode is verlopen. Vernieuw de pagina en probeer het opnieuw.",
    "5pevqzFXX": "Als u ook denkt dat het voor u zinvol is om zich bij ons aan te sluiten, blijf dan uw profiel bijwerken door op onderstaande knop te klikken. Bedankt!",
    "6h14B_t4I": "Vandaag lid geworden",
    "7BtpddC": "Ten tweede praten we in deze gemeenschap niet over politiek of andere gevoelige onderwerpen, en we verwelkomen uiteraard geen spam of advertenties. Daarom hebben wij voor registratie een geldig telefoonnummer nodig, om eventuele illegale of ongepaste activiteiten te voorkomen.",
    "7flKa": "LafTools - De almachtige voor alle professionals en ingenieurs",
    "7zqdufsdddJ": "Ja zeker. De website ELB3.com is afgeleid van de non-profit WeChat-chatgroep {0}, die tot doel heeft een vriendelijke, advertentievrije en comfortabele leeromgeving Engels te creëren.",
    "8s1R5nChx": "De uitnodigingscode is leeg. Deze community is niet openbaar maar beperkt tot uitgenodigde gebruikers.",
    "8s1dX": "De uitnodigingscode bestaat niet in het systeem. Controleer of er sprake is van een hoofdlettergevoelig probleem.",
    "8sVG1RXhx": "wachtwoord moet minimaal 6 tekens lang zijn",
    "8sVG1RdXhx": "Gebruikers-ID bestaat al",
    "8sVG1kqXhx": "Gebruikers-ID moet minimaal 2 tekens lang zijn",
    "8sVGdXhx": "Gebruikers-ID mag alleen letters en cijfers bevatten",
    "8saIR-LCjyChx": "De uitnodigingscode is verlopen",
    "8saIt5r5nGxwwChx": "De uitnodigingscode is opgebruikt",
    "9YPgsPid2M": "SMS-code",
    "9pBpiYcCy": "Om spam en advertenties te voorkomen, hebben we een uitnodigingscode nodig om uw account te registreren.",
    "BqWGnXEzV": "Stad",
    "Bz_WdwvAPn": "Controleer of CAPTCHA correct is opgegeven.",
    "C7jECCVt9": "Waardeer uw tijd en doe nooit en te nimmer iets illegaals in deze gemeenschap.",
    "CK5NCw519": "Gemeenschapsverhaal",
    "CQ44pYZYj": "Log in",
    "CuHqw9m": "{0} is geen geldig telefoonnummer. Momenteel accepteert het systeem alleen een telefoonnummer van 11 cijfers.",
    "Cz_qjjFw7": "Over {0}",
    "DYaOL4Yp7": "register",
    "D_9sNBiZj": "Je hebt het te vaak geprobeerd. Probeer het later opnieuw.",
    "F-D-AewqL": "Kijk eens terug op wat je onlangs hebt gedaan. We kunnen geen enkel gedrag tolereren dat kan worden beschouwd als intimidatie, reclame of persoonlijk misbruik, enz...",
    "GaySMPQHo": "Populair",
    "Gy45ssBPS": "Nieuw onderwerp maken",
    "H39ddc0df": "Probeer later in te loggen als dit te vaak mislukt.",
    "HaU4NMabv": "De verificatiecode is onjuist. Voer de afbeelding opnieuw in of vernieuw deze.",
    "IWPP6V-tR": "Broncode",
    "IcvP2d-QY": "Gelieve {0} of {1} om deel te nemen aan de discussie",
    "IugAFc4OT": "Er is een probleem opgetreden bij het verzenden van uw gegevens.",
    "Jf4iDTZ28": "Bovendien kunt u er zeker van zijn dat wij uw telefoonnummer nooit zullen verkopen of openbaar zullen maken.",
    "Jfr4RzEZG": "Momenteel accepteren we alleen het telefoonnummer van {0} om uw account te registreren.",
    "JuZAli3": "Handleiding",
    "K2UEY4ddl": "De gebruikers-ID bevat ongeldige woorden. Vermijd het gebruik van {0}",
    "KAiEq6dcwL5": "Tenslotte, als vriendelijke herinnering: elke gebruiker moet de verantwoordelijkheid nemen voor zijn eigen woorden en daden.",
    "MnVg5i": "Hallo, leuk je te ontmoeten! Het is ons een genoegen u uit te nodigen voor deze community.",
    "MnVqwid": "Hallo, {0}. Aangenaam! Het is ons een genoegen u uit te nodigen voor deze community.",
    "NdqZcRL2QN": "Indien u uw wachtwoord bent vergeten, kunt u dit opnieuw instellen door op de link 'Wachtwoord vergeten' te klikken.",
    "OBjaZqTvx": "Thuis",
    "OPevedpOM": "Wat moet ik doen als ik geen telefoonnummer heb?",
    "P1zxX2IQ5": "Maar voor deze website is het een afleiding van de oorspronkelijke groep en niet beperkt tot het leren van Engels, maar ook voor andere onderwerpen.",
    "Pu0pj23rR": "Waarom is een telefoonnummer vereist?",
    "RYlJHHwg3": "SMS-code klopt niet.",
    "RjdigcxfV": "Neem contact met ons op",
    "TV09-obNr": "Mijlpaal",
    "TXdh_K": "Wachtwoord",
    "TdXddh_wK": "Telefoon nummer",
    "Te3h_wK": "Telefoon nummer",
    "TqXdd3h_wK": "Telefoon nummer",
    "TqXddh_K": "Verificatie code",
    "TqXdh_K": "bevestig wachtwoord",
    "UED59zbd-": "LafTools",
    "UjkOS50wO": "Thuis",
    "VndKeCfb-": "Verifieer telefoon om account te activeren",
    "VnddCfb-": "Je bent momenteel een tijdje verbannen",
    "W3M4ivK9U": "Profiel bijwerken",
    "WKG7e": "Reglement",
    "Wpdsp3g5U": "Welkom bij de {0}-community!",
    "XIzgAAR": "Meestal kan een beschikbare uitnodigingscode worden verstrekt door de webmaster of andere gebruikers.",
    "Xddh_wK": "uitnodigingscode",
    "Y-svpKvUz": "twee wachtwoorden komen niet overeen",
    "Y0drdCSiu": "Onderwerpen",
    "Yc5uMym": "Je vraagt ​​je misschien af ​​waar ELB3 voor staat, kortom: het is een afkorting van de non-profit WeChat-groep {0}, een interessant platform voor Engelse enthousiastelingen en examenkandidaten om Engels te leren en te waarderen!",
    "ZCzH8": "Nieuwste",
    "ZaS8MP8cr": "Let op: De verificatiecode is vernieuwd. Pas uw formulierwaarden aan en voer de code opnieuw in om door te gaan.",
    "aISK9iYc_": "Illegaal informatierapport",
    "aUdtds_qwY": "Normaal gesproken kunt u zich succesvol aanmelden met uw gebruikers-ID of telefoonnummer, zelfs als u de regels in deze community heeft overtreden.",
    "b7wgrhuXl": "Technologie",
    "b_vts": "Aanmelden",
    "dHWho": "Aanmelden",
    "dldeoeqwc": "Vriendelijke herinneringen",
    "dnsz7fwNx": "Gebruikers-ID is hoofdlettergevoelig.",
    "dsdfqw": "Gebruiker bestaat niet",
    "dwJucRtar": "Dit deel is nog in uitvoering, welkom om voor dit deel bij te dragen aan het project.",
    "dzIC7qPQ": "Als u zich bij ons wilt aansluiten, probeer dan de webmaster te bereiken via zijn e-mail {0} of WeChat-account {1} om een ​​uitnodigingscode te ontvangen.",
    "englishcorner": "Engels",
    "eqwee": "Wachtwoord is niet correct",
    "fcGTPc7HP": "Waar kan ik de uitnodigingscode verkrijgen?",
    "gTOv6abWT": "Log in",
    "gTOv6adbWT": "Register",
    "geHXwByxy": "Instellingen",
    "gmK3pKyRI": "{0} Piek online-telling",
    "groupnote": "Memo",
    "hxCMxpW6Sq": "{0} dagen geleden lid geworden",
    "jRFk519Bj-": "Deze gemeenschap wordt aangedreven door een volledig internationaal gratis open source codeproject.",
    "jdbef_PBl": "Doel",
    "ky6JphiKk": "{0} Onlinegebruikers",
    "lEDpJMRfG": "Als u in de war bent, kunt u ons dit laten weten door een e-mail naar ons te sturen.",
    "lWqYc": "Deze website biedt JSON-tools, waaronder JSON naar XML, JSON naar CSV, JSON naar YAML.",
    "lastreplyby": "Laatste antwoord door",
    "lidydVO": "Waarom ben ik geblokkeerd of beperkt?",
    "lu2T6idPY": "Als u denkt dat er een probleem is met uw account, neem dan contact op met de webmaster.",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "{0} Gebruikers",
    "nncQE": "Leven",
    "o4GdNzX6xS": "Ten eerste moet elke gebruiker, vanwege de bekende regelgeving op aarde, een geldig telefoonnummer opgeven om zich te kunnen registreren.",
    "oHQNQ4mRw": "gebruikersnaam",
    "p1Jyl4uMv": "Meld u af bij uw account",
    "pNwe3": "Ander",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "Selecteer Websitetaal",
    "uefFV1": "Later",
    "ufSPh0ad": "Als het onmogelijk is om uw account te registreren via uw huidige telefoonnummer, neem dan contact op met de webmaster via zijn e-mail {0} of WeChat-account {1}. Wij kunnen u helpen uw account handmatig te registreren.",
    "wCcPJZK": "{0} is geen geldig e-mailadres",
    "wCctGPJZK": "{0} mag niet leeg zijn",
    "xhxY6iLDH": "Uitloggen",
    "yOdwRB": "Welkom bij de ELB3-gemeenschap!",
    "zr3ZBdUoT": "Handleiding",
    "zuxd0y-kmA": "Gebruikers-ID of telefoonnummer bevat geen witruimte."
}