{
    "15424": "Dat is het hele probleem met wetenschap. Je hebt een stel empiristen die dingen van onvoorstelbare verwondering proberen te beschrijven. – Bill Watterson",
    "15999": "Innovatie is het proces waarbij veranderingen worden aangebracht in iets dat al bestaat. -Innovatiedefinitieteam",
    "16987": "Soms loont het om op maandag in bed te blijven, in plaats van de rest van de week te besteden aan het debuggen van de code van maandag. – Dan Salomon",
    "19775": "Wetenschap is een manier van leven. Het is een perspectief. Wetenschap is het proces dat ons van verwarring naar begrip brengt op een manier die nauwkeurig, voorspellend en betrouwbaar is – een transformatie die, voor degenen die het geluk hebben om het te ervaren, empowerend en emotioneel is. – Brian Greene",
    "38127": "Testen is het proces waarbij wordt geprobeerd de code te kraken - Anoniem",
    "42641": "Webontwikkeling is lastig, alleen dan is het leuk om te doen. Je hoeft alleen maar je normen te stellen. Als het gemakkelijk zou zijn, zou iemand het dan doen? – Olawale Daniël",
    "46367": "Innovatie is de sleutel tot het ontsluiten van groeipotentieel. -Omar Ishrak",
    "57225": "Innovatie is de levensader van een bloeiend bedrijf. -Michael Dell",
    "63470": "Een echte wetenschapper lost problemen op, en jammert niet dat ze onoplosbaar zijn. –Anne McCaffrey",
    "66187": "Praten is goedkoop. Laat me de code zien. - Linus Torvalds",
    "68518": "Software en kathedralen zijn grotendeels hetzelfde: eerst bouwen we ze, daarna bidden we.",
    "77528": "Innovatie is de drijvende kracht achter vooruitgang. -John F. Kennedy",
    "80972": "Natuurlijk kan slechte code worden opgeruimd. Maar het is erg duur. – Robert C. Martin",
    "85805": "Een expert is iemand die alle fouten heeft gemaakt die op een heel beperkt terrein kunnen worden gemaakt. – Neils Bohr",
    "92941": "Er is echte poëzie in de echte wereld. Wetenschap is de poëzie van de werkelijkheid. - Richard Dawkins",
    "": "Bericht: {0}",
    "-8l11": "Gekopieerd",
    "-DqwwR": "Operatie voltooid.",
    "-GJ_72": "Overgeschakeld naar de geselecteerde werkruimte {0}",
    "-Jx4J": "Lokaal account",
    "-Rj3y": "Thema's",
    "-XZnW": "Rug",
    "-Yo129I": "Teksthulpmiddelen",
    "-nL_B5PoN": "Comprimeert {0}",
    "00d36": "De beste manier om de toekomst te voorspellen is door hem uit te vinden. -Alan Kay",
    "01do0y": "Kanada",
    "04SSf": "Wachtwoord vergeten?",
    "07naT": "Fout: {0}",
    "07ui6": "Meer informatie",
    "0Ceqru": "Base64 is een notatie voor het coderen van willekeurige bytegegevens met behulp van een beperkte set symbolen die gemakkelijk door mensen kunnen worden gebruikt en door computers kunnen worden verwerkt.",
    "0MO3jj": "MD5 (Message-Digest 5) is een veelgebruikte hashfunctie. Het is gebruikt in een verscheidenheid aan beveiligingstoepassingen en wordt ook vaak gebruikt om de integriteit van bestanden te controleren. MD5 is echter niet botsingsbestendig en is niet geschikt voor toepassingen zoals SSL/TLS-certificaten of digitale handtekeningen die afhankelijk zijn van deze eigenschap.",
    "0PgZ_": "Vertaling",
    "0YKce": "Converteert een binair gecodeerde decimale tekenreeks (BCD) naar een decimaal getal.",
    "0a310": "Er bestaat geen koninklijke weg naar de wetenschap, en alleen degenen die de vermoeiende beklimming van de steile paden niet vrezen, hebben een kans om de lichtgevende toppen te bereiken. - Karl Marx",
    "0a710": "Innovatie is de levensader van elke organisatie. -Dr. RL Bhatia",
    "0ba15": "Succesvolle innovatie vereist het nemen van berekende risico's. -Harvard Pruden",
    "0e299": "Alles is theoretisch onmogelijk totdat het gedaan is. – Robert A. Heinlein",
    "0gvcN": "Welkom op de overzichtspagina, deze is nog in ontwikkeling.",
    "0gywa": "Werkruimte niet gevonden. U wordt doorgestuurd naar de indexpagina van de werkruimte.",
    "0pfdz7": "Oezbeeks",
    "114ee": "Codering zoals poëzie moet kort en bondig zijn. – Santosh Kalwar",
    "13pmE": "Steun ons",
    "149c0": "In wetenschappelijke kwesties is de autoriteit van duizend mensen de bescheiden redenering van één enkel individu niet waard. – Galileo Galilei",
    "1507oa": "Bengaals",
    "1883d": "Wetenschap stimuleert de verbeelding veel meer dan de klassiekers. – JBS Haldane",
    "188cd": "Programmeren leer je door programma's te schrijven. – Brian Kernighan",
    "18f46": "Raketten zijn cool. Daar kun je niet omheen. - Elon Musk",
    "1JOFP": "Open Mijn werkruimte",
    "1NTgQ": "Werkruimte openen",
    "1Npez": "Geef het pad op",
    "1Tuab": "Gekopieerd",
    "1X8x7": "Voorbeeld",
    "1Xe82x7": "{0} Verkleinen",
    "1Xe8wx7": "Hex-reeks",
    "1Xe8x7": "{0} Verfraai",
    "1Xe8x7qe": "BCD",
    "1YmJc": "Selecteer een van de opties als uw voorkeurstaal:",
    "1a3Sc": "Annuleer het laden",
    "1a8b9": "De wetenschapper is niet iemand die de juiste antwoorden geeft, hij is iemand die de juiste vragen stelt. – Claude Levi-Strauss",
    "1bd": "Werkstroom",
    "1d71a": "We worden op een bepaald moment geboren, op een bepaalde plaats, en net als vintage jaren van wijn hebben we de kwaliteiten van het jaar en het seizoen waarin we geboren zijn. Astrologie maakt verder geen aanspraak op iets. – Carl Jung",
    "1da5a": "Innovatie is de basis van vooruitgang en succes in de moderne zakenwereld. -Larry Pagina",
    "1e3e5n": "Hausa",
    "1ff27": "Wetenschap is wat we goed genoeg begrijpen om aan een computer uit te leggen; kunst is al het andere. – Donald E. Knuth",
    "1h6jH": "Waarschuwing: de uitvoer is een lege waarde waarvan de lengte nul is!",
    "1j62a": "Doe dit op een ander tijdstip",
    "1jj0ri": "Japans",
    "1k_44": "Deze bewerking decodeert gegevens uit een ASCII Base64-reeks terug naar het onbewerkte formaat.",
    "1th2nw": "Singalees",
    "1yIQu": "U kunt proberen uw actie opnieuw te verwerken of op de onderstaande knop klikken om de fout te negeren.",
    "20nmcv": "Latijns",
    "22XLF": "Nog niet klaar",
    "22f3a": "Innovatie is het centrale vraagstuk van economische welvaart. – Michael Porter",
    "23f61": "Innovatie gaat niet alleen over het hebben van een goed idee; het gaat erom dat idee werkelijkheid te maken. -Erik Qualman",
    "24vLI": "Gemaakt",
    "277a9": "De wetenschap kan het ultieme mysterie van de natuur niet oplossen. En dat komt omdat wij uiteindelijk zelf deel uitmaken van het mysterie dat we proberen op te lossen. – Max Planck",
    "27ef9": "Innovatie is het vermogen om ideeën om te zetten in facturen. -L. Duncan",
    "27j7sy": "Shona",
    "2D9a6": "Wachtwoord vergeten?",
    "2D9qdk6": "Is het veilig genoeg?",
    "2IF6A": "Het lijkt erop dat er een probleem is met het smeden van opslagopslag",
    "2JyFN": "Kopieer het resultaat naar het klembord",
    "2Ocbey": "Versie",
    "2RhAT": "Het lijkt erop dat het smeden-ophaalproces een probleem tegenkomt",
    "2Ruh6": "Maak een nieuw lokaal account",
    "2S5ap": "Schakel de modus Volledig scherm in",
    "2S_7EVIsK": "JSON-validator",
    "2Y1mR": "Duidelijke tekst",
    "2b7f7": "Ik ben er zeker van dat het universum vol intelligent leven is. Het was gewoon te intelligent om hier te komen. – Arthur C. Clarke",
    "2bqHk": "Laden uit bestand",
    "2e4fb7": "Igbo",
    "2giYv": "Testwachtwoord: {0}",
    "2khdsv": "Pasjto",
    "2lehqwp": "Vietnamees",
    "2lhcqwp": "Turks",
    "2lhqqwp": "Indonesisch",
    "2lhqqwqp": "Maleis",
    "2lhqwwp": "Thais",
    "2qdin8": "Vul alstublieft de verificatiecode in",
    "2tib5m": "Zweeds",
    "2ybu7j": "Noors",
    "30eo2v": "Gujarati",
    "321e0": "Debuggen is twee keer zo moeilijk als het schrijven van code. Daarom, als je de code zo slim mogelijk schrijft, ben je per definitie niet slim genoeg om er fouten in te maken -Brian W. Kernighan",
    "32D9a6": "Account aanmaken",
    "32c8d": "Als debuggen het proces is van het verwijderen van bugs, dan moet programmeren het proces zijn van het invoeren ervan. – Sam Redwine",
    "33RXi": "Het verzoek is afgewezen vanwege onbevredigende parameters.",
    "33aa4": "Wetenschap is slechts puur empirisme, en sluit op grond van haar methode de metafysica uit. – Steve Martin",
    "346qid": "Russisch",
    "380da": "Tegenwoordig is programmeren een race tussen software-ingenieurs die ernaar streven grotere en betere idiot-proof programma's te bouwen, en het universum dat probeert grotere en betere idioten te produceren. Tot nu toe is het universum aan de winnende hand. – Rik Kok",
    "394b6": "Als je dacht dat de wetenschap zeker was? Nou, dat is gewoon een fout van jouw kant. –Richard Feynman",
    "398cc": "Programmeurs lijken de wereld te veranderen. Het zou een opluchting zijn, voor hen en voor ons allemaal, als ze er iets van wisten. – Ellen Ullman",
    "39dsCt": "Indien aanwezig ontvangt u de laatste melding van app-services.",
    "3d297": "Wat ik zo leuk vind aan wetenschap, is dat je tijdens het leren niet echt antwoorden krijgt. Je krijgt alleen maar betere vragen. - John groen",
    "3ii2tt": "Schots-Gaelisch",
    "3umnB": "Onbekend teken",
    "40b7f": "Innovatie is de enige manier om op de lange termijn te winnen. -Jeff Immelt",
    "420b0": "Succesvolle innovatie vereist toewijding aan samenwerking en open communicatie. -Rachel D. Ellison",
    "43be5": "Dagboek",
    "43e45": "Er is geen wet behalve de wet dat er geen wet is. – John Archibald Wheeler",
    "441oja": "Georgisch",
    "44Ntqw-": "Het afhandelen van de operatie.",
    "45cb0": "Innovatie gaat niet alleen over het creëren van nieuwe ideeën, maar ook over het succesvol uitvoeren ervan. -Arun Pandit",
    "46bksi": "Litouws",
    "4K_vhq": "Dupliceer dit tabblad",
    "4PIqD": "Codebeoordeling",
    "4UYIJ": "Nog niet voltooid.",
    "4cGA_": "Gegevens ophalen voor systeemvoorkeuren...",
    "4cf03": "Eigenlijk alles wat bekend kan worden als een getal; want het is onmogelijk iets met de geest te vatten, of het zonder dit te herkennen. – Philolaüs",
    "4d389": "Innovatie is een manier van leven voor de succesvolle ondernemer. -John Rampton",
    "4da84": "Je denkt misschien niet dat programmeurs kunstenaars zijn, maar programmeren is een uiterst creatief beroep. Het is op logica gebaseerde creativiteit. – Johannes Romero",
    "4kKe4": "Je wachtwoord",
    "4tqb4x": "Hongaars",
    "4vdfwf": "OK",
    "4wlih": "Het verzoek is afgewezen vanwege onbevredigende parameters.",
    "52OiQ": "{0} keer gekopieerd",
    "532fd": "Innovatie is het vermogen om verandering als een kans te zien en niet als een bedreiging. -Steve Jobs",
    "54cwb": "Er is een fout opgetreden in de systeemwebsocket-API: {0}",
    "56ibcj": "Vietnamees",
    "57eaa": "Wij zijn slechts een geavanceerd apenras op een kleine planeet van een zeer gemiddelde ster. Maar we kunnen het heelal begrijpen. Dat maakt ons tot iets heel bijzonders. –Stefan Hawking",
    "58HQX": "Als u de waarde ervan niet weet, neem dan contact op met uw beheerder voor meer informatie. Deze kunt u vinden in zijn instellingen.",
    "58c03": "Innovatie is een sleutelfactor voor het succes van elk bedrijf. -Ravi Venkatesan",
    "58c5f": "Als het je in eerste instantie niet lukt, noem het dan versie 1.0. - Khayri RR Woulfe",
    "59f7d": "Innovatie is de katalysator voor vooruitgang en groei. -John Donahoe",
    "5BOhl": "uitnodigingscode",
    "5Ih2u": "Hulpmiddelen-navigator",
    "5NCPT": "Donkere modus",
    "5NJeGsu1": "E-Mail, u kunt eenvoudig uw inbox ordenen, berichten opstellen en verzenden en uw correspondentie bijhouden. Tot nu toe wordt het alleen gebruikt als communicatiemiddel tussen gebruikers en ons team.",
    "5NJeddqGsu1": "Deze sectie bevat computermateriaal, wiki-artikelen, gebruikshandleidingen en meer.",
    "5NJedqddqGsu1": "Deze sectie bevat computerbronnen die u kunt gebruiken om uw eigen projecten te bouwen.",
    "5Perd": "Sorry, de functie 'Gebruik Smart Editor' is nog niet beschikbaar. Wij zijn nog bezig met de implementatie ervan. Bedankt voor uw geduld.",
    "5ZBYR": "Rug",
    "5a8a1": "Innovatie is het proces waarbij een idee wordt omgezet in realiteit. -Kevin O'Leary",
    "5dF7o": "Vernieuwen",
    "5db54": "Wetenschap is het grote tegengif tegen het gif van enthousiasme en bijgeloof. - Adam Smith",
    "5eXVS": "Scriptinhoud",
    "5ggegx": "Koreaans",
    "5lW8qp": "Laat een voorbeeld zien van dit hulpmiddel",
    "5q-Zxqa": "Scriptbeheer",
    "5qPOJL": "Om LafTools te ondersteunen, kunt u overwegen om een ​​ster te geven aan onze repository op GitHub of om te upgraden naar onze professionele versie via een maandelijks abonnement. We zouden uw hulp zeer op prijs stellen en we beloven dat LafTools nog beter zal worden met het ingezamelde geld.",
    "5qV5Sf": "Verwijder deze record uit de lijst",
    "5rg5mt": "Madagaskar",
    "5srFq": "LafTools",
    "5v8jl7": "Hmong",
    "626bf": "Als we wisten wat we deden, zou het geen onderzoek heten, toch? –Albert Einstein",
    "63d47": "Kwaliteit is het product van een conflict tussen programmeurs en testers. – Jegor Bugayenk",
    "662f9": "Je leeft maar een keer, maar als je het goed doet is een keer genoeg. – Mae West",
    "66ef1": "Goede code is zijn eigen beste documentatie. Als je op het punt staat een opmerking toe te voegen, vraag jezelf dan af: ‘Hoe kan ik de code verbeteren zodat deze opmerking niet nodig is? ’ – Steve McConnell",
    "66f12": "Wetenschap is georganiseerde kennis. Wijsheid is georganiseerd leven. – Wil Durant",
    "6AumW": "Standaardactie",
    "6ClPV": "Creëren",
    "6MrfIfGc6": "Code verkleinen",
    "6UICxHzVR.name": "Verfraai {0}",
    "6a0da": "De kunst en wetenschap van het stellen van vragen is de bron van alle kennis. – Thomas Berger",
    "6cOPZ": "Binary-Coded Decimal (BCD) is een klasse binaire coderingen van decimale getallen waarbij elk decimaal cijfer wordt weergegeven door een vast aantal bits, meestal vier of acht. Voor een bord worden soms speciale bitpatronen gebruikt",
    "6hsnqWe": "Hoewel LafTools gratis en open source is, vergt het onderhoud ervan nog steeds een aanzienlijke hoeveelheid tijd en energie. We hebben vooral geld nodig om bepaalde cloud-API’s te betalen. Als u LafTools op prijs stelt, overweeg dan om ons te steunen.",
    "6j13s3": "IJslands",
    "6qT9d-N": "Voor de notebook biedt LafTools niet alleen shell-opdrachtbeheer, maar zal er in de nabije toekomst ook krachtige notitietools aan toevoegen, zoals MarkDown, Latex, {0}, enzovoort.",
    "6ulj8i": "Nepalees",
    "6wdtJ4vmg.name.0912": "Verklein {0}",
    "6yOXx": "Onbekende naam",
    "71L3OI9T7": "Het onderzoeken van de vrede, het bevorderen van samenwerking en het zoeken naar ontwikkeling is het thema van het huidige tijdperk geworden.",
    "71x7x": "Broncode op GitHub",
    "72bee": "Ik ben geen geweldige programmeur; Ik ben gewoon een goede programmeur met geweldige gewoonten. – Kent Beck",
    "74a91": "Testen leidt tot falen, en falen leidt tot begrip - Burt Rutan",
    "74f90": "De wetenschap van vandaag is de technologie van morgen. – Edward Teller",
    "7714b": "Innovatie is de sleutel tot het ontsluiten van nieuwe kansen en het stimuleren van groei.",
    "79f2d": "De meeste goede programmeurs programmeren niet omdat ze verwachten betaald te worden of bewondering te krijgen van het publiek, maar omdat het leuk is om te programmeren. - Linus Torvalds",
    "7MOO1": "Aanmelden",
    "7affb": "De wereld zal niet op ons wachten. De technologische revolutie zal ons achter ons laten als we de achterstand niet inhalen. – Kofi Annan",
    "7c59e": "Ervaring is de naam die iedereen aan zijn fouten geeft. –Oscar Wilde",
    "7d4e4": "Innovatie gaat over het vinden van nieuwe en betere manieren om dingen te doen. -Jim Rohn",
    "7dm0d8": "Traditioneel Chinees",
    "7e19d": "Verwarring hoort bij programmeren. – Felienne Hermans",
    "7flKa": "LafTools - De almachtige voor alle professionals en ingenieurs",
    "7g5w22": "Noors",
    "7k56u3": "Galicisch",
    "7q40W": "Kan de beheerder niet initialiseren",
    "7u4vzu": "Slowaaks",
    "7x3f6": "Tabblad - 1",
    "8259a": "Programmeur: Een machine die koffie in code verandert. – Anoniem",
    "82r0C": "Beheer uw TODO-lijst en krijg dingen efficiënter gedaan.",
    "83dNp": "Kan extensie-ID niet laden. (REF: 1dl1f)",
    "850c1": "De wetenschapper legt slechts twee dingen op, namelijk waarheid en oprechtheid, en legt deze aan zichzelf en aan andere wetenschappers op. - Erwin Schrödinger",
    "8582b": "Als we willen dat gebruikers onze software leuk vinden, moeten we deze zo ontwerpen dat hij zich als een sympathiek persoon gedraagt. – Alan Kuiper",
    "8692e": "Er zijn veel babbelaars, totaal onwetend van de wiskunde, die mijn hypothese durven te veroordelen, op gezag van een deel van de Bijbel dat is verdraaid om aan hun doel te voldoen. Ik waardeer ze niet en minacht hun ongefundeerde oordeel. – Nicolaas Copernicus",
    "886d1": "Wij zijn van mening dat zelfs als alle mogelijke wetenschappelijke vragen beantwoord zijn, de problemen van het leven nog steeds helemaal niet zijn aangepakt. – Ludwig Wittgenstein",
    "8LdRj": "Overzicht",
    "8LdRjq": "Berekenen",
    "8LdevRj": "Dienst",
    "8M1wY": "Lokale terminal",
    "8OqB7hN1s": "Deze pagina biedt een IDE UI-stijl voor LafTools, een hoger abstractieniveau voor LafTools.",
    "8c224": "Welk vakgebied je ook wilt uitoefenen, het is van groot belang om minimaal één programmeertaal te leren. – Ram Ray",
    "8e5d0": "Innovatie is de roep van de toekomst. – Kofi Annan",
    "8eeL1Kk": "Over",
    "8mn_qa": "De gegevens ophalen van terminalservices...",
    "8qzWJu": "Sorry, momenteel ondersteunen we nog geen apparaten met een klein scherm. Gebruik een pc om deze pagina te bezoeken.",
    "90b5e": "Het is geen bug; het is een ongedocumenteerde functie. – Anoniem",
    "91f08": "Het beste van technologie is dat u zich kunt concentreren op uw visie en de machines kunt vergeten. – John Landis",
    "9251d": "Innovatie is een sleutelfactor voor het vermogen van elk bedrijf om op de lange termijn succesvol te zijn. -Elon Musk",
    "92b29": "Innovatie is het proces waarbij een creatief idee wordt omgezet in een commercieel succes. -Richard Branson",
    "9334e": "De grootste glorie in het leven ligt niet in het nooit vallen, maar in het opstaan ​​elke keer dat we vallen. –Nelson Mandela",
    "9412b": "Los eerst het probleem op. Schrijf vervolgens de code. – John Johnson",
    "9469a": "Iedereen zou een computer moeten leren programmeren, omdat je hierdoor leert denken. - Steve Jobs",
    "97um9v": "Hawaïaans",
    "98KcL": "Converteert een decimaal getal naar binair gecodeerd decimaal (BCD).",
    "98d3f": "Wetenschap is magie die werkt. – Kurt Vonnegut",
    "9Xv8-": "Opslaan als notitie",
    "9YPgsPid2M": "SMS-code",
    "9_qaj": "Verlaat dit formulier",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Base64-encoder",
    "9b_7a0sdf": "Base64-decoder",
    "9cb71": "Innovatie gaat over het creëren van waarde voor klanten en het verbeteren van hun leven. -Reed Hastings",
    "9d18a": "Software komt uit de hemel als je goede hardware hebt. – Ken Olsen",
    "9e4fcl": "Tamil",
    "9eZHM": "Oeps! Het lijkt erop dat we enkele waarschuwingen of fouten tegenkomen.",
    "9gqo8x": "Lets",
    "9m85mf": "Sesotho",
    "9qy1xn": "Portugees",
    "9tbbkt": "Fins",
    "9zCSc": "Geen beschikbare werkplekken",
    "A69UZ": "Variabelen",
    "AVUvu": "Base62 is een notatie voor het coderen van willekeurige bytegegevens met behulp van een beperkte set symbolen die gemakkelijk door mensen kunnen worden gebruikt en door computers kunnen worden verwerkt. Het hoge grondtal resulteert in kortere reeksen dan bij het decimale of hexadecimale systeem.",
    "AW9N8": "Invoerregio",
    "AfPC0": "Uw wachtwoord in platte tekst",
    "Ahrjc": "De directory bestaat niet. Wilt u deze aanmaken?",
    "AkXgF": "In uitvoering: {0}%",
    "Apx8D": "Hoe kunt u uw wachtwoord handmatig opnieuw instellen?",
    "AvsWiJHLZ": "Bronnen",
    "B-GCloBBt": "Comprimeert XML-code (eXtensible Markup Language).",
    "B0s0z": "Doel van deze pagina:",
    "BGd7P9": "Met deze bewerking worden onbewerkte gegevens gecodeerd in een ASCII Base64-tekenreeks.",
    "BGd7dP9": "Met deze bewerking worden onbewerkte gegevens gecodeerd in een ASCII {0}-tekenreeks.",
    "BGdd7dP9": "Met deze bewerking worden onbewerkte gegevens gecodeerd in een ASCII {0}-tekenreeks.",
    "BJbgR": "Meld een probleem",
    "BQs6go-dk": "Gratis download LafTools voor Windows, Linux en macOS.",
    "BShq3M": "Problemen",
    "BW3bpT": "Het bestand vanaf schijf lezen...",
    "Bd9h-": "Voeg hem toe aan mijn favoriete collectie",
    "BuihG": "Systeem instellingen",
    "C3L9MmdDU7": "Handboek",
    "CASef": "Oké, de operatie is geactiveerd.",
    "CEv8B": "Weet u zeker dat u deze record wilt verwijderen? Zo ja, klik dan nogmaals op deze knop.",
    "CFg8B": "Grootte moet tussen 0 en 512 liggen",
    "CK5NCw519": "Gemeenschapsverhaal",
    "CVUl0": "LafTools",
    "CWoqhy": "Exts Lijst op geselecteerde categorie-ID",
    "C_qzLO7yw": "Gebruik Chrome, Firefox of Edge voor de beste ervaring.",
    "CfZAX": "Het bestand {0} geselecteerd, we uploaden het naar de kernservice.",
    "CidOqAZ": "Als maker van LafTools ben ik zo ontroerd dat u ons wilt steunen. We hebben goede mensen in ons team die hard werken om LafTools voortdurend te verbeteren.",
    "Cide2w": "Om te zien of er een probleem is tijdens het uitvoeren van uw actie.",
    "CqFdiBu6M": "Weergave",
    "Cz_qjjFw7": "Over {0}",
    "DIQFq": "Controleer of de URL-parameter correct is opgegeven. Het lijkt erop dat u geen toestemming heeft om dit formulier in te vullen. Standaard kunt u het onderstaande bericht zien in de uitvoer van de service wanneer deze net is gestart.",
    "DIweGq": "Beveilig uw LafTools",
    "DSEtLTxUU": "Tijd is de valuta van je leven, besteed het verstandig.",
    "DTTPW": "Reset status",
    "DVoKw": "Meld u af bij dit systeem",
    "DadYp": "Realtime debounce",
    "DqFI5": "Niveaus moeten groter zijn dan 0",
    "DrXAq": "Welkom bij het gebruik van LafTools!",
    "DrbEr": "Het door u opgegeven wachtwoord is leeg. Controleer dit en probeer het opnieuw.",
    "DtlAc": "Systeembronnen laden",
    "Dxlw0": "Compleet",
    "E62ej": "Shell-opdrachten filteren",
    "E6F9B": "Voeg het toe aan de workflow",
    "EEQkeW": "Het MD6-algoritme (Message-Digest 6) is een cryptografische hashfunctie. Het maakt gebruik van een Merkle-boomachtige structuur om een ​​enorme parallelle berekening van hashes voor zeer lange invoer mogelijk te maken.",
    "EO6Qv5dCA": "Verkleint JSON-code, verkleint de bundelgrootte van uw JSON-code.",
    "ERK7E": "Als u een probleem tegenkomt of een suggestie heeft tijdens het gebruik van LafTools, neem dan gerust contact met ons op via e-mail of GitHub. We zijn bereid dit dringend te verbeteren.",
    "EgBXL": "Selecteer of geef tags op.",
    "Ewvgo": "Nog niet gestart.",
    "ExqvX": "Lijst met sneltoetsen",
    "Eyq856": "We zijn nog niet klaar: we streven ernaar de nieuwste en beste functies te bieden en we blijven updates uitbrengen om ervoor te zorgen dat u de best mogelijke ervaring heeft.",
    "Ezsn81tfc": "Weergave",
    "F-OUm": "Snelle installatie voor LafTools",
    "F0CCF": "Lijst met sneltoetsen",
    "F4uS2": "Nieuw bestand",
    "FAQ": "Veel Gestelde Vragen",
    "FBVyc": "Voer de verificatiecode opnieuw in",
    "FDlRI": "Geef dit nieuwe tabblad een naam en klik om het te bevestigen.",
    "FLsbFsOZq": "IDE",
    "FOyHW": "Zoek overal",
    "FQzhg": "Negeer lege invoer",
    "FYRoL": "Laat Cascading Style Sheets (CSS)-code inspringen en verfraaien.",
    "FhVWl": "Versleutel uw wachtwoord",
    "FjYbR": "Uitvoer",
    "Fv-zz": "Kopieer resultaat",
    "Fy217": "Configureer dit hulpprogramma",
    "Fzp3t": "Geef een waarde op in dit veld",
    "G2dvTUljF": "Hulpmiddelen",
    "G3MJN": "Uitvoerpaneel tonen",
    "G9QVo": "Beheer tabbladen",
    "GR7jK": "Type",
    "GaySMPQHo": "Populair",
    "Ggob_": "Annuleren",
    "H-Ae75": "Bevestig uw lokale wachtwoord.",
    "H-qA75": "Geef een lokaal wachtwoord op.",
    "H8fQ4": "Schakel over naar de lichte of donkere modus",
    "HEAhr": "Na het vertalen verschijnt het resultaat hier.",
    "HIc3c": "Voltooid",
    "HNDat": "Als u wijzigingen wilt aanbrengen, klikt u op de knop '{0}'. Klik anders op '{1}' om uw wijzigingen toe te passen. Veel plezier met deze gereedschapskist!",
    "Hflf2": "Omwille van de cyberveiligheid helpen we u niet uw wachtwoord opnieuw in te stellen via API's of pagina's hier, tenzij u het door het systeem beveiligde bestand handmatig bijwerkt.",
    "HjvV3": "We zullen de bestanden op de schijf niet verwijderen, maar verwijder dit record gewoon uit de lijst.",
    "HyIC_": "Slash-toets (/)",
    "HyIC_d": "Slash-toets (/)",
    "I8FLi": "Nu is het tijd om uw beheerder in te stellen. Stel het wachtwoord zo complex mogelijk in, zodat u die onbeleefde aanvallers kunt verbijsteren.",
    "IAC0A": "Zoekhulpmiddelen",
    "ICefi": "Geannuleerd",
    "IEFy5k39X": "Generatoren",
    "IKqqATS": "Ververs huidige paginagegevens",
    "IOOrz": "(Zou dit schadelijk zijn voor uw systeem? Wij denken van niet, zolang u het door het systeem bewaarde configuratiebestand kunt wijzigen, betekent dit dat u alles over de LafTools-gegevensbestanden mag lezen.)",
    "IWPP6V-tR": "Broncode",
    "IWUH5": "Voorbeeld tonen",
    "IaSyO": "Annuleren",
    "Ibzs2-Ho1": "CSV-hulpmiddelen",
    "IfsGO": "Favorieten",
    "IfsdGO": "Favorieten",
    "ImUmf": "Nieuw",
    "IugAFc4OT": "Er is een probleem opgetreden bij het verzenden van uw gegevens.",
    "IxAJswoSh": "Parseert en mooie afdrukken van geldige JavaScript-code. Werkt ook met JavaScript Object Notation (JSON).",
    "J-3KA": "Geef een naam op voor dit script, dat zou handiger zijn.",
    "J164i": "bijv. Kopieer bestanden naar een externe server",
    "J2xoL": "Zie de fout: {0}",
    "JA_Bp": "Geef eerst een naam op voor de nieuwe tag.",
    "JQEVK": "Code",
    "JQLmS": "De maat aangepast",
    "JQLmSq": "Voltooid.",
    "JTBRh": "LafTools heeft de wachtwoordwaarde opgeslagen in het lokale bestand, maar maak je geen zorgen, we hebben een eenrichtingswachtwoordversleutelingsmechanisme aangenomen, dat wil zeggen dat niemand het wachtwoord van de platte tekstversie kan lezen. Om het wachtwoord opnieuw in te stellen, volgt u onderstaande instrumenten om uw wachtwoord handmatig opnieuw in te stellen.",
    "JYqxz2": "Welkom bij LafTools, dit is een insiderversie.",
    "Jbor69IBw": "Formatters",
    "JdqiUE8": "Deze bewerking decodeert gegevens uit een ASCII-reeks (met een alfabet naar keuze, inclusief voorinstellingen) terug naar hun ruwe vorm.",
    "JdqidUE8": "Deze bewerking decodeert gegevens uit een ASCII-reeks (met een alfabet naar keuze, inclusief voorinstellingen) terug naar hun ruwe vorm.",
    "JfFHw": "Verzoek om werkruimte-informatie",
    "JiUE8": "Deze bewerking decodeert gegevens uit een ASCII {0}-tekenreeks terug naar het onbewerkte formaat.",
    "Jq7x3Igk0": "Probeer Client UI-stijl",
    "JuZAli3": "Handleiding",
    "K1qJZI": "Welkom bij LafTools, Excellentie.",
    "KGS2-": "Nadat u bovenstaande stappen heeft voltooid, kunt u uw nieuwe wachtwoord gebruiken om u aan te melden bij uw systeem. Als u geen toegang heeft tot het bestandssysteem, vraag dan uw beheerder of IT-ondersteuning om dat bestand te maken. Als het bestand al bestond, verwijder het dan en maak een nieuw bestand.",
    "KIc63": "Functie nog niet ondersteund",
    "KYh1N": "Alle notities",
    "KcqrRr": "Referentie",
    "KcrRr": "Code-implementatiegegevens ophalen",
    "KmEUF": "Geef een snel overzicht van de huidige systeemtools.",
    "Kw4OJr": "Terminal",
    "Kyd9H": "Broncode op GitHub",
    "L-p-Y": "Kopieer de inhoud van het huidige shell-commando naar het klembord",
    "L3zEM": "Voorbeeld tonen",
    "L42mxa": "Voer in dit veld uw brontekst in.",
    "L49kCq": "Geef en bevestig het slotwachtwoord in dit formulier om uw LafTools te beveiligen.",
    "L71q_N": "Het door u opgegeven wachtwoord is leeg. Controleer dit en probeer het opnieuw.",
    "L9bQku": "Decodeer {0}",
    "L9qbQku": "Decodeer {0}",
    "LAc1m": "De app-weergave vernieuwd.",
    "LFdvM": "Niet ingelogd",
    "LM715": "i18n-configuratie ophalen van lokale server-API",
    "LPJrV": "Kopieer resultaat",
    "LSohY6eZW": "Hex String is een reeks hexadecimale bytes, gescheiden door een scheidingsteken, dat een spatie, komma, puntkomma of dubbele punt kan zijn.",
    "LU9Jj": "Base85 (ook wel Ascii85 genoemd) is een notatie voor het coderen van willekeurige bytegegevens. Het is meestal efficiënter dan Base64. Deze bewerking decodeert gegevens uit een ASCII-reeks (met een alfabet naar keuze, inclusief voorinstellingen). Base85 wordt vaak gebruikt in de PostScript- en PDF-bestandsformaten van Adobe.",
    "LWaeFqd": "Schakel over naar uw voorkeurstaal",
    "Le71_N-": "Het door u opgegeven wachtwoord is niet hetzelfde als het bevestigde wachtwoord. Controleer dit en probeer het opnieuw.",
    "LnJ4H": "Houd er rekening mee dat het lokale account totaal niet hetzelfde is als dat van de geregistreerde gebruiker op onze website; het eerste wordt alleen op uw pc gedefinieerd, terwijl het laatste kan worden gebruikt voor cloudsynchronisatie.",
    "LqWaFd": "Systeem instellingen",
    "LxaEFHbfa": "Verkleint SQL-code, verkleint de bundelgrootte van uw SQL-code.",
    "M3qytc": "Codeer {0}",
    "M3ytc": "Codeer {0}",
    "M4ywN1": "Rekenmachine, kalender, klok, weer en meer.",
    "M6MrW": "Goed",
    "M7jct": "Ga naar de modus Volledig scherm",
    "MN2lT": "De lengte van het wachtwoord mag niet minder zijn dan 6",
    "Ma5mv": "Schakel de zichtbaarheid van werkbalktabbladen in of uit",
    "Mq9pdpT": "Maak een lijst van alle relevante bronnen voor het functionele menu dat u hebt geselecteerd.",
    "Mq9ppT": "Bekijk snel de status van uw diensten",
    "Mqq9pdpT": "Helpt u aan de slag te gaan met LafTools.",
    "MrgmU": "Bevestigen",
    "NMLOn": "Kopieer Bestandspad",
    "NMLOn1": "Werkruimte openen",
    "NNfJo": "Gegevens uit bestand laden",
    "Nq1IR": "Kan extensie-VM niet laden",
    "Nqc0LqwX": "Als u denkt dat er een kwetsbaarheid in dit proces zit, kunt u op elk gewenst moment contact met ons opnemen via e-mail of GitHub. We willen dit graag dringend verbeteren.",
    "NrQc8OJfZ": "Comprimeert JavaScript Object Notation (JSON)-code.",
    "O02-W": "Niet laden...",
    "O94Yx": "op",
    "OBjaZqTvx": "Thuis",
    "OO0qPN": "Voorbeeld geladen",
    "OQWm4": "Rapporteer een bug",
    "OSHOI": "Welkomstpagina",
    "OSqZQM": "Lokaal wachtwoord",
    "OeO0PeN": "Oké, het voorbeeld wordt weergegeven in de invoereditor.",
    "OeOQY": "TE DOEN",
    "Ol1ZcWomT": "{0} Verfraai",
    "OpPFe": "Als je LafTools leuk vindt, deel het dan met je vrienden en geef ons een ster, bedankt!",
    "Opcty": "Bestanden",
    "OqqGx2qg": "De statische bronnen worden geladen. Even geduld a.u.b....",
    "OrCt5": "Doorverwijzen naar de werkbank...",
    "Ot6EP": "Pools gereedschap",
    "OyZLZokUQ": "Maak ontwikkeling mogelijk met LafTools!",
    "P4ROa": "Uitvoerregio",
    "PM_N5": "Sessie - {0}",
    "PUxuU": "Gegevens voor taalpakketten ophalen...",
    "PapkF": "Als u vragen of suggesties heeft over LafTools, laat het ons dan gerust weten. We zijn altijd op zoek naar manieren om ons product te verbeteren en onze gebruikers de best mogelijke ervaring te bieden. U kunt contact met ons opnemen via work7z@outlook.com. Bedankt voor het gebruik van LafTools!",
    "PpCHA": "Vraagsleutel(?)",
    "PqazM-": "Gebruik eerst onderstaande formulieropties om uw wachtwoord te coderen",
    "QL9Sn": "Er lijkt momenteel geen beschrijving beschikbaar te zijn.",
    "QLKzF": "Het zit boordevol functies die tegemoetkomen aan de behoeften van zowel beginnende als ervaren ontwikkelaars, waardoor het een onmisbare tool is in het arsenaal van elke programmeur.",
    "QM2Ob": "Recente hulpmiddelen",
    "QM2Oq": "Recente opmerkingen",
    "QRAdA": "Engels naar Chinees",
    "QZK58Gemi": "Comprimeert Structured Query Language (SQL)-code.",
    "QhdpH": "Community-editie",
    "QkJ-TOduip6z_": "LafTools IDE",
    "QvBKp9BBp": "Lees meer over de ontwikkelingsplanning van LafTools.",
    "QzlA3": "Er is een fout opgetreden",
    "R12bq": "Geef tabbladen weer die niet worden weergegeven",
    "RNBze0": "Hulpmiddelen",
    "RNeBze0": "Geopende tabbladen",
    "RNewBze0": "Gereedschapsconfiguratie",
    "RO4ZP": "Er is een fout opgetreden",
    "RPVRl": "Het lijkt erop dat deze extensie niet compatibel is met de huidige versie van LafTools. Overweeg alstublieft om de nieuwste versie te installeren om deze extensie te ondersteunen, of neem gerust contact met ons op door een probleem aan te kaarten op GitHub.",
    "RhqzcdD": "Systeem instellingen",
    "RjCO3": "Lijst met werkruimten",
    "RjdigcxfV": "Neem contact met ons op",
    "S4MMV": "Oeps! We hebben enkele problemen aangetroffen tijdens het laden van het bestand.",
    "SAnnQ": "Het bestand laden {0}",
    "SBsDz": "Installatie voor uw beheerdersaccount.",
    "SGs7B": "Stel uw LafTools snel in",
    "SMqD13": "Toets in om te filteren",
    "SPem9": "Dit veld is nog niet klaar.",
    "SQAw7": "Brontaal",
    "SYSq1": "Voorbeeld",
    "SZgXb": "Lokaal wachtwoord instellen",
    "SdGcT": "Ander deel",
    "Sm9tq": "Geef hier het accountwachtwoord op",
    "Sm9tqq": "Geef een wachtwoord op om uw LafTools te ontgrendelen",
    "Spcfdee": "Lichte of donkere modus",
    "TBPqy7": "Taal",
    "TD7DA": "Talen",
    "TNoePE": "LafTools-cloud",
    "TV09-obNr": "Mijlpaal",
    "Ttrqqet": "Schrijf en bewaar hier uw gedachten!",
    "TwFcr": "Doel taal",
    "TyqvWY3": "Lokaal bestand",
    "U2ZNl": "Meer informatie op Wikipedia",
    "U4qqq9": "Verwijder dit tabblad uit de lijst",
    "U7zP2": "Geef hier de gebruikersnaam van uw account op",
    "UED59zbd-": "LafTools",
    "UF_Dp": "Er is een fout opgetreden: {0}, de afgewezen tijd is {1}",
    "UVvJp-vtF": "{0} Verkleinen",
    "UZ2Ig": "Nieuw lokaal account",
    "Ugpng": "Favoriet",
    "UjkOS50wO": "Thuis",
    "V2A74ySoN": "Weergave",
    "V6U_f": "Servicevoorwaarden",
    "V6XEO": "Voer gebruikersnaam of e-mailadres in",
    "VAZq8r": "Hiermee kunnen ontwikkelaars verschillende opdrachten uitvoeren, zoals het uitvoeren van scripts, het installeren van pakketten en het navigeren door het bestandssysteem, allemaal vanuit de editor.",
    "VEfeqZG": "Opmerkingen",
    "VI6VT": "Geschiedenis",
    "VOsZc": "Rapporteer probleem",
    "VSZ": "Klik om opnieuw te activeren",
    "VZtqg6": "Maak een nieuw scriptformulier",
    "Vaf2y": "Tabnaam kan niet leeg zijn.",
    "VeY9K": "Gebruiksvoorwaarden",
    "VgG5y": "Klik hier om de status van uw extensie te vernieuwen",
    "VjZCv": "Realtime conversie",
    "Vvt09V2Qo": "Generieke code",
    "WFUWzv_px": "Parseert en mooie afdrukken van geldige JavaScript-code. Werkt ook met JavaScript Object Notation (JSON).",
    "WKG7e": "Reglement",
    "WPrTW": "Officiële website",
    "WXo6D": "Vernieuwd",
    "WYCVL": "Snelle installatie",
    "X4L_Z": "Extensie-VM is niet voorzien.",
    "X6Fq4j": "Na jaren van toegewijde ontwikkeling en verfijning zijn we ervan overtuigd dat LafTools uw programmeerervaring aanzienlijk kan verbeteren door meer gemak en efficiëntie in uw workflow te brengen.",
    "XKpI0": "Klik om uw tekst in het invoergebied te verwerken",
    "XLWoR": "Selecteer uw voorkeur en ga verder",
    "XQxJB": "Mijn werkruimten",
    "X_HGx": "LafTools is een veelzijdige gereedschapskist die is ontworpen om aan verschillende behoeften te voldoen. Het is volledig open source en garandeert transparantie en veiligheid. Ondanks de lichtgewicht runtime biedt het volledige platformondersteuning, inclusief ARMv8, en native AI-ondersteuning vergelijkbaar met ChatGPT. LafTools is sterk geïntegreerd met een productieve gebruikersinterface en wordt voortdurend bijgewerkt met nieuwe tools. Het kan via internet en met Docker worden gebruikt en biedt aanvullende bronnen zoals notities en handleidingen.",
    "XeXF77": "Instellingen",
    "XikdD": "Momenten alstublieft, we zijn er bijna!",
    "Y5GAC": "Je gebruikersnaam",
    "Y9mQ2": "Geef hier de gebruikersnaam van uw account op",
    "YAAU3q": "Lokaal wachtwoord",
    "YHCjT": "LafTools ondersteunt het globale lichte en donkere thema, het is vooral handig bij codeerders in de nachtploeg.",
    "YNwKz": "Niet-ondersteunde taal: {0}, standaard wordt Engels gebruikt.",
    "YOYTp": "Snelle installatie",
    "YPPPL": "Schakel de zichtbaarheid van werkbalktabbladen in of uit",
    "YQN9u": "Er is een fout opgetreden tijdens het laden van {0}. Controleer onderstaande details.",
    "Y__Zb1_4Q": "Minimaliseert Cascading Style Sheets (CSS)-code en verwijdert alle onnodige tekens.",
    "Y_k0z": "Wachtwoord vergeten?",
    "Ye3TXses": "Om te configureren of de transformatie automatisch wordt uitgevoerd wanneer de invoertekst wordt gewijzigd.",
    "Ylq2X": "Foutcorrectie",
    "YquQqTXq": "Automatisch uitvoeren?",
    "YrTdq": "Alle",
    "YrVq683": "Mail",
    "YrVqdd683": "Handleidingen",
    "Z2QTU": "Over",
    "Z3rhY": "Bericht",
    "Z7ALO": "Overgeschakeld naar de geselecteerde werkruimte",
    "Z7OTt": "Het door u geselecteerde bestand is te groot. Selecteer een bestand dat kleiner is dan 30 MB.",
    "ZAGva": "Weet u zeker dat u deze werkruimte wilt verwijderen?",
    "ZAKaFq": "Mijn Cloud-account",
    "ZCzH8": "Nieuwste",
    "ZW1Dgz": "Geen beschikbaar bericht",
    "ZXRGC": "Zie de fout: {0}",
    "ZaS8MP8cr": "Let op: De verificatiecode is vernieuwd. Pas uw formulierwaarden aan en voer de code opnieuw in om door te gaan.",
    "ZbD3F": "{0}, gemaakt door het LafTools-team",
    "Zk7JI": "Het wordt nog niet ondersteund",
    "ZrbduC": "Sluit alle tabbladen",
    "ZrbuC": "Sluit Tab",
    "_5OqeG": "Markeer het",
    "_LFF3": "Mocht u een probleem tegenkomen of een suggestie hebben tijdens het gebruik van LafTools, neem dan gerust contact met ons op via e-mail of GitHub. We zijn bereid dit te verbeteren.",
    "_trez": "Wissel tekst uit",
    "_trqL": "Gegevens voor systeembronnen ophalen...",
    "_z3lR": "Vernieuwingscode",
    "a0ab0": "Kunst is de levensboom. Wetenschap is de boom des doods. – William Blake",
    "a2849": "Wetenschap is de acceptatie van wat werkt en de afwijzing van wat niet werkt. Daar is meer moed voor nodig dan we misschien denken. –Jacob Bronowski",
    "a3508": "Uitgerust met zijn vijf zintuigen verkent de mens het universum om hem heen en noemt het avontuur Wetenschap. –Edwin Hubble",
    "a3yqoz": "Perzisch",
    "a3z-3k12": "Hulpmiddelen voor IP-adressen",
    "a4jbpq": "Tsjechisch",
    "a5354": "Het is vreemd dat alleen buitengewone door de mens gemaakte ontdekkingen later zo gemakkelijk en eenvoudig lijken. – George C. Lichtenberg",
    "a7062": "Innovatie is de vonk die vooruitgang doet ontbranden. -Robyn M. D'Angelo",
    "a8a34": "Innovatie is het visitekaartje van de toekomst. -Anna Eshoo",
    "a8dd9": "Het leven kan geen willekeurig begin hebben... het probleem is dat er ongeveer 2000 enzymen zijn, en de kans om ze allemaal te verkrijgen in een willekeurige proef is slechts één deel op 10^40.000, een schandalig kleine waarschijnlijkheid die zelfs als het hele universum niet zou kunnen worden onder ogen gezien. bestond uit biologische soep. – Fred Hoyle",
    "aCkOP": "Uitgang",
    "aHAfR": "Gegevens ophalen voor {0}...",
    "aISK9iYc_": "Illegaal informatierapport",
    "aSOpr": "Gegevensmodelgenerator",
    "aa2f1": "Verkennen is wat je doet als je niet weet wat je doet. Dat is wat wetenschappers elke dag doen. Als een wetenschapper al wist wat hij deed, zou hij niets ontdekken, omdat hij al wist wat hij deed. – Neil deGrasse Tyson",
    "aa3a4": "Code is als humor. Als je het moet uitleggen, is het slecht. – Coryhuis",
    "ab5f7": "Het treurigste aspect van het leven op dit moment is dat de wetenschap sneller kennis verzamelt dan de samenleving wijsheid verzamelt. – Isaac Asimov",
    "about_LafTools_toolbox": "Over LafTools",
    "ac615": "Zorg ervoor dat het werkt, maak het goed, zorg ervoor dat het snel gebeurt. – Kent Beck",
    "adcca": "Elke dwaas kan code schrijven die een computer kan begrijpen. Goede programmeurs schrijven code die mensen kunnen begrijpen. – Martin Fowler",
    "adpgq": "Creëer een nieuwe werkruimte",
    "af3158": "Alles wordt bepaald... door krachten waarover we geen controle hebben. -Albert Einstein",
    "afcb9": "Niets heeft zoveel kracht om de geest te verruimen als het vermogen om systematisch en waarachtig alles te onderzoeken wat onder uw observatie in het leven valt. – Marcus Aurelius",
    "afe52": "Er is altijd nog een bug die moet worden opgelost. – Ellen Ullman",
    "ah-C4": "Nieuwe notitie",
    "aj3nhd": "Duits",
    "aked6": "Referenties",
    "aked61": "Invoering",
    "asElV": "Verwijderen",
    "az4uS2": "Weet u zeker dat u zich bij dit systeem wilt afmelden? Houd er rekening mee dat u wordt doorgestuurd naar de inlogpagina.",
    "azpNX": "Voltooid.",
    "azsd": "snelle navigatie",
    "b0qjSL": "Voer de map {1} in en maak een bestand {2}. Voer uw gecodeerde wachtwoord in als de volledige bestandsinhoud.",
    "b194e": "Innovatie komt van de producent – ​​niet van de klant. -W. Edwards Deming",
    "b19bb": "De dag dat de wetenschap niet-fysieke verschijnselen begint te bestuderen, zal zij in één decennium meer vooruitgang boeken dan in alle voorgaande eeuwen van haar bestaan. - Nikola Tesla",
    "b2724": "Programmeren is de kunst om een ​​ander mens te vertellen wat hij wil dat de computer doet. – Donald Ervin Knuth",
    "b4603": "Het leven is wat er gebeurt als je bezig bent met het maken van andere plannen. - John Lennon",
    "b5014": "Veel van de mislukkingen in het leven zijn mensen die zich niet realiseerden hoe dicht ze bij succes waren toen ze het opgaven.– Thomas A. Edison",
    "b6sx9b": "Filipijns",
    "b7wgrhuXl": "Technologie",
    "bP_6qG": "Tips voor het vergeten van uw wachtwoord",
    "bT4R6": "Nieuw tabblad",
    "bVlBN": "Chinees naar Engels",
    "bWQunyU10": "AI-laboratorium",
    "bc574": "Innovatie is de levensader van een gezond bedrijf. -Mark Cuban",
    "bc92f": "Succesvolle innovatie begint met een klantbehoefte. -Michael Dell",
    "be-Favourite-it": "Toevoegen aan favorieten",
    "beb6e": "Ideeën zijn gemakkelijk. Implementatie is moeilijk. -Guy Kawasaki",
    "bfb8e": "Innovatie is de sleutel om relevant en concurrerend op de markt te blijven. -Mark Zuckerberg",
    "bhojei1": "Traditioneel Chinees",
    "bjZyW": "Vertalen",
    "bors14": "Turks",
    "bp_-b": "Om de LafTools volledig te beheren, moet u uw beheerder aan het begin van de installatieprocedure instellen. We hebben uw identificatie geverifieerd aan de hand van het URL-parametertoken. U kunt er zeker van zijn dat niemand anders uw root-toestemming kan instellen, tenzij hij of zij een installatietoken verkrijgt.",
    "bqqrij": "Swahili",
    "bsWpBA73s": "Comprimeert JavaScript-code.",
    "c0eCw": "Vertaal uw tekst in elke gewenste taal.",
    "c5meku": "Soendanees",
    "c7Uoqqe": "Voordat u LafTools gebruikt, dient u uw lokale wachtwoord op te geven en te bevestigen, zoals hieronder.",
    "c7cfc": "Een goede test is een test waarbij de kans groot is dat de code wordt gebroken als er een probleem is - Michael Bolton",
    "cMBqyyFae": "Inspringt en verfraait SQL-code (Structured Query Language).",
    "cNQp_": "Bronnen",
    "cPS6q": "Alle gereedschappen",
    "cQqwI8r": "Het laden van de status van Terminal Service",
    "cae2c": "Innovatie is het proces waarbij ideeën worden omgezet in realiteit. -Neil Lawrence",
    "cd4d1": "Innovatie is de sleutel tot bedrijfsgroei. -Andrew R. Steinberg",
    "cfYYN": "Ontdek meer",
    "ciZV2": "Base32 is een notatie voor het coderen van willekeurige bytegegevens met behulp van een beperkte set symbolen die gemakkelijk door mensen kunnen worden gebruikt en door computers kunnen worden verwerkt. Het gebruikt een kleinere reeks tekens dan Base64, meestal het alfabet in hoofdletters en de cijfers 2 tot en met 7.",
    "ciZV21": "Base45 is een notatie voor het coderen van willekeurige bytegegevens met behulp van een beperkte set symbolen die gemakkelijk door mensen kunnen worden gebruikt en door computers kunnen worden verwerkt. Het hoge grondtal resulteert in kortere reeksen dan bij het decimale of hexadecimale systeem. Base45 is geoptimaliseerd voor gebruik met QR-codes.",
    "ciZV2deq1": "Base58 (vergelijkbaar met Base64) is een notatie voor het coderen van willekeurige bytegegevens. Het verschilt van Base64 door het verwijderen van gemakkelijk verkeerd leesbare tekens (zoals l, I, 0 en O) om de menselijke leesbaarheid te verbeteren. Base58 wordt vaak gebruikt in cryptocurrencies (Bitcoin, Ripple, enz.).",
    "cj1pd": "Vernieuwingsbewerking",
    "cjzqj9": "Bosnisch",
    "cmxzpg": "Malayalam",
    "coM2I": "Gebruik Slimme Editor",
    "crD7I": "Om te configureren of de transformatie de lege invoertekst met een lengte nul moet negeren.",
    "cuRCb": "Categorie niet gevonden.",
    "cuRCqb": "Categorie bestaat niet",
    "cxqhqa": "Myanmar (Birmees)",
    "d-l2l": "Bevestigen",
    "d-qPr": "Onbekende indeling: {0}",
    "d0624": "Innovatie gaat niet alleen over het bedenken van nieuwe ideeën, maar ook over het effectief uitvoeren ervan. -Jeff Bezos",
    "d10c9": "Innovatie is de sleutel tot het ontsluiten van nieuw potentieel en het ontsluiten van nieuwe markten. -Tim kookt",
    "d1820": "Totdat de mens een grassprietje dupliceert, kan de natuur lachen om zijn zogenaamde wetenschappelijke kennis. – Thomas Edison",
    "d366a": "Innovatie is de sleutel tot het ontsluiten van nieuwe groei. -Philip Kotler",
    "d5KZH": "Bedankt voor het gebruik van LafTools!",
    "d5LAU": "Gelicentieerd onder AGPLv3",
    "d5fmq2": "Italiaans",
    "d5hit": "Sessie - {0}",
    "d5x1rl": "Spaans",
    "d7dc4": "Testen is het proces waarbij een systeem of de componenten ervan worden geëvalueerd met de bedoeling vast te stellen of het aan de gespecificeerde eisen voldoet of niet - Anoniem",
    "dCFIC": "Code mooier",
    "dCFIwC": "Codegenerator",
    "dGKMx": "Uitvoer",
    "dGVUB": "Netwerkhulpmiddelen",
    "dO6b2Tkqwe": "Recent gebruikte hulpmiddelen",
    "dQwjNbi0y": "Meer informatie over Documentatie",
    "dV5Eq": "Werkruimtelijst vernieuwen",
    "da74c": "Speculatie en het onderzoeken van ideeën die verder gaan dan wat we met zekerheid weten, zijn wat tot vooruitgang leidt. – Lisa Randall",
    "dc662": "De enige echte fout is die waarvan we niets leren: John Powell",
    "dcebe": "Als debuggen het proces is waarbij softwarefouten worden verwijderd, dan moet programmeren het proces zijn waarbij ze worden ingevoerd -Edsger Dijkstra",
    "ddcc7": "Innovatie is de sleutel tot succes in de moderne economie. - Satya Nadella",
    "ddsdf3159": "Natuurkunde is eigenlijk niets meer dan een zoektocht naar ultieme eenvoud, maar tot nu toe is het enige wat we hebben een soort elegante rommeligheid. -Bill Bryson",
    "de47c": "Testen is de kunst van het vinden van een zwarte doos en deze laten zingen -James Bach",
    "dk122q": "Beheer uw workflows om meerdere tools samen te combineren.",
    "dkarh": "Oké, toolbox heeft de map geopend. Als er geen pop-upvenster verschijnt, controleer dan of uw platform deze functie ondersteunt, of dat de directory zich op de server bevindt.",
    "dkjk12": "dit is een proef",
    "dkkq12": "Configureer uw tool op dit tabblad.",
    "dl4kr": "Wachtwoord vergeten?",
    "download-local": "Downloaden",
    "dpRY4": "Woordenboek",
    "dqTqyvWY": "Lademenu",
    "dsdpA_eJ": "Pas de grootte aan",
    "dtjdt4": "Kazachs",
    "dxLQq": "Root-toestemming",
    "dzjTo": "Geef hier het accountwachtwoord op",
    "e--gB": "Extensie-ID is niet opgegeven.",
    "e097e": "Innovatie gaat over het creëren van nieuwe mogelijkheden, niet alleen over nieuwe producten. -Tony Robbins",
    "e2379": "We leven in een samenleving die buitengewoon afhankelijk is van wetenschap en technologie, waarin bijna niemand iets weet over wetenschap en technologie. - Carl sagan",
    "e3WgQaZlb": "Comprimeert {0}",
    "e4Cd8t": "Basis85",
    "e5rycw": "Kirgizisch",
    "e8Crq": "Vul het onderstaande veld voor gebruikersnaam en wachtwoord in om door te gaan.",
    "e984f": "Schone code ziet er altijd uit alsof deze is geschreven door iemand die er om geeft. – Robert C. Martin",
    "eTmq": "Geschiedenis van CodeGen ToolBox",
    "e_8pZ": "Een veelzijdige toolbox voor ontwikkelaars om de productiviteit te verbeteren.",
    "ea227": "De beste manier om de toekomst te voorspellen is door deze te creëren. -Peter drucker",
    "ediql2": "Hongaars",
    "ee7d0": "Het gevoel van ontzag en verwondering dat de wetenschap ons kan geven, is een van de hoogste ervaringen waartoe de menselijke psyche in staat is. - Richard Dawkins",
    "egkqC8t": "Basis58",
    "egkqCd8t": "Basis62",
    "eifoni": "Catalaans",
    "englishcorner": "Engels",
    "eqkqd4W": "Geef een naam op voor de nieuwe tag",
    "etV-l": "Kopieer bestanden naar SIT2",
    "eu5mh0": "Wit-Russisch",
    "euaI8": "Maak een nieuw lokaal account",
    "euhy9v": "Ests",
    "f0d15": "Computers zijn snel; ontwikkelaars houden ze traag. – Anoniem",
    "f12bb": "Innovatie is de drijvende kracht achter vooruitgang in de zakenwereld. Het is het proces waarbij nieuwe ideeën worden gegenereerd en deze worden omgezet in tastbare producten, diensten of processen die waarde opleveren voor klanten.",
    "f23c2": "Innovatie maakt onderscheid tussen een leider en een volger. -Steve Jobs",
    "f29b1": "Vooruitgang wordt geboekt door vallen en opstaan; De mislukkingen zijn over het algemeen honderd keer talrijker dan de successen, maar toch worden ze meestal niet vastgelegd. – William Ramsay",
    "f3151": "Het grootste risico is geen enkel risico nemen. -Mark Zuckerberg",
    "f3159": "Wiskunde is een spel dat wordt gespeeld volgens bepaalde eenvoudige regels met betekenisloze markeringen op papier. -David Hilbert",
    "f315e7": "Wiskunde kent geen rassen of geografische grenzen. -David Hilbert",
    "f3160": "Wiskunde is de hoogste rechter; tegen zijn beslissingen is geen beroep mogelijk. -Tobias Dantzig",
    "f3161": "In de wiskunde moet de kunst van het stellen van een vraag van grotere waarde worden geacht dan het oplossen ervan. -Georg Cantor",
    "f3162": "Wiskunde is een plek waar je dingen kunt doen die je in de echte wereld niet kunt doen. -Marcus du Sautoy",
    "f3163": "De vooruitgang en perfectie van de wiskunde zijn nauw verbonden met de welvaart van de staat. -Napoleon Bonaparte",
    "f3164": "De essentie van wiskunde ligt in haar vrijheid. -Georg Cantor",
    "f3165": "Wiskunde is de wetenschap van wat op zichzelf duidelijk is. -Carl Jacobi",
    "f3166": "Als je het goed bekijkt, bezit de wiskunde niet alleen de waarheid, maar ook de allerhoogste schoonheid. -Bertrand Russel",
    "f3167": "Wiskunde is het hulpmiddel dat speciaal geschikt is voor het omgaan met abstracte concepten van welke aard dan ook. -P. Dirac",
    "f3168": "Wiskunde onthult haar geheimen alleen aan degenen die haar met pure liefde benaderen, vanwege haar eigen schoonheid. -Archimedes",
    "f3169": "Wiskunde is de mooiste en krachtigste creatie van de menselijke geest. -Stefan Banach",
    "f3170": "De wiskundige bestudeert geen zuivere wiskunde omdat het nuttig is; hij bestudeert het omdat hij er plezier in heeft en hij heeft er plezier in omdat het mooi is. -Henri Poincaré",
    "f3171": "De studie van de wiskunde begint, net als de Nijl, in minutieusheid, maar eindigt in grootsheid. -Charles Caleb Colton",
    "f318e4": "Biologie is de krachtigste technologie die ooit is gemaakt. DNA is software, eiwitten zijn hardware, cellen zijn fabrieken. -Arvind Gupta",
    "f31d71": "De natuurkunde is hopelijk eenvoudig. Natuurkundigen zijn dat niet. -Edward Teller",
    "f31d75": "Natuurkunde is eigenlijk niets meer dan een zoektocht naar ultieme eenvoud, maar tot nu toe is het enige wat we hebben een soort elegante rommeligheid. -Bill Bryson",
    "f31e53": "Wiskunde is de koningin van de wetenschappen. -Carl Friedrich Gauss",
    "f31q52": "Zuivere wiskunde is in zekere zin de poëzie van logische ideeën. -Albert Einstein",
    "f31q54": "Het boek van de natuur is geschreven in de taal van de wiskunde. -Galileo Galilei",
    "f31q56": "Wiskunde is de muziek van de rede. -James Joseph Sylvester",
    "f31q58": "Wiskunde gaat niet over getallen, vergelijkingen, berekeningen of algoritmen: het gaat over begrip. -William Paul Thurston",
    "f31q70": "Biologie is de wetenschap. Evolutie is het concept dat de biologie uniek maakt. -Jared Diamant",
    "f31q72": "Biologie is de poëzie van de fysieke wereld, en de menselijke biologie is de poëzie van ons universum. -Julian Casablancas",
    "f31q74": "Biologie is gewoon natuurkunde die slecht begint te ruiken. -Nigel Calder",
    "f31q81": "Natuurkunde is de wetenschap van de bewegingen en acties van fysieke lichamen, opgevat in termen van oorzaak en gevolg. -Arthur Compton",
    "f31qe82": "Biologie is een softwareproces. Ons lichaam bestaat uit biljoenen cellen, die allemaal door dit proces worden bestuurd. Jij en ik lopen rond met verouderde software in ons lichaam, die in een heel ander tijdperk is geëvolueerd. -Ray Kurzweil",
    "f31r83": "Natuurkunde wordt te moeilijk voor natuurkundigen. -David Hilbert",
    "f31sq66": "Biologie is echt scheikunde, scheikunde is echt natuurkunde, natuurkunde is echt wiskunde. -Matt Ridley",
    "f31x76": "Biologie is de studie van de complexe dingen in het heelal. Natuurkunde is de studie van de eenvoudige. -Richard Dawkins",
    "f31x77": "Natuurkunde is ervaring, gerangschikt in economische volgorde. -Ernst Mach",
    "f3d169": "Natuurkunde is de enige echte wetenschap. De rest is alleen maar postzegels verzamelen. -Ernest Rutherford",
    "f3d179": "De natuurkunde wordt zo ongelooflijk complex dat het steeds langer duurt om een ​​natuurkundige op te leiden. Het duurt in feite zo lang om een ​​natuurkundige op te leiden tot het punt waarop hij de aard van fysieke problemen begrijpt, dat hij al te oud is om ze op te lossen. -Eugene Wigner",
    "f3d180": "Biologie is de wetenschap van het leven, maar toch begrijpen velen van ons de basisprincipes van ons eigen lichaam niet. -Kathy Reichs",
    "f3e155": "Wiskunde is de deur en sleutel tot de wetenschappen. -Roger Bacon",
    "f3q178": "Biologie is geen lot. Het was nooit meer dan een tendens. Het was gewoon de eerste snelle en vuile manier van de natuur om met vlees te rekenen. Chips zijn het lot. -Bart Kosko",
    "f3sd162": "Biologie is de studie van ingewikkelde dingen die de indruk wekken dat ze met een doel zijn ontworpen. -Richard Dawkins",
    "f3sd164": "Biologie geeft je hersenen. Het leven verandert het in een geest. -Jeffrey Eugenides",
    "f3sd165": "In de natuurkunde hoef je jezelf geen problemen te bezorgen; de natuur doet dat voor je. -Frank Wilczek",
    "f3sq167": "Het mooie van wetenschap is dat het waar is, of je er nu wel of niet in gelooft. -Neil deGrasse Tyson",
    "f3ttw8": "Maori",
    "f477b": "Programmeren is de kunst van het ontwerpen van algoritmen en het debuggen van foutieve code. – Ellen Ullman",
    "f5bLC": "Documentatie",
    "f7akol": "Engels",
    "f7cf7": "Er zijn in feite twee dingen: wetenschap en opinie; de eerstgenoemde brengt kennis voort, de laatstgenoemde onwetendheid. – Hippocrates",
    "f814a": "Toen ik deze code schreef, begrepen alleen God en ik wat ik deed. Nu alleen God knotools. – Anoniem",
    "f96ff": "Innovatie is de motor van vooruitgang en succes in het bedrijfsleven. - Satya Nadella",
    "fBP5h": "Gebruikersnaam",
    "fEr5j": "Maak een nieuw script",
    "fV_1P": "Aanmelden",
    "fa94e": "Innovatie is de sleutel om voorop te blijven in de competitieve race. -Paul Sloane",
    "fc805": "Innovatie is creativiteit met werk te doen. – Tom Peters.",
    "fd3173": "Natuurkunde is verbeelding in een dwangbuis. -John Moffat",
    "fdd2b": "Wetenschap is georganiseerde kennis. Wijsheid is georganiseerd leven. – Immanuel Kant",
    "fdxluz": "Roemeense",
    "ff02c": "Geannuleerd",
    "fgj880": "Telugu",
    "forever-foss": "Voor altijd FOSS!",
    "fqV_1P": "Ontgrendel uw LafTools",
    "g2_aX": "Kopieer het gecodeerde wachtwoord naar het bestand",
    "g5SK9": "Recentelijk geopend",
    "gDjbs": "Historische gegevens",
    "gK3dNQ": "Kopiëren",
    "gQhfS": "Bestandshulpmiddelen",
    "gTOv6abWT": "Log in",
    "gTOv6adbWT": "Register",
    "gU1O2": "Geactiveerd",
    "geHXwByxy": "Instellingen",
    "generic-NI-UFPTe0": "Verfraai generieke code",
    "generic-code-beautify.desc.2b3c": "Met deze bewerking wordt code in verschillende programmeertalen opgemaakt om de leesbaarheid te verbeteren door consistente inspringing en regeleinden toe te passen en zich te houden aan taalspecifieke stijlrichtlijnen.",
    "giveas3tar": "Geef ons een ster op GitHub als je LafTools leuk vindt.",
    "gkC8t": "Basis64",
    "gkdqqC8t": "Basis45",
    "gkqC8t": "Basis32",
    "gmK3pKyRI": "{0} Piek online-telling",
    "gms7_9n5v": "Converteert een hexadecimale bytereeks terug naar de onbewerkte waarde.",
    "gnKMZ": "Vernieuwd.",
    "groupnote": "Memo",
    "h6AeI": "Websocket-verbinding gesloten om {0}",
    "hJUMN": "Doel taal",
    "hMvh1": "Back-updatabase",
    "hRFxV": "Bezoek onze website voor meer informatie",
    "hX1CWGAhl": "Inspringt en verfraait XML-code (eXtensible Markup Language).",
    "hcnt1k": "Macedonisch",
    "hhOT3": "Zoek op naam",
    "htTmvWjsS": "Comprimeert Cascading Style Sheets (CSS)-code.",
    "htt1d2": "Esperanto",
    "hu-iz": "Timer",
    "huE6U": "Variabel",
    "hyV-d": "Klaar",
    "hyirc0": "Zweeds",
    "i27qmr": "van Friesland afkomstige",
    "i6hMN": "Beeldverificatiecode",
    "i88tb": "Resultaat exporteren naar bestand",
    "i8q8tb": "Configureer WorkFlow voor invoer",
    "iNQvo": "Laat een voorbeeld zien om mee te beginnen.",
    "iNqF1T": "Beheer Cloud-account",
    "iOEjZ": "Geen beschikbare code",
    "iQL2c": "We zijn nog bezig met het verkennen van de volledige reeks functies voor deze knop. Als u feedback of suggesties heeft over hoe we deze kunnen verbeteren, laat het ons dan weten!",
    "iZXig7E2JF": "LafTools biedt een uitgebreid pakket ontwikkelingshulpprogramma's, waaronder codecs, formatters, beeldverwerkingstools en oplossingen voor het beheer van computerbronnen. LafTools is ontworpen om uw ontwikkelingsworkflow te stroomlijnen en te verbeteren en is uw aanspreekpunt voor efficiënte, hoogwaardige softwareontwikkeling.",
    "i_lang_": "Taalpakketten",
    "ib135dq": "Uw statusbericht wordt hier weergegeven",
    "iknTS": "Wachtwoordbeheerder",
    "init_env": "Systeembronnen laden",
    "ip2g1": "Gekopieerd",
    "ipOSQE": "Pro-editie",
    "it8ths": "Indonesisch",
    "ixyP0": "De realtime actie automatisch verwerken",
    "jJuNz": "Brontaal",
    "jO5eP": "OK",
    "jPNCb": "Opnieuw geprobeerd.",
    "jQXdi": "Lichte modus",
    "jR1zX": "AI-lab",
    "jRFk519Bj-": "Deze gemeenschap wordt aangedreven door een volledig internationaal gratis open source codeproject.",
    "jaj7M": "Alle rechten voorbehouden.",
    "jb392": "Naam",
    "jfpqt": "Notities-navigator",
    "jgDoEq": "Geen FAQ-gegevens",
    "jhDoE": "FAQ-gegevens ophalen",
    "jlxvpk": "Koreaans",
    "jr_7Y98yZ": "LafTools",
    "json-beautify.desc.0912": "Met deze bewerking worden JSON-gegevens opgemaakt om de leesbaarheid te verbeteren door consistent de juiste inspringing, regeleinden en sorteersleutels toe te voegen.",
    "json-beautify.name.0912": "Formatteer SQL",
    "json-beautify.text.93kq": "Verfraai JSON-gegevens",
    "k17PG": "Websocket-verbinding gesloten.",
    "k2SVY": "uit",
    "k2ku5p": "Tsjechisch",
    "k41a5": "LafTools",
    "k4s5rx": "Sloveens",
    "kLH79": "E-mail",
    "kOi5A": "Print pagina",
    "kPD22": "Woordenboek",
    "kPJ-A4": "Vernieuwen",
    "kcHxr": "Geef hier de gebruikersnaam van het beheerdersaccount op",
    "kjks1": "i18n-configuratie ophalen van lokale server-API",
    "kqv5ht": "Jiddisch",
    "krxSK": "AI-assistent",
    "ks12d": "Cyberbeveiliging",
    "kv4wag": "Nederlands",
    "ky6JphiKk": "{0} Onlinegebruikers",
    "l3akoa": "Amhaars",
    "l6Djb": "Selecteer een van de opties als uw voorkeursthema:",
    "lDXWMq43S": "Vandaag kalender",
    "lIn3_": "Beheerdersgebruikersnaam",
    "lQFII": "Activeer de initialisatie opnieuw",
    "lRHDQ": "Sluit de modus Volledig scherm af",
    "lUh5c": "Generator",
    "lWqYc": "Deze website biedt JSON-tools, waaronder JSON naar XML, JSON naar CSV, JSON naar YAML.",
    "lastreplyby": "Laatste antwoord door",
    "lkuulh": "Frans",
    "lp0qmd0": "Markeer het als favoriet",
    "lpKAz": "Instellingen",
    "lpzg83": "Samoaans",
    "lzGS2": "Extensiedetail",
    "m0106": "Omvormer",
    "m0107": "Generator",
    "m0108": "Formatter",
    "m7WZw": "Systeemwebsocket kapot",
    "m8rTc1": "Zodra de shellscriptmanager is geïmplementeerd, kunt u deze gebruiken om uw shell-opdrachten te beheren.",
    "mBgF1": "Muisactie",
    "mSFei": "Broncode op GitHub",
    "mWXeh": "Werkruimte-ID: {0}",
    "mabHq": "Zoek oude bestanden",
    "mbzCv": "Er is een fout opgetreden: {0}, de afgewezen tijd is {1}",
    "md2.desc.1039": "Met deze bewerking worden gegevens gehasht tot een hash van {0}.",
    "md2.text.192d3": "Genereer {0} hash",
    "md2aO2NaJITm": "Laat CSS-code (Cascading Style Sheets) inspringen en verfraaien, waardoor deze gemakkelijker te lezen en te begrijpen is.",
    "md4.desc.1039": "Met deze bewerking worden gegevens gehasht tot een hash van {0}.",
    "md4.text.192d3": "Genereer {0} hash",
    "md5.desc.rxsHq": "Met deze bewerking worden gegevens gehasht tot een hash van {0}.",
    "md5.textiDjMIo": "Genereer {0} hash",
    "md6.desc.1039": "Met deze bewerking worden gegevens gehasht tot een hash van {0}.",
    "md6.text.192d3": "Genereer {0} hash",
    "meeMC1Uk7.text.93kq": "Verklein {0}",
    "mhWk4dtid": "Codering",
    "mihc3": "Deze operatie voltooid",
    "mjHoR": "Technisch gezien kan niemand dit token lezen, anders heeft hij/zij uw computer aangevallen en gecontroleerd.",
    "mnb19i": "Duits",
    "mslw4o": "Grieks",
    "mwn7iv": "Zoeloe",
    "myxedr": "Mongools",
    "n1jA9": "Bevestigen",
    "n24tes": "Portugees (Brazilië)",
    "n28g4di0L": "Handleidingen",
    "n94an4": "Pools",
    "n98EW": "Wissel de tekst van het invoergebied en het uitvoergebied om.",
    "nIDKbSXTw": "{0} Gebruikers",
    "nSeIq8-": "Het belangrijkste is dat het gratis en open source is. U kunt het gebruiken voor uw persoonlijke of commerciële doeleinden.",
    "nTvw4": "Om uw gegevens en instellingen te beschermen en afzonderlijk op te slaan, kunt u hiervoor uw lokale account gebruiken. Bovendien zal LafTools in de toekomst instant message-widgets voor gebruikers ondersteunen.",
    "nh1W-": "Testen kan alleen de aanwezigheid van bugs bewijzen, niet de afwezigheid ervan - Edsger Dijkstra",
    "nmb1wx": "Joruba",
    "nncQE": "Leven",
    "nodBw": "Met deze bewerking worden onbewerkte gegevens gecodeerd in een ASCII {0}-tekenreeks.",
    "nrix6l": "Chichewa",
    "nxJC7": "De standaardactie die moet worden uitgevoerd wanneer de transformator wordt uitgevoerd.",
    "o1umzi": "Frans",
    "o52xW": "Exporteren",
    "o8xyzu": "Luxemburgs",
    "oBz8D": "Bezig met laden",
    "oNLxH": "Gebruikersnaam",
    "oNg3f": "Officiële website",
    "ocxsw3": "Iers",
    "of_ox": "Al met al is LafTools een totaaloplossing voor al uw behoeften.",
    "oj23X": "Database herstellen",
    "ojCWEFdVe": "Comprimeert JavaScript-code en verwijdert alle onnodige tekens.",
    "ooiFU": "Start de Java-service opnieuw",
    "oqHqVq": "Sorteer op",
    "oqHqqV": "Totaal: {0} opdrachten",
    "oqHqqVq": "Kopieer tijden",
    "oqjbcj": "Laos",
    "os8h6u": "Deens",
    "p8Exxc1s": "Er zijn verschillende tools die AI-technologieën gebruiken om taken efficiënter uit te voeren in AI Laboratory.",
    "pANmj": "Tags kunnen worden gedefinieerd op basis van servertypen, scriptgebruik of andere criteria die u verkiest.",
    "pA_deJ": "Exporteren naar Klembord",
    "pA_feeJ": "Sluit de terminal opnieuw aan",
    "pA_qweJ": "Buffer wissen",
    "pDBSWq": "geen beschikbare inhoud voor rechterpaneel",
    "pEk1kk": "LafTools presenteert hier handige functionaliteiten voor u.",
    "pEk1qkk": "Maak een lijst van alle geopende tabbladen",
    "pHZDB": "Realtime actie",
    "pJoOz": "Open bestand",
    "pKHRT": "Ga naar Gereedschap",
    "pKqHRq": "Zoek notities",
    "pL6qH": "Voltooid.",
    "pNwe3": "Ander",
    "pZ4d616m-": "Verfraai {0}",
    "ph5jH": "Dit onderdeel behandelen",
    "piih4x": "Tadzjiekse",
    "pmAee": "Lees meer informatie over dit hulpmiddel.",
    "pmnp4b": "Oekraïens",
    "ppmz8e": "Haïtiaans Creools",
    "pqs7y3": "Overweeg alstublieft om deze webpagina als PWA te registreren, zodat u volledige toetsenbordondersteuning krijgt.",
    "psA_eJ": "Exporteren als bestand",
    "psZoP": "Zet bestanden hier neer om ze te verwerken",
    "psqqpq_o": "Oké, het resultaat is al {0} keer naar je klembord gekopieerd.",
    "pzn2IpkDo": "Inspringingen en mooie afdrukken JavaScript Object Notation (JSON)-code.<br><br>Tags: json-viewer, mooier maken, syntaxisaccentuering",
    "q0zA1kML_": "Online gereedschapskist",
    "q12beqwR": "Geen beschikbare hulpmiddelen",
    "q29t31": "Pools",
    "q3VjkLMsP": "Vriendschap, uitwisseling, samenwerking en ontwikkeling",
    "q6K7o": "Laden uit notities",
    "q9iuti": "Welsh",
    "qDrbEr": "De door u opgegeven gebruikersnaam is leeg. Controleer dit en probeer het opnieuw.",
    "qF4uS2": "Werkruimte creëren",
    "qF4uS23": "Nieuw raam",
    "qHoktx": "Bedankt!",
    "qN1LdZ2": "Laatst gewijzigd",
    "qQmBr": "Tekstvertaling",
    "qTqyvWdY": "Nog niet klaar",
    "qWemXE4": "1 januari 2024",
    "qWw3eTH": "Dit onderdeel helpt bij het onderhouden van bestanden op uw lokale schijf of cloudschijf.",
    "qdeFXx": "Momenteel is de pagina die u zoekt nog niet volledig geïmplementeerd.",
    "qpDBSW": "geen beschikbaar paneel",
    "qpDBSWe1": "geen beschikbaar paneel",
    "qqK_x_": "Aanmelden",
    "qqqwYoz": "Hulp",
    "qqwYoz": "Tabbladen",
    "qqwYqwe": "Werkruimtes",
    "qtpmvP": "Bevestig lokaal wachtwoord",
    "quality-first": "Kwaliteit eerst",
    "qubSJ": "Extensie-VM is geen ID. (REF: IQnMH).",
    "qzshys": "Urdu",
    "r1GLS": "Labels",
    "rE6fUsSGl": "Inspringt en verfraait SQL-code (Structured Query Language).",
    "rK6cx": "{0}, ontworpen en ontwikkeld door het LafTools-team",
    "rQkas": "Welkom bij LafTools",
    "rR1vd": "Invoer uit bestand",
    "rT34qnO": "Voer tekst in voor verwerking. Het resultaat wordt weergegeven in de uitvoereditor.",
    "rVqlu": "Decodeer {0}",
    "rYSpwq": "Het MD2-algoritme (Message-Digest 2) is een cryptografische hashfunctie ontwikkeld door Ronald Rivest in 1989. Het algoritme is geoptimaliseerd voor 8-bit computers. Hoewel MD2 niet langer als veilig wordt beschouwd, wordt het zelfs vanaf 2014 nog steeds in gebruik in het openbaar. belangrijke infrastructuren als onderdeel van certificaten gegenereerd met MD2 en RSA. Het message digest-algoritme bestaat standaard uit 18 ronden.",
    "r_n6h": "Lichte of donkere modus",
    "rf0mql3": "Licht of donker thema",
    "rpG0G": "We stellen uw feedback op prijs en horen graag uw mening over hoe we ons product kunnen verbeteren. Aarzel niet om uw feedback met ons te delen!",
    "rub76Z8zx": "Pogingen om talen in C-stijl mooi af te drukken, zoals C, C++, C#, Java, PHP, JavaScript enz. Dit zal niet perfect werken en de resulterende code werkt mogelijk niet meer. Deze bewerking is puur bedoeld om versluierde of verkleinde code gemakkelijker leesbaar en begrijpelijker te maken. Dingen die niet goed werken: voor lusformattering, Do-While-lusformattering, Switch/Case-inspringing, bepaalde bitshift-operators",
    "run_text": "Voordat we uw workbench betreden, willen we eerst de vereiste systeembronnen vooraf laden. Een ogenblik geduld a.u.b., het zal binnenkort worden voltooid. U kunt de details hieronder bekijken.",
    "rycJy": "LafTools is een veelzijdige toolbox speciaal ontworpen voor programmeurs. Het vertegenwoordigt de tweede versie van de CodeGen Toolbox, nu met een lichtere runtime geschreven in Golang en JavaScript.",
    "ryhkqb": "Bulgaars",
    "rzoFmjStq": "Relevante hulpmiddelen",
    "s-fxP80Dd": "LafTools IDE",
    "s0vrf9": "Hebreeuws",
    "s4OeX": "Meld u succesvol aan bij het systeem",
    "sHoxxW": "Geschiedenis",
    "sO0MOe": "Elke keer dat u langer dan 5 seconden in een venster blijft, wordt dit hier weergegeven.",
    "sR8yc": "Dichtbij",
    "sc49my": "Sindhi",
    "sdf3160": "Het is de taak van theoretici, vooral in de biologie, om nieuwe experimenten voor te stellen. Een goede theorie doet niet alleen voorspellingen, maar verrassende voorspellingen die vervolgens waar blijken te zijn. -Francis Crick",
    "sdfk1": "Blader met de tabbladen naar links",
    "sdfk13": "Blader door de tabbladen naar rechts",
    "sglMS": "Maak tijd",
    "share-this-page": "Deel deze pagina",
    "sk123": "Nog niet klaar",
    "slqcWD": "Dit logische gedeelte wordt nog niet ondersteund, houd het in de gaten.",
    "sojBI": "Conversie",
    "spCqEa": "TE DOEN",
    "spdh98": "Vereenvoudigd Chinees",
    "ssDaOq": "Nieuw bij LafTools?",
    "ssm80i": "baskisch",
    "str.codecs": "Codecs",
    "str.converters": "Converters",
    "str.formatter": "Formatters",
    "str.login": "Log in",
    "str.mostused": "Meest gebruikt",
    "str.parsers": "Parsers",
    "str.register": "Register",
    "str.remarks": "Favorieten",
    "str.usercentre": "Gebruikerscentrum",
    "svqh06": "Azerbeidzjaans",
    "sys_updates": "Nieuwste systeemupdates",
    "t63Qw": "Afwijzen",
    "t6wczq": "Xhosa",
    "t84q1z": "Armeens",
    "t8DUz20a-": "JSON-formatter",
    "t8c6xc": "Somalisch",
    "tBIX-d": "ramen",
    "tEiv_": "Extensiedetails ophalen",
    "tIy3Q": "Er is een fout opgetreden",
    "tIyq3Q": "Er is een fout opgetreden",
    "tWe1yF": "Geen beschikbare shell-opdracht.",
    "tY3p1": "Meer informatie",
    "tiaiB": "Annuleren",
    "title-laftools": "LafTools - De toonaangevende alles-in-één toolbox voor programmeurs",
    "tn7duf": "Kroatisch",
    "try.laftools.ide": "Probeer LafTools IDE",
    "trywithclassicalwebui": "Probeer het met de klassieke webinterface",
    "ttAre": "Voer hier uw leesbare wachtwoord in",
    "twamg": "AI-assistent, die uw creativiteit stimuleert",
    "tyhgpr": "Javaans",
    "uCEe8": "Realtime conversie",
    "uFcDQ": "Initialiseren van de statusgegevens...",
    "uV5Bi": "Kan extensie niet laden",
    "uVseB": "Druk op {0} om de sneltoetsenlijst weer te geven",
    "ucDLv": "U heeft deze record {0} keer gekopieerd",
    "ui5pZ": "Commando-parser",
    "ulah0q": "Japans",
    "unc9E": "Willekeurige tekst",
    "usr_defined": "Systeem voorkeuren",
    "uwqGE": "Ga naar Gereedschap",
    "v7q3db": "Thais",
    "vOjNC": "Voer het wachtwoord of de beveiligde sleutel in",
    "vTsQU": "Geef de uitnodigingscode van uw beheerder op",
    "vU17B": "Kan het verzoek niet verzenden",
    "vWqac": "Voordat we uw workbench betreden, willen we eerst de vereiste systeembronnen vooraf laden. Een ogenblik geduld a.u.b., het zal binnenkort worden voltooid. U kunt de details hieronder bekijken.",
    "vaP0vq": "Stel het lokale wachtwoord met succes in.",
    "vci8rd": "Nederlands",
    "vh9j4": "Invoer",
    "vo1prl": "Spaans",
    "vr93oi": "Fins",
    "vrfjnf": "Italiaans",
    "w6otqn": "Corsicaans",
    "w92j07": "Russisch",
    "w9qudj": "Punjabi",
    "wAxtg": "In eerste instantie hebben we een UUID gegenereerd als geautoriseerd token zodat u deze configuratie kunt uitvoeren. Op basis van wat LafTools heeft ontvangen, is het token dat u heeft opgegeven {0}. Het is met succes geverifieerd door LafTools en u kunt daarom doorgaan met het instellen van dit formulier.",
    "wI1eh": "Volgende",
    "wQYoz": "Bestand",
    "wQdYoz": "Bewerking",
    "wQdqwYoz": "Weergave",
    "wcl1K": "Gebruik",
    "wgkk6y": "Maltees",
    "wi28h5_S2": "Codecs",
    "wj3VS": "Deze bewerking decodeert gegevens uit een ASCII {0}-tekenreeks terug naar het onbewerkte formaat.",
    "wsWcXd": "Meldingen",
    "x009": "Om toegang te krijgen tot onze gebruiksdocumentatie",
    "x5alzu": "Koerdisch (Kurmanji)",
    "x5tHV": "Systeem overzicht",
    "xMBv0": "Gerelateerde bronnen laden...",
    "xOJqG1": "Veel Gestelde Vragen",
    "xPHqP": "De beschrijving is nog niet gedefinieerd.",
    "xQ_ls": "Back-up Redis",
    "xbz0B": "Sluit alle tabbladen",
    "xbz0B2": "Sluit Tab",
    "xdqwe": "Welkom bij het gebruik van LafTools!",
    "xeP4zV": "Bekijk snel jouw TODO items",
    "xeP4zVd": "Zoek snel een Engelse woordenschat op.",
    "xhxY6iLDH": "Uitloggen",
    "xlqtA": "Feedback",
    "xml-bdeautify.desc.2a5f9": "Verklein XML-code",
    "xml-beautify.desc.2a5f9": "Met deze bewerking worden XML-gegevens opgemaakt om de leesbaarheid te verbeteren door de juiste inspringing en regeleinden toe te voegen en een goed gevormde structuur te garanderen.",
    "xs22XLF": "Er zijn geen gegevens beschikbaar voor deze artikel-ID. Overweeg andere artikelen te selecteren.",
    "y3qjdd": "Uw lokale wachtwoord is succesvol geverifieerd.",
    "y8Ir5": "Dit deel wordt gebruikt voor het initialiseren van uw beheerdersaccount. Op dit moment hoeft u hier echter niets aan te maken of aan te passen, omdat dit eerder door uw beheerder is ingesteld. Negeer dit gedeelte en ga verder met de resterende stappen.",
    "yCsTC": "Voortijdige optimalisatie is de wortel van alle kwaad.",
    "yMZW-GEgf": "Formaat XML",
    "ySVf-": "Probeer dit verzoek opnieuw",
    "yTsqFO": "Het MD4-algoritme (Message-Digest 4) is een cryptografische hashfunctie ontwikkeld door Ronald Rivest in 1990. De samenvattingslengte is 128 bits. Het algoritme heeft latere ontwerpen beïnvloed, zoals de MD5-, SHA-1- en RIPEMD-algoritmen. De veiligheid van MD4 is ernstig aangetast.",
    "yVprb": "Dit onderdeel is nog in ontwikkeling.",
    "y_2Q1": "Coderen en decoderen",
    "y_2Q2": "Symmetrische cryptografie",
    "y_2Q3": "Asymmetrische crypto",
    "y_2Q4": "Chinese nationale algoritmen",
    "y_2Q5": "Webauth",
    "y_2Q5dqw": "Tekstmatcher",
    "y_9YM": "De uitvoer wordt hier weergegeven.",
    "y_9YqM": "Statische bronnen laden...",
    "y_BN6": "Verteren algoritme",
    "ya0cwu": "Maleis",
    "yc7dqiu": "Vereenvoudigd Chinees",
    "yfYeg": "Tekstsjabloon",
    "yiRso": "Cloud-notities",
    "ykganl": "Deens",
    "ymyfghy1r": "Opmerkingen",
    "yqiRso": "Lokale opmerkingen",
    "yqrxl4": "Servisch",
    "yznU9": "Lege boomgegevens",
    "z-o28we": "Procespaneel",
    "z0j2nf": "Hindi",
    "z1oFn": "Ontsnap en ontsnap",
    "z2jzej": "Marathi",
    "z79b1a": "Arabisch",
    "zN2ES": "Werkruimtes",
    "zaSKh": "Vernieuwen",
    "zc3Hf": "Wachtwoord",
    "zjDJk": "Geef het pad naar de werkruimtemap op",
    "zkqUFa": "{0} is nog niet geconfigureerd",
    "zkv375": "Khmer",
    "zmDWx": "Neem contact met ons op",
    "znVRwq": "Bestanden",
    "zpyd34": "Engels",
    "zqiIoqXw": "Berekeningen uitvoeren...",
    "zwd4v": "Extensiedetail",
    "zwgYx": "De gecodeerde wachtwoordwaarde wordt hier weergegeven.",
    "zzcepr": "Cebuano"
}