{
    "-dxG-aEe4w": "Maksimalt antall SMS-verifiseringskoder sendt i dag er nådd.",
    "-wHWkv2OC": "Hvorfor kan jeg ikke logge på?",
    "-wdkeq": "Er dette fellesskapet non-profit?",
    "2RbUh6TyJ": "{0} uleste varsler",
    "2S_7EVIsK": "JSON Validator",
    "3I-dkqkwr": "Merk at vi IKKE tilbyr noen kommersielle opplæringskurs for engelskeksamener eller andre fageksamener på denne nettsiden, og vi planlegger ikke å gjøre det i fremtiden.",
    "43be5": "Dagbok",
    "4N79HNWiA": "For å sikre at det er et non-profit fellesskap, åpner vi også hele kildekoden på GitHub, som du finner nederst på denne siden.",
    "4sQWoTgfr": "Bekreftelseskoden er utløpt. Last inn siden på nytt og prøv igjen",
    "4sdQWoTgfr": "Bekreftelseskoden er utløpt. Last inn siden på nytt og prøv igjen.",
    "5pevqzFXX": "Hvis du også synes det er meningsfullt for deg å bli med oss, vennligst fortsett å oppdatere profilen din ved å klikke på knappen nedenfor, takk!",
    "6h14B_t4I": "Ble med i dag",
    "7BtpddC": "For det andre, i dette fellesskapet snakker vi ikke om politikk eller andre sensitive emner, og vi tar selvfølgelig ikke imot spam eller reklame. Det er derfor vi krever et gyldig telefonnummer for registrering, for å forhindre ulovlige eller upassende aktiviteter.",
    "7flKa": "LafTools - Den allmektige for alle profesjonelle og ingeniører",
    "7fldKa": "LafTools - Den ledende alt-i-ett-verktøykassen for programmerere",
    "7zqdufsdddJ": "Ja, helt klart. Nettstedet ELB3.com er avledet fra den ideelle WeChat chat-gruppen, {0}, som tar sikte på å skape en vennlig, ads-fri og komfortabel atmosfære for engelsk læring.",
    "8s1R5nChx": "Invitasjonskoden er tom, dette fellesskapet er ikke åpent for offentligheten, men begrenset til inviterte brukere.",
    "8s1dX": "Invitasjonskoden finnes ikke i systemet, vennligst sjekk om det er et sakssensitivt problem.",
    "8sVG1RXhx": "passordet skal være på minst 6 tegn",
    "8sVG1RdXhx": "Bruker-ID finnes allerede",
    "8sVG1kqXhx": "Bruker-ID må være på minst 2 tegn",
    "8sVGdXhx": "Bruker-ID skal kun inneholde bokstaver og tall",
    "8saIR-LCjyChx": "Invitasjonskoden er utløpt",
    "8saIt5r5nGxwwChx": "Invitasjonskoden er brukt opp",
    "9YPgsPid2M": "SMS kode",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Base64-koder",
    "9b_7a0sdf": "Base64 dekoder",
    "9pBpiYcCy": "For å forhindre spam og reklame krever vi en invitasjonskode for å registrere kontoen din.",
    "BqWGnXEzV": "By",
    "Bz_WdwvAPn": "Sjekk om CAPTCHA er gitt riktig.",
    "C7jECCVt9": "Sett pris på tiden din og gjør aldri noe ulovlig i dette fellesskapet.",
    "CK5NCw519": "Samfunnshistorie",
    "CQ44pYZYj": "Logg Inn",
    "CuHqw9m": "{0} er ikke et gyldig telefonnummer. Systemet godtar for øyeblikket kun 11-sifrede telefonnummer.",
    "Cz_qjjFw7": "Om {0}",
    "DYaOL4Yp7": "registrere",
    "D_9sNBiZj": "Du prøvde for mange ganger, prøv igjen senere.",
    "F-D-AewqL": "Gjør ettertid med det du har gjort nylig. Vi kan ikke tåle noen atferd som kan betraktes som trakassering, reklamereklamer eller personlig misbruk, etc...",
    "GaySMPQHo": "Trender",
    "Gy45ssBPS": "Opprett nytt emne",
    "H39ddc0df": "Prøv å logge på senere hvis det mislyktes for mange ganger.",
    "HaU4NMabv": "Bekreftelseskoden er feil, vennligst skriv inn eller oppdater bildet.",
    "IWPP6V-tR": "Kildekode",
    "Ibzs2-Ho1": "CSV-verktøy",
    "IcvP2d-QY": "Vennligst {0} eller {1} for å bli med i diskusjonen",
    "IugAFc4OT": "Det har oppstått et problem under innsending av dataene dine.",
    "Jbor69IBw": "Formatere",
    "Jf4iDTZ28": "Dessuten kan du være sikker på at vi aldri vil selge ut telefonnummeret ditt eller offentliggjøre det.",
    "Jfr4RzEZG": "For øyeblikket godtar vi bare {0} telefonnummer for å registrere kontoen din.",
    "JuZAli3": "Brukermanual",
    "K2UEY4ddl": "Bruker-ID-en inneholder ugyldige ord. Unngå å bruke {0}",
    "KAiEq6dcwL5": "Til slutt, som en vennlig påminnelse, bør hver bruker ta ansvar for sine egne ord og handlinger.",
    "MnVg5i": "Hei, hyggelig å møte deg! Det er vår glede å invitere deg til dette fellesskapet.",
    "MnVqwid": "Hei, {0}. Hyggelig å møte deg! Det er vår glede å invitere deg til dette fellesskapet.",
    "NdqZcRL2QN": "Hvis du har glemt passordet ditt, kan du tilbakestille det ved å klikke på koblingen \"Glemt passord\".",
    "OBjaZqTvx": "Hjem",
    "OPevedpOM": "Hva om jeg ikke har et telefonnummer?",
    "P1zxX2IQ5": "Men for denne nettsiden er det en avledning av den opprinnelige gruppen og ikke begrenset til engelsklæring, men også for andre emner.",
    "Pu0pj23rR": "Hvorfor kreves et telefonnummer?",
    "RYlJHHwg3": "SMS-koden er ikke riktig.",
    "RjdigcxfV": "Kontakt oss",
    "TV09-obNr": "Milepæl",
    "TXdh_K": "Passord",
    "TdXddh_wK": "Telefonnummer",
    "Te3h_wK": "Telefonnummer",
    "TqXdd3h_wK": "Telefonnummer",
    "TqXddh_K": "Bekreftelseskode",
    "TqXdh_K": "bekreft passord",
    "UED59zbd-": "LafTools",
    "UjkOS50wO": "Hjem",
    "VndKeCfb-": "Bekreft telefon for å aktivere konto",
    "VnddCfb-": "Du er for øyeblikket utestengt en stund",
    "W3M4ivK9U": "Oppdater profil",
    "WKG7e": "Regler",
    "Wpdsp3g5U": "Velkommen til {0}-fellesskapet!",
    "XIzgAAR": "Vanligvis kan en tilgjengelig invitasjonskode gis fra nettredaktøren eller andre brukere.",
    "Xddh_wK": "invitasjonskode",
    "Y-svpKvUz": "to passord stemmer ikke overens",
    "Y0drdCSiu": "Emner",
    "Yc5uMym": "Du lurer kanskje på hva ELB3 står for, kort sagt er det en forkortelse for den ideelle WeChat-gruppen {0}, som er en interessant plattform for engelske entusiaster og eksaminatorer for å lære og sette pris på engelsk!",
    "ZCzH8": "Nyeste",
    "ZaS8MP8cr": "Merk: Bekreftelseskoden er oppdatert. Juster skjemaverdiene og skriv inn koden på nytt for å fortsette med.",
    "aISK9iYc_": "Rapport om ulovlig informasjon",
    "aUdtds_qwY": "Vanligvis kan du logge på med bruker-ID eller telefonnummer selv om du har brutt reglene i dette fellesskapet.",
    "b7wgrhuXl": "Tech",
    "b_vts": "Logg inn",
    "dHWho": "Melde deg på",
    "dldeoeqwc": "Vennlige påminnelser",
    "dnsz7fwNx": "User ID skiller mellom store og små bokstaver.",
    "dsdfqw": "Bruker finnes ikke",
    "dwJucRtar": "Denne delen pågår fortsatt, velkommen til å bidra til prosjektet for denne delen.",
    "dzIC7qPQ": "Hvis du ønsker å bli med oss, kan du prøve å kontakte nettredaktøren på hans e-post {0} eller WeChat-konto {1} for å få en invitasjonskode.",
    "englishcorner": "Engelsk",
    "eqwee": "Passordet er ikke riktig",
    "fcGTPc7HP": "Hvor kan jeg få tak i invitasjonskoden?",
    "gTOv6abWT": "Logg Inn",
    "gTOv6adbWT": "Registrere",
    "geHXwByxy": "Innstillinger",
    "gmK3pKyRI": "{0} Høyeste antall online",
    "groupnote": "Memo",
    "hxCMxpW6Sq": "Ble med for {0} dager siden",
    "iZXig7E2JF": "LafTools tilbyr en omfattende pakke med utviklingsverktøy, inkludert kodeker, formatere, bildebehandlingsverktøy og datamaskinressursadministrasjonsløsninger. LafTools er designet for å strømlinjeforme og forbedre utviklingsarbeidsflyten din, og er din viktigste ressurs for effektiv programvareutvikling av høy kvalitet.",
    "jRFk519Bj-": "Dette fellesskapet er drevet av et fullstendig internasjonalt gratis åpen kildekodeprosjekt.",
    "jdbef_PBl": "Mål",
    "jr_7Y98yZ": "LafTools",
    "ky6JphiKk": "{0} Internett-brukere",
    "lEDpJMRfG": "Hvis du er forvirret, vennligst gi oss beskjed ved å sende en e-post til oss.",
    "lWqYc": "Dette nettstedet tilbyr JSON-verktøy inkludert JSON til XML, JSON til CSV, JSON til YAML.",
    "lastreplyby": "Siste svar av",
    "lidydVO": "Hvorfor er jeg blokkert eller begrenset?",
    "lu2T6idPY": "Hvis du tror det er et problem med kontoen din, vennligst kontakt nettredaktøren.",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "{0} Brukere",
    "nncQE": "Liv",
    "o4GdNzX6xS": "For det første, på grunn av det velkjente reguleringskravet på jorden, er hver bruker pålagt å oppgi et gyldig telefonnummer for å registrere seg.",
    "oHQNQ4mRw": "bruker-ID",
    "p1Jyl4uMv": "Logg ut kontoen din",
    "pNwe3": "Annen",
    "t8DUz20a-": "JSON-formater",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "Velg nettstedspråk",
    "uefFV1": "Seinere",
    "ufSPh0ad": "Hvis det er umulig å registrere kontoen din via ditt nåværende telefonnummer, vennligst kontakt nettredaktøren på hans e-post {0} eller WeChat-konto {1}. Vi kan hjelpe deg med å registrere kontoen din manuelt.",
    "wCcPJZK": "{0} er ikke en gyldig e-post",
    "wCctGPJZK": "{0} skal ikke være tom",
    "wi28h5_S2": "kodeker",
    "xhxY6iLDH": "Logg ut",
    "yOdwRB": "Velkommen til ELB3-fellesskapet!",
    "zr3ZBdUoT": "Brukermanual",
    "zuxd0y-kmA": "Bruker-ID eller PhoneNumber har ingen mellomrom."
}