{
    "-dxG-aEe4w": "Maksymalna liczba wysłanych dzisiaj kodów weryfikacyjnych SMS została osiągnięta.",
    "-wHWkv2OC": "Dlaczego nie mogę się zalogować?",
    "-wdkeq": "Czy ta społeczność jest organizacją non-profit?",
    "2RbUh6TyJ": "{0} Nieprzeczytane powiadomienia",
    "3I-dkqkwr": "Należy pamiętać, że na tej stronie NIE zapewniamy żadnych komercyjnych kursów przygotowujących do egzaminów z języka angielskiego ani egzaminów z innych przedmiotów i nie planujemy tego robić w przyszłości.",
    "43be5": "Dziennik",
    "4N79HNWiA": "Aby mieć pewność, że jest to społeczność non-profit, otwieramy również cały jej kod źródłowy na GitHubie, który można znaleźć w stopce tej strony.",
    "4sQWoTgfr": "Kod weryfikacyjny wygasł. Odśwież stronę i spróbuj ponownie",
    "4sdQWoTgfr": "Kod weryfikacyjny wygasł. Odśwież stronę i spróbuj ponownie.",
    "5pevqzFXX": "Jeśli również uważasz, że warto do nas dołączyć, kontynuuj aktualizację swojego profilu, klikając przycisk poniżej, dzięki!",
    "6h14B_t4I": "Dołączył dzisiaj",
    "7BtpddC": "Po drugie, w tej społeczności nie rozmawiamy o polityce ani innych drażliwych tematach i oczywiście nie przyjmujemy spamu ani reklam. Dlatego do rejestracji wymagany jest ważny numer telefonu, aby zapobiec wszelkim nielegalnym lub niewłaściwym działaniom.",
    "7flKa": "LafTools - Wszechmocny dla wszystkich profesjonalistów i inżynierów",
    "7zqdufsdddJ": "Tak, na pewno. Witryna ELB3.com wywodzi się z grupy dyskusyjnej WeChat o charakterze non-profit {0}, której celem jest stworzenie przyjaznej, wolnej od reklam i komfortowej atmosfery do nauki języka angielskiego.",
    "8s1R5nChx": "Kod zaproszenia jest pusty, ta społeczność nie jest otwarta dla publiczności, ale ograniczona do zaproszonych użytkowników.",
    "8s1dX": "Kod zaproszenia nie istnieje w systemie. Sprawdź, czy wielkość liter ma znaczenie.",
    "8sVG1RXhx": "hasło powinno składać się z co najmniej 6 znaków",
    "8sVG1RdXhx": "Identyfikator użytkownika już istnieje",
    "8sVG1kqXhx": "Identyfikator użytkownika powinien składać się z co najmniej 2 znaków",
    "8sVGdXhx": "Identyfikator użytkownika powinien zawierać wyłącznie litery i cyfry",
    "8saIR-LCjyChx": "Kod zaproszenia wygasł",
    "8saIt5r5nGxwwChx": "Kod zaproszenia został wykorzystany",
    "9YPgsPid2M": "Kod SMS",
    "9pBpiYcCy": "Aby zapobiec spamowi i reklamom, wymagamy kodu zaproszenia do zarejestrowania Twojego konta.",
    "BqWGnXEzV": "Miasto",
    "Bz_WdwvAPn": "Sprawdź, czy CAPTCHA jest poprawnie podany.",
    "C7jECCVt9": "Szanuj swój czas i nigdy, przenigdy nie rób niczego nielegalnego w tej społeczności.",
    "CK5NCw519": "Historia społeczności",
    "CQ44pYZYj": "Zaloguj sie",
    "CuHqw9m": "{0} nie jest prawidłowym numerem telefonu, obecnie system akceptuje tylko 11-cyfrowy numer telefonu.",
    "Cz_qjjFw7": "O {0}",
    "DYaOL4Yp7": "rejestr",
    "D_9sNBiZj": "Próbowano zbyt wiele razy. Spróbuj ponownie później.",
    "F-D-AewqL": "Zrób retrospekcję tego, co ostatnio zrobiłeś. Nie możemy tolerować żadnego zachowania, które można uznać za nękanie, reklamy lub znęcanie się nad osobą itp.",
    "GaySMPQHo": "Trendy",
    "Gy45ssBPS": "Utwórz nowy temat",
    "H39ddc0df": "Spróbuj zalogować się później, jeśli nie powiodło się zbyt wiele razy.",
    "HaU4NMabv": "Kod weryfikacyjny jest nieprawidłowy. Wprowadź ponownie lub odśwież obraz.",
    "IWPP6V-tR": "Kod źródłowy",
    "IcvP2d-QY": "Proszę {0} lub {1}, aby dołączyć do dyskusji",
    "IugAFc4OT": "Wystąpił problem podczas przesyłania danych.",
    "Jf4iDTZ28": "Poza tym, możesz mieć pewność, że nigdy nie sprzedamy Twojego numeru telefonu ani nie upublicznimy go.",
    "Jfr4RzEZG": "Obecnie akceptujemy tylko numer telefonu {0} do rejestracji Twojego konta.",
    "JuZAli3": "Poradnik użytkownika",
    "K2UEY4ddl": "Identyfikator użytkownika zawiera nieprawidłowe słowa, unikaj używania {0}",
    "KAiEq6dcwL5": "Na koniec, dla przypomnienia, każdy użytkownik powinien wziąć odpowiedzialność za swoje własne słowa i czyny.",
    "MnVg5i": "Cześć miło cię poznać! Mamy przyjemność zaprosić Cię do tej społeczności.",
    "MnVqwid": "Witaj, {0}. Miło mi cię poznać! Mamy przyjemność zaprosić Cię do tej społeczności.",
    "NdqZcRL2QN": "Jeśli zapomniałeś hasła, możesz je zresetować, klikając link „Zapomniałem hasła”.",
    "OBjaZqTvx": "Dom",
    "OPevedpOM": "Co jeśli nie mam numeru telefonu?",
    "P1zxX2IQ5": "Ale w przypadku tej witryny jest to pochodna oryginalnej grupy i nie ogranicza się do nauki języka angielskiego, ale także do innych tematów.",
    "Pu0pj23rR": "Dlaczego numer telefonu jest wymagany?",
    "RYlJHHwg3": "Kod SMS jest nieprawidłowy.",
    "RjdigcxfV": "Skontaktuj się z nami",
    "TV09-obNr": "Kamień milowy",
    "TXdh_K": "Hasło",
    "TdXddh_wK": "Numer telefonu",
    "Te3h_wK": "Numer telefonu",
    "TqXdd3h_wK": "Numer telefonu",
    "TqXddh_K": "Kod weryfikacyjny",
    "TqXdh_K": "Potwierdź hasło",
    "UED59zbd-": "LafTools",
    "UjkOS50wO": "Dom",
    "VndKeCfb-": "Zweryfikuj telefon, aby aktywować konto",
    "VnddCfb-": "Obecnie jesteś zbanowany na jakiś czas",
    "W3M4ivK9U": "Zaktualizować profil",
    "WKG7e": "Zasady",
    "Wpdsp3g5U": "Witamy w społeczności {0}!",
    "XIzgAAR": "Zwykle dostępny kod zaproszenia można uzyskać od webmastera lub innych użytkowników.",
    "Xddh_wK": "Kod zaproszenia",
    "Y-svpKvUz": "dwa hasła nie pasują do siebie",
    "Y0drdCSiu": "Tematy",
    "Yc5uMym": "Możesz się zastanawiać, co oznacza ELB3, w skrócie, jest to skrót od grupy non-profit WeChat {0}, która jest interesującą platformą dla entuzjastów języka angielskiego i zdających, umożliwiającą naukę i docenianie języka angielskiego!",
    "ZCzH8": "Najnowsza",
    "ZaS8MP8cr": "Uwaga: kod weryfikacyjny został odświeżony. Aby kontynuować, dostosuj wartości w formularzu i wprowadź kod ponownie.",
    "aISK9iYc_": "Raport dotyczący nielegalnych informacji",
    "aUdtds_qwY": "Zwykle możesz pomyślnie zalogować się przy użyciu swojego identyfikatora użytkownika lub numeru telefonu, nawet jeśli naruszyłeś zasady obowiązujące w tej społeczności.",
    "b7wgrhuXl": "Tech",
    "b_vts": "Zalogować się",
    "dHWho": "Zapisać się",
    "dldeoeqwc": "Przyjazne przypomnienia",
    "dnsz7fwNx": "W identyfikatorze użytkownika rozróżniana jest wielkość liter.",
    "dsdfqw": "użytkownik nie istnieje",
    "dwJucRtar": "Ta część jest wciąż w toku. Zapraszamy do wzięcia udziału w projekcie dotyczącym tej części.",
    "dzIC7qPQ": "Jeśli chcesz do nas dołączyć, spróbuj skontaktować się z webmasterem za pośrednictwem jego adresu e-mail {0} lub konta WeChat {1}, aby otrzymać kod zaproszenia.",
    "englishcorner": "język angielski",
    "eqwee": "Hasło jest nieprawidłowe",
    "fcGTPc7HP": "Gdzie mogę zdobyć kod zaproszenia?",
    "gTOv6abWT": "Zaloguj sie",
    "gTOv6adbWT": "Rejestr",
    "geHXwByxy": "Ustawienia",
    "gmK3pKyRI": "{0} Szczytowa liczba online",
    "groupnote": "Notatka",
    "hxCMxpW6Sq": "Dołączył {0} dni temu",
    "jRFk519Bj-": "Społeczność ta opiera się na w pełni międzynarodowym projekcie darmowego kodu źródłowego.",
    "jdbef_PBl": "Bramka",
    "ky6JphiKk": "{0} Użytkownicy online",
    "lEDpJMRfG": "Jeśli jesteś zdezorientowany, daj nam znać, wysyłając do nas e-mail.",
    "lWqYc": "Ta strona internetowa udostępnia narzędzia JSON, w tym JSON do XML, JSON do CSV, JSON do YAML.",
    "lastreplyby": "Ostatnia odpowiedź od",
    "lidydVO": "Dlaczego jestem zablokowany lub ograniczony?",
    "lu2T6idPY": "Jeśli uważasz, że wystąpił problem z Twoim kontem, skontaktuj się z webmasterem.",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "{0} Użytkownicy",
    "nncQE": "Życie",
    "o4GdNzX6xS": "Po pierwsze, ze względu na dobrze znane na Ziemi wymogi regulacyjne, każdy użytkownik w celu rejestracji zobowiązany jest do podania ważnego numeru telefonu.",
    "oHQNQ4mRw": "Identyfikator użytkownika",
    "p1Jyl4uMv": "Wyloguj się ze swojego konta",
    "pNwe3": "Inny",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "Wybierz język witryny",
    "uefFV1": "Później",
    "ufSPh0ad": "Jeśli rejestracja konta przy użyciu bieżącego numeru telefonu nie jest możliwa, skontaktuj się z webmasterem pod jego adresem e-mail {0} lub kontem WeChat {1}. Możemy pomóc Ci w ręcznej rejestracji konta.",
    "wCcPJZK": "{0} nie jest prawidłowym adresem e-mail",
    "wCctGPJZK": "{0} nie powinien być pusty",
    "xhxY6iLDH": "Wyloguj",
    "yOdwRB": "Witamy w społeczności ELB3!",
    "zr3ZBdUoT": "Poradnik użytkownika",
    "zuxd0y-kmA": "Identyfikator użytkownika lub numer telefonu nie zawiera białych znaków."
}