{
    "15424": "Esse é todo o problema da ciência. Você tem um bando de empiristas tentando descrever coisas de maravilhas inimagináveis. –Bill Watterson",
    "15999": "Inovação é o processo de fazer mudanças em algo estabelecido. -Equipe de definição de inovação",
    "16987": "Às vezes vale a pena ficar na cama na segunda-feira, em vez de passar o resto da semana depurando o código de segunda-feira. –Dan Salomão",
    "19775": "A ciência é um modo de vida. É uma perspectiva. A ciência é o processo que nos leva da confusão à compreensão de uma forma precisa, preditiva e fiável – uma transformação, para aqueles que têm a sorte de a experimentar, que é fortalecedora e emocional. -Brian Greene",
    "38127": "Teste é o processo de tentar quebrar o código – Anônimo",
    "42641": "O desenvolvimento da Web é difícil, só que é divertido de fazer. Você apenas precisa definir seus padrões. Se fosse fácil, alguém faria isso? - Olawale Daniel",
    "46367": "A inovação é a chave para desbloquear o potencial de crescimento. -Omar Ishrak",
    "57225": "A inovação é a força vital de um negócio próspero. -Michael Dell",
    "63470": "Um verdadeiro cientista resolve problemas, não lamenta que sejam insolúveis. –Anne McCaffrey",
    "66187": "Falar é fácil. Mostre-me o código. - Linus Torvalds",
    "68518": "Software e catedrais são praticamente a mesma coisa – primeiro nós os construímos, depois oramos.",
    "77528": "A inovação é a força motriz do progresso. -John F. Kennedy",
    "80972": "É claro que códigos incorretos podem ser eliminados. Mas é muito caro. -Robert C. Martin",
    "85805": "Um especialista é uma pessoa que cometeu todos os erros que podem ser cometidos em uma área muito restrita. – Neils Bohr",
    "92941": "Existe poesia real no mundo real. A ciência é a poesia da realidade. - Richard dawkins",
    "": "Mensagem: {0}",
    "-8l11": "Copiado",
    "-DqwwR": "Operação concluída.",
    "-GJ_72": "Mudou para o espaço de trabalho selecionado {0}",
    "-Jx4J": "Conta local",
    "-Rj3y": "Temas",
    "-XZnW": "Voltar",
    "-Yo129I": "Ferramentas de texto",
    "-nL_B5PoN": "Comprime {0}",
    "00d36": "A melhor maneira de prever o futuro é inventá-lo. -Alan Kay",
    "01do0y": "Kannada",
    "04SSf": "Esqueceu sua senha?",
    "07naT": "Erro: {0}",
    "07ui6": "Mais informações",
    "0Ceqru": "Base64 é uma notação para codificação de dados de bytes arbitrários usando um conjunto restrito de símbolos que podem ser convenientemente usados ​​por humanos e processados ​​por computadores.",
    "0MO3jj": "MD5 (Message-Digest 5) é uma função hash amplamente usada. Ele tem sido usado em uma variedade de aplicações de segurança e também é comumente usado para verificar a integridade de arquivos. No entanto, o MD5 não é resistente a colisões e não é adequado para aplicações como certificados SSL/TLS ou assinaturas digitais que dependem desta propriedade.",
    "0PgZ_": "Tradução",
    "0YKce": "Converte uma string decimal codificada em binário (BCD) em um número decimal.",
    "0a310": "Não existe um caminho real para a ciência, e apenas aqueles que não temem a subida cansativa dos seus caminhos íngremes têm a oportunidade de alcançar os seus cumes luminosos. - Karl Marx",
    "0a710": "A inovação é a força vital de qualquer organização. -Dr. RL Bhatia",
    "0ba15": "A inovação bem-sucedida exige assumir riscos calculados. -Harvard Pruden",
    "0e299": "Tudo é teoricamente impossível até que seja feito. –Robert A. Heinlein",
    "0gvcN": "Bem-vindo à página de visão geral, ela ainda está em desenvolvimento.",
    "0gywa": "Espaço de trabalho não encontrado. Você será redirecionado para a página de índice do espaço de trabalho.",
    "0pfdz7": "Usbeque",
    "114ee": "A codificação como a poesia deve ser curta e concisa. - Santosh Kalwar",
    "13pmE": "Apoie-nos",
    "149c0": "Em questões de ciência, a autoridade de mil não vale o raciocínio humilde de um único indivíduo. – Galileu Galilei",
    "1507oa": "bengali",
    "1883d": "A ciência é muito mais estimulante para a imaginação do que os clássicos. – JBS Haldane",
    "188cd": "A programação é aprendida escrevendo programas. -Brian Kernighan",
    "18f46": "Foguetes são legais. Não há como evitar isso. -Elon Musk",
    "1JOFP": "Abra meu espaço de trabalho",
    "1NTgQ": "Abrir espaço de trabalho",
    "1Npez": "Forneça o caminho",
    "1Tuab": "Copiado",
    "1X8x7": "Exemplo",
    "1Xe82x7": "{0} Minimizar",
    "1Xe8wx7": "Corda hexadecimal",
    "1Xe8x7": "{0} Embelezar",
    "1Xe8x7qe": "BCD",
    "1YmJc": "Selecione uma das opções como seu idioma preferido:",
    "1a3Sc": "Cancelar carregamento",
    "1a8b9": "O cientista não é uma pessoa que dá as respostas certas, é alguém que faz as perguntas certas. – Claude Lévi-Strauss",
    "1bd": "Fluxo de trabalho",
    "1d71a": "Nascemos num determinado momento, num determinado local, e tal como os anos de colheita do vinho, temos as qualidades do ano e da estação em que nascemos. A astrologia não reivindica mais nada. –Carl Jung",
    "1da5a": "A inovação é a base do progresso e do sucesso no mundo empresarial moderno. -Larry Página",
    "1e3e5n": "Hauçá",
    "1ff27": "Ciência é o que entendemos bem o suficiente para ser explicado a um computador; arte é todo o resto. -Donald E. Knuth",
    "1h6jH": "Atenção, a saída é um valor vazio cujo comprimento é zero!",
    "1j62a": "Faça isso em outro momento",
    "1jj0ri": "japonês",
    "1k_44": "Esta operação decodifica dados de uma string ASCII Base64 de volta ao seu formato bruto.",
    "1th2nw": "Cingalês",
    "1yIQu": "Você pode tentar reprocessar sua ação ou clicar no botão abaixo para descartar o erro.",
    "20nmcv": "Latim",
    "22XLF": "Ainda não está terminado",
    "22f3a": "A inovação é a questão central da prosperidade económica. –Michael Porter",
    "23f61": "A inovação não consiste apenas em ter uma boa ideia; trata-se de tornar essa ideia uma realidade. -Erik Qualman",
    "24vLI": "Criada",
    "277a9": "A ciência não pode resolver o mistério final da natureza. E isso porque, em última análise, nós próprios fazemos parte do mistério que tentamos resolver. - Max Planck",
    "27ef9": "Inovação é a capacidade de converter ideias em faturas. -EU. Duncan",
    "27j7sy": "Shona",
    "2D9a6": "Esqueceu sua senha?",
    "2D9qdk6": "É seguro o suficiente?",
    "2IF6A": "Parece que o armazenamento salvo do Forge encontrou algum problema",
    "2JyFN": "Copiar resultado para a área de transferência",
    "2Ocbey": "Versão",
    "2RhAT": "Parece que o processo de recuperação da forja encontrou algum problema",
    "2Ruh6": "Criar nova conta local",
    "2S5ap": "Alternar modo de tela inteira",
    "2S_7EVIsK": "Validador JSON",
    "2Y1mR": "Texto claro",
    "2b7f7": "Tenho certeza de que o universo está cheio de vida inteligente. Foi muito inteligente vir aqui. -Arthur C. Clarke",
    "2bqHk": "Carregar do arquivo",
    "2e4fb7": "Ibo",
    "2giYv": "Senha de teste: {0}",
    "2khdsv": "pashto",
    "2lehqwp": "vietnamita",
    "2lhcqwp": "turco",
    "2lhqqwp": "indonésio",
    "2lhqqwqp": "malaio",
    "2lhqwwp": "tailandês",
    "2qdin8": "Por favor, insira o código de verificação",
    "2tib5m": "sueco",
    "2ybu7j": "norueguês",
    "30eo2v": "Guzerate",
    "321e0": "A depuração é duas vezes mais difícil do que escrever o código. Portanto, se você escrever o código da maneira mais inteligente possível, você não será, por definição, inteligente o suficiente para depurá-lo - Brian W. Kernighan",
    "32D9a6": "Crie a sua conta aqui",
    "32c8d": "Se a depuração é o processo de remoção de bugs, então a programação deve ser o processo de colocá-los. – Sam Redwine",
    "33RXi": "A solicitação foi rejeitada devido a parâmetros insatisfatórios.",
    "33aa4": "A ciência é apenas puro empirismo e, em virtude do seu método, exclui a metafísica. –Steve Martin",
    "346qid": "russo",
    "380da": "A programação hoje é uma corrida entre engenheiros de software que se esforçam para construir programas maiores e melhores à prova de idiotas e o Universo que tenta produzir idiotas maiores e melhores. Até agora, o Universo está vencendo. -Rick Cook",
    "394b6": "Se você pensasse que a ciência era certa? bem, isso é apenas um erro de sua parte. -Richard Feynman",
    "398cc": "Os programadores parecem estar mudando o mundo. Seria um alívio, para eles e para todos nós, se soubessem algo sobre isso. –Ellen Ullman",
    "39dsCt": "Você receberá a notificação mais recente dos serviços de aplicativos, se tiver.",
    "3d297": "O que adoro na ciência é que, à medida que você aprende, você realmente não obtém respostas. Você apenas recebe perguntas melhores. -John Verde",
    "3ii2tt": "Gaélico Escocês",
    "3umnB": "Token desconhecido",
    "40b7f": "A inovação é a única maneira de vencer no longo prazo. -Jeff Immelt",
    "420b0": "A inovação bem-sucedida requer um compromisso com a colaboração e a comunicação aberta. -Rachel D. Ellison",
    "43be5": "Diário",
    "43e45": "Não há lei, exceto a lei de que não há lei. –John Archibald Wheeler",
    "441oja": "Georgiano",
    "44Ntqw-": "Lidando com a operação.",
    "45cb0": "A inovação não consiste apenas em criar novas ideias, mas também em executá-las com sucesso. -Arun Pandit",
    "46bksi": "lituano",
    "4K_vhq": "Duplicar esta guia",
    "4PIqD": "Revisão de código",
    "4UYIJ": "Ainda não foi completo.",
    "4cGA_": "Recuperando dados para preferências do sistema...",
    "4cf03": "Na verdade, tudo o que pode ser conhecido como número; pois é impossível compreender qualquer coisa com a mente ou reconhecê-la sem ela. – Filolau",
    "4d389": "A inovação é um modo de vida para o empreendedor de sucesso. -John Rampton",
    "4da84": "Você pode não pensar que programadores são artistas, mas programar é uma profissão extremamente criativa. É criatividade baseada na lógica. – João Romero",
    "4kKe4": "Sua senha",
    "4tqb4x": "húngaro",
    "4vdfwf": "OK",
    "4wlih": "A solicitação foi rejeitada devido a parâmetros insatisfatórios.",
    "52OiQ": "Copiado {0} vezes",
    "532fd": "Inovação é a capacidade de ver a mudança como uma oportunidade e não como uma ameaça. -Steve Jobs",
    "54cwb": "A API Websocket do sistema encontrou um erro: {0}",
    "56ibcj": "vietnamita",
    "57eaa": "Somos apenas uma raça avançada de macacos num planeta menor de uma estrela muito comum. Mas podemos entender o Universo. Isso nos torna algo muito especial. -Stephen Hawking",
    "58HQX": "Caso você não saiba seu valor, entre em contato com seu administrador para obter mais detalhes, que podem ser encontrados em suas configurações.",
    "58c03": "A inovação é um fator chave para o sucesso de qualquer negócio. -Ravi Venkatesan",
    "58c5f": "Se, a princípio, você não conseguir, chame-a de versão 1.0. - Khayri R.R. Woulfe",
    "59f7d": "A inovação é o catalisador do progresso e do crescimento. -John Donahoe",
    "5BOhl": "Código de Convite",
    "5Ih2u": "Navegador de ferramentas",
    "5NCPT": "Modo escuro",
    "5NJeGsu1": "E-Mail, você pode organizar facilmente sua caixa de entrada, redigir e enviar mensagens e ficar por dentro de sua correspondência. Até o momento, é utilizado apenas como ferramenta de comunicação entre os usuários e nossa equipe.",
    "5NJeddqGsu1": "Esta seção inclui materiais de informática, artigos wiki, guias de uso e muito mais.",
    "5NJedqddqGsu1": "Esta seção inclui recursos de computador que podem ser usados ​​para construir seus próprios projetos.",
    "5Perd": "Desculpe, a função 'Usar Editor Inteligente' ainda não está disponível. Ainda estamos trabalhando para implementá-lo. Obrigado pela sua paciência.",
    "5ZBYR": "Voltar",
    "5a8a1": "Inovação é o processo de pegar uma ideia e transformá-la em realidade. -Kevin O'Leary",
    "5dF7o": "Atualizar",
    "5db54": "A ciência é o grande antídoto para o veneno do entusiasmo e da superstição. - Adam Smith",
    "5eXVS": "Conteúdo do roteiro",
    "5ggegx": "coreano",
    "5lW8qp": "Mostre um exemplo para esta ferramenta",
    "5q-Zxqa": "Gerenciador de scripts",
    "5qPOJL": "Para oferecer suporte ao LafTools, considere dar uma estrela ao nosso repositório no GitHub ou atualizar para a nossa versão profissional por meio de uma assinatura mensal. Agradeceríamos muito a sua ajuda e prometemos que o LafTools ficará ainda melhor com os fundos arrecadados.",
    "5qV5Sf": "Remover este registro da lista",
    "5rg5mt": "malgaxe",
    "5srFq": "LafFerramentas",
    "5v8jl7": "Hmong",
    "626bf": "Se soubéssemos o que estávamos fazendo, isso não se chamaria pesquisa, certo? - Albert Einstein",
    "63d47": "A qualidade é produto de um conflito entre programadores e testadores. - Yegor Bugayenk",
    "662f9": "Você só vive uma vez, mas se você viver certo, uma vez é o bastante. -Mae Oeste",
    "66ef1": "Um bom código é sua melhor documentação. Ao adicionar um comentário, pergunte-se: ‘Como posso melhorar o código para que este comentário não seja necessário? ' -Steve McConnell",
    "66f12": "Ciência é conhecimento organizado. Sabedoria é vida organizada. -Will Durant",
    "6AumW": "Ação padrão",
    "6ClPV": "Criar",
    "6MrfIfGc6": "Minimização de código",
    "6UICxHzVR.name": "Embelezar {0}",
    "6a0da": "A arte e a ciência de fazer perguntas são a fonte de todo conhecimento. –Thomas Berger",
    "6cOPZ": "Decimal codificado em binário (BCD) é uma classe de codificações binárias de números decimais onde cada dígito decimal é representado por um número fixo de bits, geralmente quatro ou oito. Às vezes, padrões de bits especiais são usados ​​para um sinal",
    "6hsnqWe": "Embora o LafTools seja gratuito e de código aberto, mantê-lo ainda requer uma quantidade significativa de tempo e energia. Em particular, precisamos de fundos para pagar certas APIs em nuvem. Se você aprecia o LafTools, considere nos apoiar.",
    "6j13s3": "islandês",
    "6qT9d-N": "Para o notebook, o LafTools não apenas fornece um gerenciador de comandos shell, mas também adicionará ferramentas poderosas de notas em um futuro próximo, como MarkDown, Latex, {0} e assim por diante.",
    "6ulj8i": "nepalês",
    "6wdtJ4vmg.name.0912": "Minimizar {0}",
    "6yOXx": "Nome desconhecido",
    "71L3OI9T7": "Examinar a paz, promover a cooperação e buscar o desenvolvimento tornou-se o tema da era atual.",
    "71x7x": "Código-fonte no GitHub",
    "72bee": "Não sou um grande programador; Sou apenas um bom programador com ótimos hábitos. -Kent Beck",
    "74a91": "Testar leva ao fracasso e o fracasso leva à compreensão - Burt Rutan",
    "74f90": "A ciência de hoje é a tecnologia de amanhã. –Edward Teller",
    "7714b": "A inovação é a chave para desbloquear novas oportunidades e impulsionar o crescimento.",
    "79f2d": "A maioria dos bons programadores programa não porque espera ser pago ou adulado pelo público, mas porque é divertido programar. - Linus Torvalds",
    "7MOO1": "Entrar",
    "7affb": "O mundo não vai esperar por nós. A revolução tecnológica deixar-nos-á para trás se não conseguirmos alcançá-la. –Kofi Annan",
    "7c59e": "Experiência é o nome que todos dão aos seus erros. – Oscar Wilde",
    "7d4e4": "Inovação significa encontrar maneiras novas e melhores de fazer as coisas. -Jim Rohn",
    "7dm0d8": "Chinês tradicional",
    "7e19d": "A confusão faz parte da programação. - Felienne Hermans",
    "7flKa": "LafTools – O Onipotente para todos os Profissionais e Engenheiros",
    "7g5w22": "norueguês",
    "7k56u3": "Galego",
    "7q40W": "Não é possível inicializar o administrador",
    "7u4vzu": "Eslovaco",
    "7x3f6": "Guia - 1",
    "8259a": "Programador: Máquina que transforma café em código. – Anônimo",
    "82r0C": "Gerencie sua lista de tarefas pendentes e faça as coisas com mais eficiência.",
    "83dNp": "Não foi possível carregar o ID da extensão. (REF: 1dl1f)",
    "850c1": "O cientista impõe apenas duas coisas, nomeadamente a verdade e a sinceridade, e impõe-nas a si mesmo e a outros cientistas. –Erwin Schrodinger",
    "8582b": "Se quisermos que os usuários gostem do nosso software, devemos projetá-lo para se comportar como uma pessoa agradável. -Alan Cooper",
    "8692e": "Há muitos tagarelas, totalmente ignorantes em matemática, que ousam condenar a minha hipótese, com base na autoridade de alguma parte da Bíblia distorcida para se adequar ao seu propósito. Eu não os valorizo ​​e desprezo seu julgamento infundado. – Nicolau Copérnico",
    "886d1": "Sentimos que mesmo que todas as questões científicas possíveis sejam respondidas, os problemas da vida ainda não foram tocados. –Ludwig Wittgenstein",
    "8LdRj": "Visão geral",
    "8LdRjq": "Calcular",
    "8LdevRj": "Serviço",
    "8M1wY": "Terminal local",
    "8OqB7hN1s": "Esta página fornece um estilo de UI IDE para LafTools, um nível mais alto de abstração para LafTools.",
    "8c224": "Não importa qual área de trabalho você queira atuar, é de grande importância aprender pelo menos uma linguagem de programação. -Ram Ray",
    "8e5d0": "A inovação é a chamada do futuro. –Kofi Annan",
    "8eeL1Kk": "Sobre",
    "8mn_qa": "Recuperando os dados dos serviços de terminal...",
    "8qzWJu": "Desculpe, no momento ainda não oferecemos suporte a dispositivos de tela pequena. Use o PC para visitar esta página.",
    "90b5e": "Não é um bug; é um recurso não documentado. - Anônimo",
    "91f08": "A melhor coisa sobre a tecnologia é que ela permite que você se concentre na sua visão e esqueça o maquinário. –John Landis",
    "9251d": "A inovação é um fator chave na capacidade de qualquer empresa ter sucesso no longo prazo. -Elon Musk",
    "92b29": "Inovação é o processo de pegar uma ideia criativa e transformá-la em um sucesso comercial. -Richard Branson",
    "9334e": "A maior glória de viver não reside em nunca cair, mas em levantar-nos sempre que caímos. -Nelson Mandela",
    "9412b": "Primeiro, resolva o problema. Em seguida, escreva o código. –John Johnson",
    "9469a": "Todo mundo deveria aprender a programar um computador porque ele ensina como pensar. - Steve Jobs",
    "97um9v": "havaiano",
    "98KcL": "Converte um número decimal em decimal codificado em binário (BCD).",
    "98d3f": "A ciência é uma magia que funciona. – Kurt Vonnegut",
    "9Xv8-": "Salvar como nota",
    "9YPgsPid2M": "Código SMS",
    "9_qaj": "Sair deste formulário",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Codificador Base64",
    "9b_7a0sdf": "Decodificador Base64",
    "9cb71": "Inovação significa criar valor para os clientes e melhorar suas vidas. -Reed Hastings",
    "9d18a": "O software vem do céu quando você tem um bom hardware. –Ken Olsen",
    "9e4fcl": "tâmil",
    "9eZHM": "Ops! Parece que encontramos alguns avisos ou erros.",
    "9gqo8x": "letão",
    "9m85mf": "Sesoto",
    "9qy1xn": "Português",
    "9tbbkt": "finlandês",
    "9zCSc": "Não há espaços de trabalho disponíveis",
    "A69UZ": "Variáveis",
    "AVUvu": "Base62 é uma notação para codificação de dados de bytes arbitrários usando um conjunto restrito de símbolos que podem ser convenientemente usados ​​por humanos e processados ​​por computadores. A base numérica alta resulta em strings mais curtas do que no sistema decimal ou hexadecimal.",
    "AW9N8": "Região de entrada",
    "AfPC0": "Sua senha em texto simples",
    "Ahrjc": "O diretório não existe, deseja criá-lo?",
    "AkXgF": "Em andamento: {0}%",
    "Apx8D": "Como redefinir sua senha manualmente?",
    "AvsWiJHLZ": "Recursos",
    "B-GCloBBt": "Compacta código XML (eXtensible Markup Language).",
    "B0s0z": "Objetivo desta página:",
    "BGd7P9": "Esta operação codifica dados brutos em uma string ASCII Base64.",
    "BGd7dP9": "Esta operação codifica dados brutos em uma sequência ASCII {0}.",
    "BGdd7dP9": "Esta operação codifica dados brutos em uma sequência ASCII {0}.",
    "BJbgR": "Reportar um problema",
    "BQs6go-dk": "Baixe gratuitamente LafTools para Windows, Linux e macOS.",
    "BShq3M": "Problemas",
    "BW3bpT": "Lendo o arquivo do disco...",
    "Bd9h-": "Adicione-o à minha coleção favorita",
    "BuihG": "Configurações de sistema",
    "C3L9MmdDU7": "Manual",
    "CASef": "Ok, a operação foi acionada.",
    "CEv8B": "Tem certeza de que deseja remover este registro? Se sim, clique neste botão novamente.",
    "CFg8B": "O tamanho deve estar entre 0 e 512",
    "CK5NCw519": "História da comunidade",
    "CVUl0": "LafFerramentas",
    "CWoqhy": "Lista de Exts por CategoryID selecionado",
    "C_qzLO7yw": "Use Chrome, Firefox ou Edge para obter a melhor experiência.",
    "CfZAX": "O arquivo {0} selecionado, estamos enviando-o para o serviço principal.",
    "CidOqAZ": "Como criador do LafTools, estou muito emocionado por você estar disposto a nos apoiar. Temos boas pessoas em nossa equipe que trabalham duro para melhorar continuamente o LafTools.",
    "Cide2w": "Para ver se há algum problema ao executar sua ação.",
    "CqFdiBu6M": "Visualizar",
    "Cz_qjjFw7": "Sobre {0}",
    "DIQFq": "Verifique se o parâmetro URL foi fornecido corretamente. Parece que você não tem permissão para preencher este formulário. Por padrão, você poderá ver a mensagem abaixo na saída do serviço quando ele for iniciado.",
    "DIweGq": "Proteja seu LafTools",
    "DSEtLTxUU": "O tempo é a moeda da sua vida, gaste-o com sabedoria.",
    "DTTPW": "Reinicie status",
    "DVoKw": "Sair deste sistema",
    "DadYp": "Debounce em tempo real",
    "DqFI5": "Os níveis devem ser maiores que 0",
    "DrXAq": "Bem-vindo ao uso do LafTools!",
    "DrbEr": "A senha que você forneceu está vazia, verifique e tente novamente.",
    "DtlAc": "Carregando recursos do sistema",
    "Dxlw0": "Completo",
    "E62ej": "Filtrar comandos do Shell",
    "E6F9B": "Adicione-o ao fluxo de trabalho",
    "EEQkeW": "O algoritmo MD6 (Message-Digest 6) é uma função hash criptográfica. Ele usa uma estrutura semelhante a uma árvore Merkle para permitir um imenso cálculo paralelo de hashes para entradas muito longas.",
    "EO6Qv5dCA": "Minifica o código JSON, reduza o tamanho do pacote do seu código JSON.",
    "ERK7E": "Se você encontrar algum problema ou tiver alguma sugestão ao usar o LafTools, sinta-se à vontade para nos contatar via e-mail ou GitHub a qualquer momento, estamos dispostos a melhorá-lo urgentemente.",
    "EgBXL": "Selecione ou forneça tags.",
    "Ewvgo": "Ainda nao comecou.",
    "ExqvX": "Lista de teclas de atalho",
    "Eyq856": "Ainda não terminamos - estamos empenhados em fornecer os melhores e mais recentes recursos e continuaremos lançando atualizações para garantir que você tenha a melhor experiência possível.",
    "Ezsn81tfc": "Visualizar",
    "F-OUm": "Configuração rápida para LafTools",
    "F0CCF": "Lista de teclas de atalho",
    "F4uS2": "Novo arquivo",
    "FAQ": "Perguntas frequentes",
    "FBVyc": "Reinsira o código de verificação",
    "FDlRI": "Dê um nome a esta nova guia e clique para confirmá-la.",
    "FLsbFsOZq": "Ambiente de desenvolvimento integrado",
    "FOyHW": "Pesquise em qualquer lugar",
    "FQzhg": "Ignorar entrada vazia",
    "FYRoL": "Recua e embeleza o código Cascading Style Sheets (CSS).",
    "FhVWl": "Criptografe sua senha",
    "FjYbR": "Saída",
    "Fv-zz": "Copiar resultado",
    "Fy217": "Configurar esta ferramenta",
    "Fzp3t": "Forneça o valor neste campo",
    "G2dvTUljF": "Ferramentas",
    "G3MJN": "Mostrar painel de saída",
    "G9QVo": "Gerenciar guias",
    "GR7jK": "Tipo",
    "GaySMPQHo": "Tendendo",
    "Ggob_": "Cancelar",
    "H-Ae75": "Por favor, confirme sua senha local.",
    "H-qA75": "Forneça a senha local.",
    "H8fQ4": "Alternar para modo claro ou escuro",
    "HEAhr": "Após a tradução, o resultado aparecerá aqui.",
    "HIc3c": "Concluído",
    "HNDat": "Para fazer alterações, clique no botão \"{0}\". Caso contrário, clique em \"{1}\" para aplicar suas alterações. Que você se divirta com esta caixa de ferramentas!",
    "Hflf2": "Por uma questão de segurança cibernética, não ajudaríamos a redefinir sua senha por meio de APIs ou páginas aqui, a menos que você atualize manualmente o arquivo protegido pelo sistema.",
    "HjvV3": "Não iremos deletar seus arquivos do disco, apenas removeremos este registro da lista.",
    "HyIC_": "Tecla de barra (/)",
    "HyIC_d": "Tecla de barra (/)",
    "I8FLi": "Agora é hora de configurar seu administrador. Defina a senha o mais complexa possível para deixar perplexos os invasores indelicados.",
    "IAC0A": "Ferramentas de busca",
    "ICefi": "Cancelado",
    "IEFy5k39X": "Geradores",
    "IKqqATS": "Atualizar dados da página atual",
    "IOOrz": "(Seria prejudicial ao seu sistema? Achamos que não, contanto que você possa modificar o arquivo de configuração preservado do sistema, isso significa que você pode ler tudo sobre os arquivos de dados do LafTools.)",
    "IWPP6V-tR": "Código fonte",
    "IWUH5": "Mostrar exemplo",
    "IaSyO": "Cancelar",
    "Ibzs2-Ho1": "Ferramentas CSV",
    "IfsGO": "Favoritos",
    "IfsdGO": "Favoritos",
    "ImUmf": "Novo",
    "IugAFc4OT": "Ocorreu um problema ao enviar seus dados.",
    "IxAJswoSh": "Analisa e imprime código JavaScript válido. Também funciona com JavaScript Object Notation (JSON).",
    "J-3KA": "Forneça um nome para este script, o que seria mais útil.",
    "J164i": "por exemplo. Copie arquivos para servidor remoto",
    "J2xoL": "Veja o erro: {0}",
    "JA_Bp": "Forneça primeiro um nome para a nova tag.",
    "JQEVK": "Código",
    "JQLmS": "Ajustou o tamanho",
    "JQLmSq": "Concluído.",
    "JTBRh": "O LafTools armazenou o valor da senha no arquivo local, mas não se preocupe, adotamos um mecanismo de criptografia de senha unidirecional, ou seja, ninguém consegue ler a senha da versão em texto simples. Para redefinir a senha, siga os instrumentos abaixo para redefinir sua senha manualmente.",
    "JYqxz2": "Bem-vindo ao LafTools, esta é uma versão interna.",
    "Jbor69IBw": "Formatadores",
    "JdqiUE8": "Esta operação decodifica dados de uma string ASCII (com um alfabeto de sua escolha, predefinições incluídas) de volta à sua forma bruta.",
    "JdqidUE8": "Esta operação decodifica dados de uma string ASCII (com um alfabeto de sua escolha, predefinições incluídas) de volta à sua forma bruta.",
    "JfFHw": "Obter solicitação de informações do espaço de trabalho",
    "JiUE8": "Esta operação decodifica dados de uma string ASCII {0} de volta ao seu formato bruto.",
    "Jq7x3Igk0": "Experimente o estilo de UI do cliente",
    "JuZAli3": "Guia do usuário",
    "K1qJZI": "Bem-vindo ao LafTools, Excelência.",
    "KGS2-": "Depois de concluir as etapas acima, você poderá usar sua nova senha para entrar no sistema. Se você não conseguiu acessar o sistema de arquivos, peça ao administrador ou ao suporte de TI para criar esse arquivo. Se o arquivo já existia, exclua-o e renove um.",
    "KIc63": "Função ainda não suportada",
    "KYh1N": "Todas as notas",
    "KcqrRr": "Referência",
    "KcrRr": "Recuperando dados de implementação de código",
    "KmEUF": "Fornece uma visão geral rápida das ferramentas atuais do sistema.",
    "Kw4OJr": "terminal",
    "Kyd9H": "Código-fonte no GitHub",
    "L-p-Y": "Copie o conteúdo do comando shell atual para a área de transferência",
    "L3zEM": "Mostrar exemplo",
    "L42mxa": "Por favor insira seu texto fonte neste campo.",
    "L49kCq": "Forneça e confirme a senha de bloqueio neste formulário para proteger seu LafTools.",
    "L71q_N": "A senha que você forneceu está vazia, verifique e tente novamente.",
    "L9bQku": "Decodificar {0}",
    "L9qbQku": "Decodificar {0}",
    "LAc1m": "Atualizada a visualização do aplicativo.",
    "LFdvM": "Não logado",
    "LM715": "Recuperando a configuração do i18n da API do servidor local",
    "LPJrV": "Copiar resultado",
    "LSohY6eZW": "Hex String é uma string de bytes hexadecimais separados por um delimitador, que pode ser espaço, vírgula, ponto e vírgula ou dois pontos.",
    "LU9Jj": "Base85 (também chamado de Ascii85) é uma notação para codificação de dados de bytes arbitrários. Geralmente é mais eficiente que Base64. Esta operação decodifica dados de uma string ASCII (com um alfabeto de sua escolha, predefinições incluídas). Base85 é comumente usado nos formatos de arquivo PostScript e PDF da Adobe.",
    "LWaeFqd": "Mude para o seu idioma preferido",
    "Le71_N-": "A senha que você forneceu não é a mesma que a confirmada, verifique e tente novamente.",
    "LnJ4H": "Observe que a conta local não é totalmente igual à do usuário registrado em nosso site, a primeira é definida apenas no seu PC enquanto a segunda pode ser usada para sincronização na nuvem.",
    "LqWaFd": "Configurações de sistema",
    "LxaEFHbfa": "Minifica o código SQL, reduza o tamanho do pacote do seu código SQL.",
    "M3qytc": "Codificar {0}",
    "M3ytc": "Codificar {0}",
    "M4ywN1": "Calculadora, calendário, relógio, clima e muito mais.",
    "M6MrW": "Bom",
    "M7jct": "Entre no modo de tela inteira",
    "MN2lT": "O comprimento da senha não pode ser inferior a 6",
    "Ma5mv": "Alternar a visibilidade das guias da barra de ferramentas",
    "Mq9pdpT": "Liste todos os recursos relevantes para o menu funcional selecionado.",
    "Mq9ppT": "Visualize rapidamente o status dos seus serviços",
    "Mqq9pdpT": "Ajudá-lo a começar a usar o LafTools.",
    "MrgmU": "confirme",
    "NMLOn": "Copiar caminho do arquivo",
    "NMLOn1": "Abrir espaço de trabalho",
    "NNfJo": "Carregar dados do arquivo",
    "Nq1IR": "Não foi possível carregar a VM de extensão",
    "Nqc0LqwX": "Se você acha que há uma vulnerabilidade neste processo, sinta-se à vontade para nos contatar via e-mail ou GitHub a qualquer momento, gostaríamos de aprimorá-la urgentemente.",
    "NrQc8OJfZ": "Compacta código JavaScript Object Notation (JSON).",
    "O02-W": "Não está carregando...",
    "O94Yx": "sobre",
    "OBjaZqTvx": "Lar",
    "OO0qPN": "Exemplo carregado",
    "OQWm4": "Reportar um erro",
    "OSHOI": "Página de boas-vindas",
    "OSqZQM": "Senha local",
    "OeO0PeN": "Ok, o exemplo é exibido no editor de entrada.",
    "OeOQY": "PENDÊNCIA",
    "Ol1ZcWomT": "{0} Embelezar",
    "OpPFe": "Se você gosta do LafTools, compartilhe com seus amigos e nos dê uma estrela, obrigado!",
    "Opcty": "arquivos",
    "OqqGx2qg": "Carregando os recursos estáticos, aguarde...",
    "OrCt5": "Redirecionando para o ambiente de trabalho...",
    "Ot6EP": "Ferramentas polonesas",
    "OyZLZokUQ": "Capacite o desenvolvimento com LafTools!",
    "P4ROa": "Região de saída",
    "PM_N5": "Sessão - {0}",
    "PUxuU": "Recuperando dados para pacotes de idiomas...",
    "PapkF": "Se você tiver alguma dúvida ou sugestão sobre o LafTools, sinta-se à vontade para nos informar. Estamos sempre buscando maneiras de melhorar nosso produto e oferecer a melhor experiência possível aos nossos usuários. Você pode entrar em contato conosco em work7z@outlook.com. Obrigado por usar o LafTools!",
    "PpCHA": "Chave da pergunta (?)",
    "PqazM-": "Primeiro de tudo, use os controles do formulário abaixo para criptografar sua senha",
    "QL9Sn": "No momento, não parece haver uma descrição disponível.",
    "QLKzF": "Está repleto de recursos que atendem às necessidades de desenvolvedores novatos e experientes, tornando-o uma ferramenta obrigatória no arsenal de qualquer programador.",
    "QM2Ob": "Ferramentas recentes",
    "QM2Oq": "Notas recentes",
    "QRAdA": "inglês para chinês",
    "QZK58Gemi": "Compacta código de linguagem de consulta estruturada (SQL).",
    "QhdpH": "Edição da comunidade",
    "QkJ-TOduip6z_": "IDE LafTools",
    "QvBKp9BBp": "Saiba mais sobre o planejamento de desenvolvimento do LafTools.",
    "QzlA3": "Um erro ocorreu",
    "R12bq": "Listar guias que não são mostradas",
    "RNBze0": "Ferramentas",
    "RNeBze0": "Guias abertas",
    "RNewBze0": "Configuração da ferramenta",
    "RO4ZP": "Um erro ocorreu",
    "RPVRl": "Parece que esta extensão não é compatível com a versão atual do LafTools. Considere instalar a versão mais recente para oferecer suporte a esta extensão ou sinta-se à vontade para entrar em contato conosco levantando um problema no GitHub.",
    "RhqzcdD": "Configurações de sistema",
    "RjCO3": "Lista de espaços de trabalho",
    "RjdigcxfV": "Contate-nos",
    "S4MMV": "Ops! Encontramos alguns problemas ao carregar o arquivo.",
    "SAnnQ": "Carregando o arquivo {0}",
    "SBsDz": "Configuração para sua conta de administrador.",
    "SGs7B": "Configure seu LafTools rapidamente",
    "SMqD13": "Digite para filtrar",
    "SPem9": "Este campo ainda não está pronto.",
    "SQAw7": "Idioma de origem",
    "SYSq1": "Exemplo",
    "SZgXb": "Configurar senha local",
    "SdGcT": "Outra parte",
    "Sm9tq": "Forneça a senha da conta aqui",
    "Sm9tqq": "Forneça a senha para desbloquear seu LafTools",
    "Spcfdee": "Modo claro ou escuro",
    "TBPqy7": "Linguagem",
    "TD7DA": "línguas",
    "TNoePE": "Nuvem LafTools",
    "TV09-obNr": "Marco",
    "Ttrqqet": "Escreva e salve suas idéias aqui!",
    "TwFcr": "Idioma alvo",
    "TyqvWY3": "Arquivo local",
    "U2ZNl": "Saiba mais na Wikipédia",
    "U4qqq9": "Remover esta guia da lista",
    "U7zP2": "Forneça o nome de usuário da conta aqui",
    "UED59zbd-": "LafFerramentas",
    "UF_Dp": "Ocorreu um erro: {0}, o tempo rejeitado é {1}",
    "UVvJp-vtF": "{0} Minimizar",
    "UZ2Ig": "Nova conta local",
    "Ugpng": "Favorito",
    "UjkOS50wO": "Lar",
    "V2A74ySoN": "Visualizar",
    "V6U_f": "Termos de serviço",
    "V6XEO": "Digite o nome de usuário ou e-mail",
    "VAZq8r": "Ele permite que os desenvolvedores executem vários comandos, como executar scripts, instalar pacotes e navegar no sistema de arquivos, tudo dentro do editor.",
    "VEfeqZG": "Notas",
    "VI6VT": "História",
    "VOsZc": "Reportar problema",
    "VSZ": "Clique para reativar",
    "VZtqg6": "Criar novo formulário de script",
    "Vaf2y": "O nome da guia não poderia ficar em branco.",
    "VeY9K": "Termos de uso",
    "VgG5y": "Clique aqui para atualizar o status da sua extensão",
    "VjZCv": "Conversão em tempo real",
    "Vvt09V2Qo": "Código genérico",
    "WFUWzv_px": "Analisa e imprime código JavaScript válido. Também funciona com JavaScript Object Notation (JSON).",
    "WKG7e": "Regras",
    "WPrTW": "Website oficial",
    "WXo6D": "Atualizado",
    "WYCVL": "Configuração rápida",
    "X4L_Z": "A VM de extensão não é fornecida.",
    "X6Fq4j": "Após anos de desenvolvimento e refinamento dedicados, estamos confiantes de que o LafTools pode aprimorar significativamente sua experiência de programação, trazendo mais conveniência e eficiência ao seu fluxo de trabalho.",
    "XKpI0": "Clique para processar seu texto na região de entrada",
    "XLWoR": "Selecione o seu preferido e continue",
    "XQxJB": "Meus espaços de trabalho",
    "X_HGx": "LafTools é uma caixa de ferramentas versátil projetada para atender a diversas necessidades. É totalmente de código aberto, garantindo transparência e segurança. Apesar de seu tempo de execução leve, ele oferece suporte completo à plataforma, incluindo ARMv8, e suporte nativo de IA semelhante ao ChatGPT. LafTools é altamente integrado a uma UI produtiva e é continuamente atualizado com novas ferramentas. Ele pode ser usado pela web e com Docker e fornece recursos adicionais como notas e manuais.",
    "XeXF77": "Configurações",
    "XikdD": "Momentos por favor, estamos quase lá!",
    "Y5GAC": "Seu nome de usuário",
    "Y9mQ2": "Forneça o nome de usuário da conta aqui",
    "YAAU3q": "Senha local",
    "YHCjT": "LafTools suporta tema global claro e escuro, é útil principalmente com codificadores noturnos.",
    "YNwKz": "Idioma não suportado: {0}, usará o inglês por padrão.",
    "YOYTp": "Configuração rápida",
    "YPPPL": "Alternar a visibilidade das guias da barra de ferramentas",
    "YQN9u": "Ocorreu um erro ao carregar {0}. Verifique os detalhes abaixo.",
    "Y__Zb1_4Q": "Minimiza o código Cascading Style Sheets (CSS), removendo todos os caracteres desnecessários.",
    "Y_k0z": "Esqueceu sua senha?",
    "Ye3TXses": "Configurar se a transformação será executada automaticamente quando o texto de entrada for alterado.",
    "Ylq2X": "Correção de erros",
    "YquQqTXq": "Execução automática?",
    "YrTdq": "Todos",
    "YrVq683": "Correspondência",
    "YrVqdd683": "Manuais",
    "Z2QTU": "Sobre",
    "Z3rhY": "Mensagem",
    "Z7ALO": "Mudou para o espaço de trabalho selecionado",
    "Z7OTt": "O arquivo que você selecionou é muito grande. Selecione um arquivo com menos de 30 MB.",
    "ZAGva": "Tem certeza de que deseja excluir este espaço de trabalho?",
    "ZAKaFq": "Minha conta na nuvem",
    "ZCzH8": "O mais novo",
    "ZW1Dgz": "Nenhuma mensagem disponível",
    "ZXRGC": "Veja o erro: {0}",
    "ZaS8MP8cr": "Observação: o código de verificação foi atualizado. Ajuste os valores do formulário e insira o código novamente para continuar.",
    "ZbD3F": "{0}, criado pela equipe LafTools",
    "Zk7JI": "Ainda não é compatível",
    "ZrbduC": "Fechar todas as guias",
    "ZrbuC": "Aba fechada",
    "_5OqeG": "Desmarque",
    "_LFF3": "Caso você encontre algum problema ou tenha alguma sugestão ao usar o LafTools, sinta-se à vontade para nos contatar via e-mail ou GitHub a qualquer momento, estamos dispostos a aprimorá-lo.",
    "_trez": "Trocar texto",
    "_trqL": "Recuperando dados para recursos do sistema...",
    "_z3lR": "Atualizar código",
    "a0ab0": "A arte é a árvore da vida. A ciência é a árvore da morte. -William Blake",
    "a2849": "Ciência é a aceitação do que funciona e a rejeição do que não funciona. Isso requer mais coragem do que imaginamos. -Jacob Bronowski",
    "a3508": "Equipado com seus cinco sentidos, o homem explora o universo ao seu redor e chama a aventura de Ciência. -Edwin Hubble",
    "a3yqoz": "persa",
    "a3z-3k12": "Ferramentas de endereço IP",
    "a4jbpq": "Tcheco",
    "a5354": "É estranho que apenas as descobertas extraordinárias feitas pelo homem mais tarde pareçam tão fáceis e simples. –George C. Lichtenberg",
    "a7062": "A inovação é a faísca que acende o progresso. -Robyn M. D'Angelo",
    "a8a34": "A inovação é o cartão de visita do futuro. -Anna Eshoo",
    "a8dd9": "A vida não pode ter um começo aleatório... o problema é que existem cerca de 2.000 enzimas, e a chance de obter todas elas em um teste aleatório é apenas uma parte em 10^40.000, uma probabilidade escandalosamente pequena que não poderia ser enfrentada mesmo que todo o universo consistia em sopa orgânica. – Fred Hoyle",
    "aCkOP": "Saída",
    "aHAfR": "Buscando dados para {0}...",
    "aISK9iYc_": "Relatório de informações ilegais",
    "aSOpr": "Gerador de modelo de dados",
    "aa2f1": "Exploração é o que você faz quando não sabe o que está fazendo. Isso é o que os cientistas fazem todos os dias. Se um cientista já soubesse o que está fazendo, não estaria descobrindo nada, porque já sabia o que estava fazendo. – Neil de Grasse Tyson",
    "aa3a4": "Código é como humor. Quando você tem que explicar, é ruim. – Casa Cory",
    "ab5f7": "O aspecto mais triste da vida neste momento é que a ciência reúne conhecimento mais rápido do que a sociedade reúne sabedoria. – Isaac Asimov",
    "about_LafTools_toolbox": "Sobre LafTools",
    "ac615": "Faça funcionar, faça certo, faça rápido. –Kent Beck",
    "adcca": "Qualquer idiota pode escrever um código que um computador possa entender. Bons programadores escrevem códigos que os humanos podem entender. - Martin Fowler",
    "adpgq": "Criar novo espaço de trabalho",
    "af3158": "Tudo é determinado... por forças sobre as quais não temos controle. -Albert Einstein",
    "afcb9": "Nada tem tanto poder de ampliar a mente quanto a capacidade de investigar sistemática e verdadeiramente tudo o que está sob sua observação na vida. – Marco Aurélio",
    "afe52": "Sempre há mais um bug para corrigir. –Ellen Ullman",
    "ah-C4": "Nova nota",
    "aj3nhd": "Alemão",
    "aked6": "Referências",
    "aked61": "Introdução",
    "asElV": "Remover",
    "az4uS2": "Tem certeza de que deseja sair deste sistema? Observe que você será redirecionado para a página de login.",
    "azpNX": "Concluído.",
    "azsd": "navegação rápida",
    "b0qjSL": "Por favor entre no diretório {1} e crie um arquivo {2}, coloque sua senha criptografada como todo o conteúdo do arquivo.",
    "b194e": "A inovação vem do produtor – não do cliente. -C. Eduardo Deming",
    "b19bb": "No dia em que a ciência começar a estudar fenómenos não-físicos, fará mais progressos numa década do que em todos os séculos anteriores da sua existência. - Nikola Tesla",
    "b2724": "Programar é a arte de dizer a outro ser humano o que se deseja que o computador faça. -Donald Ervin Knuth",
    "b4603": "A vida é o que acontece quando você está ocupado fazendo outros planos. - John Lennon",
    "b5014": "Muitos dos fracassos da vida são de pessoas que não perceberam o quão perto estavam do sucesso quando desistiram. – Thomas A. Edison",
    "b6sx9b": "filipino",
    "b7wgrhuXl": "Tecnologia",
    "bP_6qG": "Dicas para esquecer sua senha",
    "bT4R6": "Nova aba",
    "bVlBN": "Chinês para Inglês",
    "bWQunyU10": "Laboratório de IA",
    "bc574": "A inovação é a força vital de um negócio saudável. -Mark Cubano",
    "bc92f": "A inovação bem-sucedida começa com a necessidade do cliente. -Michael Dell",
    "be-Favourite-it": "Adicionar aos favoritos",
    "beb6e": "As ideias são fáceis. A implementação é difícil. -Guy Kawasaki",
    "bfb8e": "A inovação é a chave para se manter relevante e competitivo no mercado. -Mark Zuckerberg",
    "bhojei1": "Chinês tradicional",
    "bjZyW": "Traduzir",
    "bors14": "turco",
    "bp_-b": "Para gerenciar totalmente o LafTools, você precisa configurar seu administrador no início do fluxo de configuração. Verificamos sua identificação pelo token de parâmetro de URL. Tenha certeza de que ninguém mais pode configurar sua permissão de root, a menos que obtenha o token de configuração.",
    "bqqrij": "suaíli",
    "bsWpBA73s": "Compacta código JavaScript.",
    "c0eCw": "Traduza seu texto para qualquer idioma que desejar.",
    "c5meku": "Sudanês",
    "c7Uoqqe": "Antes de usar o LafTools, forneça e confirme sua senha local conforme abaixo.",
    "c7cfc": "Um bom teste é aquele que tem alta probabilidade de quebrar o código se houver algum problema - Michael Bolton",
    "cMBqyyFae": "Recua e embeleza o código SQL (Structured Query Language).",
    "cNQp_": "Recursos",
    "cPS6q": "Todas as ferramentas",
    "cQqwI8r": "Carregando o status do Terminal Service",
    "cae2c": "Inovação é o processo de pegar ideias e transformá-las em realidade. -Neil Lawrence",
    "cd4d1": "A inovação é a chave para o crescimento dos negócios. -André R. Steinberg",
    "cfYYN": "Descubra mais",
    "ciZV2": "Base32 é uma notação para codificação de dados de bytes arbitrários usando um conjunto restrito de símbolos que podem ser convenientemente usados ​​por humanos e processados ​​por computadores. Ele usa um conjunto menor de caracteres que o Base64, geralmente o alfabeto maiúsculo e os números de 2 a 7.",
    "ciZV21": "Base45 é uma notação para codificação de dados de bytes arbitrários usando um conjunto restrito de símbolos que podem ser convenientemente usados ​​por humanos e processados ​​por computadores. A base numérica alta resulta em strings mais curtas do que no sistema decimal ou hexadecimal. Base45 é otimizado para uso com códigos QR.",
    "ciZV2deq1": "Base58 (semelhante a Base64) é uma notação para codificação de dados de bytes arbitrários. Ele difere do Base64 por remover caracteres facilmente mal interpretados (ou seja, l, I, 0 e O) para melhorar a legibilidade humana. Base58 é comumente usado em criptomoedas (Bitcoin, Ripple, etc).",
    "cj1pd": "Operação de atualização",
    "cjzqj9": "Bósnio",
    "cmxzpg": "Malaiala",
    "coM2I": "Use o Editor Inteligente",
    "crD7I": "Configurar se a transformação deve ignorar o texto de entrada vazio cujo comprimento é zero.",
    "cuRCb": "Categoria não encontrada.",
    "cuRCqb": "A categoria não existe",
    "cxqhqa": "Mianmar (birmanês)",
    "d-l2l": "confirme",
    "d-qPr": "Layout desconhecido: {0}",
    "d0624": "A inovação não consiste apenas em apresentar novas ideias, mas em executá-las de forma eficaz. -Jeff Bezos",
    "d10c9": "A inovação é a chave para desbloquear novos potenciais e desbloquear novos mercados. -Tim cook",
    "d1820": "Até que o homem duplique uma folha de grama, a natureza poderá rir do seu chamado conhecimento científico. –Thomas Edison",
    "d366a": "A inovação é a chave para desbloquear um novo crescimento. -Philip Kotler",
    "d5KZH": "Obrigado por usar o LafTools!",
    "d5LAU": "Licenciado sob AGPLv3",
    "d5fmq2": "italiano",
    "d5hit": "Sessão - {0}",
    "d5x1rl": "Espanhol",
    "d7dc4": "Teste é o processo de avaliação de um sistema ou de seu(s) componente(s) com a intenção de descobrir se ele satisfaz ou não os requisitos especificados - Anônimo",
    "dCFIC": "Código mais bonito",
    "dCFIwC": "Gerador de código",
    "dGKMx": "Saída",
    "dGVUB": "Ferramentas de rede",
    "dO6b2Tkqwe": "Ferramentas usadas recentemente",
    "dQwjNbi0y": "Saiba mais em Documentação",
    "dV5Eq": "Atualizar lista de espaços de trabalho",
    "da74c": "A especulação e a exploração de ideias além do que sabemos com certeza são o que leva ao progresso. –Lisa Randall",
    "dc662": "O único erro real é aquele com o qual nada aprendemos - John Powell",
    "dcebe": "Se a depuração é o processo de remoção de bugs de software, então a programação deve ser o processo de inseri-los - Edsger Dijkstra",
    "ddcc7": "A inovação é a chave para o sucesso na economia moderna. -Satya Nadella",
    "ddsdf3159": "A física nada mais é do que uma busca pela simplicidade máxima, mas até agora tudo o que temos é uma espécie de bagunça elegante. -Bill Bryson",
    "de47c": "Testar é a arte de encontrar uma caixa preta e fazê-la cantar - James Bach",
    "dk122q": "Gerencie seus fluxos de trabalho para combinar várias ferramentas.",
    "dkarh": "Ok, a caixa de ferramentas abriu o diretório. Se não aparecer nenhuma janela, verifique se sua plataforma suporta esta função ou se o diretório está no servidor.",
    "dkjk12": "isso é um teste",
    "dkkq12": "Configure sua ferramenta nesta aba.",
    "dl4kr": "Esqueceu sua senha?",
    "download-local": "Download grátis",
    "dpRY4": "Dicionário",
    "dqTqyvWY": "Menu Gaveta",
    "dsdpA_eJ": "Ajustar tamanho",
    "dtjdt4": "Cazaque",
    "dxLQq": "Permissão raiz",
    "dzjTo": "Forneça a senha da conta aqui",
    "e--gB": "O ID da extensão não é fornecido.",
    "e097e": "Inovação significa criar novas possibilidades e não apenas novos produtos. -Tony Robbins",
    "e2379": "Vivemos numa sociedade extremamente dependente da ciência e da tecnologia, na qual quase ninguém sabe alguma coisa sobre ciência e tecnologia. - Carl sagan",
    "e3WgQaZlb": "Comprime {0}",
    "e4Cd8t": "Base85",
    "e5rycw": "Quirguistão",
    "e8Crq": "Preencha abaixo o campo de nome de usuário e senha para continuar.",
    "e984f": "O código limpo sempre parece ter sido escrito por alguém que se importa. -Robert C. Martin",
    "eTmq": "História da caixa de ferramentas CodeGen",
    "e_8pZ": "Uma caixa de ferramentas versátil para desenvolvedores melhorarem a produtividade.",
    "ea227": "A melhor maneira de prever o futuro é criá-lo. -Peter Drucker",
    "ediql2": "húngaro",
    "ee7d0": "O sentimento de admiração que a ciência pode nos proporcionar é uma das experiências mais elevadas de que a psique humana é capaz. - Richard dawkins",
    "egkqC8t": "Base58",
    "egkqCd8t": "Base62",
    "eifoni": "catalão",
    "englishcorner": "Inglês",
    "eqkqd4W": "Forneça um nome para a nova tag",
    "etV-l": "Copiar arquivos para SIT2",
    "eu5mh0": "Bielorrusso",
    "euaI8": "Criar nova conta local",
    "euhy9v": "estoniano",
    "f0d15": "Os computadores são rápidos; os desenvolvedores os mantêm lentos. – Anônimo",
    "f12bb": "A inovação é a força motriz do progresso no mundo dos negócios. É o processo de gerar novas ideias e transformá-las em produtos, serviços ou processos tangíveis que agreguem valor aos clientes.",
    "f23c2": "Inovação distingue um líder de um seguidor. -Steve Jobs",
    "f29b1": "O progresso é feito por tentativa e fracasso; os fracassos são geralmente cem vezes mais numerosos que os sucessos, mas geralmente não são registrados. –William Ramsay",
    "f3151": "O maior risco é não correr nenhum risco. -Mark Zuckerberg",
    "f3159": "A matemática é um jogo jogado de acordo com certas regras simples, com marcas sem sentido no papel. -David Hilbert",
    "f315e7": "A matemática não conhece raças ou fronteiras geográficas. -David Hilbert",
    "f3160": "A matemática é o juiz supremo; de suas decisões não há recurso. -Tobias Dantzig",
    "f3161": "Em matemática, a arte de propor uma questão deve ser considerada de maior valor do que resolvê-la. -Georg Cantor",
    "f3162": "A matemática é um lugar onde você pode fazer coisas que não pode fazer no mundo real. -Marcus du Sautoy",
    "f3163": "O avanço e o aperfeiçoamento da matemática estão intimamente ligados à prosperidade do estado. -Napoleão Bonaparte",
    "f3164": "A essência da matemática reside na sua liberdade. -Georg Cantor",
    "f3165": "A matemática é a ciência do que é claro por si só. -Carl Jacobi",
    "f3166": "A matemática, vista corretamente, possui não apenas a verdade, mas também a beleza suprema. -Bertrand Russel",
    "f3167": "A matemática é a ferramenta especialmente adequada para lidar com conceitos abstratos de qualquer tipo. -P. Dirac",
    "f3168": "A matemática revela os seus segredos apenas a quem a aborda com puro amor, pela sua própria beleza. -Arquimedes",
    "f3169": "A matemática é a criação mais bela e poderosa do espírito humano. -Stefan Banach",
    "f3170": "O matemático não estuda matemática pura porque é útil; ele estuda porque se deleita com isso e se deleita porque é lindo. -Henri Poincaré",
    "f3171": "O estudo da matemática, como o Nilo, começa na minúcia, mas termina na magnificência. -Charles Caleb Colton",
    "f318e4": "A biologia é a tecnologia mais poderosa já criada. DNA é software, proteínas são hardware, células são fábricas. -Arvind Gupta",
    "f31d71": "A física é, esperançosamente, simples. Os físicos não são. -Edward Teller",
    "f31d75": "A física nada mais é do que uma busca pela simplicidade máxima, mas até agora tudo o que temos é uma espécie de bagunça elegante. -Bill Bryson",
    "f31e53": "A matemática é a rainha das ciências. -Carl Friedrich Gauss",
    "f31q52": "A matemática pura é, à sua maneira, a poesia das ideias lógicas. -Albert Einstein",
    "f31q54": "O livro da natureza está escrito na linguagem da matemática. -Galileu Galilei",
    "f31q56": "A matemática é a música da razão. -James Joseph Sylvester",
    "f31q58": "A matemática não trata de números, equações, cálculos ou algoritmos: trata-se de compreensão. -William Paul Thurston",
    "f31q70": "Biologia é a ciência. A evolução é o conceito que torna a biologia única. -Jared Diamante",
    "f31q72": "A biologia é a poesia do mundo físico e a biologia humana é a poesia do nosso universo. -Julian Casablancas",
    "f31q74": "A biologia é apenas a física que começou a cheirar mal. -Nigel Calder",
    "f31q81": "A física é a ciência dos movimentos e ações dos corpos físicos concebidos em termos de causa e efeito. -Arthur Compton",
    "f31qe82": "Biologia é um processo de software. Nossos corpos são compostos de trilhões de células, cada uma governada por esse processo. Você e eu andamos por aí com softwares desatualizados rodando em nossos corpos, que evoluíram em uma era muito diferente. -Ray Kurzweil",
    "f31r83": "A física está se tornando muito difícil para os físicos. -David Hilbert",
    "f31sq66": "A biologia é realmente química, a química é realmente física, a física é realmente matemática. -Matt Ridley",
    "f31x76": "Biologia é o estudo das coisas complexas do Universo. A física é o estudo dos simples. -Richard dawkins",
    "f31x77": "A física é experiência, organizada em ordem econômica. -Ernst Mach",
    "f3d169": "A física é a única ciência real. O resto são apenas colecionadores de selos. -Ernest Rutherford",
    "f3d179": "A física está se tornando tão incrivelmente complexa que leva cada vez mais tempo para treinar um físico. Na verdade, está demorando tanto para treinar um físico até o ponto em que ele entenda a natureza dos problemas físicos que ele já está velho demais para resolvê-los. -Eugene Wigner",
    "f3d180": "A biologia é a ciência da vida, mas muitos de nós não entendemos os fundamentos do nosso próprio corpo. -Kathy Reichs",
    "f3e155": "A matemática é a porta e a chave das ciências. -Roger Bacon",
    "f3q178": "Biologia não é destino. Nunca foi mais do que uma tendência. Foi apenas a primeira maneira rápida e suja da natureza de calcular a carne. Chips são destino. -Bart Kosko",
    "f3sd162": "Biologia é o estudo de coisas complicadas que parecem ter sido projetadas com um propósito. -Richard dawkins",
    "f3sd164": "A biologia lhe dá um cérebro. A vida transforma isso em uma mente. -Jeffrey Eugenides",
    "f3sd165": "Na física, você não precisa sair por aí criando problemas para si mesmo - a natureza faz isso por você. -Frank Wilczek",
    "f3sq167": "O bom da ciência é que ela é verdade, quer você acredite nela ou não. -Neil de Grasse Tyson",
    "f3ttw8": "maori",
    "f477b": "A programação é a arte do design de algoritmos e a arte de depurar códigos errôneos. –Ellen Ullman",
    "f5bLC": "Documentação",
    "f7akol": "Inglês",
    "f7cf7": "Na verdade, existem duas coisas: ciência e opinião; o primeiro gera conhecimento, o segundo, ignorância. – Hipócrates",
    "f814a": "Quando escrevi este código, somente Deus e eu entendemos o que fiz. Agora só Deus notools. – Anônimo",
    "f96ff": "A inovação é o motor do progresso e do sucesso nos negócios. -Satya Nadella",
    "fBP5h": "Nome de usuário",
    "fEr5j": "Criar novo script",
    "fV_1P": "Entrar",
    "fa94e": "A inovação é a chave para permanecer à frente na corrida competitiva. -Paul Sloane",
    "fc805": "Inovação é criatividade com uma tarefa a cumprir. –Tom Peters.",
    "fd3173": "Física é imaginação em camisa de força. -John Moffat",
    "fdd2b": "Ciência é conhecimento organizado. Sabedoria é vida organizada. – Emanuel Kant",
    "fdxluz": "romena",
    "ff02c": "Cancelado",
    "fgj880": "Telugu",
    "forever-foss": "Para sempre FOSS!",
    "fqV_1P": "Desbloqueie seu LafTools",
    "g2_aX": "Copie a senha criptografada para o arquivo",
    "g5SK9": "Aberto recentemente",
    "gDjbs": "Data histórica",
    "gK3dNQ": "cópia de",
    "gQhfS": "Ferramentas de arquivo",
    "gTOv6abWT": "Conecte-se",
    "gTOv6adbWT": "Registro",
    "gU1O2": "Acionado",
    "geHXwByxy": "Configurações",
    "generic-NI-UFPTe0": "Embelezar código genérico",
    "generic-code-beautify.desc.2b3c": "Esta operação formata o código em várias linguagens de programação para melhorar a legibilidade, aplicando recuo consistente, quebras de linha e aderindo às diretrizes de estilo específicas da linguagem.",
    "giveas3tar": "Dê-nos uma estrela no GitHub se você gosta do LafTools.",
    "gkC8t": "Base64",
    "gkdqqC8t": "Base45",
    "gkqC8t": "Base32",
    "gmK3pKyRI": "{0} Pico de contagem on-line",
    "gms7_9n5v": "Converte uma string de bytes hexadecimais de volta em seu valor bruto.",
    "gnKMZ": "Atualizado.",
    "groupnote": "Memorando",
    "h6AeI": "Conexão Websocket fechada às {0}",
    "hJUMN": "Idioma alvo",
    "hMvh1": "Banco de dados de backup",
    "hRFxV": "Para mais informações, visite nosso site",
    "hX1CWGAhl": "Recua e embeleza o código XML (eXtensible Markup Language).",
    "hcnt1k": "Macedônio",
    "hhOT3": "Procura por nome",
    "htTmvWjsS": "Compacta o código Cascading Style Sheets (CSS).",
    "htt1d2": "esperanto",
    "hu-iz": "Cronômetro",
    "huE6U": "Variável",
    "hyV-d": "Feito",
    "hyirc0": "sueco",
    "i27qmr": "Frísio",
    "i6hMN": "Código de verificação de imagem",
    "i88tb": "Exportar resultado para arquivo",
    "i8q8tb": "Configurar WorkFlow para entrada",
    "iNQvo": "Mostre um exemplo para começar.",
    "iNqF1T": "Gerenciar conta na nuvem",
    "iOEjZ": "Nenhum código disponível",
    "iQL2c": "Ainda estamos explorando toda a gama de funções deste botão. Se você tiver algum comentário ou sugestão sobre como podemos melhorá-lo, informe-nos!",
    "iZXig7E2JF": "LafTools oferece um conjunto abrangente de utilitários de desenvolvimento, incluindo codecs, formatadores, ferramentas de processamento de imagens e soluções de gerenciamento de recursos de computador. Projetado para agilizar e aprimorar seu fluxo de trabalho de desenvolvimento, o LafTools é o recurso ideal para desenvolvimento de software eficiente e de alta qualidade.",
    "i_lang_": "Pacotes de idiomas",
    "ib135dq": "Sua mensagem de status será exibida aqui",
    "iknTS": "Gerenciador de senhas",
    "init_env": "Carregando recursos do sistema",
    "ip2g1": "Copiado",
    "ipOSQE": "Edição Pró",
    "it8ths": "indonésio",
    "ixyP0": "Processando a ação em tempo real automaticamente",
    "jJuNz": "Idioma de origem",
    "jO5eP": "OK",
    "jPNCb": "Tentei novamente.",
    "jQXdi": "Modo claro",
    "jR1zX": "Laboratório de IA",
    "jRFk519Bj-": "Esta comunidade é impulsionada por um projeto de código-fonte aberto totalmente internacional e gratuito.",
    "jaj7M": "Todos os direitos reservados.",
    "jb392": "Nome",
    "jfpqt": "Navegador de Notas",
    "jgDoEq": "Sem dados de perguntas frequentes",
    "jhDoE": "Recuperando dados de perguntas frequentes",
    "jlxvpk": "coreano",
    "jr_7Y98yZ": "LafFerramentas",
    "json-beautify.desc.0912": "Esta operação formata dados JSON para melhorar a legibilidade adicionando recuo adequado, quebras de linha e chaves de classificação de forma consistente.",
    "json-beautify.name.0912": "Formatar SQL",
    "json-beautify.text.93kq": "Embelezar dados JSON",
    "k17PG": "Conexão Websocket fechada.",
    "k2SVY": "desligado",
    "k2ku5p": "Tcheco",
    "k41a5": "LafFerramentas",
    "k4s5rx": "esloveno",
    "kLH79": "E-mail",
    "kOi5A": "Imprimir página",
    "kPD22": "Dicionário",
    "kPJ-A4": "Atualizar",
    "kcHxr": "Forneça o nome de usuário da conta de administrador aqui",
    "kjks1": "Recuperando a configuração do i18n da API do servidor local",
    "kqv5ht": "iídiche",
    "krxSK": "Assistente de IA",
    "ks12d": "Cíber segurança",
    "kv4wag": "Holandês",
    "ky6JphiKk": "{0} Usuários on-line",
    "l3akoa": "amárico",
    "l6Djb": "Selecione uma das opções como tema preferido:",
    "lDXWMq43S": "Calendário de hoje",
    "lIn3_": "Nome de usuário do administrador",
    "lQFII": "Reacione a inicialização",
    "lRHDQ": "Sair do modo de tela inteira",
    "lUh5c": "Gerador",
    "lWqYc": "Este site fornece ferramentas JSON, incluindo JSON para XML, JSON para CSV, JSON para YAML.",
    "lastreplyby": "Última resposta de",
    "lkuulh": "Francês",
    "lp0qmd0": "Marcar como favorito",
    "lpKAz": "Configurações",
    "lpzg83": "samoano",
    "lzGS2": "Detalhe da extensão",
    "m0106": "Conversor",
    "m0107": "Gerador",
    "m0108": "Formatador",
    "m7WZw": "Websocket do sistema quebrado",
    "m8rTc1": "Depois que o gerenciador de scripts shell for implementado, você poderá usá-lo para gerenciar seus comandos shell.",
    "mBgF1": "Ação do mouse",
    "mSFei": "Código-fonte no GitHub",
    "mWXeh": "ID do espaço de trabalho: {0}",
    "mabHq": "Encontre arquivos antigos",
    "mbzCv": "Ocorreu um erro: {0}, o tempo rejeitado é {1}",
    "md2.desc.1039": "Esta operação faz o hash dos dados em um hash {0}.",
    "md2.text.192d3": "Gerar {0} hash",
    "md2aO2NaJITm": "Recua e embeleza o código Cascading Style Sheets (CSS), facilitando a leitura e a compreensão.",
    "md4.desc.1039": "Esta operação faz o hash dos dados em um hash {0}.",
    "md4.text.192d3": "Gerar {0} hash",
    "md5.desc.rxsHq": "Esta operação faz o hash dos dados em um hash {0}.",
    "md5.textiDjMIo": "Gerar {0} hash",
    "md6.desc.1039": "Esta operação faz o hash dos dados em um hash {0}.",
    "md6.text.192d3": "Gerar {0} hash",
    "meeMC1Uk7.text.93kq": "Minimizar {0}",
    "mhWk4dtid": "Codificação",
    "mihc3": "Concluiu esta operação",
    "mjHoR": "Além disso, tecnicamente, ninguém pode ler este token, caso contrário, ele atacará e controlará seu computador.",
    "mnb19i": "Alemão",
    "mslw4o": "grego",
    "mwn7iv": "zulu",
    "myxedr": "mongol",
    "n1jA9": "confirme",
    "n24tes": "Português (Brasil)",
    "n28g4di0L": "Manuais",
    "n94an4": "polonês",
    "n98EW": "Troque o texto da região de entrada e da região de saída.",
    "nIDKbSXTw": "{0} Usuários",
    "nSeIq8-": "Mais importante ainda, é gratuito e de código aberto. Você pode usá-lo para fins pessoais ou comerciais.",
    "nTvw4": "Para proteger e salvar separadamente seus dados e configurações, você pode usar sua conta local para fazer isso. Além disso, o LafTools oferecerá suporte a widgets de mensagens instantâneas entre os usuários no futuro.",
    "nh1W-": "Os testes só podem provar a presença de bugs, não a sua ausência - Edsger Dijkstra",
    "nmb1wx": "Iorubá",
    "nncQE": "Vida",
    "nodBw": "Esta operação codifica dados brutos em uma sequência ASCII {0}.",
    "nrix6l": "Chichewa",
    "nxJC7": "A ação padrão a ser executada quando o transformador for executado.",
    "o1umzi": "Francês",
    "o52xW": "Exportar",
    "o8xyzu": "Luxemburguês",
    "oBz8D": "Carregando",
    "oNLxH": "Nome de usuário",
    "oNg3f": "Website oficial",
    "ocxsw3": "irlandês",
    "of_ox": "Resumindo, LafTools é uma solução completa para todas as suas necessidades.",
    "oj23X": "Restaurar banco de dados",
    "ojCWEFdVe": "Compacta o código JavaScript, removendo todos os caracteres desnecessários.",
    "ooiFU": "Reinicie o serviço Java",
    "oqHqVq": "Ordenar por",
    "oqHqqV": "Total: {0} comandos",
    "oqHqqVq": "Tempos de cópia",
    "oqjbcj": "Laos",
    "os8h6u": "dinamarquês",
    "p8Exxc1s": "Existem várias ferramentas que aproveitam as tecnologias de IA para executar tarefas com mais eficiência no Laboratório de IA.",
    "pANmj": "As tags podem ser definidas com base nos tipos de servidor, uso de scripts ou qualquer outro critério de sua preferência.",
    "pA_deJ": "Exportar para a área de transferência",
    "pA_feeJ": "Reconectar Terminal",
    "pA_qweJ": "Limpar buffer",
    "pDBSWq": "nenhum conteúdo disponível para o painel direito",
    "pEk1kk": "LafTools apresenta funcionalidades úteis para você aqui.",
    "pEk1qkk": "Liste todas as guias abertas",
    "pHZDB": "Ação em tempo real",
    "pJoOz": "Abrir arquivo",
    "pKHRT": "Vá para Ferramentas",
    "pKqHRq": "Notas de pesquisa",
    "pL6qH": "Concluído.",
    "pNwe3": "Outro",
    "pZ4d616m-": "Embelezar {0}",
    "ph5jH": "Lidando com esta parte",
    "piih4x": "tadjique",
    "pmAee": "Leia mais informações sobre esta ferramenta.",
    "pmnp4b": "ucraniano",
    "ppmz8e": "crioulo haitiano",
    "pqs7y3": "Considere registrar esta página da web como um PWA para ter suporte completo ao mapa de teclado.",
    "psA_eJ": "Exportar como arquivo",
    "psZoP": "Solte os arquivos aqui para processá-los",
    "psqqpq_o": "Ok, o resultado foi copiado para sua área de transferência {0} vezes.",
    "pzn2IpkDo": "Recuos e impressões bonitas do código JavaScript Object Notation (JSON).<br><br>Tags: visualizador json, embelezamento, realce de sintaxe",
    "q0zA1kML_": "Caixa de ferramentas on-line",
    "q12beqwR": "Nenhuma ferramenta disponível",
    "q29t31": "polonês",
    "q3VjkLMsP": "Amizade, intercâmbio, cooperação e desenvolvimento",
    "q6K7o": "Carregar das notas",
    "q9iuti": "galês",
    "qDrbEr": "O nome de usuário que você forneceu está vazio. Verifique e tente novamente.",
    "qF4uS2": "Criar espaço de trabalho",
    "qF4uS23": "Nova janela",
    "qHoktx": "Obrigado!",
    "qN1LdZ2": "Última modificação",
    "qQmBr": "Tradução do texto",
    "qTqyvWdY": "Ainda não está terminado",
    "qWemXE4": "1º de janeiro de 2024",
    "qWw3eTH": "Esta parte ajuda a manter os arquivos em seu disco local ou disco na nuvem.",
    "qdeFXx": "Atualmente, esta página que você procura ainda não está totalmente implementada.",
    "qpDBSW": "nenhum painel disponível",
    "qpDBSWe1": "nenhum painel disponível",
    "qqK_x_": "Entrar",
    "qqqwYoz": "Ajuda",
    "qqwYoz": "Guias",
    "qqwYqwe": "Espaços de trabalho",
    "qtpmvP": "Confirme a senha local",
    "quality-first": "Qualidade em primeiro lugar",
    "qubSJ": "Extensão VM não é ID. (REF: IQnMH).",
    "qzshys": "urdu",
    "r1GLS": "Tag",
    "rE6fUsSGl": "Recua e embeleza o código SQL (Structured Query Language).",
    "rK6cx": "{0}, projetado e desenvolvido pela equipe LafTools",
    "rQkas": "Bem-vindo ao LafTools",
    "rR1vd": "Entrada do arquivo",
    "rT34qnO": "Insira o texto para processamento. O resultado será exibido no editor de saída.",
    "rVqlu": "Decodificar {0}",
    "rYSpwq": "O algoritmo MD2 (Message-Digest 2) é uma função hash criptográfica desenvolvida por Ronald Rivest em 1989. O algoritmo é otimizado para computadores de 8 bits. Embora o MD2 não seja mais considerado seguro, mesmo a partir de 2014, ele permanece em uso em público infraestruturas principais como parte de certificados gerados com MD2 e RSA. O algoritmo de resumo da mensagem consiste, por padrão, em 18 rodadas.",
    "r_n6h": "Modo claro ou escuro",
    "rf0mql3": "Tema claro ou escuro",
    "rpG0G": "Valorizamos seu feedback e adoraríamos ouvir sua opinião sobre como podemos melhorar nosso produto - não hesite em compartilhar seus comentários conosco!",
    "rub76Z8zx": "Tentativas de imprimir linguagens de estilo C, como C, C++, C#, Java, PHP, JavaScript etc. Isso não fará um trabalho perfeito e o código resultante pode não funcionar mais. Esta operação foi projetada exclusivamente para tornar o código ofuscado ou reduzido mais fácil de ler e entender. Coisas que não funcionarão corretamente: Para formatação de loop, formatação de loop Do-While, recuo Switch/Case, certos operadores de deslocamento de bits",
    "run_text": "Antes de entrar em seu ambiente de trabalho, gostaríamos de pré-carregar os recursos necessários do sistema primeiro. Aguarde um pouco, em breve será concluído, cujos detalhes podem ser visualizados abaixo.",
    "rycJy": "LafTools é uma caixa de ferramentas versátil projetada especificamente para programadores. Ele representa a segunda versão do CodeGen Toolbox, agora com um runtime mais leve escrito em Golang e JavaScript.",
    "ryhkqb": "búlgaro",
    "rzoFmjStq": "Ferramentas relevantes",
    "s-fxP80Dd": "IDE LafTools",
    "s0vrf9": "hebraico",
    "s4OeX": "Faça login no sistema com sucesso",
    "sHoxxW": "História",
    "sO0MOe": "Cada vez que você ficar em uma janela por mais de 5 segundos, ela será mostrada aqui.",
    "sR8yc": "Fechar",
    "sc49my": "Sindi",
    "sdf3160": "A tarefa dos teóricos, especialmente na biologia, é sugerir novos experimentos. Uma boa teoria não faz apenas previsões, mas previsões surpreendentes que depois se revelam verdadeiras. -Francisco Crick",
    "sdfk1": "Rolar as guias para a esquerda",
    "sdfk13": "Rolar as guias para a direita",
    "sglMS": "Criar tempo",
    "share-this-page": "Compartilhe esta página",
    "sk123": "Ainda não acabado",
    "slqcWD": "Esta parte lógica ainda não é suportada, fique atento.",
    "sojBI": "Conversão",
    "spCqEa": "PENDÊNCIA",
    "spdh98": "Chinês simplificado",
    "ssDaOq": "Novo no LafTools?",
    "ssm80i": "Basco",
    "str.codecs": "Codecs",
    "str.converters": "Conversores",
    "str.formatter": "Formatadores",
    "str.login": "Conecte-se",
    "str.mostused": "Mais usado",
    "str.parsers": "Analisadores",
    "str.register": "Registro",
    "str.remarks": "Favoritos",
    "str.usercentre": "Central do usuário",
    "svqh06": "Azerbaijano",
    "sys_updates": "Últimas atualizações do sistema",
    "t63Qw": "Liberar",
    "t6wczq": "Xhosa",
    "t84q1z": "Armênio",
    "t8DUz20a-": "Formatador JSON",
    "t8c6xc": "somali",
    "tBIX-d": "janelas",
    "tEiv_": "Recuperando detalhes da extensão",
    "tIy3Q": "Encontrou um erro",
    "tIyq3Q": "Encontrou um erro",
    "tWe1yF": "Nenhum comando shell disponível.",
    "tY3p1": "Mais Informações",
    "tiaiB": "Cancelar",
    "title-laftools": "LafTools – A caixa de ferramentas multifuncional líder para programadores",
    "tn7duf": "croata",
    "try.laftools.ide": "Experimente o IDE LafTools",
    "ttAre": "Insira sua senha em texto simples aqui",
    "twamg": "Assistente de IA, capacitando sua criatividade",
    "tyhgpr": "Javanês",
    "uCEe8": "Conversão em tempo real",
    "uFcDQ": "Inicializando os dados de status...",
    "uV5Bi": "Não foi possível carregar a extensão",
    "uVseB": "Pressione {0} para mostrar a lista de teclas de atalho",
    "ucDLv": "Você copiou este registro {0} vezes",
    "ui5pZ": "Analisador de comando",
    "ulah0q": "japonês",
    "unc9E": "Texto aleatório",
    "usr_defined": "Preferências do Sistema",
    "uwqGE": "Vá para Ferramentas",
    "v7q3db": "tailandês",
    "vOjNC": "Digite a senha ou chave segura",
    "vTsQU": "Forneça o código de convite do seu administrador",
    "vU17B": "Não foi possível enviar a solicitação",
    "vWqac": "Antes de entrar em seu ambiente de trabalho, gostaríamos de pré-carregar os recursos necessários do sistema primeiro. Aguarde um pouco, em breve será concluído, cujos detalhes podem ser visualizados abaixo.",
    "vaP0vq": "Configure a senha local com sucesso.",
    "vci8rd": "Holandês",
    "vh9j4": "Entrada",
    "vo1prl": "Espanhol",
    "vr93oi": "finlandês",
    "vrfjnf": "italiano",
    "w6otqn": "Córsega",
    "w92j07": "russo",
    "w9qudj": "punjabi",
    "wAxtg": "Inicialmente, geramos um UUID como token autorizado para você fazer esta configuração. Pelo que o LafTools recebeu, o token que você forneceu é {0}, foi verificado pelo LafTools com sucesso e consequentemente você pode continuar a configurar este formulário.",
    "wI1eh": "Próximo",
    "wQYoz": "Arquivo",
    "wQdYoz": "Editar",
    "wQdqwYoz": "Visualizar",
    "wcl1K": "Uso",
    "wgkk6y": "maltês",
    "wi28h5_S2": "Codecs",
    "wj3VS": "Esta operação decodifica dados de uma string ASCII {0} de volta ao seu formato bruto.",
    "wsWcXd": "Notificações",
    "x009": "Para acessar nossa documentação de uso",
    "x5alzu": "Curdo (Kurmanji)",
    "x5tHV": "Visão geral do sistema",
    "xMBv0": "Carregando recursos relacionados...",
    "xOJqG1": "perguntas frequentes",
    "xPHqP": "A descrição ainda não está definida.",
    "xQ_ls": "Redis de backup",
    "xbz0B": "Fechar todas as guias",
    "xbz0B2": "Aba fechada",
    "xdqwe": "Bem-vindo ao uso do LafTools!",
    "xeP4zV": "Visualize rapidamente seus itens TODO",
    "xeP4zVd": "Procure rapidamente um vocabulário em inglês.",
    "xhxY6iLDH": "Sair",
    "xlqtA": "Opinião",
    "xml-bdeautify.desc.2a5f9": "Minimize o código XML",
    "xml-beautify.desc.2a5f9": "Esta operação formata dados XML para melhorar a legibilidade, adicionando recuo adequado, quebras de linha e garantindo uma estrutura bem formada.",
    "xs22XLF": "Não há dados disponíveis para este ID de item. Considere selecionar outros itens.",
    "y3qjdd": "Sua senha local foi verificada com sucesso.",
    "y8Ir5": "Esta parte é usada para inicializar sua conta de administrador, porém, por enquanto, não há nada que precise ser criado ou ajustado aqui, pois foi previamente configurado pelo seu administrador, negligencie esta parte e prossiga com as etapas restantes.",
    "yCsTC": "Otimização prematura é a raiz de todo o mal.",
    "yMZW-GEgf": "Formatar XML",
    "ySVf-": "Tente novamente esta solicitação",
    "yTsqFO": "O algoritmo MD4 (Message-Digest 4) é uma função hash criptográfica desenvolvida por Ronald Rivest em 1990. O comprimento do resumo é de 128 bits. O algoritmo influenciou projetos posteriores, como os algoritmos MD5, SHA-1 e RIPEMD. A segurança do MD4 foi gravemente comprometida.",
    "yVprb": "Esta parte ainda está em desenvolvimento.",
    "y_2Q1": "Codificar e decodificar",
    "y_2Q2": "Criptografia simétrica",
    "y_2Q3": "Criptografia assimétrica",
    "y_2Q4": "Algoritmos Nacionais da China",
    "y_2Q5": "Autenticação da Web",
    "y_2Q5dqw": "Correspondente de texto",
    "y_9YM": "A saída será exibida aqui.",
    "y_9YqM": "Carregando recursos estáticos...",
    "y_BN6": "Algoritmo de resumo",
    "ya0cwu": "malaio",
    "yc7dqiu": "Chinês simplificado",
    "yfYeg": "Modelo de texto",
    "yiRso": "Notas na nuvem",
    "ykganl": "dinamarquês",
    "ymyfghy1r": "Notas",
    "yqiRso": "Notas locais",
    "yqrxl4": "sérvio",
    "yznU9": "Dados de árvore vazios",
    "z-o28we": "Painel de Processo",
    "z0j2nf": "hindi",
    "z1oFn": "Fugir e Desescape",
    "z2jzej": "Marathi",
    "z79b1a": "árabe",
    "zN2ES": "Espaços de trabalho",
    "zaSKh": "Atualizar",
    "zc3Hf": "Senha",
    "zjDJk": "Forneça o caminho do diretório do espaço de trabalho",
    "zkqUFa": "{0} ainda não está configurado",
    "zkv375": "Khmer",
    "zmDWx": "Contate-nos",
    "znVRwq": "arquivos",
    "zpyd34": "Inglês",
    "zqiIoqXw": "Executando cálculos...",
    "zwd4v": "Detalhe da extensão",
    "zwgYx": "O valor da senha criptografada será exibido aqui.",
    "zzcepr": "Cebuano"
}