{
    "-dxG-aEe4w": "O número máximo de códigos de verificação SMS enviados hoje foi atingido.",
    "-wHWkv2OC": "Por que não consigo fazer login?",
    "-wdkeq": "Esta comunidade não tem fins lucrativos?",
    "2RbUh6TyJ": "{0} Notificações não lidas",
    "3I-dkqkwr": "Observe que NÃO oferecemos nenhum curso comercial de treinamento para exames de inglês ou quaisquer outros exames de disciplinas neste site, e não planejamos fazê-lo no futuro.",
    "43be5": "Diário",
    "4N79HNWiA": "Para garantir que seja uma comunidade sem fins lucrativos, também abrimos todo o seu código-fonte no GitHub, que pode ser encontrado no rodapé desta página.",
    "4sQWoTgfr": "O código de verificação expirou. Atualize a página e tente novamente",
    "4sdQWoTgfr": "O código de verificação expirou. Atualize a página e tente novamente.",
    "5pevqzFXX": "Se você também acha que é significativo se juntar a nós, continue atualizando seu perfil clicando no botão abaixo, obrigado!",
    "6h14B_t4I": "Inscreveu-se hoje",
    "7BtpddC": "Em segundo lugar, nesta comunidade, não falamos sobre política ou quaisquer outros tópicos delicados e, claro, não aceitamos spam ou publicidade. É por isso que exigimos um número de telefone válido para registro, para evitar atividades ilícitas ou impróprias.",
    "7flKa": "LafTools – O Onipotente para todos os Profissionais e Engenheiros",
    "7zqdufsdddJ": "Sim com certeza. O site ELB3.com é derivado do grupo de bate-papo sem fins lucrativos WeChat, {0}, que visa criar uma atmosfera de aprendizado de inglês amigável, livre de anúncios e confortável.",
    "8s1R5nChx": "O código de convite está vazio, esta comunidade não está aberta ao público, mas limitada a usuários convidados.",
    "8s1dX": "O código de convite não existe no sistema. Verifique se há algum problema com distinção entre maiúsculas e minúsculas.",
    "8sVG1RXhx": "a senha deve ter pelo menos 6 caracteres",
    "8sVG1RdXhx": "O ID do usuário já existe",
    "8sVG1kqXhx": "O ID do usuário deve ter pelo menos 2 caracteres",
    "8sVGdXhx": "O ID do usuário deve conter apenas letras e números",
    "8saIR-LCjyChx": "O código de convite expirou",
    "8saIt5r5nGxwwChx": "O código de convite foi usado",
    "9YPgsPid2M": "Código SMS",
    "9pBpiYcCy": "Para evitar spam e publicidade, exigimos um código de convite para registrar sua conta.",
    "BqWGnXEzV": "Cidade",
    "Bz_WdwvAPn": "Verifique se o CAPTCHA foi fornecido corretamente.",
    "C7jECCVt9": "Valorize o seu tempo e nunca, para sempre, faça algo ilegal nesta comunidade.",
    "CK5NCw519": "História da comunidade",
    "CQ44pYZYj": "Conecte-se",
    "CuHqw9m": "{0} não é um número de telefone válido. Atualmente o sistema aceita apenas números de telefone de 11 dígitos.",
    "Cz_qjjFw7": "Sobre {0}",
    "DYaOL4Yp7": "registro",
    "D_9sNBiZj": "Você tentou muitas vezes. Tente novamente mais tarde.",
    "F-D-AewqL": "Faça uma retrospectiva do que você fez recentemente. Não podemos tolerar qualquer comportamento que possa ser considerado como assédio, anúncios publicitários ou abuso pessoal, etc...",
    "GaySMPQHo": "Tendendo",
    "Gy45ssBPS": "Criar novo tópico",
    "H39ddc0df": "Tente fazer login mais tarde se falhar muitas vezes.",
    "HaU4NMabv": "O código de verificação está incorreto. Insira novamente ou atualize a imagem.",
    "IWPP6V-tR": "Código fonte",
    "IcvP2d-QY": "Por favor, {0} ou {1} para participar da discussão",
    "IugAFc4OT": "Ocorreu um problema ao enviar seus dados.",
    "Jf4iDTZ28": "Além disso, com certeza, tenha certeza de que nunca venderemos seu número de telefone ou o tornaremos público.",
    "Jfr4RzEZG": "Atualmente, aceitamos apenas {0} número de telefone para registrar sua conta.",
    "JuZAli3": "Guia do usuário",
    "K2UEY4ddl": "O ID do usuário contém palavras inválidas. Evite usar {0}",
    "KAiEq6dcwL5": "Por último, como lembrete amigável, cada usuário deve assumir a responsabilidade por suas próprias palavras e ações.",
    "MnVg5i": "Olá prazer em conhecê-lo! É um prazer convidá-lo para esta comunidade.",
    "MnVqwid": "Olá, {0}. Prazer em conhecê-lo! É um prazer convidá-lo para esta comunidade.",
    "NdqZcRL2QN": "Caso você tenha esquecido sua senha, você pode redefini-la clicando no link ‘Esqueci minha senha’.",
    "OBjaZqTvx": "Lar",
    "OPevedpOM": "E se eu não tiver um número de telefone?",
    "P1zxX2IQ5": "Mas para este site, é uma derivação do grupo original e não se limita ao aprendizado de inglês, mas também a outros temas.",
    "Pu0pj23rR": "Por que o número de telefone é obrigatório?",
    "RYlJHHwg3": "O código SMS não está correto.",
    "RjdigcxfV": "Contate-nos",
    "TV09-obNr": "Marco",
    "TXdh_K": "Senha",
    "TdXddh_wK": "Número de telefone",
    "Te3h_wK": "Número de telefone",
    "TqXdd3h_wK": "Número de telefone",
    "TqXddh_K": "Código de verificação",
    "TqXdh_K": "Confirme sua senha",
    "UED59zbd-": "LafFerramentas",
    "UjkOS50wO": "Lar",
    "VndKeCfb-": "Verifique o telefone para ativar a conta",
    "VnddCfb-": "Você está banido por um tempo",
    "W3M4ivK9U": "Atualizar perfil",
    "WKG7e": "Regras",
    "Wpdsp3g5U": "Bem-vindo à comunidade {0}!",
    "XIzgAAR": "Normalmente, um código de convite disponível pode ser fornecido pelo webmaster ou por outros usuários.",
    "Xddh_wK": "Código de Convite",
    "Y-svpKvUz": "duas senhas não coincidem",
    "Y0drdCSiu": "Tópicos",
    "Yc5uMym": "Você pode estar se perguntando o que significa ELB3, em resumo, é a abreviatura de grupo WeChat sem fins lucrativos {0}, que é uma plataforma interessante para entusiastas e examinandos de inglês aprenderem e apreciarem o inglês!",
    "ZCzH8": "O mais novo",
    "ZaS8MP8cr": "Observação: o código de verificação foi atualizado. Ajuste os valores do formulário e insira o código novamente para continuar.",
    "aISK9iYc_": "Relatório de informações ilegais",
    "aUdtds_qwY": "Normalmente, você pode entrar com seu ID de usuário ou número de telefone com sucesso, mesmo se tiver violado as regras desta comunidade.",
    "b7wgrhuXl": "Tecnologia",
    "b_vts": "Entrar",
    "dHWho": "Inscrever-se",
    "dldeoeqwc": "Lembretes amigáveis",
    "dnsz7fwNx": "O ID do usuário diferencia maiúsculas de minúsculas.",
    "dsdfqw": "Usuário não existe",
    "dwJucRtar": "Esta parte ainda está em andamento, bem-vindo para contribuir com o projeto desta parte.",
    "dzIC7qPQ": "Se você quiser se juntar a nós, tente entrar em contato com o webmaster por e-mail {0} ou conta WeChat {1} para obter um código de convite.",
    "englishcorner": "Inglês",
    "eqwee": "A senha não está correta",
    "fcGTPc7HP": "Onde posso obter o código de convite?",
    "gTOv6abWT": "Conecte-se",
    "gTOv6adbWT": "Registro",
    "geHXwByxy": "Configurações",
    "gmK3pKyRI": "{0} Pico de contagem on-line",
    "groupnote": "Memorando",
    "hxCMxpW6Sq": "Inscreveu-se há {0} dias",
    "jRFk519Bj-": "Esta comunidade é impulsionada por um projeto de código-fonte aberto totalmente internacional e gratuito.",
    "jdbef_PBl": "Meta",
    "ky6JphiKk": "{0} Usuários on-line",
    "lEDpJMRfG": "Se você estiver confuso, sinta-se à vontade para nos informar enviando um e-mail para nós.",
    "lWqYc": "Este site fornece ferramentas JSON, incluindo JSON para XML, JSON para CSV, JSON para YAML.",
    "lastreplyby": "Última resposta de",
    "lidydVO": "Por que estou bloqueado ou limitado?",
    "lu2T6idPY": "Se você acha que há um problema com sua conta, entre em contato com o webmaster.",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "{0} Usuários",
    "nncQE": "Vida",
    "o4GdNzX6xS": "Em primeiro lugar, devido aos requisitos regulamentares bem conhecidos na Terra, cada utilizador é obrigado a fornecer um número de telefone válido para se registar.",
    "oHQNQ4mRw": "ID do usuário",
    "p1Jyl4uMv": "Saia da sua conta",
    "pNwe3": "Outro",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "Selecione o idioma do site",
    "uefFV1": "Mais tarde",
    "ufSPh0ad": "Se for impossível registrar sua conta por meio de seu número de telefone atual, entre em contato com o webmaster por e-mail {0} ou conta WeChat {1}. Podemos ajudá-lo a registrar sua conta manualmente.",
    "wCcPJZK": "{0} não é um e-mail válido",
    "wCctGPJZK": "{0} não deve estar vazio",
    "xhxY6iLDH": "Sair",
    "yOdwRB": "Bem-vindo à comunidade ELB3!",
    "zr3ZBdUoT": "Guia do usuário",
    "zuxd0y-kmA": "ID de usuário ou número de telefone não possui espaços em branco."
}