{
    "-dxG-aEe4w": "Достигнуто максимальное количество отправленных сегодня кодов подтверждения по SMS.",
    "-wHWkv2OC": "Почему я не могу войти?",
    "-wdkeq": "Это сообщество некоммерческое?",
    "2RbUh6TyJ": "{0} Непрочитанные уведомления",
    "2S_7EVIsK": "JSON-валидатор",
    "3I-dkqkwr": "Обратите внимание, что мы НЕ предоставляем никаких коммерческих курсов подготовки к экзаменам по английскому языку или экзаменам по другим предметам на этом веб-сайте и не планируем делать это в будущем.",
    "43be5": "Дневник",
    "4N79HNWiA": "Чтобы убедиться, что это некоммерческое сообщество, мы также открываем весь исходный код на GitHub, который можно найти в нижнем колонтитуле этой страницы.",
    "4sQWoTgfr": "Срок действия кода подтверждения истек. Обновите страницу и повторите попытку.",
    "4sdQWoTgfr": "Срок действия кода подтверждения истек. Обновите страницу и повторите попытку.",
    "5pevqzFXX": "Если вы также считаете, что для вас имеет смысл присоединиться к нам, продолжайте обновлять свой профиль, нажав кнопку ниже, спасибо!",
    "6h14B_t4I": "Присоединился сегодня",
    "7BtpddC": "Во-вторых, в этом сообществе мы не обсуждаем политику и другие деликатные темы и, конечно же, не приветствуем спам и рекламу. Вот почему для регистрации нам требуется действующий номер телефона, чтобы предотвратить любые незаконные или ненадлежащие действия.",
    "7flKa": "LafTools – Всемогущий для всех профессионалов и инженеров",
    "7fldKa": "LafTools — ведущий универсальный набор инструментов для программистов",
    "7zqdufsdddJ": "Да точно. Веб-сайт ELB3.com создан на основе некоммерческой чат-группы WeChat {0}, целью которой является создание дружественной, без рекламы и комфортной атмосферы изучения английского языка.",
    "8s1R5nChx": "Код приглашения пуст, это сообщество закрыто для публичного доступа, но ограничено приглашенными пользователями.",
    "8s1dX": "Код приглашения не существует в системе. Проверьте, не учитывается ли регистр.",
    "8sVG1RXhx": "пароль должен быть не менее 6 символов",
    "8sVG1RdXhx": "Идентификатор пользователя уже существует",
    "8sVG1kqXhx": "Идентификатор пользователя должен содержать не менее 2 символов.",
    "8sVGdXhx": "Идентификатор пользователя должен содержать только буквы и цифры.",
    "8saIR-LCjyChx": "Срок действия пригласительного кода истек",
    "8saIt5r5nGxwwChx": "Пригласительный код использован.",
    "9YPgsPid2M": "СМС-код",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Кодировщик Base64",
    "9b_7a0sdf": "Декодер Base64",
    "9pBpiYcCy": "Чтобы предотвратить спам и рекламу, нам требуется код приглашения для регистрации вашей учетной записи.",
    "BqWGnXEzV": "Город",
    "Bz_WdwvAPn": "Проверьте, правильно ли указана CAPTCHA.",
    "C7jECCVt9": "Цените свое время и никогда и никогда не делайте ничего противозаконного в этом сообществе.",
    "CK5NCw519": "История сообщества",
    "CQ44pYZYj": "авторизоваться",
    "CuHqw9m": "{0} не является действительным номером телефона. В настоящее время система принимает только 11-значный номер телефона.",
    "Cz_qjjFw7": "О {0}",
    "DYaOL4Yp7": "регистр",
    "D_9sNBiZj": "Вы пытались слишком много раз, повторите попытку позже.",
    "F-D-AewqL": "Сделайте ретроспективный обзор того, что вы сделали в последнее время. Мы не можем мириться с поведением, которое можно рассматривать как преследование, рекламу, личное насилие и т. д.",
    "GaySMPQHo": "Тенденции",
    "Gy45ssBPS": "Создать новую тему",
    "H39ddc0df": "Попробуйте войти позже, если неудачно было слишком много раз.",
    "HaU4NMabv": "Код подтверждения неверен. Введите повторно или обновите изображение.",
    "IWPP6V-tR": "Исходный код",
    "Ibzs2-Ho1": "CSV-инструменты",
    "IcvP2d-QY": "Пожалуйста, {0} или {1}, чтобы присоединиться к обсуждению.",
    "IugAFc4OT": "При отправке данных возникла проблема.",
    "Jbor69IBw": "Форматеры",
    "Jf4iDTZ28": "Кроме того, будьте уверены, мы никогда не выдадим ваш номер телефона и не обнародуем его.",
    "Jfr4RzEZG": "В настоящее время для регистрации вашей учетной записи мы принимаем только номер телефона {0}.",
    "JuZAli3": "Руководство пользователя",
    "K2UEY4ddl": "Идентификатор пользователя содержит недопустимые слова. Не используйте {0}.",
    "KAiEq6dcwL5": "И наконец, в качестве дружеского напоминания: каждый пользователь должен взять на себя ответственность за свои слова и действия.",
    "MnVg5i": "Привет! Рад тебя видеть! Мы рады пригласить вас в это сообщество.",
    "MnVqwid": "Здравствуйте, {0}. Рад встрече! Мы рады пригласить вас в это сообщество.",
    "NdqZcRL2QN": "Если вы забыли свой пароль, вы можете сбросить его, нажав ссылку «Забыли пароль».",
    "OBjaZqTvx": "Дом",
    "OPevedpOM": "Что делать, если у меня нет номера телефона?",
    "P1zxX2IQ5": "Но для этого веб-сайта это продолжение исходной группы и оно не ограничивается изучением английского языка, но и другими темами.",
    "Pu0pj23rR": "Зачем нужен номер телефона?",
    "RYlJHHwg3": "СМС-код неправильный.",
    "RjdigcxfV": "Связаться с нами",
    "TV09-obNr": "Веха",
    "TXdh_K": "Пароль",
    "TdXddh_wK": "Номер телефона",
    "Te3h_wK": "Номер телефона",
    "TqXdd3h_wK": "Номер телефона",
    "TqXddh_K": "Проверочный код",
    "TqXdh_K": "Подтвердите пароль",
    "UED59zbd-": "LafИнструменты",
    "UjkOS50wO": "Дом",
    "VndKeCfb-": "Подтвердите телефон для активации учетной записи",
    "VnddCfb-": "В настоящее время вы забанены на некоторое время",
    "W3M4ivK9U": "Обновить профиль",
    "WKG7e": "Правила",
    "Wpdsp3g5U": "Добро пожаловать в сообщество {0}!",
    "XIzgAAR": "Обычно доступный код приглашения может быть предоставлен веб-мастером или другими пользователями.",
    "Xddh_wK": "Код приглашения",
    "Y-svpKvUz": "два пароля не совпадают",
    "Y0drdCSiu": "Темы",
    "Yc5uMym": "Вы можете задаться вопросом, что означает ELB3. Короче говоря, это сокращение от некоммерческой группы WeChat {0}, которая представляет собой интересную платформу для любителей английского языка и экзаменуемых, позволяющую изучать и ценить английский язык!",
    "ZCzH8": "Новейший",
    "ZaS8MP8cr": "Примечание. Код подтверждения обновлен. Измените значения формы и повторно введите код, чтобы продолжить.",
    "aISK9iYc_": "Сообщение о незаконной информации",
    "aUdtds_qwY": "Обычно вы можете успешно войти в систему, используя свой идентификатор пользователя или номер телефона, даже если вы нарушили правила этого сообщества.",
    "b7wgrhuXl": "Технология",
    "b_vts": "Войти",
    "dHWho": "Зарегистрироваться",
    "dldeoeqwc": "Дружеские напоминания",
    "dnsz7fwNx": "Идентификатор пользователя чувствителен к регистру.",
    "dsdfqw": "Пользователь не существует",
    "dwJucRtar": "Эта часть все еще находится в разработке. Приглашаем вас внести свой вклад в проект этой части.",
    "dzIC7qPQ": "Если вы действительно хотите присоединиться к нам, попробуйте связаться с веб-мастером по электронной почте {0} или через аккаунт WeChat {1}, чтобы получить код приглашения.",
    "englishcorner": "Английский",
    "eqwee": "Пароль неверный",
    "fcGTPc7HP": "Где я могу получить код приглашения?",
    "gTOv6abWT": "Авторизоваться",
    "gTOv6adbWT": "регистр",
    "geHXwByxy": "Настройки",
    "gmK3pKyRI": "{0} Пиковое количество онлайн-игр",
    "groupnote": "Памятка",
    "hxCMxpW6Sq": "Присоединился {0} дня назад",
    "iZXig7E2JF": "LafTools предлагает полный набор утилит для разработки, включая кодеки, форматтеры, инструменты обработки изображений и решения для управления компьютерными ресурсами. LafTools, созданный для оптимизации и улучшения вашего рабочего процесса разработки, является вашим незаменимым ресурсом для эффективной и высококачественной разработки программного обеспечения.",
    "jRFk519Bj-": "Движущей силой этого сообщества является полностью международный бесплатный проект с открытым исходным кодом.",
    "jdbef_PBl": "Цель",
    "jr_7Y98yZ": "LafИнструменты",
    "ky6JphiKk": "{0} онлайн-пользователи",
    "lEDpJMRfG": "Если вы запутались, пожалуйста, сообщите нам об этом, отправив нам электронное письмо.",
    "lWqYc": "На этом веб-сайте представлены инструменты JSON, включая JSON в XML, JSON в CSV, JSON в YAML.",
    "lastreplyby": "Последний ответ от",
    "lidydVO": "Почему меня заблокировали или ограничили?",
    "lu2T6idPY": "Если вы считаете, что с вашей учетной записью возникла проблема, обратитесь к веб-мастеру.",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "{0} пользователей",
    "nncQE": "Жизнь",
    "o4GdNzX6xS": "Во-первых, в соответствии с общеизвестными требованиями законодательства на Земле каждый пользователь должен предоставить действующий номер телефона для регистрации.",
    "oHQNQ4mRw": "ID пользователя",
    "p1Jyl4uMv": "Выйдите из своей учетной записи",
    "pNwe3": "Другой",
    "t8DUz20a-": "Форматер JSON",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "Выберите язык веб-сайта",
    "uefFV1": "Позже",
    "ufSPh0ad": "Если невозможно зарегистрировать учетную запись по текущему номеру телефона, обратитесь к веб-мастеру по электронной почте {0} или через учетную запись WeChat {1}. Мы можем помочь вам зарегистрировать учетную запись вручную.",
    "wCcPJZK": "{0} не является действительным адресом электронной почты.",
    "wCctGPJZK": "{0} не должно быть пустым.",
    "wi28h5_S2": "Кодеки",
    "xhxY6iLDH": "Выйти",
    "yOdwRB": "Добро пожаловать в сообщество ELB3!",
    "zr3ZBdUoT": "Руководство пользователя",
    "zuxd0y-kmA": "Идентификатор пользователя или номер телефона не имеют пробелов."
}