{
    "15424": "Det är hela problemet med vetenskap. Du har ett gäng empiriker som försöker beskriva saker av ofattbar förundran. – Bill Watterson",
    "15999": "Innovation är processen att göra förändringar i något etablerat. -Innovation Definition Team",
    "16987": "Ibland lönar det sig att ligga kvar i sängen på måndag, istället för att spendera resten av veckan på att felsöka måndagens kod. – Dan Salomon",
    "19775": "Vetenskap är ett sätt att leva. Det är ett perspektiv. Vetenskapen är processen som tar oss från förvirring till förståelse på ett sätt som är exakt, förutsägbart och tillförlitligt – en transformation, för dem som har turen att uppleva den, som är stärkande och känslomässig. – Brian Greene",
    "38127": "Testning är processen att försöka bryta koden - Anonym",
    "42641": "Webbutveckling är svårt, bara då är det roligt att göra. Du måste bara sätta dina standarder. Om det skulle vara enkelt, skulle någon göra det? ― Olawale Daniel",
    "46367": "Innovation är nyckeln till att frigöra tillväxtpotential. -Omar Ishrak",
    "57225": "Innovation är livsnerven i ett blomstrande företag. -Michael Dell",
    "63470": "En riktig vetenskapsman löser problem, inte klagar över att de är olösliga. – Anne McCaffrey",
    "66187": "Prat är billigt. Visa mig koden. ― Linus Torvalds",
    "68518": "Programvara och katedraler är ungefär samma sak – först bygger vi dem, sedan ber vi.",
    "77528": "Innovation är drivkraften bakom framsteg. -John F. Kennedy",
    "80972": "Naturligtvis kan dålig kod rensas upp. Men det är väldigt dyrt. — Robert C. Martin",
    "85805": "En expert är en person som har gjort alla misstag som kan göras inom ett mycket smalt område. – Neils Bohr",
    "92941": "Det finns riktig poesi i den verkliga världen. Vetenskap är verklighetens poesi. – Richard Dawkins",
    "": "Meddelande: {0}",
    "-8l11": "Kopierade",
    "-DqwwR": "Operation slutförd.",
    "-GJ_72": "Bytte till den valda arbetsytan {0}",
    "-Jx4J": "Lokalt konto",
    "-Rj3y": "teman",
    "-XZnW": "Tillbaka",
    "-Yo129I": "Textverktyg",
    "-nL_B5PoN": "Komprimerar {0}",
    "00d36": "Det bästa sättet att förutsäga framtiden är att uppfinna den. -Alan Kay",
    "01do0y": "Kannada",
    "04SSf": "Glömt ditt lösenord?",
    "07naT": "Fel: {0}",
    "07ui6": "Mer information",
    "0Ceqru": "Base64 är en notation för kodning av godtyckliga bytedata med hjälp av en begränsad uppsättning symboler som bekvämt kan användas av människor och bearbetas av datorer.",
    "0MO3jj": "MD5 (Message-Digest 5) är en mycket använd hashfunktion. Den har använts i en mängd olika säkerhetsapplikationer och används också ofta för att kontrollera filers integritet. MD5 är dock inte kollisionsbeständig och den är inte lämplig för applikationer som SSL/TLS-certifikat eller digitala signaturer som förlitar sig på den här egenskapen.",
    "0PgZ_": "Översättning",
    "0YKce": "Konverterar en binärkodad decimalsträng (BCD) till ett decimaltal.",
    "0a310": "Det finns ingen kunglig väg till vetenskap, och bara de som inte fruktar den tröttsamma stigningen på dess branta stigar har en chans att nå dess lysande toppar. - Karl Marx",
    "0a710": "Innovation är livsnerven i alla organisationer. -Dr. R.L. Bhatia",
    "0ba15": "Framgångsrik innovation kräver att man tar kalkylerade risker. -Harvard Pruden",
    "0e299": "Allt är teoretiskt omöjligt tills det är gjort. – Robert A. Heinlein",
    "0gvcN": "Välkommen till översiktssidan, den är fortfarande under utveckling.",
    "0gywa": "Arbetsytan hittades inte, du omdirigeras till arbetsytans indexsida.",
    "0pfdz7": "uzbekiska",
    "114ee": "Kodning som poesi bör vara kort och koncis. - Santosh Kalwar",
    "13pmE": "Stöd oss",
    "149c0": "I vetenskapsfrågor är tusentals auktoritet inte värt en enda individs ödmjuka resonemang. - Galileo Galilei",
    "1507oa": "bengaliska",
    "1883d": "Vetenskap är mycket mer stimulerande för fantasin än klassikerna. – J. B. S. Haldane",
    "188cd": "Programmering lär sig genom att skriva program. - Brian Kernighan",
    "18f46": "Raketer är coola. Det går inte att komma runt det. – Elon Musk",
    "1JOFP": "Öppna Min arbetsyta",
    "1NTgQ": "Öppna Workspace",
    "1Npez": "Ange sökvägen",
    "1Tuab": "Kopierade",
    "1X8x7": "Exempel",
    "1Xe82x7": "{0} Förminska",
    "1Xe8wx7": "Hexsträng",
    "1Xe8x7": "{0} Försköna",
    "1Xe8x7qe": "BCD",
    "1YmJc": "Välj ett av alternativen som ditt föredragna språk:",
    "1a3Sc": "Avbryt laddning",
    "1a8b9": "Forskaren är inte en person som ger rätt svar, han är en som ställer rätt frågor. – Claude Levi-Strauss",
    "1bd": "Arbetsflöde",
    "1d71a": "Vi föds i ett givet ögonblick, på en given plats, och precis som årgångsår av vin har vi kvaliteterna för det år och den årstid som vi är födda av. Astrologi gör inte anspråk på något mer. – Carl Jung",
    "1da5a": "Innovation är grunden för framsteg och framgång i den moderna affärsvärlden. -Larry Page",
    "1e3e5n": "Hausa",
    "1ff27": "Vetenskap är vad vi förstår tillräckligt bra för att förklara för en dator; konst är allt annat. – Donald E. Knuth",
    "1h6jH": "Varning, utgången är ett tomt värde vars längd är noll!",
    "1j62a": "Gör detta vid annan tidpunkt",
    "1jj0ri": "japanska",
    "1k_44": "Denna operation avkodar data från en ASCII Base64-sträng tillbaka till sitt råformat.",
    "1th2nw": "singalesiska",
    "1yIQu": "Du kan försöka bearbeta din åtgärd igen eller klicka på knappen nedan för att ta bort felet.",
    "20nmcv": "latin",
    "22XLF": "Inte färdig än",
    "22f3a": "Innovation är den centrala frågan i ekonomiskt välstånd. – Michael Porter",
    "23f61": "Innovation handlar inte bara om att ha en bra idé; det handlar om att göra den idén till verklighet. -Erik Qualman",
    "24vLI": "Skapad",
    "277a9": "Vetenskapen kan inte lösa naturens yttersta mysterium. Och det beror på att vi i sista hand själva är en del av mysteriet som vi försöker lösa. – Max Planck",
    "27ef9": "Innovation är förmågan att omvandla idéer till fakturor. -L. Duncan",
    "27j7sy": "Shona",
    "2D9a6": "Glömt ditt lösenord?",
    "2D9qdk6": "Är det tillräckligt säkert?",
    "2IF6A": "Det ser ut som att forge save storage stöter på något problem",
    "2JyFN": "Kopiera resultatet till Urklipp",
    "2Ocbey": "Version",
    "2RhAT": "Det ser ut som att förfalskningsprocessen stöter på något problem",
    "2Ruh6": "Skapa nytt lokalt konto",
    "2S5ap": "Växla helskärmsläge",
    "2S_7EVIsK": "JSON Validator",
    "2Y1mR": "Klar text",
    "2b7f7": "Jag är säker på att universum är fullt av intelligent liv. Det har bara varit för intelligent att komma hit. – Arthur C. Clarke",
    "2bqHk": "Ladda från fil",
    "2e4fb7": "Igbo",
    "2giYv": "Testlösenord: {0}",
    "2khdsv": "Pashto",
    "2lehqwp": "vietnamesiska",
    "2lhcqwp": "turkiska",
    "2lhqqwp": "indonesiska",
    "2lhqqwqp": "malajiska",
    "2lhqwwp": "Thai",
    "2qdin8": "Vänligen ange verifieringskoden",
    "2tib5m": "svenska",
    "2ybu7j": "norska",
    "30eo2v": "Gujarati",
    "321e0": "Felsökning är dubbelt så svårt som att skriva koden i första hand. Därför, om du skriver koden så smart som möjligt är du per definition inte smart nog att felsöka den - Brian W. Kernighan",
    "32D9a6": "Skapa ett konto",
    "32c8d": "Om felsökning är processen att ta bort buggar, måste programmering vara processen att lägga in dem. – Sam Redwine",
    "33RXi": "Begäran avvisades på grund av otillfredsställande parametrar.",
    "33aa4": "Vetenskap är bara ren empirism, och i kraft av sin metod utesluter den metafysik. – Steve Martin",
    "346qid": "ryska",
    "380da": "Programmering idag är en kapplöpning mellan mjukvaruingenjörer som strävar efter att bygga större och bättre idiotsäkra program och universum som försöker producera större och bättre idioter. Hittills vinner universum. – Rick Cook",
    "394b6": "Om du trodde att vetenskapen var säker? Tja, det är bara ett fel från din sida. – Richard Feynman",
    "398cc": "Programmerare verkar förändra världen. Det skulle vara en lättnad, för dem och för oss alla, om de visste något om det. – Ellen Ullman",
    "39dsCt": "Du skulle få senaste meddelande från apptjänster om du har det.",
    "3d297": "Det jag älskar med vetenskap är att när du lär dig får du inte riktigt svar. Du får bara bättre frågor. – John Green",
    "3ii2tt": "skotsk gaeliska",
    "3umnB": "Okänd token",
    "40b7f": "Innovation är det enda sättet att vinna på lång sikt. -Jeff Immelt",
    "420b0": "Framgångsrik innovation kräver ett engagemang för samarbete och öppen kommunikation. -Rachel D. Ellison",
    "43be5": "Dagbok",
    "43e45": "Det finns ingen lag förutom lagen att det inte finns någon lag. – John Archibald Wheeler",
    "441oja": "georgiska",
    "44Ntqw-": "Hantera operationen.",
    "45cb0": "Innovation handlar inte bara om att skapa nya idéer, utan det handlar också om att genomföra dem framgångsrikt. -Arun Pandit",
    "46bksi": "litauiska",
    "4K_vhq": "Duplicera den här fliken",
    "4PIqD": "Kodgranskning",
    "4UYIJ": "Ännu inte klar.",
    "4cGA_": "Hämtar data för systeminställningar...",
    "4cf03": "Egentligen allt som kan kallas ett nummer; för det är omöjligt att fatta något med sinnet eller att känna igen det utan detta. – Philolaus",
    "4d389": "Innovation är ett sätt att leva för den framgångsrika entreprenören. -John Rampton",
    "4da84": "Du kanske inte tror att programmerare är konstnärer, men programmering är ett extremt kreativt yrke. Det är logikbaserad kreativitet. – John Romero",
    "4kKe4": "Ditt lösenord",
    "4tqb4x": "ungerska",
    "4vdfwf": "OK",
    "4wlih": "Begäran avvisades på grund av otillfredsställande parametrar.",
    "52OiQ": "Kopierade {0} gånger",
    "532fd": "Innovation är förmågan att se förändring som en möjlighet, inte ett hot. -Steve Jobs",
    "54cwb": "System Websocket API påträffade ett fel: {0}",
    "56ibcj": "vietnamesiska",
    "57eaa": "Vi är bara en avancerad ras av apor på en mindre planet av en mycket genomsnittlig stjärna. Men vi kan förstå universum. Det gör oss till något väldigt speciellt. - Stephen Hawking",
    "58HQX": "Om du inte känner till dess värde, kontakta din administratör för mer information, som finns i hans inställningar.",
    "58c03": "Innovation är en nyckelfaktor för framgång för alla företag. -Ravi Venkatesan",
    "58c5f": "Om du först inte lyckas, kalla det version 1.0. – Khayri R.R. Woulfe",
    "59f7d": "Innovation är katalysatorn för framsteg och tillväxt. -John Donahoe",
    "5BOhl": "Inbjudningskod",
    "5Ih2u": "Verktygsnavigator",
    "5NCPT": "Mörkt läge",
    "5NJeGsu1": "E-post, du kan enkelt organisera din inkorg, skriva och skicka meddelanden och hålla koll på din korrespondens. Hittills har det endast använts som ett kommunikationsverktyg mellan användare och vårt team.",
    "5NJeddqGsu1": "Det här avsnittet innehåller datormaterial, wikiartiklar, användarguider och mer.",
    "5NJedqddqGsu1": "Det här avsnittet innehåller datorresurser som kan användas för att bygga dina egna projekt.",
    "5Perd": "Tyvärr, funktionen \"Använd Smart Editor\" är inte tillgänglig ännu. Vi arbetar fortfarande med att implementera det. Tack för ditt tålamod.",
    "5ZBYR": "Tillbaka",
    "5a8a1": "Innovation är processen att ta en idé och omsätta den till verklighet. -Kevin O'Leary",
    "5dF7o": "Uppdatera",
    "5db54": "Vetenskapen är det stora motgiftet mot giftet av entusiasm och vidskepelse. – Adam Smith",
    "5eXVS": "Skriptinnehåll",
    "5ggegx": "koreanska",
    "5lW8qp": "Visa ett exempel för detta verktyg",
    "5q-Zxqa": "Skripthanterare",
    "5qPOJL": "För att stödja LafTools, överväg att antingen ge en stjärna till vårt arkiv på GitHub eller uppgradera till vår professionella version genom en månadsprenumeration. Vi skulle uppskatta er hjälp och vi lovar att LafTools kommer att bli ännu bättre med de insamlade medlen.",
    "5qV5Sf": "Ta bort denna post från listan",
    "5rg5mt": "Madagaskar",
    "5srFq": "LafTools",
    "5v8jl7": "Hmong",
    "626bf": "Om vi ​​visste vad det var vi gjorde skulle det inte kallas forskning, eller hur? – Albert Einstein",
    "63d47": "Kvalitet är en produkt av en konflikt mellan programmerare och testare. ― Yegor Bugayenk",
    "662f9": "Du lever bara en gång men om du gör det rätt så är en gång tillräckligt. — Mae West",
    "66ef1": "Bra kod är dess egen bästa dokumentation. När du ska lägga till en kommentar, fråga dig själv: 'Hur kan jag förbättra koden så att den här kommentaren inte behövs? ’ – Steve McConnell",
    "66f12": "Vetenskap är organiserad kunskap. Visdom är organiserat liv. – Will Durant",
    "6AumW": "Standardåtgärd",
    "6ClPV": "Skapa",
    "6MrfIfGc6": "Kodminifiera",
    "6UICxHzVR.name": "Försköna {0}",
    "6a0da": "Konsten och vetenskapen att ställa frågor är källan till all kunskap. – Thomas Berger",
    "6cOPZ": "Binary-Coded Decimal (BCD) är en klass av binära kodningar av decimaltal där varje decimalsiffra representeras av ett fast antal bitar, vanligtvis fyra eller åtta. Särskilda bitmönster används ibland för en skylt",
    "6hsnqWe": "Även om LafTools är gratis och öppen källkod, kräver det fortfarande en betydande mängd tid och energi att underhålla det. I synnerhet behöver vi pengar för att betala för vissa moln-API:er. Om du uppskattar LafTools, vänligen överväg att stödja oss.",
    "6j13s3": "isländska",
    "6qT9d-N": "För anteckningsboken tillhandahåller LafTools inte bara skalkommandohanteraren, utan kommer också att lägga till kraftfulla anteckningsverktyg i den inom en snar framtid som MarkDown, Latex, {0} och så vidare.",
    "6ulj8i": "nepalesiska",
    "6wdtJ4vmg.name.0912": "Förminska {0}",
    "6yOXx": "Okänt namn",
    "71L3OI9T7": "Att granska fred, främja samarbete och söka utveckling har blivit temat för den nuvarande eran.",
    "71x7x": "Källkod på GitHub",
    "72bee": "Jag är ingen bra programmerare; Jag är bara en bra programmerare med bra vanor. - Kent Beck",
    "74a91": "Testning leder till misslyckande, och misslyckande leder till förståelse - Burt Rutan",
    "74f90": "Dagens vetenskap är morgondagens teknik. – Edward Teller",
    "7714b": "Innovation är nyckeln till att låsa upp nya möjligheter och driva tillväxt.",
    "79f2d": "De flesta duktiga programmerare gör programmering inte för att de förväntar sig att få betalt eller bli bejublad av allmänheten, utan för att det är roligt att programmera. – Linus Torvalds",
    "7MOO1": "Logga in",
    "7affb": "Världen väntar inte på oss. Den tekniska revolutionen kommer att lämna oss bakom oss om vi inte kommer ikapp. – Kofi Annan",
    "7c59e": "Erfarenhet är namnet alla ger sina misstag. – Oscar Wilde",
    "7d4e4": "Innovation handlar om att hitta nya och bättre sätt att göra saker på. -Jim Rohn",
    "7dm0d8": "Traditionell kinesiska",
    "7e19d": "Förvirring är en del av programmering. - Felienne Hermans",
    "7flKa": "LafTools - Den allsmäktige för alla proffs och ingenjörer",
    "7g5w22": "norska",
    "7k56u3": "galiciska",
    "7q40W": "Det går inte att initiera administratören",
    "7u4vzu": "slovakiska",
    "7x3f6": "Flik - 1",
    "8259a": "Programmerare: En maskin som förvandlar kaffe till kod. – Anonym",
    "82r0C": "Hantera din TODO-lista och få saker gjorda mer effektivt.",
    "83dNp": "Det gick inte att ladda tilläggs-ID. (REF: 1dl1f)",
    "850c1": "Vetenskapsmannen påtvingar bara två saker, nämligen sanning och uppriktighet, påtvingar sig själv och andra vetenskapsmän dem. – Erwin Schrödinger",
    "8582b": "Om vi ​​vill att användarna ska gilla vår programvara bör vi designa den så att den beter sig som en sympatisk person. – Alan Cooper",
    "8692e": "Det finns många babblare, helt okunniga om matematik, som vågar fördöma min hypotes, på auktoritet av någon del av Bibeln som vrids för att passa deras syfte. Jag värdesätter dem inte och föraktar deras ogrundade omdöme. – Nicholas Copernicus",
    "886d1": "Vi känner att även om alla möjliga vetenskapliga frågor besvaras, så har livets problem fortfarande inte berörts alls. – Ludwig Wittgenstein",
    "8LdRj": "Översikt",
    "8LdRjq": "Beräkna",
    "8LdevRj": "Service",
    "8M1wY": "Lokal terminal",
    "8c224": "Oavsett vilket arbetsområde du vill gå inom är det av stor vikt att lära dig minst ett programmeringsspråk. — Ram Ray",
    "8e5d0": "Innovation är framtidens uppmaning. – Kofi Annan",
    "8eeL1Kk": "Handla om",
    "8mn_qa": "Hämtar data från terminaltjänster...",
    "8qzWJu": "Tyvärr, för närvarande har vi inte stöd för småskärmsenheter ännu, använd PC för att besöka den här sidan.",
    "90b5e": "Det är inte en bugg; det är en odokumenterad funktion. – Anonym",
    "91f08": "Det bästa med tekniken är att den låter dig koncentrera dig på din vision och glömma maskineriet. – John Landis",
    "9251d": "Innovation är en nyckelfaktor för alla företags förmåga att lyckas på lång sikt. - Elon Musk",
    "92b29": "Innovation är processen att ta en kreativ idé och förvandla den till en kommersiell framgång. -Richard Branson",
    "9334e": "Den största äran i att leva ligger inte i att aldrig falla, utan i att stiga varje gång vi faller. – Nelson Mandela",
    "9412b": "Först, lös problemet. Skriv sedan koden. – John Johnson",
    "9469a": "Alla borde lära sig att programmera en dator eftersom den lär dig att tänka. - Steve Jobs",
    "97um9v": "Hawaiian",
    "98KcL": "Konverterar ett decimaltal till Binary-Coded Decimal (BCD).",
    "98d3f": "Vetenskap är magi som fungerar. – Kurt Vonnegut",
    "9Xv8-": "Spara som anteckning",
    "9YPgsPid2M": "SMS-kod",
    "9_qaj": "Avsluta detta formulär",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Base64 Encoder",
    "9b_7a0sdf": "Base64-avkodare",
    "9cb71": "Innovation handlar om att skapa värde för kunder och förbättra deras liv. -Reed Hastings",
    "9d18a": "Programvara kommer från himlen när du har bra hårdvara. – Ken Olsen",
    "9e4fcl": "Tamil",
    "9eZHM": "hoppsan! Det verkar som om vi stöter på några varningar eller fel.",
    "9gqo8x": "lettiska",
    "9m85mf": "Sesotho",
    "9qy1xn": "portugisiska",
    "9tbbkt": "finska",
    "9zCSc": "Inga tillgängliga arbetsytor",
    "A69UZ": "Variabler",
    "AVUvu": "Base62 är en notation för kodning av godtyckliga bytedata med hjälp av en begränsad uppsättning symboler som bekvämt kan användas av människor och bearbetas av datorer. Den höga talbasen resulterar i kortare strängar än med decimal- eller hexadecimalsystemet.",
    "AW9N8": "Inmatningsregion",
    "AfPC0": "Ditt oformaterade lösenord",
    "Ahrjc": "Katalogen finns inte, vill du skapa den?",
    "AkXgF": "Pågår: {0}%",
    "Apx8D": "Hur återställer du ditt lösenord manuellt?",
    "AvsWiJHLZ": "Resurser",
    "B-GCloBBt": "Komprimerar eXtensible Markup Language (XML)-kod.",
    "B0s0z": "Syftet med denna sida:",
    "BGd7P9": "Denna operation kodar rådata till en ASCII Base64-sträng.",
    "BGd7dP9": "Denna operation kodar rådata till en ASCII {0}-sträng.",
    "BGdd7dP9": "Denna operation kodar rådata till en ASCII {0}-sträng.",
    "BJbgR": "Rapportera ett problem",
    "BQs6go-dk": "Ladda ner gratis LafTools för Windows, Linux och macOS.",
    "BShq3M": "Problem",
    "BW3bpT": "Läser filen från disken...",
    "Bd9h-": "Lägg till den i min favoritsamling",
    "BuihG": "Systeminställningar",
    "C3L9MmdDU7": "Handbok",
    "CASef": "Okej, operationen utlöses.",
    "CEv8B": "Är du säker på att ta bort den här posten? Om ja, klicka på den här knappen igen.",
    "CFg8B": "Storleken måste vara mellan 0 och 512",
    "CK5NCw519": "Samhällsberättelse",
    "CVUl0": "LafTools",
    "CWoqhy": "Exts List efter valt kategori-ID",
    "CZ5ZU__AFJF": "Den här sidan tillhandahåller en klient-UI-stil för LafTools, en högre abstraktionsnivå för LafTools.",
    "C_qzLO7yw": "Använd Chrome, Firefox eller Edge för den bästa upplevelsen.",
    "CfZAX": "Filen {0} har valts, vi laddar upp den till kärntjänsten.",
    "CidOqAZ": "Som skapare av LafTools är jag så berörd att du är villig att stödja oss. Vi har bra människor i vårt team som jobbar hårt för att kontinuerligt förbättra LafTools.",
    "Cide2w": "För att se om det är något problem när du utför din åtgärd.",
    "CqFdiBu6M": "Se",
    "Cz_qjjFw7": "Om {0}",
    "DIQFq": "Kontrollera om URL-parametern har angetts korrekt, det verkar som att du inte har behörighet att fylla i det här formuläret. Som standard kommer du att kunna se meddelandet nedan i utgången av tjänsten när den precis startade.",
    "DIweGq": "Säkra dina LafTools",
    "DSEtLTxUU": "Tid är valutan i ditt liv, använd den klokt.",
    "DTTPW": "Återställ status",
    "DVoKw": "Logga ut detta system",
    "DadYp": "Debounce i realtid",
    "DqFI5": "Nivåerna måste vara större än 0",
    "DrXAq": "Välkommen att använda LafTools!",
    "DrbEr": "Lösenordet du angav är tomt, kontrollera och försök igen.",
    "DtlAc": "Laddar systemresurser",
    "Dxlw0": "Komplett",
    "E62ej": "Filtrera skalkommandon",
    "E6F9B": "Lägg till det i arbetsflödet",
    "EEQkeW": "Algoritmen MD6 (Message-Digest 6) är en kryptografisk hashfunktion. Den använder en Merkle-trädliknande struktur för att möjliggöra enorm parallell beräkning av hash för mycket långa indata.",
    "EO6Qv5dCA": "Minimerar JSON-koden, minska paketstorleken på din JSON-kod.",
    "ERK7E": "Om du stöter på något problem eller har några förslag när du använder LafTools, var god kontakta oss via e-post eller GitHub när som helst, vi är villiga att förbättra det omgående.",
    "EgBXL": "Välj eller tillhandahåll taggar.",
    "Ewvgo": "Inte börjat än.",
    "ExqvX": "Snabbtangenter lista",
    "Eyq856": "Vi är inte klara än - vi är dedikerade till att tillhandahålla de senaste och bästa funktionerna, och vi kommer att fortsätta släppa uppdateringar för att se till att du får den bästa möjliga upplevelsen.",
    "Ezsn81tfc": "Se",
    "F-OUm": "Snabbinstallation för LafTools",
    "F0CCF": "Snabbtangenter lista",
    "F4uS2": "Ny fil",
    "FAQ": "Vanliga frågor",
    "FBVyc": "Vänligen ange verifieringskoden igen",
    "FDlRI": "Namnge denna nya flik och klicka för att bekräfta den.",
    "FOyHW": "Sök överallt",
    "FQzhg": "Ignorera tom inmatning",
    "FYRoL": "Indrag och försköna CSS-kod (Cascading Style Sheets).",
    "FhVWl": "Kryptera ditt lösenord",
    "FjYbR": "Produktion",
    "Fv-zz": "Kopiera resultat",
    "Fy217": "Konfigurera detta verktyg",
    "Fzp3t": "Ange värde i det här fältet",
    "G2dvTUljF": "Verktyg",
    "G3MJN": "Visa utdatapanel",
    "G9QVo": "Hantera flikar",
    "GR7jK": "Typ",
    "GaySMPQHo": "Trendigt",
    "Ggob_": "Annullera",
    "H-Ae75": "Vänligen bekräfta ditt lokala lösenord.",
    "H-qA75": "Vänligen ange lokalt lösenord.",
    "H8fQ4": "Växla till ljust eller mörkt läge",
    "HEAhr": "Efter översättningen kommer resultatet att visas här.",
    "HIc3c": "Avslutad",
    "HNDat": "Klicka på knappen \"{0}\" för att göra ändringar. Annars klickar du på \"{1}\" för att tillämpa dina ändringar. Må du ha det bra med den här verktygslådan!",
    "Hflf2": "För cybersäkerhetens skull skulle vi inte hjälpa till att återställa ditt lösenord via API:er eller sidor här om du inte uppdaterar den systemskyddade filen manuellt.",
    "HjvV3": "Vi kommer inte att radera dess filer på disken, bara ta bort denna post från listan.",
    "HyIC_": "Slash Key (/)",
    "HyIC_d": "Slash Key (/)",
    "I8FLi": "Nu är det dags att ställa in din administratör, vänligen ställ in lösenordet så komplicerat du kan så att du kan förbrylla dessa otrevliga angripare.",
    "IAC0A": "Sökverktyg",
    "ICefi": "Inställt",
    "IEFy5k39X": "Generatorer",
    "IKqqATS": "Uppdatera aktuella siddata",
    "IOOrz": "(Skulle det vara skadligt för ditt system? Vi tror inte det, så länge du kan ändra den systembevarade konfigurationsfilen betyder det att du får läsa allt om LafTools datafiler.)",
    "IWPP6V-tR": "Källkod",
    "IWUH5": "Visa exempel",
    "IaSyO": "Annullera",
    "Ibzs2-Ho1": "CSV-verktyg",
    "IfsGO": "Favoriter",
    "IfsdGO": "Favoriter",
    "ImUmf": "Ny",
    "IugAFc4OT": "Ett problem har uppstått när din data skickades.",
    "IxAJswoSh": "Analyserar och skriver ut giltig JavaScript-kod. Fungerar även med JavaScript Object Notation (JSON).",
    "J-3KA": "Ange ett namn för det här skriptet, vilket skulle vara mer användbart.",
    "J164i": "t.ex. Kopiera filer till fjärrserver",
    "J2xoL": "Se felet: {0}",
    "JA_Bp": "Ange ett namn för den nya taggen först.",
    "JQEVK": "Koda",
    "JQLmS": "Justerade storleken",
    "JQLmSq": "Avslutad.",
    "JTBRh": "LafTools lagrade lösenordsvärdet i den lokala filen, men inga bekymmer, vi antog en enkelriktad lösenordskrypteringsmekanism, det vill säga att ingen kan läsa lösenordet för vanlig textversion. För att återställa lösenordet, följ nedanstående instrument för att manuellt återställa ditt lösenord.",
    "JYqxz2": "Välkommen till LafTools, detta är en insiderversion.",
    "Jbor69IBw": "Formatterare",
    "JdqiUE8": "Denna operation avkodar data från en ASCII-sträng (med ett alfabet som du väljer, inklusive förinställningar) tillbaka till sin råa form.",
    "JdqidUE8": "Denna operation avkodar data från en ASCII-sträng (med ett alfabet som du väljer, inklusive förinställningar) tillbaka till sin råa form.",
    "JfFHw": "Få Workspace Info Request",
    "JiUE8": "Denna operation avkodar data från en ASCII {0}-sträng tillbaka till sitt råformat.",
    "Jq7x3Igk0": "Prova Client UI Style",
    "JuZAli3": "Användarmanual",
    "K1qJZI": "Välkommen till LafTools, ers excellens.",
    "KGS2-": "När du har slutfört stegen ovan kan du använda ditt nya lösenord för att logga in på ditt system. Om du inte kunde komma åt filsystemet, be din administratör eller IT-support att skapa den filen. Om filen redan fanns, raderade du den och gör en ny.",
    "KIc63": "Funktionen stöds inte ännu",
    "KYh1N": "Alla anteckningar",
    "KcqrRr": "Referens",
    "KcrRr": "Hämtar kodimplementeringsdata",
    "KmEUF": "Ge en snabb översikt över de nuvarande systemverktygen.",
    "Kw4OJr": "Terminal",
    "Kyd9H": "Källkod på GitHub",
    "L-p-Y": "Kopiera innehållet i det aktuella skalkommandot till urklipp",
    "L3zEM": "Visa exempel",
    "L42mxa": "Vänligen ange din källtext i det här fältet.",
    "L49kCq": "Vänligen ange och bekräfta låslösenordet i det här formuläret för att säkra dina LafTools.",
    "L71q_N": "Lösenordet du angav är tomt, kontrollera och försök igen.",
    "L9bQku": "Avkoda {0}",
    "L9qbQku": "Avkoda {0}",
    "LAc1m": "Uppdaterade appvyn.",
    "LFdvM": "Inte inloggad",
    "LM715": "Hämtar i18n config från lokal server API",
    "LPJrV": "Kopiera resultat",
    "LSohY6eZW": "Hexsträng är en sträng med hexadecimala byte separerade med en avgränsare, som kan vara ett mellanslag, komma, semikolon eller kolon.",
    "LU9Jj": "Base85 (även kallad Ascii85) är en notation för kodning av godtyckliga bytedata. Det är vanligtvis mer effektivt än Base64. Denna operation avkodar data från en ASCII-sträng (med ett alfabet som du väljer, förinställningar ingår). Base85 används ofta i Adobes PostScript- och PDF-filformat.",
    "LWaeFqd": "Byt till ditt föredragna språk",
    "Le71_N-": "Lösenordet du angav är inte detsamma som det bekräftade, kontrollera och försök igen.",
    "LnJ4H": "Observera att det lokala kontot inte är detsamma som den registrerade användaren på vår webbplats, det förra definieras endast på din PC medan det senare kan användas för molnsynkronisering.",
    "LqWaFd": "Systeminställningar",
    "LxaEFHbfa": "Minimerar SQL-kod, minska paketstorleken på din SQL-kod.",
    "M3qytc": "Koda {0}",
    "M3ytc": "Koda {0}",
    "M4ywN1": "Kalkylator, Kalender, Klocka, Väder och mer.",
    "M6MrW": "Bra",
    "M7jct": "Gå in i helskärmsläge",
    "MN2lT": "Längden på lösenordet får inte vara mindre än 6",
    "Ma5mv": "Växla synligheten för verktygsfältsflikar",
    "Mq9pdpT": "Lista alla relevanta resurser för den funktionella menyn du valde.",
    "Mq9ppT": "Visa snabbt status för dina tjänster",
    "Mqq9pdpT": "Hjälp dig att komma igång med LafTools.",
    "MrgmU": "Bekräfta",
    "NMLOn": "Kopiera FilePath",
    "NMLOn1": "Öppna Workspace",
    "NNfJo": "Ladda data från fil",
    "Nq1IR": "Det gick inte att ladda Extension VM",
    "Nqc0LqwX": "Om du tror att det finns en sårbarhet i den här processen, var god kontakta oss via e-post eller GitHub när som helst, vi vill förbättra det snarast.",
    "NrQc8OJfZ": "Komprimerar JavaScript Object Notation (JSON)-kod.",
    "O02-W": "Laddar inte...",
    "O94Yx": "på",
    "OBjaZqTvx": "Hem",
    "OO0qPN": "Exempel laddat",
    "OQWm4": "Rapportera en bugg",
    "OSHOI": "Välkomstsida",
    "OSqZQM": "Lokalt lösenord",
    "OeO0PeN": "Okej, exemplet visas i inmatningsredigeraren.",
    "OeOQY": "ATT GÖRA",
    "Ol1ZcWomT": "{0} Försköna",
    "OpPFe": "Om du gillar LafTools, vänligen dela det med dina vänner och ge oss en stjärna, tack!",
    "Opcty": "Filer",
    "OqqGx2qg": "Laddar de statiska resurserna, vänta...",
    "OrCt5": "Omdirigerar till arbetsbänken...",
    "Ot6EP": "Polska verktyg",
    "OyZLZokUQ": "Styr utvecklingen med LafTools!",
    "P4ROa": "Utdataregion",
    "PM_N5": "Session – {0}",
    "PUxuU": "Hämtar data för språkpaket...",
    "PapkF": "Om du har några frågor eller förslag om LafTools får du gärna meddela oss. Vi letar alltid efter sätt att förbättra vår produkt och ge bästa möjliga upplevelse för våra användare. Du kan kontakta oss på work7z@outlook.com. Tack för att du använder LafTools!",
    "PpCHA": "Frågenyckel(?)",
    "PqazM-": "Först av allt, använd nedanstående formulärkontroller för att kryptera ditt lösenord",
    "QL9Sn": "För närvarande verkar det inte finnas någon beskrivning tillgänglig.",
    "QLKzF": "Den är fullspäckad med funktioner som tillgodoser behoven hos både nybörjare och erfarna utvecklare, vilket gör den till ett måste-verktyg i alla programmerares arsenal.",
    "QM2Ob": "Senaste verktyg",
    "QM2Oq": "Senaste anteckningar",
    "QRAdA": "engelska till kinesiska",
    "QZK58Gemi": "Komprimerar SQL-kod (Structured Query Language).",
    "QhdpH": "Community Edition",
    "QkJ-qwhki": "LafTools med klassisk UI-stil",
    "QvBKp9BBp": "Lär dig mer om utvecklingsplaneringen av LafTools.",
    "QzlA3": "Ett fel uppstod",
    "R12bq": "Lista flikar som inte visas",
    "RNBze0": "Verktyg",
    "RNeBze0": "Öppnade flikar",
    "RNewBze0": "Verktygskonfiguration",
    "RO4ZP": "Ett fel uppstod",
    "RPVRl": "Det verkar som om det här tillägget inte är kompatibelt med den nuvarande versionen av LafTools. Vänligen överväg att installera den senaste versionen för att stödja detta tillägg, eller kontakta oss gärna genom att ta upp ett problem på GitHub.",
    "RhqzcdD": "Systeminställningar",
    "RjCO3": "Lista över arbetsytor",
    "RjdigcxfV": "Kontakta oss",
    "S4MMV": "hoppsan! Vi hittade några problem när filen laddades.",
    "SAnnQ": "Laddar filen {0}",
    "SBsDz": "Konfigurera ditt administratörskonto.",
    "SGs7B": "Konfigurera dina LafTools snabbt",
    "SMqD13": "Knappa in för att filtrera",
    "SPem9": "Detta fält är inte klart ännu.",
    "SQAw7": "Källspråk",
    "SYSq1": "Exempel",
    "SZgXb": "Ställ in lokalt lösenord",
    "SdGcT": "Annan del",
    "Sm9tq": "Ange kontolösenord här",
    "Sm9tqq": "Ange lösenord för att låsa upp dina LafTools",
    "Spcfdee": "Ljus eller mörkt läge",
    "TBPqy7": "Språk",
    "TD7DA": "språk",
    "TNoePE": "LafTools moln",
    "TV09-obNr": "Milstolpe",
    "Ttrqqet": "Skriv och spara dina tankar här!",
    "TwFcr": "Målspråk",
    "TyqvWY3": "Lokal fil",
    "U2ZNl": "Läs mer på Wikipedia",
    "U4qqq9": "Ta bort den här fliken från listan",
    "U7zP2": "Ange användarnamn för kontot här",
    "UED59zbd-": "LafTools",
    "UF_Dp": "Ett fel inträffade: {0}, avvisad tid är {1}",
    "UVvJp-vtF": "{0} Förminska",
    "UZ2Ig": "Nytt lokalt konto",
    "Ugpng": "Favorit",
    "UjkOS50wO": "Hem",
    "V2A74ySoN": "Se",
    "V6U_f": "Användarvillkor",
    "V6XEO": "Ange användarnamn eller e-post",
    "VAZq8r": "Det tillåter utvecklare att köra olika kommandon, som att köra skript, installera paket och navigera i filsystemet, allt från redigeraren.",
    "VEfeqZG": "Anteckningar",
    "VI6VT": "Historia",
    "VOsZc": "Rapportera problem",
    "VSZ": "Klicka för att utlösa igen",
    "VZtqg6": "Skapa nytt skriptformulär",
    "Vaf2y": "Fliknamnet kunde inte vara tomt.",
    "VeY9K": "Villkor",
    "VgG5y": "Klicka här för att uppdatera statusen för ditt tillägg",
    "VjZCv": "Realtidskonvertering",
    "Vvt09V2Qo": "Generisk kod",
    "WFUWzv_px": "Analyserar och skriver ut giltig JavaScript-kod. Fungerar även med JavaScript Object Notation (JSON).",
    "WKG7e": "Regler",
    "WPrTW": "Officiell hemsida",
    "WXo6D": "Uppfriskad",
    "WYCVL": "Snabb installation",
    "X4L_Z": "Tillägg VM tillhandahålls inte.",
    "X6Fq4j": "Efter år av dedikerad utveckling och förfining är vi övertygade om att LafTools avsevärt kan förbättra din programmeringsupplevelse genom att tillföra mer bekvämlighet och effektivitet till ditt arbetsflöde.",
    "XKpI0": "Klicka för att bearbeta din text i inmatningsområdet",
    "XLWoR": "Välj din favorit och fortsätt",
    "XQxJB": "Mina arbetsplatser",
    "X_HGx": "LafTools är en mångsidig verktygslåda designad för att möta olika behov. Det är helt öppen källkod, vilket säkerställer transparens och säkerhet. Trots sin lätta körtid erbjuder den fullt plattformsstöd, inklusive ARMv8, och inbyggt AI-stöd som liknar ChatGPT. LafTools är mycket integrerat med ett produktivt användargränssnitt och uppdateras kontinuerligt med nya verktyg. Den kan användas över webben och med Docker, och ger ytterligare resurser som anteckningar och manualer.",
    "XeXF77": "inställningar",
    "XikdD": "Snälla ögonblick, vi är nästan där!",
    "Y5GAC": "Ditt användarnamn",
    "Y9mQ2": "Ange användarnamn för kontot här",
    "YAAU3q": "Lokalt lösenord",
    "YHCjT": "LafTools stöder globala ljusa och mörka tema, det är särskilt användbart med nattskiftskodare.",
    "YNwKz": "Språk som inte stöds: {0}, kommer att använda engelska som standard.",
    "YOYTp": "Snabb installation",
    "YPPPL": "Växla synligheten för verktygsfältsflikar",
    "YQN9u": "Ett fel uppstod när {0} laddades, kontrollera nedanstående detaljer.",
    "Y__Zb1_4Q": "Minimerar CSS-koden (Cascading Style Sheets) och tar bort alla onödiga tecken.",
    "Y_k0z": "Glömt ditt lösenord?",
    "Ye3TXses": "För att konfigurera om omvandlingen kommer att utföras automatiskt när inmatningstexten ändras.",
    "Ylq2X": "Felkorrigering",
    "YquQqTXq": "Autokörning?",
    "YrTdq": "Allt",
    "YrVq683": "Post",
    "YrVqdd683": "handböcker",
    "Z2QTU": "Handla om",
    "Z3rhY": "Meddelande",
    "Z7ALO": "Bytte till den valda arbetsytan",
    "Z7OTt": "Filen du valde är för stor. Välj en fil som är mindre än 30 MB.",
    "ZAGva": "Är du säker på att ta bort den här arbetsytan?",
    "ZAKaFq": "Mitt molnkonto",
    "ZCzH8": "Nyaste",
    "ZW1Dgz": "Inget tillgängligt meddelande",
    "ZXRGC": "Se felet: {0}",
    "ZaS8MP8cr": "Obs: Verifieringskoden är uppdaterad, justera dina formulärvärden och skriv in koden igen för att fortsätta med.",
    "ZbD3F": "{0}, skapad av LafTools-teamet",
    "Zk7JI": "Det stöds inte ännu",
    "ZrbduC": "Stäng alla flikar",
    "ZrbuC": "Stäng flik",
    "_5OqeG": "Avmarkera den",
    "_LFF3": "Om du stöter på något problem eller har några förslag när du använder LafTools, vänligen kontakta oss via e-post eller GitHub när som helst, vi är villiga att förbättra det.",
    "_trez": "Byt text",
    "_trqL": "Hämtar data för systemresurser...",
    "_z3lR": "Uppdateringskod",
    "a0ab0": "Konst är livets träd. Vetenskapen är dödens träd. – William Blake",
    "a2849": "Vetenskap är acceptansen av det som fungerar och förkastandet av det som inte gör det. Det kräver mer mod än vi kanske tror. – Jacob Bronowski",
    "a3508": "Utrustad med sina fem sinnen utforskar människan universum omkring sig och kallar äventyret Science. – Edwin Hubble",
    "a3yqoz": "persiska",
    "a3z-3k12": "IP-adressverktyg",
    "a4jbpq": "tjeckiska",
    "a5354": "Det är konstigt att bara extraordinära konstgjorda upptäckter som rycker senare verkar så lätta och enkla. – George C. Lichtenberg",
    "a7062": "Innovation är gnistan som tänder framsteg. -Robyn M. D'Angelo",
    "a8a34": "Innovation är framtidens visitkort. -Anna Eshoo",
    "a8dd9": "Livet kan inte ha en slumpmässig början... problemet är att det finns cirka 2000 enzymer, och chansen att få dem alla i ett slumpmässigt försök är bara en del av 10^40 000, en oerhört liten sannolikhet som inte skulle kunna hanteras även om hela universum bestod av ekologisk soppa. – Fred Hoyle",
    "aCkOP": "Utgång",
    "aHAfR": "Hämtar data för {0}...",
    "aISK9iYc_": "Rapport om illegal information",
    "aSOpr": "Datamodellgenerator",
    "aa2f1": "Utforskning är vad du gör när du inte vet vad du gör. Det är vad forskare gör varje dag. Om en vetenskapsman redan visste vad de gjorde, skulle de inte upptäcka någonting, eftersom de redan visste vad de gjorde. – Neil deGrasse Tyson",
    "aa3a4": "Kod är som humor. När du måste förklara det är det dåligt. – Cory House",
    "ab5f7": "Den sorgligaste aspekten av livet just nu är att vetenskapen samlar in kunskap snabbare än samhället samlar in visdom. – Isaac Asimov",
    "about_LafTools_toolbox": "Om LafTools",
    "ac615": "Få det att fungera, gör det rätt, gör det snabbt. – Kent Beck",
    "adcca": "Vilken dåre som helst kan skriva kod som en dator kan förstå. Bra programmerare skriver kod som människor kan förstå. – Martin Fowler",
    "adpgq": "Skapa ny arbetsyta",
    "af3158": "Allt bestäms... av krafter som vi inte har kontroll över. -Albert Einstein",
    "afcb9": "Ingenting har sådan kraft att vidga sinnet som förmågan att systematiskt och verkligen undersöka allt som kommer under din observation i livet. – Marcus Aurelius",
    "afe52": "Det finns alltid en bugg till att fixa. – Ellen Ullman",
    "ah-C4": "Ny anteckning",
    "aj3nhd": "tysk",
    "aked6": "Referenser",
    "aked61": "Introduktion",
    "asElV": "Avlägsna",
    "az4uS2": "Är du säker på att du loggar ut detta system? Observera att du kommer att omdirigeras till inloggningssidan.",
    "azpNX": "Avslutad.",
    "azsd": "Snabbnavigering",
    "b0qjSL": "Gå in i katalogen {1} och skapa en fil {2}, ange ditt krypterade lösenord som hela filinnehållet.",
    "b194e": "Innovation kommer från producenten – inte från kunden. -W. Edwards Deming",
    "b19bb": "Den dag vetenskapen börjar studera icke-fysiska fenomen, kommer den att göra mer framsteg på ett decennium än under alla tidigare århundraden av dess existens. – Nikola Tesla",
    "b2724": "Programmering är konsten att berätta för en annan människa vad man vill att datorn ska göra. – Donald Ervin Knuth",
    "b4603": "Livet är vad som händer när du är upptagen med att göra andra planer. - John Lennon",
    "b5014": "Många av livets misslyckanden är människor som inte insåg hur nära de var framgång när de gav upp.– Thomas A. Edison",
    "b6sx9b": "Filippinare",
    "b7wgrhuXl": "Tech",
    "bP_6qG": "Tips för att glömma ditt lösenord",
    "bT4R6": "Ny flik",
    "bVlBN": "kinesiska till engelska",
    "bWQunyU10": "AI-laboratoriet",
    "bc574": "Innovation är livsnerven i ett hälsosamt företag. -Mark Cuban",
    "bc92f": "Framgångsrik innovation börjar med ett kundbehov. -Michael Dell",
    "be-Favourite-it": "Lägg till i favoriter",
    "beb6e": "Idéer är lätta. Implementeringen är svår. - Kille Kawasaki",
    "bfb8e": "Innovation är nyckeln till att förbli relevant och konkurrenskraftig på marknaden. -Mark Zuckerberg",
    "bhojei1": "Traditionell kinesiska",
    "bjZyW": "Översätt",
    "bors14": "turkiska",
    "bp_-b": "För att hantera LafTools fullständigt måste du konfigurera din administratör i början av installationsflödet. Vi har verifierat din identifiering med URL-parametertoken. Du kan vara säker på att det inte finns någon annan som kan ställa in din root-behörighet om han eller hon inte får installationstoken.",
    "bqqrij": "Swahili",
    "bsWpBA73s": "Komprimerar JavaScript-kod.",
    "c0eCw": "Översätt din text till vilket språk du vill.",
    "c5meku": "Sundanesiska",
    "c7Uoqqe": "Innan du använder LafTools, vänligen ange och bekräfta ditt lokala lösenord enligt nedan.",
    "c7cfc": "Ett bra test är ett som har stor sannolikhet att bryta koden om det finns ett problem - Michael Bolton",
    "cMBqyyFae": "Indrag och försköna SQL-kod (Structured Query Language).",
    "cNQp_": "Resurser",
    "cPS6q": "Alla verktyg",
    "cQqwI8r": "Laddar status för Terminal Service",
    "cae2c": "Innovation är processen att ta idéer och omsätta dem till verklighet. -Neil Lawrence",
    "cd4d1": "Innovation är nyckeln till affärstillväxt. -Andrew R. Steinberg",
    "cfYYN": "Upptäck mer",
    "ciZV2": "Base32 är en notation för kodning av godtyckliga bytedata med hjälp av en begränsad uppsättning symboler som bekvämt kan användas av människor och bearbetas av datorer. Den använder en mindre uppsättning tecken än Base64, vanligtvis det stora alfabetet och siffrorna 2 till 7.",
    "ciZV21": "Base45 är en notation för kodning av godtyckliga bytedata med hjälp av en begränsad uppsättning symboler som bekvämt kan användas av människor och bearbetas av datorer. Den höga talbasen resulterar i kortare strängar än med decimal- eller hexadecimalsystemet. Base45 är optimerad för användning med QR-koder.",
    "ciZV2deq1": "Base58 (liknar Base64) är en notation för kodning av godtyckliga bytedata. Den skiljer sig från Base64 genom att ta bort lätta fellästa tecken (dvs. l, I, 0 och O) för att förbättra mänsklig läsbarhet. Base58 används ofta i kryptovalutor (Bitcoin, Ripple, etc).",
    "cj1pd": "Uppdatera operation",
    "cjzqj9": "bosniska",
    "cmxzpg": "Malayalam",
    "coM2I": "Använd Smart Editor",
    "crD7I": "För att konfigurera om transformationen ska ignorera den tomma inmatningstexten vars längd är noll.",
    "cuRCb": "Kategori hittades inte.",
    "cuRCqb": "Kategori finns inte",
    "cxqhqa": "Myanmar (burmesiska)",
    "d-l2l": "Bekräfta",
    "d-qPr": "Okänd layout: {0}",
    "d0624": "Innovation handlar inte bara om att komma med nya idéer, utan det handlar om att genomföra dem effektivt. -Jeff Bezos",
    "d10c9": "Innovation är nyckeln till att låsa upp ny potential och låsa upp nya marknader. -Tim Cook",
    "d1820": "Tills människan duplicerar ett grässtrå kan naturen skratta åt hans så kallade vetenskapliga kunskap. - Thomas Edison",
    "d366a": "Innovation är nyckeln till att låsa upp ny tillväxt. -Philip Kotler",
    "d5KZH": "Tack för att du använder LafTools!",
    "d5LAU": "Licensierad under AGPLv3",
    "d5fmq2": "italienska",
    "d5hit": "Session – {0}",
    "d5x1rl": "spanska",
    "d7dc4": "Testning är processen att utvärdera ett system eller dess komponent(er) med avsikt att ta reda på om det uppfyller de specificerade kraven eller inte - Anonym",
    "dCFIC": "Kod snyggare",
    "dCFIwC": "Kodgenerator",
    "dGKMx": "Produktion",
    "dGVUB": "Nätverksverktyg",
    "dO6b2Tkqwe": "Nyligen använda verktyg",
    "dQwjNbi0y": "Läs mer om dokumentation",
    "dV5Eq": "Uppdatera arbetsytalistan",
    "da74c": "Spekulation och utforskning av idéer bortom vad vi vet med säkerhet är det som leder till framsteg. – Lisa Randall",
    "dc662": "Det enda verkliga misstaget är det som vi inte lär oss något av - John Powell",
    "dcebe": "Om felsökning är processen att ta bort programvarubuggar, måste programmering vara processen att lägga in dem - Edsger Dijkstra",
    "ddcc7": "Innovation är nyckeln till framgång i den moderna ekonomin. -Satya Nadella",
    "ddsdf3159": "Fysik är egentligen inget annat än ett sökande efter ultimat enkelhet, men än så länge är allt vi har ett slags elegant röra. -Bill Bryson",
    "de47c": "Att testa är konsten att hitta en svart låda och få den att sjunga - James Bach",
    "dk122q": "Hantera dina arbetsflöden för att kombinera flera verktyg tillsammans.",
    "dkarh": "Okej, verktygslådan öppnade katalogen. Om det inte dyker upp något fönster, kontrollera om din plattform stöder denna funktion eller om katalogen finns på servern.",
    "dkjk12": "detta är test",
    "dkkq12": "Konfigurera ditt verktyg på den här fliken.",
    "dl4kr": "Glömt ditt lösenord?",
    "download-local": "Gratis nedladdning",
    "dpRY4": "Lexikon",
    "dqTqyvWY": "Lådmeny",
    "dsdpA_eJ": "Justera storlek",
    "dtjdt4": "Kazakiska",
    "dxLQq": "Rottillstånd",
    "dzjTo": "Ange kontolösenord här",
    "e--gB": "Tilläggs-ID tillhandahålls inte.",
    "e097e": "Innovation handlar om att skapa nya möjligheter, inte bara nya produkter. -Tony Robbins",
    "e2379": "Vi lever i ett samhälle som är utsökt beroende av vetenskap och teknik, där knappast någon vet något om vetenskap och teknik. – Carl Sagan",
    "e3WgQaZlb": "Komprimerar {0}",
    "e4Cd8t": "Bas 85",
    "e5rycw": "kirgiziska",
    "e8Crq": "Vänligen fyll i fältet för användarnamn och lösenord nedan för att fortsätta.",
    "e984f": "Ren kod ser alltid ut som om den skrivits av någon som bryr sig. — Robert C. Martin",
    "eTmq": "Historik för CodeGen ToolBox",
    "e_8pZ": "En mångsidig verktygslåda för utvecklare för att förbättra produktiviteten.",
    "ea227": "Det bästa sättet att förutsäga framtiden är att skapa den. -Peter Drucker",
    "ediql2": "ungerska",
    "ee7d0": "Känslan av förundran som vetenskapen kan ge oss är en av de högsta upplevelser som det mänskliga psyket är kapabelt till. – Richard Dawkins",
    "egkqC8t": "Base58",
    "egkqCd8t": "Base62",
    "eifoni": "katalanska",
    "englishcorner": "engelsk",
    "eqkqd4W": "Ange ett namn för den nya taggen",
    "etV-l": "Kopiera filer till SIT2",
    "eu5mh0": "vitryska",
    "euaI8": "Skapa nytt lokalt konto",
    "euhy9v": "estniska",
    "f0d15": "Datorer är snabba; utvecklare håller dem långsamma. – Anonym",
    "f12bb": "Innovation är drivkraften bakom framsteg i näringslivet. Det är processen att generera nya idéer och omvandla dem till konkreta produkter, tjänster eller processer som levererar värde till kunderna.",
    "f23c2": "Innovation skiljer mellan en ledare och en följare. -Steve Jobs",
    "f29b1": "Framsteg görs genom prövning och misslyckande; misslyckandena är i allmänhet hundra gånger fler än framgångarna, men de lämnas vanligtvis okroniserade. – William Ramsay",
    "f3151": "Den största risken är att inte ta någon risk. -Mark Zuckerberg",
    "f3159": "Matematik är ett spel som spelas enligt vissa enkla regler med meningslösa märken på papper. -David Hilbert",
    "f315e7": "Matematik känner inga raser eller geografiska gränser. -David Hilbert",
    "f3160": "Matematik är den högsta domaren; dess beslut kan inte överklagas. -Tobias Dantzig",
    "f3161": "Inom matematiken måste konsten att ställa en fråga hållas av högre värde än att lösa den. -Georg Cantor",
    "f3162": "Matematik är en plats där du kan göra saker som du inte kan göra i den verkliga världen. -Marcus du Sautoy",
    "f3163": "Matematikens framsteg och perfektion är intimt förknippade med statens välstånd. -Napoleon Bonaparte",
    "f3164": "Matematikens väsen ligger i dess frihet. -Georg Cantor",
    "f3165": "Matematik är vetenskapen om vad som är klart av sig självt. -Carl Jacobi",
    "f3166": "Matematik, rätt betraktad, besitter inte bara sanning, utan suverän skönhet. -Bertrand Russell",
    "f3167": "Matematik är verktyget speciellt lämpat för att hantera abstrakta begrepp av alla slag. -P. Dirac",
    "f3168": "Matematik avslöjar dess hemligheter endast för dem som närmar sig den med ren kärlek, för dess egen skönhet. -Arkimedes",
    "f3169": "Matematik är den vackraste och mest kraftfulla skapelsen av den mänskliga anden. -Stefan Banach",
    "f3170": "Matematikern studerar inte ren matematik för att det är användbart; han studerar den för att han njuter av den och han njuter av den för att den är vacker. -Henri Poincaré",
    "f3171": "Studiet av matematik, precis som Nilen, börjar i minuthet men slutar i storhet. -Charles Caleb Colton",
    "f318e4": "Biologi är den mest kraftfulla tekniken som någonsin skapats. DNA är mjukvara, protein är hårdvara, celler är fabriker. -Arvind Gupta",
    "f31d71": "Fysiken är förhoppningsvis enkel. Fysiker är det inte. -Edward Teller",
    "f31d75": "Fysik är egentligen inget annat än ett sökande efter ultimat enkelhet, men än så länge är allt vi har ett slags elegant röra. -Bill Bryson",
    "f31e53": "Matematik är vetenskapernas drottning. -Carl Friedrich Gauss",
    "f31q52": "Ren matematik är på sitt sätt de logiska idéernas poesi. -Albert Einstein",
    "f31q54": "Naturens bok är skriven på matematikens språk. -Galileo Galilei",
    "f31q56": "Matematik är förnuftets musik. -James Joseph Sylvester",
    "f31q58": "Matematik handlar inte om siffror, ekvationer, beräkningar eller algoritmer: det handlar om förståelse. -William Paul Thurston",
    "f31q70": "Biologi är vetenskapen. Evolution är konceptet som gör biologin unik. - Jared Diamond",
    "f31q72": "Biologi är den fysiska världens poesi, och mänsklig biologi är vårt universums poesi. -Julian Casablancas",
    "f31q74": "Biologi är bara fysik som har börjat lukta illa. - Nigel Calder",
    "f31q81": "Fysik är vetenskapen om fysiska kroppars rörelser och handlingar utformade i termer av orsak och verkan. -Arthur Compton",
    "f31qe82": "Biologi är en mjukvaruprocess. Våra kroppar består av biljoner celler, var och en styrd av denna process. Du och jag går runt med föråldrad programvara igång i våra kroppar, som utvecklats under en helt annan tid. -Ray Kurzweil",
    "f31r83": "Fysiken börjar bli för svår för fysikerna. -David Hilbert",
    "f31sq66": "Biologi är verkligen kemi, kemi är verkligen fysik, fysik är verkligen matematik. -Matt Ridley",
    "f31x76": "Biologi är studiet av de komplexa sakerna i universum. Fysik är studiet av de enkla. -Richard Dawkins",
    "f31x77": "Fysik är erfarenhet, ordnad i ekonomisk ordning. -Ernst Mach",
    "f3d169": "Fysik är den enda riktiga vetenskapen. Resten är bara frimärkshämtning. -Ernest Rutherford",
    "f3d179": "Fysiken blir så otroligt komplex att det tar allt längre tid att utbilda en fysiker. Det tar faktiskt så lång tid att utbilda en fysiker till den plats där han förstår naturen av fysiska problem att han redan är för gammal för att lösa dem. -Eugene Wigner",
    "f3d180": "Biologi är vetenskapen om livet, men många av oss förstår inte grunderna i våra egna kroppar. - Kathy Reichs",
    "f3e155": "Matematik är dörren och nyckeln till naturvetenskaperna. -Roger Bacon",
    "f3q178": "Biologi är inte ödet. Det var aldrig mer än tendens. Det var bara naturens första snabba och smutsiga sätt att räkna med kött. Chips är ödet. -Bart Kosko",
    "f3sd162": "Biologi är studiet av komplicerade saker som ser ut att vara designade med ett syfte. -Richard Dawkins",
    "f3sd164": "Biologi ger dig en hjärna. Livet förvandlar det till ett sinne. -Jeffrey Eugenides",
    "f3sd165": "Inom fysiken behöver du inte gå runt och göra dig själv besvär – naturen gör det åt dig. -Frank Wilczek",
    "f3sq167": "Det som är bra med vetenskap är att det är sant oavsett om du tror på det eller inte. -Neil deGrasse Tyson",
    "f3ttw8": "Maori",
    "f477b": "Programmering är konsten att designa algoritmer och hantverket att felsöka felkod. – Ellen Ullman",
    "f5bLC": "Dokumentation",
    "f7akol": "engelsk",
    "f7cf7": "Det finns faktiskt två saker, vetenskap och åsikt; den förra föder kunskap, den senare okunnighet. – Hippokrates",
    "f814a": "När jag skrev den här koden var det bara Gud och jag som förstod vad jag gjorde. Nu är det bara Gud som knyter. – Anonym",
    "f96ff": "Innovation är drivkraften för framsteg och framgång i affärer. -Satya Nadella",
    "fBP5h": "Användarnamn",
    "fEr5j": "Skapa nytt skript",
    "fV_1P": "Logga in",
    "fa94e": "Innovation är nyckeln till att ligga före i konkurrensen. -Paul Sloane",
    "fc805": "Innovation är kreativitet med ett jobb att göra. – Tom Peters.",
    "fd3173": "Fysik är fantasi i en rak jacka. -John Moffat",
    "fdd2b": "Vetenskap är organiserad kunskap. Visdom är organiserat liv. – Immanuel Kant",
    "fdxluz": "rumänska",
    "ff02c": "Inställt",
    "fgj880": "Telugu",
    "forever-foss": "För alltid FOSS!",
    "fqV_1P": "Lås upp dina LafTools",
    "g2_aX": "Kopiera krypterade lösenord till filen",
    "g5SK9": "Öppna Senaste",
    "gDjbs": "Historisk data",
    "gK3dNQ": "Kopiera",
    "gQhfS": "Filverktyg",
    "gTOv6abWT": "Logga in",
    "gTOv6adbWT": "Registrera",
    "gU1O2": "Utlöst",
    "geHXwByxy": "inställningar",
    "generic-NI-UFPTe0": "Försköna generisk kod",
    "generic-code-beautify.desc.2b3c": "Denna operation formaterar kod i olika programmeringsspråk för att förbättra läsbarheten genom att tillämpa konsekvent indrag, radbrytningar och följa språkspecifika stilriktlinjer.",
    "giveas3tar": "Ge oss en stjärna på GitHub om du gillar LafTools.",
    "gkC8t": "Base64",
    "gkdqqC8t": "Bas 45",
    "gkqC8t": "Base32",
    "gmK3pKyRI": "{0} Högsta antal online",
    "gms7_9n5v": "Konverterar en hexadecimal bytesträng tillbaka till dess råvärde.",
    "gnKMZ": "Uppfriskad.",
    "groupnote": "PM",
    "h6AeI": "Websocket-anslutningen stängdes kl. {0}",
    "hJUMN": "Målspråk",
    "hMvh1": "Säkerhetskopiera databas",
    "hRFxV": "För mer information, besök vår hemsida",
    "hX1CWGAhl": "Indrag och förfinar eXtensible Markup Language (XML)-kod.",
    "hcnt1k": "makedonska",
    "hhOT3": "Sök efter namn",
    "htTmvWjsS": "Komprimerar CSS-kod (Cascading Style Sheets).",
    "htt1d2": "esperanto",
    "hu-iz": "Timer",
    "huE6U": "Variabel",
    "hyV-d": "Gjort",
    "hyirc0": "svenska",
    "i27qmr": "frisiska",
    "i6hMN": "Bildverifieringskod",
    "i88tb": "Exportera resultat till fil",
    "i8q8tb": "Konfigurera WorkFlow för Input",
    "iNQvo": "Visa ett exempel till att börja med.",
    "iNqF1T": "Hantera molnkonto",
    "iOEjZ": "Ingen tillgänglig kod",
    "iQL2c": "Vi undersöker fortfarande hela utbudet av funktioner för den här knappen - om du har feedback eller förslag på hur vi kan förbättra den, vänligen meddela oss!",
    "iZXig7E2JF": "LafTools erbjuder en omfattande uppsättning utvecklingsverktyg, inklusive codecs, formatterare, bildbehandlingsverktyg och lösningar för datorresurshantering. LafTools är designat för att effektivisera och förbättra ditt utvecklingsarbetsflöde och är din bästa resurs för effektiv mjukvaruutveckling av hög kvalitet.",
    "i_lang_": "Språkpaket",
    "ib135dq": "Ditt statusmeddelande kommer att visas här",
    "iknTS": "Lösenordshanteraren",
    "init_env": "Laddar systemresurser",
    "ip2g1": "Kopierade",
    "ipOSQE": "Pro Edition",
    "it8ths": "indonesiska",
    "ixyP0": "Bearbetar realtidsåtgärden automatiskt",
    "jJuNz": "Källspråk",
    "jO5eP": "OK",
    "jPNCb": "Försökte igen.",
    "jQXdi": "Ljusläge",
    "jR1zX": "AI Lab",
    "jRFk519Bj-": "Denna gemenskap drivs av ett helt internationellt gratis projekt med öppen källkod.",
    "jaj7M": "Alla rättigheter förbehållna.",
    "jb392": "namn",
    "jfpqt": "Notes Navigator",
    "jgDoEq": "Inga FAQ-data",
    "jhDoE": "Hämtar FAQ-data",
    "jlxvpk": "koreanska",
    "jr_7Y98yZ": "LafTools",
    "json-beautify.desc.0912": "Denna operation formaterar JSON-data för att förbättra läsbarheten genom att lägga till korrekt indrag, radbrytningar och sorteringsnycklar konsekvent.",
    "json-beautify.name.0912": "Formatera SQL",
    "json-beautify.text.93kq": "Försköna JSON-data",
    "k17PG": "Websocket-anslutning stängd.",
    "k2SVY": "av",
    "k2ku5p": "tjeckiska",
    "k41a5": "LafTools",
    "k4s5rx": "slovenska",
    "kLH79": "E-post",
    "kOi5A": "Skriv ut sida",
    "kPD22": "Lexikon",
    "kPJ-A4": "Uppdatera",
    "kcHxr": "Ange användarnamn för administratörskontot här",
    "kjks1": "Hämtar i18n config från lokal server API",
    "kqv5ht": "jiddisch",
    "krxSK": "AI-assistent",
    "ks12d": "Cybersäkerhet",
    "kv4wag": "holländska",
    "ky6JphiKk": "{0} Onlineanvändare",
    "l3akoa": "amhariska",
    "l6Djb": "Välj ett av alternativen som ditt föredragna tema:",
    "lDXWMq43S": "Dagens kalender",
    "lIn3_": "Admin användarnamn",
    "lQFII": "Aktivera initieringen igen",
    "lRHDQ": "Avsluta helskärmsläge",
    "lUh5c": "Generator",
    "lWqYc": "Den här webbplatsen tillhandahåller JSON-verktyg inklusive JSON till XML, JSON till CSV, JSON till YAML.",
    "lastreplyby": "Senaste svar av",
    "lkuulh": "franska",
    "lp0qmd0": "Markera den som favorit",
    "lpKAz": "inställningar",
    "lpzg83": "Samoan",
    "lzGS2": "Tilläggsdetaljer",
    "m0106": "Omvandlare",
    "m0107": "Generator",
    "m0108": "Formaterare",
    "m7WZw": "Systemets webbsocket trasig",
    "m8rTc1": "När skalskripthanteraren har implementerats kan du använda den för att hantera dina skalkommandon.",
    "mBgF1": "Musåtgärd",
    "mSFei": "Källkod på GitHub",
    "mWXeh": "Arbetsyta-ID: {0}",
    "mabHq": "Hitta gamla filer",
    "mbzCv": "Ett fel inträffade: {0}, avvisad tid är {1}",
    "md2.desc.1039": "Den här operationen hashar data till en {0}-hash.",
    "md2.text.192d3": "Generera {0} Hash",
    "md2aO2NaJITm": "Indrag och försköna CSS-kod (Cascading Style Sheets), vilket gör det lättare att läsa och förstå.",
    "md4.desc.1039": "Den här operationen hashar data till en {0}-hash.",
    "md4.text.192d3": "Generera {0} Hash",
    "md5.desc.rxsHq": "Den här operationen hashar data till en {0}-hash.",
    "md5.textiDjMIo": "Generera {0} Hash",
    "md6.desc.1039": "Den här operationen hashar data till en {0}-hash.",
    "md6.text.192d3": "Generera {0} Hash",
    "meeMC1Uk7.text.93kq": "Förminska {0}",
    "mhWk4dtid": "Kodning",
    "mihc3": "Slutförde denna operation",
    "mjHoR": "Tekniskt sett kan ingen läsa denna token annars har han/hon attackerat och kontrollerat din dator.",
    "mnb19i": "tysk",
    "mslw4o": "grekisk",
    "mwn7iv": "Zulu",
    "myxedr": "mongoliska",
    "n1jA9": "Bekräfta",
    "n24tes": "portugisiska (Brasilien)",
    "n28g4di0L": "handböcker",
    "n94an4": "putsa",
    "n98EW": "Byt text för inmatningsregion och utdataregion.",
    "nIDKbSXTw": "{0} användare",
    "nSeIq8-": "Viktigast av allt, det är gratis och öppen källkod. Du kan använda den för ditt personliga eller kommersiella syfte.",
    "nTvw4": "För att skydda och separat spara dina data och inställningar kan du använda ditt lokala konto för att uppnå det. Dessutom kommer LafTools att stödja widgets för snabbmeddelanden bland användare i framtiden.",
    "nh1W-": "Testning kan bara bevisa förekomsten av buggar, inte deras frånvaro - Edsger Dijkstra",
    "nmb1wx": "Yoruba",
    "nncQE": "Liv",
    "nodBw": "Denna operation kodar rådata till en ASCII {0}-sträng.",
    "nrix6l": "Chichewa",
    "nxJC7": "Standardåtgärden som ska utföras när transformatorn utförs.",
    "o1umzi": "franska",
    "o52xW": "Exportera",
    "o8xyzu": "Luxemburgiska",
    "oBz8D": "Läser in",
    "oNLxH": "Användarnamn",
    "oNg3f": "Officiell hemsida",
    "ocxsw3": "irländska",
    "of_ox": "Sammantaget är LafTools en enda lösning för alla dina behov.",
    "oj23X": "Återställ databas",
    "ojCWEFdVe": "Komprimerar JavaScript-kod och tar bort alla onödiga tecken.",
    "ooiFU": "Starta om Java Service",
    "oqHqVq": "Sortera efter",
    "oqHqqV": "Totalt: {0} kommandon",
    "oqHqqVq": "Kopiera tider",
    "oqjbcj": "Lao",
    "os8h6u": "danska",
    "p8Exxc1s": "Det finns olika verktyg som utnyttjar AI-teknik för att utföra uppgifter mer effektivt i AI Laboratory.",
    "pANmj": "Taggar kan definieras baserat på servertyper, skriptanvändningar eller andra kriterier du föredrar.",
    "pA_deJ": "Exportera till Urklipp",
    "pA_feeJ": "Återanslut terminalen",
    "pA_qweJ": "Rensa buffert",
    "pDBSWq": "inget tillgängligt innehåll för höger panel",
    "pEk1kk": "LafTools presenterar användbara funktioner för dig här.",
    "pEk1qkk": "Lista alla öppna flikar",
    "pHZDB": "Action i realtid",
    "pJoOz": "Öppna fil",
    "pKHRT": "Gå till Verktyg",
    "pKqHRq": "Sök i anteckningar",
    "pL6qH": "Avslutad.",
    "pNwe3": "Övrig",
    "pZ4d616m-": "Försköna {0}",
    "ph5jH": "Hanterar denna del",
    "piih4x": "tadzjikiska",
    "pmAee": "Läs mer information om detta verktyg.",
    "pmnp4b": "ukrainska",
    "ppmz8e": "haitisk kreol",
    "pqs7y3": "Vänligen överväg att registrera den här webbsidan som en PWA för att få fullt stöd för tangentbord.",
    "psA_eJ": "Exportera som fil",
    "psZoP": "Släpp filer här för att bearbeta dem",
    "psqqpq_o": "Okej, resultatet har kopierats till ditt urklipp i {0} gånger.",
    "pzn2IpkDo": "Indrag och vackra utskrifter JavaScript Object Notation (JSON)-kod.<br><br>Taggar: json viewer, prettify, syntax highlighting",
    "q0zA1kML_": "Verktygslåda online",
    "q12beqwR": "Inga tillgängliga verktyg",
    "q29t31": "putsa",
    "q3VjkLMsP": "Vänskap, utbyte, samarbete och utveckling",
    "q6K7o": "Ladda från anteckningar",
    "q9iuti": "walesiska",
    "qDrbEr": "Användarnamnet du angav är tomt, kontrollera och försök igen.",
    "qF4uS2": "Skapa arbetsyta",
    "qF4uS23": "Nytt fönster",
    "qHoktx": "Tack!",
    "qN1LdZ2": "Senast ändrad",
    "qQmBr": "Textöversättning",
    "qTqyvWdY": "Inte färdig än",
    "qWemXE4": "1 januari 2024",
    "qWw3eTH": "Den här delen hjälper till att underhålla filer på din lokala disk eller molndisk.",
    "qdeFXx": "För närvarande är den här sidan du letar efter inte helt implementerad ännu.",
    "qpDBSW": "ingen tillgänglig panel",
    "qpDBSWe1": "ingen tillgänglig panel",
    "qqK_x_": "Logga in",
    "qqqwYoz": "Hjälp",
    "qqwYoz": "Flikar",
    "qqwYqwe": "Arbetsytor",
    "qtpmvP": "Bekräfta lokalt lösenord",
    "quality-first": "Kvalitet först",
    "qubSJ": "Extension VM är inte ID. (REF: IQnMH).",
    "qzshys": "Urdu",
    "r1GLS": "Taggar",
    "rE6fUsSGl": "Indrag och försköna SQL-kod (Structured Query Language).",
    "rK6cx": "{0}, designad och utvecklad av LafTools-teamet",
    "rQkas": "Välkommen till LafTools",
    "rR1vd": "Inmatning från fil",
    "rT34qnO": "Ange text för bearbetning. Resultatet kommer att visas i utdataredigeraren.",
    "rVqlu": "Avkoda {0}",
    "rYSpwq": "Algoritmen MD2 (Message-Digest 2) är en kryptografisk hashfunktion utvecklad av Ronald Rivest 1989. Algoritmen är optimerad för 8-bitars datorer. Även om MD2 inte längre anses vara säker, även från och med 2014, är den fortfarande i offentlig användning nyckelinfrastrukturer som en del av certifikat genererade med MD2 och RSA. Algoritmen för meddelandesammandrag består, som standard, av 18 omgångar.",
    "r_n6h": "Ljus eller mörkt läge",
    "rf0mql3": "Ljus eller mörkt tema",
    "rpG0G": "Vi värdesätter din feedback och vill gärna höra dina tankar om hur vi kan förbättra vår produkt - tveka inte att dela din feedback med oss!",
    "rub76Z8zx": "Försök att snyggt skriva ut språk i C-stil som C, C++, C#, Java, PHP, JavaScript etc. Detta kommer inte att göra ett perfekt jobb, och den resulterande koden kanske inte fungerar längre. Den här operationen är enbart utformad för att göra obfuskerad eller förminskad kod lättare att läsa och förstå. Saker som inte kommer att fungera korrekt: För loopformatering, Do-While loopformatering, Switch/Case indrag, vissa bitskiftsoperatorer",
    "run_text": "Innan vi går in i din arbetsbänk vill vi först ladda de nödvändiga systemresurserna. Vänta ett tag, det kommer att slutföras snart, vars detaljer kan visas enligt nedan.",
    "rycJy": "LafTools är en mångsidig verktygslåda speciellt designad för programmerare. Den representerar den andra versionen av CodeGen Toolbox, nu med en mer lättviktig runtime skriven i Golang och JavaScript.",
    "ryhkqb": "bulgariska",
    "rzoFmjStq": "Relevanta verktyg",
    "s0vrf9": "hebreiska",
    "s4OeX": "Logga in systemet framgångsrikt",
    "sHoxxW": "Historia",
    "sO0MOe": "Varje gång du vistas i ett fönster i mer än 5 sekunder, skulle det visas här.",
    "sR8yc": "Stänga",
    "sc49my": "Sindhi",
    "sdf3160": "Teoretikers uppgift, särskilt inom biologi, är att föreslå nya experiment. En bra teori gör inte bara förutsägelser, utan överraskande förutsägelser som sedan visar sig vara sanna. -Francis Crick",
    "sdfk1": "Rulla flikarna åt vänster",
    "sdfk13": "Rulla flikarna åt höger",
    "sglMS": "Skapa tid",
    "share-this-page": "Dela denna sida",
    "sk123": "Inte färdig än",
    "slqcWD": "Den här logiska delen stöds inte ännu, håll utkik.",
    "sojBI": "Omvandling",
    "spCqEa": "ATT GÖRA",
    "spdh98": "Förenklad kinesiska",
    "ssDaOq": "Ny på LafTools?",
    "ssm80i": "baskiska",
    "str.codecs": "Codecs",
    "str.converters": "Omvandlare",
    "str.formatter": "Formatterare",
    "str.login": "Logga in",
    "str.mostused": "Mest använda",
    "str.parsers": "Parsers",
    "str.register": "Registrera",
    "str.remarks": "Favoriter",
    "str.usercentre": "Användarcenter",
    "svqh06": "azerbajdzjanska",
    "sys_updates": "Senaste systemuppdateringarna",
    "t63Qw": "Avfärda",
    "t6wczq": "Xhosa",
    "t84q1z": "armeniska",
    "t8DUz20a-": "JSON-formaterare",
    "t8c6xc": "somaliska",
    "tBIX-d": "Windows",
    "tEiv_": "Hämtar tilläggsdetaljer",
    "tIy3Q": "Påträffade ett fel",
    "tIyq3Q": "Påträffade ett fel",
    "tWe1yF": "Inget tillgängligt skalkommando.",
    "tY3p1": "Mer information",
    "tiaiB": "Annullera",
    "title-laftools": "LafTools - Den ledande allt-i-ett-verktygslådan för programmerare",
    "tn7duf": "Kroatisk",
    "ttAre": "Ange ditt lösenord i klartext här",
    "twamg": "AI-assistent, stärker din kreativitet",
    "tyhgpr": "javanesiska",
    "uCEe8": "Realtidskonvertering",
    "uFcDQ": "Initierar statusdata...",
    "uV5Bi": "Det går inte att ladda tillägget",
    "uVseB": "Tryck på {0} för att visa snabbknappslistan",
    "ucDLv": "Du har kopierat den här posten {0} gånger",
    "ui5pZ": "Kommando Parser",
    "ulah0q": "japanska",
    "unc9E": "Slumpmässig text",
    "usr_defined": "Systeminställningar",
    "uwqGE": "Gå till Verktyg",
    "v7q3db": "Thai",
    "vOjNC": "Ange lösenord eller säker nyckel",
    "vTsQU": "Ange inbjudningskod från din administratör",
    "vU17B": "Det gick inte att skicka förfrågan",
    "vWqac": "Innan vi går in i din arbetsbänk vill vi först ladda de nödvändiga systemresurserna. Vänta ett tag, det kommer att slutföras snart, vars detaljer kan visas enligt nedan.",
    "vaP0vq": "Konfigurera det lokala lösenordet framgångsrikt.",
    "vci8rd": "holländska",
    "vh9j4": "Inmatning",
    "vo1prl": "spanska",
    "vr93oi": "finska",
    "vrfjnf": "italienska",
    "w6otqn": "korsikanska",
    "w92j07": "ryska",
    "w9qudj": "Punjabi",
    "wAxtg": "Inledningsvis genererade vi ett UUID som en auktoriserad token för dig att göra den här konfigurationen. Enligt vad LafTools har tagit emot är tokenen du angav {0}, den har verifierats av LafTools och följaktligen kan du fortsätta att ställa in det här formuläret.",
    "wI1eh": "Nästa",
    "wQYoz": "Fil",
    "wQdYoz": "Redigera",
    "wQdqwYoz": "Se",
    "wcl1K": "Användande",
    "wgkk6y": "maltesiska",
    "wi28h5_S2": "Codecs",
    "wj3VS": "Denna operation avkodar data från en ASCII {0}-sträng tillbaka till sitt råformat.",
    "wsWcXd": "Aviseringar",
    "x009": "För att komma åt vår användningsdokumentation",
    "x5alzu": "kurdiska (Kurmanji)",
    "x5tHV": "System översikt",
    "xMBv0": "Laddar relaterade resurser...",
    "xOJqG1": "Vanliga frågor",
    "xPHqP": "Beskrivningen är ännu inte definierad.",
    "xQ_ls": "Backup Redis",
    "xbz0B": "Stäng alla flikar",
    "xbz0B2": "Stäng flik",
    "xdqwe": "Välkommen att använda LafTools!",
    "xeP4zV": "Visa snabbt dina TODO-föremål",
    "xeP4zVd": "Slå snabbt upp ett engelskt ordförråd.",
    "xhxY6iLDH": "Logga ut",
    "xlqtA": "Respons",
    "xml-bdeautify.desc.2a5f9": "Förminska XML-kod",
    "xml-beautify.desc.2a5f9": "Denna operation formaterar XML-data för att förbättra läsbarheten genom att lägga till korrekt indrag, radbrytningar och säkerställa välformad struktur.",
    "xs22XLF": "Ingen tillgänglig data för detta artikel-ID, överväg att välja andra objekt.",
    "y3qjdd": "Ditt lokala lösenord har verifierats.",
    "y8Ir5": "Den här delen används för att initiera ditt administratörskonto, men för närvarande finns det inget som behöver skapas eller justeras här eftersom det tidigare konfigurerades av din administratör, vänligen strunta i den här delen och fortsätt med dina resterande steg.",
    "yCsTC": "För tidig optimering är roten till allt ont.",
    "yMZW-GEgf": "Formatera XML",
    "ySVf-": "Försök igen med denna begäran",
    "yTsqFO": "Algoritmen MD4 (Message-Digest 4) är en kryptografisk hashfunktion utvecklad av Ronald Rivest 1990. Sammandragningslängden är 128 bitar. Algoritmen har påverkat senare konstruktioner, såsom MD5-, SHA-1- och RIPEMD-algoritmerna. Säkerheten för MD4 har allvarligt äventyrats.",
    "yVprb": "Denna del är fortfarande under utveckling.",
    "y_2Q1": "Koda och avkoda",
    "y_2Q2": "Symmetrisk krypto",
    "y_2Q3": "Asymmetrisk krypto",
    "y_2Q4": "Kinas nationella algoritmer",
    "y_2Q5": "Web Auth",
    "y_2Q5dqw": "Textmatchning",
    "y_9YM": "Utdata kommer att visas här.",
    "y_9YqM": "Laddar statiska resurser...",
    "y_BN6": "Sammanfattningsalgoritm",
    "ya0cwu": "malajiska",
    "yc7dqiu": "Förenklad kinesiska",
    "yfYeg": "Textmall",
    "yiRso": "Cloud Notes",
    "ykganl": "danska",
    "ymyfghy1r": "Anteckningar",
    "yqiRso": "Lokala anteckningar",
    "yqrxl4": "serbiska",
    "yznU9": "Töm träddata",
    "z-o28we": "Processpanel",
    "z0j2nf": "hindi",
    "z1oFn": "Fly och Unescape",
    "z2jzej": "Marathi",
    "z79b1a": "arabiska",
    "zN2ES": "Arbetsytor",
    "zaSKh": "Uppdatera",
    "zc3Hf": "Lösenord",
    "zjDJk": "Ange sökvägen till arbetsytans katalog",
    "zkqUFa": "{0} är inte konfigurerad ännu",
    "zkv375": "Khmer",
    "zmDWx": "Kontakta oss",
    "znVRwq": "Filer",
    "zpyd34": "engelsk",
    "zqiIoqXw": "Kör beräkningar...",
    "zwd4v": "Tilläggsdetaljer",
    "zwgYx": "Värdet för krypterat lösenord kommer att visas här.",
    "zzcepr": "Cebuano"
}