{
    "-dxG-aEe4w": "Det maximala antalet SMS-verifieringskoder som skickas idag har uppnåtts.",
    "-wHWkv2OC": "Varför kan jag inte logga in?",
    "-wdkeq": "Är det här samhället ideellt?",
    "2RbUh6TyJ": "{0} Olästa aviseringar",
    "2S_7EVIsK": "JSON Validator",
    "3I-dkqkwr": "Observera att vi INTE tillhandahåller några kommersiella utbildningskurser för engelska prov eller andra ämnen på denna webbplats, och vi planerar inte att göra det i framtiden.",
    "43be5": "Dagbok",
    "4N79HNWiA": "För att säkerställa att det är en ideell gemenskap öppnar vi också hela källkoden på GitHub, som finns i sidfoten på den här sidan.",
    "4sQWoTgfr": "Verifieringskoden har upphört att gälla. Uppdatera sidan och försök igen",
    "4sdQWoTgfr": "Verifieringskoden har upphört att gälla. Uppdatera sidan och försök igen.",
    "5pevqzFXX": "Om du också tycker att det är meningsfullt för dig att gå med oss, fortsätt att uppdatera din profil genom att klicka på knappen nedan, tack!",
    "6h14B_t4I": "Gick med idag",
    "7BtpddC": "För det andra, i den här communityn pratar vi inte om politik eller andra känsliga ämnen, och vi välkomnar naturligtvis inte spam eller reklam. Det är därför vi kräver ett giltigt telefonnummer för registrering, för att förhindra alla olagliga eller otillbörliga aktiviteter.",
    "7flKa": "LafTools - Den allsmäktige för alla proffs och ingenjörer",
    "7fldKa": "LafTools - Den ledande allt-i-ett-verktygslådan för programmerare",
    "7zqdufsdddJ": "Ja säkert. Webbplatsen ELB3.com kommer från den ideella chattgruppen WeChat, {0}, som syftar till att skapa en vänlig, ADs-fri och bekväm atmosfär för att lära sig engelska.",
    "8s1R5nChx": "Inbjudningskoden är tom, denna grupp är inte öppen för allmänheten utan begränsad till inbjudna användare.",
    "8s1dX": "Inbjudningskoden finns inte i systemet, kontrollera om det finns ett skiftlägeskänsligt problem.",
    "8sVG1RXhx": "lösenord bör vara minst 6 tecken",
    "8sVG1RdXhx": "Användar-ID finns redan",
    "8sVG1kqXhx": "Användar-ID bör bestå av minst 2 tecken",
    "8sVGdXhx": "Användar-ID bör endast innehålla bokstäver och siffror",
    "8saIR-LCjyChx": "Inbjudningskoden har gått ut",
    "8saIt5r5nGxwwChx": "Inbjudningskoden är förbrukad",
    "9YPgsPid2M": "SMS-kod",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Base64 Encoder",
    "9b_7a0sdf": "Base64-avkodare",
    "9pBpiYcCy": "För att förhindra spam och reklam kräver vi en inbjudningskod för att registrera ditt konto.",
    "BqWGnXEzV": "Stad",
    "Bz_WdwvAPn": "Kontrollera om CAPTCHA tillhandahålls korrekt.",
    "C7jECCVt9": "Värdera din tid och gör aldrig för alltid något olagligt i det här samhället.",
    "CK5NCw519": "Samhällsberättelse",
    "CQ44pYZYj": "logga in",
    "CuHqw9m": "{0} är inte ett giltigt telefonnummer, för närvarande accepterar systemet endast ett 11-siffrigt telefonnummer.",
    "Cz_qjjFw7": "Om {0}",
    "DYaOL4Yp7": "Registrera",
    "D_9sNBiZj": "Du försökte för många gånger, försök igen senare.",
    "F-D-AewqL": "Titta i efterhand med vad du har gjort nyligen. Vi kan inte uthärda något beteende som kan betraktas som trakasserier, AD eller personligt övergrepp, etc...",
    "GaySMPQHo": "Trendigt",
    "Gy45ssBPS": "Skapa nytt ämne",
    "H39ddc0df": "Försök att logga in senare om det misslyckades för många gånger.",
    "HaU4NMabv": "Verifieringskoden är felaktig, vänligen mata in eller uppdatera bilden igen.",
    "IWPP6V-tR": "Källkod",
    "Ibzs2-Ho1": "CSV-verktyg",
    "IcvP2d-QY": "Vänligen {0} eller {1} för att gå med i diskussionen",
    "IugAFc4OT": "Ett problem har uppstått när din data skickades.",
    "Jbor69IBw": "Formatterare",
    "Jf4iDTZ28": "Dessutom kan du vara säker på att vi aldrig kommer att sälja ut ditt telefonnummer eller offentliggöra det.",
    "Jfr4RzEZG": "För närvarande accepterar vi endast {0} telefonnummer för att registrera ditt konto.",
    "JuZAli3": "Användarmanual",
    "K2UEY4ddl": "Användar-ID:t innehåller ogiltiga ord. Undvik att använda {0}",
    "KAiEq6dcwL5": "Slutligen, som en vänlig påminnelse, bör varje användare ta ansvar för sina egna ord och handlingar.",
    "MnVg5i": "Hej trevligt att träffas! Det är vårt nöje att bjuda in dig till denna gemenskap.",
    "MnVqwid": "Hej, {0}. Trevligt att träffas! Det är vårt nöje att bjuda in dig till denna gemenskap.",
    "NdqZcRL2QN": "Om du har glömt ditt lösenord kan du återställa det genom att klicka på länken \"Glömt lösenord\".",
    "OBjaZqTvx": "Hem",
    "OPevedpOM": "Vad händer om jag inte har ett telefonnummer?",
    "P1zxX2IQ5": "Men för den här webbplatsen är det en härledning av den ursprungliga gruppen och inte begränsad till engelskainlärning, utan även för andra ämnen.",
    "Pu0pj23rR": "Varför krävs ett telefonnummer?",
    "RYlJHHwg3": "SMS-koden är inte korrekt.",
    "RjdigcxfV": "Kontakta oss",
    "TV09-obNr": "Milstolpe",
    "TXdh_K": "Lösenord",
    "TdXddh_wK": "Telefonnummer",
    "Te3h_wK": "Telefonnummer",
    "TqXdd3h_wK": "Telefonnummer",
    "TqXddh_K": "Verifierings kod",
    "TqXdh_K": "Bekräfta lösenord",
    "UED59zbd-": "LafTools",
    "UjkOS50wO": "Hem",
    "VndKeCfb-": "Verifiera telefon för att aktivera konto",
    "VnddCfb-": "Du är för närvarande avstängd ett tag",
    "W3M4ivK9U": "Uppdatera profil",
    "WKG7e": "Regler",
    "Wpdsp3g5U": "Välkommen till gruppen {0}!",
    "XIzgAAR": "Vanligtvis kan en tillgänglig inbjudningskod tillhandahållas från webbansvarig eller andra användare.",
    "Xddh_wK": "Inbjudningskod",
    "Y-svpKvUz": "två lösenord matchar inte",
    "Y0drdCSiu": "Ämnen",
    "Yc5uMym": "Du kanske undrar vad ELB3 står för, kort sagt, det är en förkortning för den ideella WeChat-gruppen {0} som är en intressant plattform för engelska entusiaster och examinander att lära sig och uppskatta engelskan!",
    "ZCzH8": "Nyaste",
    "ZaS8MP8cr": "Obs: Verifieringskoden är uppdaterad, justera dina formulärvärden och skriv in koden igen för att fortsätta med.",
    "aISK9iYc_": "Rapport om illegal information",
    "aUdtds_qwY": "Normalt kan du logga in med ditt användar-ID eller telefonnummer även om du har brutit mot reglerna i den här gruppen.",
    "b7wgrhuXl": "Tech",
    "b_vts": "Logga in",
    "dHWho": "Bli Medlem",
    "dldeoeqwc": "Vänliga påminnelser",
    "dnsz7fwNx": "Användar-ID är skiftlägeskänsligt.",
    "dsdfqw": "Användare finns inte",
    "dwJucRtar": "Denna del pågår fortfarande, välkommen att bidra till projektet för denna del.",
    "dzIC7qPQ": "Om du vill gå med oss ​​kan du försöka nå webbansvarig på hans e-post {0} eller WeChat-konto {1} för att få en inbjudningskod.",
    "englishcorner": "engelsk",
    "eqwee": "Lösenordet är inte korrekt",
    "fcGTPc7HP": "Var kan jag få tag på inbjudningskoden?",
    "gTOv6abWT": "Logga in",
    "gTOv6adbWT": "Registrera",
    "geHXwByxy": "inställningar",
    "gmK3pKyRI": "{0} Högsta antal online",
    "groupnote": "PM",
    "hxCMxpW6Sq": "Gick med för {0} dagar sedan",
    "iZXig7E2JF": "LafTools erbjuder en omfattande uppsättning utvecklingsverktyg, inklusive codecs, formatterare, bildbehandlingsverktyg och lösningar för datorresurshantering. LafTools är designat för att effektivisera och förbättra ditt utvecklingsarbetsflöde och är din bästa resurs för effektiv mjukvaruutveckling av hög kvalitet.",
    "jRFk519Bj-": "Denna gemenskap drivs av ett helt internationellt gratis projekt med öppen källkod.",
    "jdbef_PBl": "Mål",
    "jr_7Y98yZ": "LafTools",
    "ky6JphiKk": "{0} Onlineanvändare",
    "lEDpJMRfG": "Om du är förvirrad får du gärna meddela oss genom att skicka ett e-postmeddelande till oss.",
    "lWqYc": "Den här webbplatsen tillhandahåller JSON-verktyg inklusive JSON till XML, JSON till CSV, JSON till YAML.",
    "lastreplyby": "Senaste svar av",
    "lidydVO": "Varför är jag blockerad eller begränsad?",
    "lu2T6idPY": "Om du tror att det finns ett problem med ditt konto, kontakta webbmastern.",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "{0} användare",
    "nncQE": "Liv",
    "o4GdNzX6xS": "För det första, på grund av det välkända regelkravet på jorden, måste varje användare ange ett giltigt telefonnummer för att registrera sig.",
    "oHQNQ4mRw": "användar ID",
    "p1Jyl4uMv": "Logga ut ditt konto",
    "pNwe3": "Övrig",
    "t8DUz20a-": "JSON-formaterare",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "Välj webbplatsens språk",
    "uefFV1": "Senare",
    "ufSPh0ad": "Om det är omöjligt att registrera ditt konto via ditt nuvarande telefonnummer, kontakta webbansvarig på hans e-post {0} eller WeChat-konto {1}. Vi kan hjälpa dig att registrera ditt konto manuellt.",
    "wCcPJZK": "{0} är inte en giltig e-postadress",
    "wCctGPJZK": "{0} ska inte vara tom",
    "wi28h5_S2": "Codecs",
    "xhxY6iLDH": "Logga ut",
    "yOdwRB": "Välkommen till ELB3 Community!",
    "zr3ZBdUoT": "Användarmanual",
    "zuxd0y-kmA": "Användar-ID eller Telefonnummer har inget blanksteg."
}