{
    "-dxG-aEe4w": "รหัสยืนยันทาง SMS ถึงจำนวนสูงสุดที่ส่งในวันนี้แล้ว",
    "-wHWkv2OC": "เหตุใดฉันจึงไม่สามารถลงชื่อเข้าใช้ได้",
    "-wdkeq": "ชุมชนนี้ไม่แสวงหาผลกำไรใช่ไหม",
    "2RbUh6TyJ": "{0} การแจ้งเตือนที่ยังไม่ได้อ่าน",
    "2S_7EVIsK": "เครื่องมือตรวจสอบ JSON",
    "3I-dkqkwr": "โปรดทราบว่าเราไม่ได้จัดให้มีหลักสูตรการฝึกอบรมเชิงพาณิชย์สำหรับการสอบภาษาอังกฤษหรือการสอบวิชาอื่นๆ บนเว็บไซต์นี้ และเราไม่ได้วางแผนที่จะทำเช่นนั้นในอนาคต",
    "43be5": "ไดอารี่",
    "4N79HNWiA": "เพื่อให้แน่ใจว่าเป็นชุมชนที่ไม่แสวงหาผลกำไร เรายังเปิดซอร์สโค้ดทั้งหมดบน GitHub ซึ่งสามารถพบได้ที่ส่วนท้ายของหน้านี้",
    "4sQWoTgfr": "รหัสยืนยันหมดอายุแล้ว โปรดรีเฟรชหน้านี้แล้วลองอีกครั้ง",
    "4sdQWoTgfr": "รหัสยืนยันหมดอายุแล้ว โปรดรีเฟรชหน้านี้แล้วลองอีกครั้ง",
    "5pevqzFXX": "หากคุณคิดว่ามันมีความหมายสำหรับคุณที่จะเข้าร่วมกับเรา โปรดอัปเดตโปรไฟล์ของคุณต่อไปโดยคลิกที่ปุ่มด้านล่าง ขอบคุณ!",
    "6h14B_t4I": "เข้าร่วมวันนี้",
    "7BtpddC": "ประการที่สอง ในชุมชนนี้ เราไม่พูดเกี่ยวกับการเมืองหรือหัวข้อที่ละเอียดอ่อนอื่น ๆ และแน่นอนว่าไม่ต้อนรับสแปมหรือการโฆษณา นั่นคือเหตุผลที่เราต้องการหมายเลขโทรศัพท์ที่ถูกต้องสำหรับการลงทะเบียน เพื่อป้องกันกิจกรรมที่ผิดกฎหมายหรือไม่เหมาะสม",
    "7flKa": "LafTools - ผู้ทรงอำนาจสำหรับมืออาชีพและวิศวกรทุกคน",
    "7fldKa": "LafTools - กล่องเครื่องมือ All-In-One ชั้นนำสำหรับโปรแกรมเมอร์",
    "7zqdufsdddJ": "ใช่แน่นอน. เว็บไซต์ ELB3.com มาจากกลุ่มแชท WeChat ที่ไม่แสวงหาผลกำไร {0} ซึ่งมีเป้าหมายเพื่อสร้างบรรยากาศการเรียนรู้ภาษาอังกฤษที่เป็นมิตร ปราศจากโฆษณา และสะดวกสบาย",
    "8s1R5nChx": "รหัสคำเชิญว่างเปล่า ชุมชนนี้ไม่เปิดให้สาธารณะ แต่จำกัดเฉพาะผู้ใช้ที่ได้รับเชิญ",
    "8s1dX": "รหัสคำเชิญไม่มีอยู่ในระบบ โปรดตรวจสอบว่ามีปัญหาแบบคำนึงถึงตัวพิมพ์เล็กและตัวพิมพ์ใหญ่หรือไม่",
    "8sVG1RXhx": "รหัสผ่านควรมีอย่างน้อย 6 ตัวอักษร",
    "8sVG1RdXhx": "มีรหัสผู้ใช้อยู่แล้ว",
    "8sVG1kqXhx": "ID ผู้ใช้ควรมีอย่างน้อย 2 ตัวอักษร",
    "8sVGdXhx": "ID ผู้ใช้ควรมีเฉพาะตัวอักษรและตัวเลขเท่านั้น",
    "8saIR-LCjyChx": "รหัสคำเชิญหมดอายุแล้ว",
    "8saIt5r5nGxwwChx": "รหัสเชิญถูกใช้หมดแล้ว",
    "9YPgsPid2M": "รหัส SMS",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "เอ็มดี5",
    "9b_7a0fqwe": "ตัวเข้ารหัส Base64",
    "9b_7a0sdf": "ตัวถอดรหัส Base64",
    "9pBpiYcCy": "เพื่อป้องกันสแปมและการโฆษณา เราจำเป็นต้องมีรหัสเชิญเพื่อลงทะเบียนบัญชีของคุณ",
    "BqWGnXEzV": "เมือง",
    "Bz_WdwvAPn": "ตรวจสอบว่าให้ CAPTCHA อย่างถูกต้องหรือไม่",
    "C7jECCVt9": "ให้คุณค่ากับเวลาของคุณและไม่เคยทำอะไรที่ผิดกฎหมายในชุมชนนี้ตลอดไป",
    "CK5NCw519": "เรื่องราวของชุมชน",
    "CQ44pYZYj": "เข้าสู่ระบบ",
    "CuHqw9m": "{0} ไม่ใช่หมายเลขโทรศัพท์ที่ถูกต้อง ขณะนี้ระบบยอมรับหมายเลขโทรศัพท์ 11 หลักเท่านั้น",
    "Cz_qjjFw7": "เกี่ยวกับ {0}",
    "DYaOL4Yp7": "ลงทะเบียน",
    "D_9sNBiZj": "คุณพยายามหลายครั้งเกินไป โปรดลองอีกครั้งในภายหลัง",
    "F-D-AewqL": "ย้อนกลับไปดูสิ่งที่คุณได้ทำเมื่อเร็วๆ นี้ เราไม่สามารถทนต่อพฤติกรรมใดๆ ที่อาจถือเป็นการคุกคาม โฆษณา หรือการละเมิดส่วนตัว ฯลฯ...",
    "GaySMPQHo": "กำลังมาแรง",
    "Gy45ssBPS": "สร้างหัวข้อใหม่",
    "H39ddc0df": "ลองลงชื่อเข้าใช้ในภายหลังหากล้มเหลวหลายครั้งเกินไป",
    "HaU4NMabv": "รหัสยืนยันไม่ถูกต้อง โปรดป้อนใหม่หรือรีเฟรชรูปภาพ",
    "IWPP6V-tR": "รหัสแหล่งที่มา",
    "Ibzs2-Ho1": "เครื่องมือ CSV",
    "IcvP2d-QY": "โปรด {0} หรือ {1} เพื่อเข้าร่วมการสนทนา",
    "IugAFc4OT": "เกิดปัญหาขณะส่งข้อมูลของคุณ",
    "Jbor69IBw": "ฟอร์แมตเตอร์",
    "Jf4iDTZ28": "นอกจากนี้ โปรดมั่นใจได้ว่าเราจะไม่ขายหมายเลขโทรศัพท์ของคุณหรือเปิดเผยต่อสาธารณะอย่างแน่นอน",
    "Jfr4RzEZG": "ขณะนี้เรายอมรับเฉพาะหมายเลขโทรศัพท์ {0} เพื่อลงทะเบียนบัญชีของคุณ",
    "JuZAli3": "คู่มือผู้ใช้",
    "K2UEY4ddl": "ID ผู้ใช้มีคำที่ไม่ถูกต้อง โปรดหลีกเลี่ยงการใช้ {0}",
    "KAiEq6dcwL5": "สุดท้ายนี้ เพื่อเป็นการเตือนใจที่เป็นมิตร ผู้ใช้แต่ละคนควรรับผิดชอบต่อคำพูดและการกระทำของตนเอง",
    "MnVg5i": "สวัสดี ยินดีที่ได้รู้จัก! เรามีความยินดีเป็นอย่างยิ่งที่จะเชิญคุณเข้าสู่ชุมชนนี้",
    "MnVqwid": "สวัสดี {0} ยินดีที่ได้รู้จัก! เรามีความยินดีเป็นอย่างยิ่งที่จะเชิญคุณเข้าสู่ชุมชนนี้",
    "NdqZcRL2QN": "ในกรณีที่คุณลืมรหัสผ่าน คุณสามารถรีเซ็ตได้โดยคลิกลิงก์ 'ลืมรหัสผ่าน'",
    "OBjaZqTvx": "บ้าน",
    "OPevedpOM": "จะทำอย่างไรถ้าฉันไม่มีหมายเลขโทรศัพท์?",
    "P1zxX2IQ5": "แต่สำหรับเว็บไซต์นี้ถือเป็นที่มาจากกลุ่มดั้งเดิมและไม่จำกัดเฉพาะการเรียนภาษาอังกฤษแต่รวมถึงหัวข้ออื่นๆ ด้วย",
    "Pu0pj23rR": "เหตุใดจึงต้องมีหมายเลขโทรศัพท์?",
    "RYlJHHwg3": "รหัส SMS ไม่ถูกต้อง",
    "RjdigcxfV": "ติดต่อเรา",
    "TV09-obNr": "เหตุการณ์สำคัญ",
    "TXdh_K": "รหัสผ่าน",
    "TdXddh_wK": "หมายเลขโทรศัพท์",
    "Te3h_wK": "หมายเลขโทรศัพท์",
    "TqXdd3h_wK": "หมายเลขโทรศัพท์",
    "TqXddh_K": "รหัสยืนยัน",
    "TqXdh_K": "ยืนยันรหัสผ่าน",
    "UED59zbd-": "ลาฟทูลส์",
    "UjkOS50wO": "บ้าน",
    "VndKeCfb-": "ยืนยันโทรศัพท์เพื่อเปิดใช้งานบัญชี",
    "VnddCfb-": "ขณะนี้คุณถูกแบนมาระยะหนึ่งแล้ว",
    "W3M4ivK9U": "อัพเดตโปรไฟล์",
    "WKG7e": "กฎ",
    "Wpdsp3g5U": "ยินดีต้อนรับสู่ชุมชน {0}!",
    "XIzgAAR": "โดยปกติแล้ว ผู้ดูแลเว็บหรือผู้ใช้รายอื่นสามารถให้รหัสเชิญที่มีอยู่ได้",
    "Xddh_wK": "รหัสการเชิญ",
    "Y-svpKvUz": "รหัสผ่านสองอันไม่ตรงกัน",
    "Y0drdCSiu": "หัวข้อ",
    "Yc5uMym": "คุณอาจสงสัยว่า ELB3 ย่อมาจากอะไร พูดสั้นๆ ก็คือกลุ่ม WeChat ที่ไม่แสวงหากำไร {0} ซึ่งเป็นแพลตฟอร์มที่น่าสนใจสำหรับผู้ที่ชื่นชอบภาษาอังกฤษและผู้เข้าสอบเพื่อเรียนรู้และชื่นชมภาษาอังกฤษ!",
    "ZCzH8": "ใหม่ล่าสุด",
    "ZaS8MP8cr": "หมายเหตุ: รหัสยืนยันได้รับการรีเฟรชแล้ว โปรดปรับค่าแบบฟอร์มของคุณและป้อนรหัสอีกครั้งเพื่อดำเนินการต่อ",
    "aISK9iYc_": "รายงานข้อมูลที่ผิดกฎหมาย",
    "aUdtds_qwY": "โดยปกติ คุณสามารถลงชื่อเข้าใช้ด้วย ID ผู้ใช้หรือหมายเลขโทรศัพท์ของคุณได้สำเร็จ แม้ว่าคุณจะละเมิดกฎในชุมชนนี้ก็ตาม",
    "b7wgrhuXl": "เทค",
    "b_vts": "เข้าสู่ระบบ",
    "dHWho": "ลงชื่อ",
    "dldeoeqwc": "การแจ้งเตือนที่เป็นมิตร",
    "dnsz7fwNx": "ID ผู้ใช้ต้องตรงตามตัวพิมพ์เล็กและตัวพิมพ์ใหญ่",
    "dsdfqw": "ไม่มีผู้ใช้อยู่",
    "dwJucRtar": "ส่วนนี้ยังอยู่ในระหว่างดำเนินการ ยินดีร่วมสนับสนุนโครงการในส่วนนี้",
    "dzIC7qPQ": "หากคุณต้องการเข้าร่วมกับเรา โปรดติดต่อผู้ดูแลเว็บทางอีเมล {0} หรือบัญชี WeChat {1} เพื่อรับรหัสเชิญ",
    "englishcorner": "ภาษาอังกฤษ",
    "eqwee": "รหัสผ่านไม่ถูกต้อง",
    "fcGTPc7HP": "ฉันจะรับรหัสเชิญได้ที่ไหน?",
    "gTOv6abWT": "เข้าสู่ระบบ",
    "gTOv6adbWT": "ลงทะเบียน",
    "geHXwByxy": "การตั้งค่า",
    "gmK3pKyRI": "{0} จำนวนออนไลน์สูงสุด",
    "groupnote": "บันทึก",
    "hxCMxpW6Sq": "เข้าร่วมเมื่อ {0} วันที่แล้ว",
    "iZXig7E2JF": "LafTools นำเสนอชุดโปรแกรมอรรถประโยชน์การพัฒนาที่ครอบคลุม รวมถึงตัวแปลงสัญญาณ ฟอร์แมตเตอร์ เครื่องมือประมวลผลภาพ และโซลูชันการจัดการทรัพยากรคอมพิวเตอร์ ออกแบบมาเพื่อปรับปรุงขั้นตอนการพัฒนาของคุณ LafTools เป็นแหล่งข้อมูลสำหรับการพัฒนาซอฟต์แวร์ที่มีประสิทธิภาพและมีคุณภาพสูง",
    "jRFk519Bj-": "ชุมชนนี้ขับเคลื่อนโดยโครงการโค้ดโอเพ่นซอร์สระดับสากลฟรี",
    "jdbef_PBl": "เป้าหมาย",
    "jr_7Y98yZ": "ลาฟทูลส์",
    "ky6JphiKk": "{0} ผู้ใช้ออนไลน์",
    "lEDpJMRfG": "หากคุณสับสน โปรดแจ้งให้เราทราบโดยส่งอีเมลถึงเรา",
    "lWqYc": "เว็บไซต์นี้มีเครื่องมือ JSON รวมถึง JSON ถึง XML, JSON ถึง CSV, JSON ถึง YAML",
    "lastreplyby": "ตอบล่าสุดโดย",
    "lidydVO": "เหตุใดฉันจึงถูกบล็อคหรือถูกจำกัด?",
    "lu2T6idPY": "หากคุณคิดว่าบัญชีของคุณมีปัญหา โปรดติดต่อผู้ดูแลเว็บ",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "{0} ผู้ใช้",
    "nncQE": "ชีวิต",
    "o4GdNzX6xS": "ประการแรก เนื่องจากข้อกำหนดด้านกฎระเบียบที่รู้จักกันดีในโลก ผู้ใช้แต่ละคนจะต้องระบุหมายเลขโทรศัพท์ที่ถูกต้องเพื่อลงทะเบียน",
    "oHQNQ4mRw": "รหัสผู้ใช้",
    "p1Jyl4uMv": "ออกจากระบบบัญชีของคุณ",
    "pNwe3": "อื่น",
    "t8DUz20a-": "JSON ฟอร์แมตเตอร์",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "เลือกภาษาของเว็บไซต์",
    "uefFV1": "ภายหลัง",
    "ufSPh0ad": "หากเป็นไปไม่ได้ที่จะลงทะเบียนบัญชีของคุณผ่านหมายเลขโทรศัพท์ปัจจุบันของคุณ โปรดติดต่อผู้ดูแลเว็บทางอีเมล {0} หรือบัญชี WeChat {1} เราสามารถช่วยเหลือคุณในการลงทะเบียนบัญชีของคุณด้วยตนเอง",
    "wCcPJZK": "{0} ไม่ใช่อีเมลที่ถูกต้อง",
    "wCctGPJZK": "{0} ไม่ควรเว้นว่าง",
    "wi28h5_S2": "ตัวแปลงสัญญาณ",
    "xhxY6iLDH": "ออกจากระบบ",
    "yOdwRB": "ยินดีต้อนรับสู่ชุมชน ELB3!",
    "zr3ZBdUoT": "คู่มือผู้ใช้",
    "zuxd0y-kmA": "ID ผู้ใช้หรือ PhoneNumber ไม่มีช่องว่าง"
}