{
    "15424": "Bilimin bütün sorunu budur. Hayal edilemeyecek derecede harika şeyleri tanımlamaya çalışan bir grup ampiristiniz var. – Bill Watterson",
    "15999": "Yenilik, yerleşik bir şeyde değişiklik yapma sürecidir. -İnovasyon Tanımlama Ekibi",
    "16987": "Bazen haftanın geri kalanını Pazartesi günkü kodun hatalarını ayıklamakla geçirmek yerine Pazartesi günü yatakta kalmak daha mantıklıdır. – Dan Salomon",
    "19775": "Bilim bir yaşam biçimidir. Bu bir perspektiftir. Bilim, kesin, öngörücü ve güvenilir bir şekilde bizi kafa karışıklığından anlayışa götüren süreçtir; bunu deneyimleyecek kadar şanslı olanlar için güçlendirici ve duygusal bir dönüşümdür. –Brian Greene",
    "38127": "Test, kodu kırmaya çalışma sürecidir - Anonim",
    "42641": "Web geliştirme zordur, ancak o zaman bunu yapmak eğlencelidir. Sadece standartlarınızı belirlemeniz gerekiyor. Kolay olsaydı bunu kimse yapar mıydı? -Olawale Daniel",
    "46367": "İnovasyon, büyüme potansiyelinin kilidini açmanın anahtarıdır. -Ömer İşrak",
    "57225": "İnovasyon, gelişen bir işletmenin can damarıdır. -Michael Dell",
    "63470": "Gerçek bir bilim adamı sorunları çözer, çözülemez olduklarından yakınmaz. – Anne McCaffrey",
    "66187": "Konuşma ucuz. Bana kodu göster. -Linus Torvalds",
    "68518": "Yazılım ve katedraller hemen hemen aynı; önce onları inşa ediyoruz, sonra dua ediyoruz.",
    "77528": "Yenilik, ilerlemenin arkasındaki itici güçtür. -John F. Kennedy",
    "80972": "Elbette kötü kod temizlenebilir. Ama çok pahalı. — Robert C. Martin",
    "85805": "Uzman, çok dar bir alanda yapılabilecek tüm hataları yapmış kişidir. – Neils Bohr",
    "92941": "Gerçek dünyada gerçek şiir vardır. Bilim gerçekliğin şiiridir. - Richard dawkins",
    "": "Mesaj: {0}",
    "-8l11": "Kopyalandı",
    "-DqwwR": "Operasyon Tamamlandı.",
    "-GJ_72": "Seçilen {0} çalışma alanına geçildi",
    "-Jx4J": "Yerel Hesap",
    "-Rj3y": "Temalar",
    "-XZnW": "Geri",
    "-Yo129I": "Metin Araçları",
    "-nL_B5PoN": "{0}'ı sıkıştırır",
    "00d36": "Geleceği tahmin etmenin en iyi yolu onu icat etmektir. -Alan Kay",
    "01do0y": "Kannadaca",
    "04SSf": "Parolanızı mı unuttunuz?",
    "07naT": "Hata: {0}",
    "07ui6": "Daha fazla bilgi",
    "0Ceqru": "Base64, insanlar tarafından rahatlıkla kullanılabilen ve bilgisayarlar tarafından işlenebilen sınırlı bir sembol kümesi kullanarak rastgele bayt verilerini kodlamaya yönelik bir gösterimdir.",
    "0MO3jj": "MD5 (Message-Digest 5) yaygın olarak kullanılan bir karma işlevidir. Çeşitli güvenlik uygulamalarında kullanılmıştır ve ayrıca dosyaların bütünlüğünü kontrol etmek için de yaygın olarak kullanılır. Ancak MD5 çarpışmaya dayanıklı değildir ve SSL/TLS sertifikaları veya bu özelliğe dayanan dijital imzalar gibi uygulamalar için uygun değildir.",
    "0PgZ_": "Tercüme",
    "0YKce": "İkili Kodlu Ondalık (BCD) dizeyi ondalık sayıya dönüştürür.",
    "0a310": "Bilime giden muhteşem bir yol yoktur ve yalnızca dik yolların yorucu tırmanışından korkmayanlar onun aydınlık zirvelerine ulaşma şansına sahiptir. - Karl Marx",
    "0a710": "İnovasyon herhangi bir organizasyonun can damarıdır. -Dr. R. L. Bhatia",
    "0ba15": "Başarılı inovasyon, hesaplanmış riskler almayı gerektirir. -Harvard Pruden",
    "0e299": "Yapılana kadar her şey teorik olarak imkansızdır. – Robert A. Heinlein",
    "0gvcN": "Genel bakış sayfasına hoş geldiniz, halen geliştirilme aşamasındadır.",
    "0gywa": "Çalışma alanı bulunamadı. Çalışma alanı dizin sayfasına yönlendirileceksiniz.",
    "0pfdz7": "Özbekçe",
    "114ee": "Şiir gibi kodlamalar kısa ve öz olmalıdır. – Santosh Kalwar",
    "13pmE": "Bizi destekle",
    "149c0": "Bilim meselelerinde bin kişinin otoritesi, tek bir bireyin alçakgönüllü muhakemesine değmez. - Galileo Galilei",
    "1507oa": "Bengalce",
    "1883d": "Bilim, hayal gücünü klasiklerden çok daha fazla teşvik eder. – J. B. S. Haldane",
    "188cd": "Programlama, program yazarak öğrenilir. -Brian Kernighan",
    "18f46": "Roketler harika. Bundan kaçış yok. -Elon Musk",
    "1JOFP": "Çalışma Alanımı Aç",
    "1NTgQ": "Çalışma Alanını Aç",
    "1Npez": "Lütfen yolu belirtin",
    "1Tuab": "Kopyalandı",
    "1X8x7": "Örnek",
    "1Xe82x7": "{0} Küçült",
    "1Xe8wx7": "Altıgen Dize",
    "1Xe8x7": "{0} Güzelleştir",
    "1Xe8x7qe": "BCD",
    "1YmJc": "Tercih ettiğiniz dil olarak seçeneklerden birini seçin:",
    "1a3Sc": "Yüklemeyi İptal Et",
    "1a8b9": "Bilim insanı doğru cevapları veren değil, doğru soruları soran kişidir. – Claude Levi-Strauss",
    "1bd": "İş akışı",
    "1d71a": "Belirli bir anda, belirli bir yerde doğarız ve yıllanmış şaraplar gibi, doğduğumuz yılın ve mevsimin niteliklerine sahibiz. Astroloji bundan daha fazlasını iddia etmez. - Carl Jung",
    "1da5a": "İnovasyon, modern iş dünyasında ilerlemenin ve başarının temelidir. -Larry Page",
    "1e3e5n": "Hausa",
    "1ff27": "Bilim, bir bilgisayara açıklayabilecek kadar iyi anladığımız şeydir; sanat geri kalan her şeydir. – Donald E. Knuth",
    "1h6jH": "Uyarı, çıktı, uzunluğu sıfır olan boş bir değerdir!",
    "1j62a": "Bunu başka zaman yap",
    "1jj0ri": "Japonca",
    "1k_44": "Bu işlem, bir ASCII Base64 dizesindeki verilerin kodunu çözerek ham formatına geri döndürür.",
    "1th2nw": "Sinhala",
    "1yIQu": "İşleminizi yeniden işlemeyi deneyebilir veya hatayı gidermek için aşağıdaki düğmeyi tıklayabilirsiniz.",
    "20nmcv": "Latince",
    "22XLF": "Henüz bitmedi",
    "22f3a": "Yenilik, ekonomik refahın temel meselesidir. – Michael Porter",
    "23f61": "İnovasyon sadece iyi bir fikre sahip olmakla ilgili değildir; bu fikri gerçeğe dönüştürmekle ilgili. -Erik Qualman",
    "24vLI": "Oluşturuldu",
    "277a9": "Bilim doğanın nihai gizemini çözemez. Bunun nedeni, son tahlilde, bizlerin de çözmeye çalıştığımız gizemin bir parçası olmamızdır. – Max Planck",
    "27ef9": "İnovasyon, fikirleri faturalara dönüştürme yeteneğidir. -L. Duncan",
    "27j7sy": "Şona",
    "2D9a6": "Parolanızı mı unuttunuz?",
    "2D9qdk6": "Yeterince Güvenli mi?",
    "2IF6A": "Görünüşe göre sahte depolama alanında bir sorunla karşılaşılıyor",
    "2JyFN": "Sonucu Panoya Kopyala",
    "2Ocbey": "Sürüm",
    "2RhAT": "Görünüşe göre sahte alma işleminde bir sorunla karşılaşılıyor",
    "2Ruh6": "Yeni Yerel Hesap Oluştur",
    "2S5ap": "Tam Ekran Modunu Değiştir",
    "2S_7EVIsK": "JSON Doğrulayıcı",
    "2Y1mR": "Metni Temizle",
    "2b7f7": "Evrenin akıllı yaşamla dolu olduğundan eminim. Buraya gelmek çok akıllıcaydı. – Arthur C. Clarke",
    "2bqHk": "Dosyadan yükle",
    "2e4fb7": "İbo",
    "2giYv": "Test Şifresi: {0}",
    "2khdsv": "Peştuca",
    "2lehqwp": "Vietnam",
    "2lhcqwp": "Türkçe",
    "2lhqqwp": "Endonezya dili",
    "2lhqqwqp": "Malayca",
    "2lhqwwp": "Tay dili",
    "2qdin8": "Lütfen doğrulama kodunu giriniz",
    "2tib5m": "İsveççe",
    "2ybu7j": "Norveççe",
    "30eo2v": "Gujarati dili",
    "321e0": "Hata ayıklama, ilk etapta kodu yazmaktan iki kat daha zordur. Bu nedenle, eğer kodu mümkün olduğu kadar akıllıca yazarsanız, tanımı gereği hata ayıklamak için yeterince akıllı değilsinizdir. - Brian W. Kernighan",
    "32D9a6": "Bir hesap oluşturun",
    "32c8d": "Eğer hata ayıklama, hataları giderme süreciyse, programlama da onları yerleştirme süreci olmalıdır. – Sam Redwine",
    "33RXi": "İstek, yetersiz parametreler nedeniyle reddedildi.",
    "33aa4": "Bilim yalnızca saf deneyciliktir ve yöntemi gereği metafiziği dışlar. – Steve Martin",
    "346qid": "Rusça",
    "380da": "Günümüzde programlama, daha büyük ve daha iyi aptallara dayanıklı programlar oluşturmaya çalışan yazılım mühendisleri ile daha büyük ve daha iyi aptallar üretmeye çalışan Evren arasındaki bir yarıştır. Şu ana kadar Evren kazanıyor. -Rick Cook",
    "394b6": "Eğer bilimin kesin olduğunu düşündüyseniz? yani bu sadece senin yaptığın bir hata. -Richard Feynman",
    "398cc": "Programcılar dünyayı değiştiriyor gibi görünüyor. Bu konuda bir şeyler bilselerdi, hem onlar hem de hepimiz için bir rahatlama olurdu. – Ellen Ullman",
    "39dsCt": "Varsa uygulama hizmetlerinden en son bildirimi alırsınız.",
    "3d297": "Bilimin sevdiğim yanı, öğrendikçe gerçek anlamda yanıt alamamanızdır. Daha iyi sorular alırsınız. - Yeşil John",
    "3ii2tt": "İskoç Galcesi",
    "3umnB": "Bilinmeyen jeton",
    "40b7f": "Uzun vadede kazanmanın tek yolu inovasyondur. -Jeff Immelt",
    "420b0": "Başarılı inovasyon, işbirliğine ve açık iletişime bağlılık gerektirir. -Rachel D.Ellison",
    "43be5": "Günlük",
    "43e45": "Hukukun olmadığı kanundan başka kanun yoktur. – John Archibald Wheeler",
    "441oja": "Gürcüce",
    "44Ntqw-": "Operasyonu yürütmek.",
    "45cb0": "İnovasyon sadece yeni fikirler yaratmak değil, aynı zamanda bunları başarıyla hayata geçirmektir. -Arun Pandit",
    "46bksi": "Litvanyalı",
    "4K_vhq": "Bu sekmeyi çoğalt",
    "4PIqD": "Kod incelemesi",
    "4UYIJ": "Henüz tamamlanmadı.",
    "4cGA_": "Sistem tercihleri ​​için veriler alınıyor...",
    "4cf03": "Aslında sayı olarak bilinebilecek her şey; çünkü bir şeyi akılla kavramak, akıl olmadan onu tanımak imkansızdır. – Philolaus",
    "4d389": "İnovasyon başarılı girişimci için bir yaşam biçimidir. -John Rampton",
    "4da84": "Programcıların sanatçı olduğunu düşünmüyor olabilirsiniz ancak programlama son derece yaratıcı bir meslektir. Mantık temelli yaratıcılıktır. – John Romero",
    "4kKe4": "Şifreniz",
    "4tqb4x": "Macarca",
    "4vdfwf": "TAMAM",
    "4wlih": "İstek, yetersiz parametreler nedeniyle reddedildi.",
    "52OiQ": "{0} kez kopyalandı",
    "532fd": "İnovasyon, değişimi bir tehdit olarak değil, bir fırsat olarak görebilme yeteneğidir. -Steve Jobs",
    "54cwb": "Sistem Websocket API'si bir hatayla karşılaştı: {0}",
    "56ibcj": "Vietnam",
    "57eaa": "Bizler oldukça ortalama bir yıldızın küçük bir gezegeninde yaşayan gelişmiş bir maymun türüyüz. Ama Evreni anlayabiliyoruz. Bu bizi çok özel kılıyor. - Stephen Hawking",
    "58HQX": "Değerini bilmiyorsanız, daha fazla ayrıntı için lütfen yöneticinizle iletişime geçin; bu bilgiyi onun ayarlarında bulabilirsiniz.",
    "58c03": "Yenilik, herhangi bir işletmenin başarısında önemli bir faktördür. -Ravi Venkatesan",
    "58c5f": "İlk başta başarılı olamazsanız, buna sürüm 1.0 adını verin. - Khayri R.R. Woulfe",
    "59f7d": "Yenilik, ilerlemenin ve büyümenin katalizörüdür. -John Donahoe",
    "5BOhl": "Davet Kodu",
    "5Ih2u": "Araçlar Gezgini",
    "5NCPT": "Karanlık Mod",
    "5NJeGsu1": "E-Posta ile gelen kutunuzu kolayca düzenleyebilir, mesaj oluşturup gönderebilir ve yazışmalarınızı takip edebilirsiniz. Şu ana kadar sadece kullanıcılar ve ekibimiz arasında bir iletişim aracı olarak kullanılmaktadır.",
    "5NJeddqGsu1": "Bu bölüm bilgisayar materyallerini, wiki makalelerini, kullanım kılavuzlarını ve daha fazlasını içerir.",
    "5NJedqddqGsu1": "Bu bölüm kendi projelerinizi oluşturmak için kullanılabilecek bilgisayar kaynaklarını içerir.",
    "5Perd": "Üzgünüz, 'Akıllı Düzenleyiciyi Kullan' işlevi henüz kullanılamıyor. Halen uygulamaya koymaya çalışıyoruz. Sabrınız için teşekkürler.",
    "5ZBYR": "Geri",
    "5a8a1": "İnovasyon, bir fikrin alınıp gerçeğe dönüştürülmesi sürecidir. -Kevin O'Leary",
    "5dF7o": "Yenile",
    "5db54": "Bilim, coşku ve hurafe zehrinin en büyük panzehiridir. – Adam Smith",
    "5eXVS": "Komut Dosyası İçeriği",
    "5ggegx": "Koreli",
    "5lW8qp": "Bu araç için bir örnek göster",
    "5q-Zxqa": "Komut Dosyası Yöneticisi",
    "5qPOJL": "LafTools'u desteklemek için GitHub'daki depomuza yıldız vermeyi veya aylık abonelik yoluyla profesyonel sürümümüze yükseltmeyi düşünün. Yardımınızdan büyük mutluluk duyacağız ve toplanan fonlarla LafTools'un daha da iyi olacağına söz veriyoruz.",
    "5qV5Sf": "Bu kaydı listeden kaldır",
    "5rg5mt": "Madagaskarca",
    "5srFq": "LafAraçlar",
    "5v8jl7": "Hmong",
    "626bf": "Ne yaptığımızı bilseydik buna araştırma denmezdi değil mi? - Albert Einstein",
    "63d47": "Kalite, programcılar ve testçiler arasındaki çatışmanın bir ürünüdür. – Yegor Bugayenk",
    "662f9": "Sadece bir kez yaşarsın ama eğer doğru yaparsan bir kez yeter. - Cankurtaran yeleği",
    "66ef1": "İyi kod, kendisinin en iyi belgeleridir. Bir yorum eklemek üzereyken kendinize şu soruyu sorun: 'Bu yoruma gerek kalmayacak şekilde kodu nasıl geliştirebilirim? ' -Steve McConnell",
    "66f12": "Bilim organize bilgidir. Bilgelik organize yaşamdır. – Will Durant",
    "6AumW": "Varsayılan aksiyon",
    "6ClPV": "Yaratmak",
    "6MrfIfGc6": "Kodu Küçült",
    "6UICxHzVR.name": "{0}'ı güzelleştir",
    "6a0da": "Soru sorma sanatı ve bilimi tüm bilgilerin kaynağıdır. – Thomas Berger",
    "6cOPZ": "İkili Kodlu Ondalık (BCD), her ondalık basamağın genellikle dört veya sekiz olmak üzere sabit sayıda bit ile temsil edildiği, ondalık sayıların ikili kodlaması sınıfıdır. Bazen bir işaret için özel bit desenleri kullanılır",
    "6hsnqWe": "LafTools ücretsiz ve açık kaynak olmasına rağmen bakımı hala önemli miktarda zaman ve enerji gerektirir. Özellikle belirli bulut API'lerinin ödemesini yapmak için fona ihtiyacımız var. LafTools'u takdir ediyorsanız lütfen bizi desteklemeyi düşünün.",
    "6j13s3": "İzlandaca",
    "6qT9d-N": "Dizüstü bilgisayar için LafTools yalnızca kabuk komutları yöneticisi sağlamakla kalmıyor, aynı zamanda yakın gelecekte MarkDown, Latex, {0} vb. gibi güçlü not araçlarını da ekleyecek.",
    "6ulj8i": "Nepalce",
    "6wdtJ4vmg.name.0912": "{0}'ı küçült",
    "6yOXx": "Bilinmeyen isim",
    "71L3OI9T7": "Barışı incelemek, işbirliğini teşvik etmek ve kalkınmayı aramak günümüzün teması haline geldi.",
    "71x7x": "GitHub'daki Kaynak Kodu",
    "72bee": "Harika bir programcı değilim; Ben sadece harika alışkanlıkları olan iyi bir programcıyım. -Kent Beck",
    "74a91": "Test etmek başarısızlığa, başarısızlık ise anlamaya yol açar. - Burt Rutan",
    "74f90": "Bugünün bilimi yarının teknolojisidir. –Edward Teller",
    "7714b": "İnovasyon, yeni fırsatların kilidini açmanın ve büyümeyi artırmanın anahtarıdır.",
    "79f2d": "Çoğu iyi programcı programlamayı para almayı veya halktan övgü almayı bekledikleri için değil, programlamanın eğlenceli olduğu için yapar. – Linus Torvalds",
    "7MOO1": "Kayıt olmak",
    "7affb": "Dünya bizi beklemeyecek. Eğer yetişemezsek teknolojik devrim bizi geride bırakacak. – Kofi Annan",
    "7c59e": "Tecrübe, herkesin kendi yanlışlarına verdiği isimdir. - Oscar Wilde",
    "7d4e4": "İnovasyon, işleri yapmanın yeni ve daha iyi yollarını bulmakla ilgilidir. -Jim Rohn",
    "7dm0d8": "Geleneksel çince",
    "7e19d": "Karışıklık programlamanın bir parçasıdır. - Felienne Hermans",
    "7flKa": "LafTools - Tüm Profesyoneller ve Mühendisler için Her Şeye Gücü Yeten",
    "7g5w22": "Norveççe",
    "7k56u3": "Galiçyaca",
    "7q40W": "Yönetici başlatılamıyor",
    "7u4vzu": "Slovak",
    "7x3f6": "Sekme - 1",
    "8259a": "Programcı: Kahveyi koda dönüştüren bir makine. – Anonim",
    "82r0C": "YAPILACAKLAR listenizi yönetin ve işlerinizi daha verimli bir şekilde halledin.",
    "83dNp": "Uzantı Kimliği Yüklenemiyor. (REF: 1dl1f)",
    "850c1": "Bilim adamı yalnızca iki şeyi, yani doğruluğu ve samimiyeti empoze eder, bunları hem kendisine hem de diğer bilim adamlarına empoze eder. - Erwin Schrödinger",
    "8582b": "Kullanıcıların yazılımımızı beğenmesini istiyorsak onu sevimli bir insan gibi davranacak şekilde tasarlamalıyız. – Alan Cooper",
    "8692e": "Matematikten tamamen habersiz, İncil'in kendi amaçlarına uyacak şekilde çarpıtılmış bir kısmına dayanarak benim hipotezimi kınamaya cesaret eden pek çok geveze var. Onlara değer vermiyorum ve asılsız yargılarını küçümsüyorum. – Nicholas Kopernik",
    "886d1": "Olası tüm bilimsel sorular cevaplansa bile hayatın sorunlarına hâlâ hiç dokunulmadığını düşünüyoruz. -Ludwig Wittgenstein",
    "8LdRj": "Genel Bakış",
    "8LdRjq": "Hesapla",
    "8LdevRj": "Hizmet",
    "8M1wY": "Yerel Terminal",
    "8OqB7hN1s": "Bu sayfa, LafTools için daha yüksek düzeyde bir soyutlama olan LafTools için bir IDE UI stili sağlar.",
    "8c224": "Hangi iş alanına girmek isterseniz isteyin en az bir programlama dilini öğrenmek büyük önem taşıyor. -Ram Ray",
    "8e5d0": "İnovasyon geleceğin çağrısıdır. – Kofi Annan",
    "8eeL1Kk": "Hakkında",
    "8mn_qa": "Veriler terminal hizmetlerinden alınıyor...",
    "8qzWJu": "Üzgünüz, şu anda henüz küçük ekranlı cihazları desteklemiyoruz, lütfen bu sayfayı ziyaret etmek için PC'yi kullanın.",
    "90b5e": "Bu bir hata değil; bu belgelenmemiş bir özelliktir. - Anonim",
    "91f08": "Teknolojinin en iyi yanı, vizyonunuza konsantre olmanıza ve makineleri unutmanıza olanak sağlamasıdır. – John Landis",
    "9251d": "İnovasyon, herhangi bir şirketin uzun vadede başarılı olabilmesinde önemli bir faktördür. -Elon Musk",
    "92b29": "İnovasyon, yaratıcı bir fikrin alınıp ticari başarıya dönüştürülmesi sürecidir. -Richard Branson",
    "9334e": "Yaşamanın en büyük zaferi hiç düşmemek değil, her düştüğümüzde ayağa kalkabilmektir. - Nelson Mandela",
    "9412b": "Öncelikle sorunu çözün. Daha sonra kodu yazın. – John Johnson",
    "9469a": "Herkes bilgisayar programlamayı öğrenmeli çünkü bilgisayar sana nasıl düşüneceğini öğretir. – Steve Jobs",
    "97um9v": "Hawaii dili",
    "98KcL": "Ondalık sayıyı İkili Kodlu Ondalık Sayıya (BCD) dönüştürür.",
    "98d3f": "Bilim işe yarayan bir sihirdir. – Kurt Vonnegut",
    "9Xv8-": "Not Olarak Kaydet",
    "9YPgsPid2M": "SMS Kodu",
    "9_qaj": "Bu Formdan Çık",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Base64 Kodlayıcı",
    "9b_7a0sdf": "Base64 Kod Çözücü",
    "9cb71": "İnovasyon, müşteriler için değer yaratmak ve onların yaşamlarını iyileştirmekle ilgilidir. -Reed Hastings",
    "9d18a": "İyi bir donanıma sahip olduğunuzda yazılım cennetten gelir. – Ken Olsen",
    "9e4fcl": "Tamilce",
    "9eZHM": "Hata! Görünüşe göre bazı uyarılar veya hatalarla karşılaşıyoruz.",
    "9gqo8x": "Letonca",
    "9m85mf": "Sesotho",
    "9qy1xn": "Portekizce",
    "9tbbkt": "Fince",
    "9zCSc": "Kullanılabilir çalışma alanı yok",
    "A69UZ": "Değişkenler",
    "AVUvu": "Base62, insanlar tarafından rahatlıkla kullanılabilen ve bilgisayarlar tarafından işlenebilen kısıtlı bir sembol kümesi kullanarak rastgele bayt verilerini kodlamaya yönelik bir gösterimdir. Yüksek sayı tabanı, ondalık veya onaltılık sisteme göre daha kısa dizelerle sonuçlanır.",
    "AW9N8": "Giriş Bölgesi",
    "AfPC0": "Düz metin şifreniz",
    "Ahrjc": "Dizin mevcut değil, oluşturmak istiyor musunuz?",
    "AkXgF": "Devam Ediyor: %{0}",
    "Apx8D": "Şifrenizi Manuel Olarak Nasıl Sıfırlayabilirsiniz?",
    "AvsWiJHLZ": "Kaynaklar",
    "B-GCloBBt": "Genişletilebilir İşaretleme Dili (XML) kodunu sıkıştırır.",
    "B0s0z": "Bu sayfanın amacı:",
    "BGd7P9": "Bu işlem ham verileri bir ASCII Base64 dizesine kodlar.",
    "BGd7dP9": "Bu işlem ham verileri bir ASCII {0} dizisine kodlar.",
    "BGdd7dP9": "Bu işlem ham verileri bir ASCII {0} dizisine kodlar.",
    "BJbgR": "Problemi şikayet et",
    "BQs6go-dk": "Windows, Linux ve macOS için LafTools'u ücretsiz indirin.",
    "BShq3M": "Sorunlar",
    "BW3bpT": "Dosya diskten okunuyor...",
    "Bd9h-": "Favori koleksiyonuma ekle",
    "BuihG": "Sistem ayarları",
    "C3L9MmdDU7": "El Kitabı",
    "CASef": "Tamam, operasyon tetiklendi.",
    "CEv8B": "Bu kaydı kaldıracağınızdan emin misiniz? Cevabınız evet ise bu düğmeye tekrar tıklayın.",
    "CFg8B": "Boyut 0 ile 512 arasında olmalıdır",
    "CK5NCw519": "Topluluk Hikayesi",
    "CVUl0": "LafAraçlar",
    "CWoqhy": "Seçilen KategoriID'ye göre Dahili Liste",
    "C_qzLO7yw": "En iyi deneyim için lütfen Chrome, Firefox veya Edge'i kullanın.",
    "CfZAX": "Dosya {0} Seçildi, onu çekirdek hizmete yüklüyoruz.",
    "CidOqAZ": "LafTools'un yaratıcısı olarak bizi desteklemeye istekli olmanızdan çok etkilendim. Ekibimizde LafTools'u sürekli olarak geliştirmek için çok çalışan iyi insanlar var.",
    "Cide2w": "Eyleminizi gerçekleştirirken herhangi bir sorun olup olmadığını görmek için.",
    "CqFdiBu6M": "Görüş",
    "Cz_qjjFw7": "{0} hakkında",
    "DIQFq": "Lütfen URL parametresinin doğru şekilde sağlanıp sağlanmadığını kontrol edin; bu formu doldurma izniniz yok gibi görünüyor. Varsayılan olarak, hizmet yeni başlatıldığında çıktısında aşağıdaki mesajı görebileceksiniz.",
    "DIweGq": "LafTools'unuzu Güvenceye Alın",
    "DSEtLTxUU": "Zaman hayatınızın para birimidir, onu akıllıca harcayın.",
    "DTTPW": "Durumu sıfırla",
    "DVoKw": "Bu Sistemden Çıkış Yapın",
    "DadYp": "Gerçek Zamanlı Geri Dönme",
    "DqFI5": "Düzeyler 0'dan büyük olmalıdır",
    "DrXAq": "LafTools'u kullanmaya hoş geldiniz!",
    "DrbEr": "Girdiğiniz şifre boş, lütfen kontrol edip tekrar deneyin.",
    "DtlAc": "Sistem Kaynakları Yükleniyor",
    "Dxlw0": "Tamamlamak",
    "E62ej": "Kabuk Komutlarını Filtrele",
    "E6F9B": "İş akışına ekleyin",
    "EEQkeW": "MD6 (Message-Digest 6) algoritması bir kriptografik karma işlevidir. Çok uzun girdiler için karmaların muazzam paralel hesaplanmasına izin vermek için Merkle ağacı benzeri bir yapı kullanır.",
    "EO6Qv5dCA": "JSON kodunu küçültür, JSON kodunuzun paket boyutunu azaltır.",
    "ERK7E": "LafTools'u kullanırken herhangi bir sorunla karşılaşırsanız veya herhangi bir öneriniz varsa, lütfen istediğiniz zaman EMail veya GitHub aracılığıyla bizimle iletişime geçmekten çekinmeyin; bunu acilen geliştirmeye hazırız.",
    "EgBXL": "Etiketleri seçin veya sağlayın.",
    "Ewvgo": "Henüz başlamadı.",
    "ExqvX": "Kısayol Tuşları Listesi",
    "Eyq856": "Henüz işimiz bitmedi; kendimizi en yeni ve en iyi özellikleri sunmaya adadık ve mümkün olan en iyi deneyimi yaşamanızı sağlamak için güncellemeler yayınlamaya devam edeceğiz.",
    "Ezsn81tfc": "Görüş",
    "F-OUm": "LafTools için Hızlı Kurulum",
    "F0CCF": "Kısayol Tuşları Listesi",
    "F4uS2": "Yeni dosya",
    "FAQ": "Sıkça Sorulan Sorular",
    "FBVyc": "Lütfen doğrulama kodunu tekrar girin",
    "FDlRI": "Bu yeni sekmeye bir ad verin ve onaylamak için tıklayın.",
    "FLsbFsOZq": "IDE",
    "FOyHW": "Her Yerde Ara",
    "FQzhg": "Boş Girişi Yoksay",
    "FYRoL": "Basamaklı Stil Sayfaları (CSS) kodunu girintiler ve güzelleştirir.",
    "FhVWl": "Şifrenizi Şifreleyin",
    "FjYbR": "Çıktı",
    "Fv-zz": "Sonucu Kopyala",
    "Fy217": "Bu Aracı Yapılandır",
    "Fzp3t": "Lütfen bu alana değer girin",
    "G2dvTUljF": "Aletler",
    "G3MJN": "Çıktı Panelini Göster",
    "G9QVo": "Sekmeleri Yönet",
    "GR7jK": "Tip",
    "GaySMPQHo": "Trend olan",
    "Ggob_": "İptal etmek",
    "H-Ae75": "Lütfen yerel şifrenizi doğrulayın.",
    "H-qA75": "Lütfen yerel şifreyi girin.",
    "H8fQ4": "Açık veya Koyu Moda Geç",
    "HEAhr": "Çeviriden sonra sonuç burada görünecektir.",
    "HIc3c": "Tamamlanmış",
    "HNDat": "Değişiklik yapmak için lütfen \"{0}\" düğmesini tıklayın. Aksi takdirde değişikliklerinizi uygulamak için \"{1}\" düğmesini tıklayın. Bu araç kutusuyla iyi vakit geçirmenizi dilerim!",
    "Hflf2": "Siber güvenlik açısından, sistem tarafından korunan dosyayı manuel olarak güncellemediğiniz sürece şifrenizin API'ler veya buradaki sayfalar aracılığıyla sıfırlanmasına yardımcı olmayacağız.",
    "HjvV3": "Diskteki dosyalarını silmeyeceğiz, sadece bu kaydı listeden kaldıracağız.",
    "HyIC_": "Eğik Çizgi Tuşu (/)",
    "HyIC_d": "Eğik Çizgi Tuşu (/)",
    "I8FLi": "Şimdi yöneticinizi ayarlamanın zamanı geldi; lütfen şifreyi olabildiğince karmaşık ayarlayın, böylece bu kaba saldırganların kafasını karıştırabilirsiniz.",
    "IAC0A": "Arama araçları",
    "ICefi": "İptal edildi",
    "IEFy5k39X": "Jeneratörler",
    "IKqqATS": "Geçerli Sayfa Verilerini Yenile",
    "IOOrz": "(Sisteminize zararlı olur mu? Biz öyle düşünmüyoruz, sistem tarafından korunan yapılandırma dosyasını değiştirebildiğiniz sürece, bu, LafTools veri dosyalarıyla ilgili her şeyi okuma hakkına sahip olduğunuz anlamına gelir.)",
    "IWPP6V-tR": "Kaynak kodu",
    "IWUH5": "Örneği Göster",
    "IaSyO": "İptal etmek",
    "Ibzs2-Ho1": "CSV Araçları",
    "IfsGO": "Favoriler",
    "IfsdGO": "Favoriler",
    "ImUmf": "Yeni",
    "IugAFc4OT": "Verileriniz gönderilirken bir sorun oluştu.",
    "IxAJswoSh": "Geçerli JavaScript kodunu ayrıştırır ve güzel bir şekilde yazdırır. Ayrıca JavaScript Nesne Gösterimi (JSON) ile de çalışır.",
    "J-3KA": "Lütfen bu komut dosyası için daha yararlı olabilecek bir ad girin.",
    "J164i": "Örneğin. Dosyaları uzak sunucuya kopyalayın",
    "J2xoL": "Lütfen şu hataya bakın: {0}",
    "JA_Bp": "Lütfen ilk önce yeni etiket için bir ad girin.",
    "JQEVK": "Kod",
    "JQLmS": "Boyutu ayarlandı",
    "JQLmSq": "Tamamlanmış.",
    "JTBRh": "LafTools şifre değerini yerel dosyada sakladı, ancak endişelenmeyin, Tek yönlü şifre şifreleme mekanizmasını benimsedik, yani hiç kimse düz metin sürümünün şifresini okuyamaz. Şifrenizi sıfırlamak için lütfen aşağıdaki araçları takip ederek şifrenizi manuel olarak sıfırlayın.",
    "JYqxz2": "LafTools'a hoş geldiniz, bu içeriden öğrenilen bir sürümdür.",
    "Jbor69IBw": "Biçimlendiriciler",
    "JdqiUE8": "Bu işlem, bir ASCII dizesindeki verileri (seçtiğiniz bir alfabeyle, ön ayarlar dahil) ham biçimine geri çözer.",
    "JdqidUE8": "Bu işlem, bir ASCII dizesindeki verileri (seçtiğiniz bir alfabeyle, ön ayarlar dahil) ham biçimine geri çözer.",
    "JfFHw": "Çalışma Alanı Bilgi Talebi Alma",
    "JiUE8": "Bu işlem, bir ASCII {0} dizesindeki verilerin kodunu çözerek ham biçimine geri döndürür.",
    "Jq7x3Igk0": "İstemci Kullanıcı Arayüzü Stilini Deneyin",
    "JuZAli3": "Kullanıcı Kılavuzu",
    "K1qJZI": "LafTools'a hoş geldiniz Ekselansları.",
    "KGS2-": "Yukarıdaki adımları tamamladıktan sonra yeni şifrenizi kullanarak sisteminize giriş yapabilirsiniz. Dosya sistemine erişemediyseniz lütfen yöneticinizden veya BT desteğinizden bu dosyayı oluşturmasını isteyin. Dosya zaten mevcutsa, onu silin ve yenisini yeniden oluşturun.",
    "KIc63": "İşlev henüz desteklenmiyor",
    "KYh1N": "Tüm Notlar",
    "KcqrRr": "Referans",
    "KcrRr": "Kod Uygulama Verilerini Alma",
    "KmEUF": "Mevcut sistem araçlarına hızlı bir genel bakış sağlayın.",
    "Kw4OJr": "terminal",
    "Kyd9H": "GitHub'daki Kaynak Kodu",
    "L-p-Y": "Geçerli kabuk komutunun içeriğini panoya kopyalayın",
    "L3zEM": "Örneği Göster",
    "L42mxa": "Lütfen kaynak metninizi bu alana girin.",
    "L49kCq": "LafTools'unuzu güvence altına almak için lütfen bu formda kilit şifresini sağlayın ve onaylayın.",
    "L71q_N": "Girdiğiniz şifre boş, lütfen kontrol edip tekrar deneyin.",
    "L9bQku": "{0} kodunu çöz",
    "L9qbQku": "{0} kodunu çöz",
    "LAc1m": "Uygulama görünümü yenilendi.",
    "LFdvM": "Giriş yapmadınız",
    "LM715": "Yerel sunucu API'sinden i18n yapılandırmasını alma",
    "LPJrV": "Sonucu Kopyala",
    "LSohY6eZW": "Hex String, boşluk, virgül, noktalı virgül veya iki nokta üst üste olabilen bir sınırlayıcıyla ayrılmış onaltılık baytlardan oluşan bir dizedir.",
    "LU9Jj": "Base85 (Ascii85 olarak da bilinir), rastgele bayt verilerini kodlamak için kullanılan bir gösterimdir. Base64'ün kullanılması genellikle daha verimlidir. Bu işlem, bir ASCII dizesindeki verilerin kodunu çözer (seçtiğiniz bir alfabeyle, ön ayarlar dahil). Base85, Adobe'nin PostScript ve PDF dosya formatlarında yaygın olarak kullanılır.",
    "LWaeFqd": "Tercih ettiğiniz dile geçin",
    "Le71_N-": "Girdiğiniz şifre onaylanan şifreyle aynı değil, lütfen kontrol edip tekrar deneyin.",
    "LnJ4H": "Yerel hesabın web sitemizdeki kayıtlı kullanıcıyla tamamen aynı olmadığını, ilkinin yalnızca PC'nizde tanımlandığını, ikincisinin ise bulut senkronizasyonu için kullanılabileceğini unutmayın.",
    "LqWaFd": "Sistem ayarları",
    "LxaEFHbfa": "SQL kodunu küçültür, SQL kodunuzun paket boyutunu azaltır.",
    "M3qytc": "{0}'ı kodlayın",
    "M3ytc": "{0}'ı kodlayın",
    "M4ywN1": "Hesap Makinesi, Takvim, Saat, Hava Durumu ve daha fazlası.",
    "M6MrW": "İyi",
    "M7jct": "Tam Ekran Moduna Girin",
    "MN2lT": "Şifrenin uzunluğu 6'dan az olamaz",
    "Ma5mv": "Araç çubuğu sekmelerinin görünürlüğünü değiştirin",
    "Mq9pdpT": "Seçtiğiniz işlevsel menüyle ilgili tüm kaynakları listeleyin.",
    "Mq9ppT": "Hizmetlerinizin durumunu hızlı bir şekilde görüntüleyin",
    "Mqq9pdpT": "LafTools'u kullanmaya başlamanıza yardımcı olur.",
    "MrgmU": "Onaylamak",
    "NMLOn": "FilePath'i kopyala",
    "NMLOn1": "Çalışma Alanını Aç",
    "NNfJo": "Dosyadan Veri Yükle",
    "Nq1IR": "Uzantı VM'si Yüklenemiyor",
    "Nqc0LqwX": "Bu süreçte bir güvenlik açığı olduğunu düşünüyorsanız lütfen istediğiniz zaman EMail veya GitHub aracılığıyla bizimle iletişime geçmekten çekinmeyin, bunu acilen geliştirmek istiyoruz.",
    "NrQc8OJfZ": "JavaScript Nesne Gösterimi (JSON) kodunu sıkıştırır.",
    "O02-W": "Yüklenmiyor...",
    "O94Yx": "Açık",
    "OBjaZqTvx": "Ev",
    "OO0qPN": "Örnek Yüklendi",
    "OQWm4": "Hata Bildir",
    "OSHOI": "Sayfaya hoşgeldiniz",
    "OSqZQM": "Yerel Şifre",
    "OeO0PeN": "Tamam, örnek giriş düzenleyicisinde görüntüleniyor.",
    "OeOQY": "YAPMAK",
    "Ol1ZcWomT": "{0} Güzelleştir",
    "OpPFe": "LafTools'u beğendiyseniz lütfen arkadaşlarınızla paylaşın ve bize bir yıldız verin, teşekkürler!",
    "Opcty": "Dosyalar",
    "OqqGx2qg": "Statik kaynaklar yükleniyor, lütfen bekleyin...",
    "OrCt5": "Çalışma tezgahına yönlendiriliyorum...",
    "Ot6EP": "Lehçe Araçları",
    "OyZLZokUQ": "LafTools ile Gelişimi Güçlendirin!",
    "P4ROa": "Çıkış Bölgesi",
    "PM_N5": "Oturum - {0}",
    "PUxuU": "Dil paketleri için veriler alınıyor...",
    "PapkF": "LafTools hakkında herhangi bir sorunuz veya öneriniz varsa lütfen bize bildirmekten çekinmeyin. Her zaman ürünümüzü geliştirmenin ve kullanıcılarımıza mümkün olan en iyi deneyimi sunmanın yollarını arıyoruz. Work7z@outlook.com adresinden bizimle iletişime geçebilirsiniz. LafTools'u kullandığınız için teşekkür ederiz!",
    "PpCHA": "Soru Anahtarı(?)",
    "PqazM-": "Öncelikle şifrenizi şifrelemek için lütfen aşağıdaki form kontrollerini kullanın.",
    "QL9Sn": "Şu anda bir açıklama mevcut görünmüyor.",
    "QLKzF": "Hem acemi hem de deneyimli geliştiricilerin ihtiyaçlarını karşılayan özelliklerle doludur ve bu da onu her programcının cephaneliğinde bulunması gereken bir araç haline getirir.",
    "QM2Ob": "En Yeni Araçlar",
    "QM2Oq": "Son Notlar",
    "QRAdA": "ingilizceden Çinceye",
    "QZK58Gemi": "Yapılandırılmış Sorgu Dili (SQL) kodunu sıkıştırır.",
    "QhdpH": "Topluluk Sürümü",
    "QkJ-TOduip6z_": "LafTools IDE",
    "QvBKp9BBp": "LafTools'un geliştirme planlaması hakkında daha fazla bilgi edinin.",
    "QzlA3": "Bir hata oluştu",
    "R12bq": "Gösterilmeyen sekmeleri listeleyin",
    "RNBze0": "Aletler",
    "RNeBze0": "Açılan Sekmeler",
    "RNewBze0": "Araç Yapılandırması",
    "RO4ZP": "Bir hata oluştu",
    "RPVRl": "Bu uzantının LafTools'un mevcut sürümüyle uyumlu olmadığı anlaşılıyor. Lütfen bu uzantıyı desteklemek için en son sürümü yüklemeyi düşünün veya GitHub'da bir sorunu dile getirerek bizimle iletişime geçmekten çekinmeyin.",
    "RhqzcdD": "Sistem ayarları",
    "RjCO3": "Çalışma Alanı Listesi",
    "RjdigcxfV": "Bize Ulaşın",
    "S4MMV": "Hata! Dosyayı yüklerken bazı sorunlar bulduk.",
    "SAnnQ": "{0} dosyası yükleniyor",
    "SBsDz": "Yönetici Hesabınız için Kurulum.",
    "SGs7B": "LafTools'unuzu Hızla Kurun",
    "SMqD13": "Filtrelemek için girin",
    "SPem9": "Bu alan henüz hazır değil.",
    "SQAw7": "Kaynak dil",
    "SYSq1": "Örnek",
    "SZgXb": "Yerel Parolayı Ayarlayın",
    "SdGcT": "Diğer bölüm",
    "Sm9tq": "Lütfen hesap şifrenizi buraya girin",
    "Sm9tqq": "Lütfen LafTools'unuzun kilidini açmak için şifre girin",
    "Spcfdee": "Açık veya Koyu Mod",
    "TBPqy7": "Dil",
    "TD7DA": "Diller",
    "TNoePE": "LafTools Bulutu",
    "TV09-obNr": "Dönüm noktası",
    "Ttrqqet": "Düşüncelerinizi buraya yazın ve kaydedin!",
    "TwFcr": "Hedef dil",
    "TyqvWY3": "Yerel dosya",
    "U2ZNl": "Wikipedia'da daha fazla bilgi edinin",
    "U4qqq9": "Bu sekmeyi listeden kaldır",
    "U7zP2": "Lütfen hesap kullanıcı adını buraya girin",
    "UED59zbd-": "LafAraçlar",
    "UF_Dp": "Bir Hata oluştu: {0}, reddedilen zaman: {1}",
    "UVvJp-vtF": "{0} Küçült",
    "UZ2Ig": "Yeni Yerel Hesap",
    "Ugpng": "Favori",
    "UjkOS50wO": "Ev",
    "V2A74ySoN": "Görüş",
    "V6U_f": "Kullanım Şartları",
    "V6XEO": "Kullanıcı adını veya E-posta adresini girin",
    "VAZq8r": "Geliştiricilerin, komut dosyalarını çalıştırma, paketleri yükleme ve dosya sisteminde gezinme gibi çeşitli komutları düzenleyicinin içinden yürütmesine olanak tanır.",
    "VEfeqZG": "Notlar",
    "VI6VT": "Tarih",
    "VOsZc": "Rapor bildir",
    "VSZ": "Yeniden tetiklemek için tıklayın",
    "VZtqg6": "Yeni Komut Dosyası Formu Oluştur",
    "Vaf2y": "Sekme adı boş olamaz.",
    "VeY9K": "Kullanım Şartları",
    "VgG5y": "Uzantınızın durumunu yenilemek için burayı tıklayın",
    "VjZCv": "Gerçek Zamanlı Dönüşüm",
    "Vvt09V2Qo": "Genel Kod",
    "WFUWzv_px": "Geçerli JavaScript kodunu ayrıştırır ve güzel bir şekilde yazdırır. Ayrıca JavaScript Nesne Gösterimi (JSON) ile de çalışır.",
    "WKG7e": "Tüzük",
    "WPrTW": "Resmi internet sitesi",
    "WXo6D": "Yenilendi",
    "WYCVL": "Hızlı ayar",
    "X4L_Z": "Uzantı VM'si sağlanmadı.",
    "X6Fq4j": "Yıllar süren özel geliştirme ve iyileştirmelerden sonra, LafTools'un iş akışınıza daha fazla kolaylık ve verimlilik getirerek programlama deneyiminizi önemli ölçüde geliştirebileceğinden eminiz.",
    "XKpI0": "Metninizi giriş bölgesinde işlemek için tıklayın",
    "XLWoR": "Tercih ettiğinizi seçin ve devam edin",
    "XQxJB": "Çalışma Alanlarım",
    "X_HGx": "LafTools, çeşitli ihtiyaçları karşılamak üzere tasarlanmış çok yönlü bir araç kutusudur. Tamamen açık kaynaklı olup şeffaflık ve güvenlik sağlar. Hafif çalışma süresine rağmen ARMv8 de dahil olmak üzere tam platform desteği ve ChatGPT'ye benzer yerel AI desteği sunar. LafTools, üretken bir kullanıcı arayüzü ile son derece entegre edilmiştir ve yeni araçlarla sürekli olarak güncellenmektedir. Web üzerinden ve Docker ile birlikte kullanılabilir ve notlar ve kılavuzlar gibi ek kaynaklar sağlar.",
    "XeXF77": "Ayarlar",
    "XikdD": "Bir dakika lütfen, neredeyse geldik!",
    "Y5GAC": "Kullanıcı adınızı",
    "Y9mQ2": "Lütfen hesap kullanıcı adını buraya girin",
    "YAAU3q": "Yerel Şifre",
    "YHCjT": "LafTools küresel açık ve koyu temayı destekler; özellikle gece vardiyası kodlayıcıları için kullanışlıdır.",
    "YNwKz": "Desteklenmeyen dil: {0}, varsayılan olarak İngilizce kullanılacaktır.",
    "YOYTp": "Hızlı ayar",
    "YPPPL": "Araç çubuğu sekmelerinin görünürlüğünü değiştirin",
    "YQN9u": "{0} yüklenirken bir hata oluştu, lütfen aşağıdaki ayrıntıları kontrol edin.",
    "Y__Zb1_4Q": "Gereksiz tüm karakterleri kaldırarak Basamaklı Stil Sayfaları (CSS) kodunu küçültür.",
    "Y_k0z": "Parolanızı mı unuttunuz?",
    "Ye3TXses": "Giriş metni değiştirildiğinde dönüşümün otomatik olarak yürütülüp yürütülmeyeceğini yapılandırmak için.",
    "Ylq2X": "Hata düzeltme",
    "YquQqTXq": "Otomatik Çalıştır?",
    "YrTdq": "Tüm",
    "YrVq683": "Posta",
    "YrVqdd683": "Kılavuzlar",
    "Z2QTU": "Hakkında",
    "Z3rhY": "İleti",
    "Z7ALO": "Seçilen çalışma alanına geçildi",
    "Z7OTt": "Seçtiğiniz dosya çok büyük, lütfen 30 MB'tan küçük bir dosya seçin.",
    "ZAGva": "Bu çalışma alanını sildiğinizden emin misiniz?",
    "ZAKaFq": "Bulut Hesabım",
    "ZCzH8": "En yeni",
    "ZW1Dgz": "Mevcut Mesaj Yok",
    "ZXRGC": "Lütfen şu hataya bakın: {0}",
    "ZaS8MP8cr": "Not: Doğrulama kodu yenilendi, lütfen form değerlerinizi ayarlayın ve devam etmek için kodu yeniden girin.",
    "ZbD3F": "{0}, LafTools ekibi tarafından hazırlandı",
    "Zk7JI": "Henüz desteklenmiyor",
    "ZrbduC": "Tüm Sekmeleri Kapat",
    "ZrbuC": "Sekmeyi Kapat",
    "_5OqeG": "İşaretini kaldır",
    "_LFF3": "LafTools'u kullanırken herhangi bir sorunla karşılaşırsanız veya herhangi bir öneriniz varsa, lütfen istediğiniz zaman EMail veya GitHub aracılığıyla bizimle iletişime geçmekten çekinmeyin; bunu geliştirmeye hazırız.",
    "_trez": "Metni Değiştir",
    "_trqL": "Sistem kaynakları için veriler alınıyor...",
    "_z3lR": "Kodu Yenile",
    "a0ab0": "Sanat hayat ağacıdır. Bilim ölüm ağacıdır. -William Blake",
    "a2849": "Bilim, neyin işe yaradığının kabul edilmesi, neyin işe yaramadığının reddedilmesidir. Bu sandığımızdan daha fazla cesaret gerektiriyor. – Jacob Bronowski",
    "a3508": "Beş duyuyla donatılmış insan, etrafındaki evreni keşfeder ve bu maceraya Bilim adını verir. – Edwin Hubble",
    "a3yqoz": "Farsça",
    "a3z-3k12": "IP Adresi Araçları",
    "a4jbpq": "Çek",
    "a5354": "Sadece olağanüstü insan yapımı keşiflerin daha sonra bu kadar kolay ve basit görünmesi garip. –George C. Lichtenberg",
    "a7062": "Yenilik, ilerlemeyi ateşleyen kıvılcımdır. -Robyn M. D'Angelo",
    "a8a34": "İnovasyon geleceğin kartvizitidir. -Anna Eshoo",
    "a8dd9": "Yaşamın rastgele bir başlangıcı olamaz... Sorun şu ki, yaklaşık 2000 enzim var ve bunların tamamını rastgele bir denemede elde etme şansı, 10 üzeri 40.000'de sadece bir parça; tüm evren bu durumla yüzleşemeyecek kadar küçük bir olasılık. organik çorbadan oluşuyordu. –Fred Hoyle",
    "aCkOP": "çıkış",
    "aHAfR": "{0} için veriler getiriliyor...",
    "aISK9iYc_": "Yasa Dışı Bilgi Raporu",
    "aSOpr": "Veri Modeli Oluşturucu",
    "aa2f1": "Keşif, ne yaptığınızı bilmediğinizde yaptığınız şeydir. Bilim adamlarının her gün yaptığı şey budur. Bir bilim adamı ne yaptığını zaten biliyor olsaydı hiçbir şey keşfedemezdi çünkü ne yaptıklarını zaten biliyorlardı. – Neil deGrasse Tyson",
    "aa3a4": "Kod mizah gibidir. Açıklamak zorunda kaldığınızda bu kötüdür. – Cory Evi",
    "ab5f7": "Şu anda hayatın en üzücü yanı, bilimin bilgiyi toplumun bilgeliği toplamasından daha hızlı toplamasıdır. - Isaac asimov",
    "about_LafTools_toolbox": "LafTools Hakkında",
    "ac615": "Çalıştırın, doğru yapın, hızlı yapın. – Kent Beck",
    "adcca": "Herhangi bir aptal bir bilgisayarın anlayabileceği kodu yazabilir. İyi programcılar insanların anlayabileceği kodlar yazarlar. -Martin Fowler",
    "adpgq": "Yeni çalışma alanı oluştur",
    "af3158": "Her şey üzerinde kontrolümüz olmayan güçler tarafından belirleniyor. -Albert Einstein",
    "afcb9": "Hayatta gözlemlediğiniz her şeyi sistematik ve gerçek anlamda araştırma yeteneği kadar zihninizi genişletecek hiçbir şey yoktur. – Marcus Aurelius",
    "afe52": "Her zaman düzeltilmesi gereken bir hata daha vardır. – Ellen Ullman",
    "ah-C4": "Yeni Not",
    "aj3nhd": "Almanca",
    "aked6": "Referanslar",
    "aked61": "giriiş",
    "asElV": "Kaldırmak",
    "az4uS2": "Bu sistemden çıkış yaptığınızdan emin misiniz? Giriş sayfasına yönlendirileceğinizi unutmayın.",
    "azpNX": "Tamamlanmış.",
    "azsd": "hızlı navigasyon",
    "b0qjSL": "Lütfen {1} dizinine girin ve bir {2} dosyası oluşturun, şifrelenmiş şifrenizi dosya içeriğinin tamamına koyun.",
    "b194e": "İnovasyon müşteriden değil üreticiden gelir. -W. Edwards Deming",
    "b19bb": "Bilim, fiziksel olmayan olguları incelemeye başladığı gün, on yıl içinde var olduğu önceki tüm yüzyıllarda olduğundan daha fazla ilerleme kaydedecektir. - Nikola Tesla",
    "b2724": "Programlama, başka bir insana bilgisayarın ne yapmasını istediğini söyleme sanatıdır. –Donald Ervin Knuth",
    "b4603": "Hayat, sen başka planlar yapmakla meşgulken başına gelenlerdir. — John Lennon",
    "b5014": "Hayattaki çoğu başarısızlık, başarıya ne kadar yaklaştıklarını fark edemeyen insanlardan pes etmelerinden kaynaklanmaktadır. – Thomas A. Edison",
    "b6sx9b": "Filipinli",
    "b7wgrhuXl": "Teknoloji",
    "bP_6qG": "Şifrenizi Unutmak İçin İpuçları",
    "bT4R6": "Yeni sekme",
    "bVlBN": "Çince'den İngilizce'ye",
    "bWQunyU10": "Yapay Zeka Laboratuvarı",
    "bc574": "İnovasyon sağlıklı bir işletmenin can damarıdır. -Mark Küba",
    "bc92f": "Başarılı inovasyon müşteri ihtiyacıyla başlar. -Michael Dell",
    "be-Favourite-it": "Favorilere ekle",
    "beb6e": "Fikirler kolaydır. Uygulama zordur. -Guy Kawasaki",
    "bfb8e": "Yenilik, pazarda güncel ve rekabetçi kalmanın anahtarıdır. -Mark Zuckerberg",
    "bhojei1": "Geleneksel çince",
    "bjZyW": "Çevirmek",
    "bors14": "Türkçe",
    "bp_-b": "LafTools'u tam olarak yönetmek için kurulum akışının başında yöneticinizi ayarlamanız gerekir. Kimliğinizi URL parametre belirteciyle doğruladık; kurulum belirtecini almadan başka hiç kimsenin kök izninizi ayarlayamayacağından emin olun.",
    "bqqrij": "Svahili",
    "bsWpBA73s": "JavaScript kodunu sıkıştırır.",
    "c0eCw": "Metninizi istediğiniz dile çevirin.",
    "c5meku": "Sundan dili",
    "c7Uoqqe": "LafTools'u kullanmadan önce lütfen yerel şifrenizi aşağıdaki gibi girip onaylayın.",
    "c7cfc": "İyi bir test, bir sorun olması durumunda kodu kırma olasılığı yüksek olan testtir. - Michael Bolton",
    "cMBqyyFae": "Yapılandırılmış Sorgu Dili (SQL) kodunu girintiler ve güzelleştirir.",
    "cNQp_": "Kaynaklar",
    "cPS6q": "Tüm Araçlar",
    "cQqwI8r": "Terminal Hizmetinin durumu yükleniyor",
    "cae2c": "İnovasyon, fikirlerin alınması ve bunların gerçeğe dönüştürülmesi sürecidir. -Neil Lawrence",
    "cd4d1": "İnovasyon iş büyümesinin anahtarıdır. -Andrew R. Steinberg",
    "cfYYN": "Daha fazlasını keşfet",
    "ciZV2": "Base32, insanlar tarafından rahatlıkla kullanılabilen ve bilgisayarlar tarafından işlenebilen sınırlı bir sembol kümesi kullanarak rastgele bayt verilerini kodlamaya yönelik bir gösterimdir. Base64'ten daha küçük bir karakter kümesi kullanır; genellikle büyük harf ve 2'den 7'ye kadar sayılar.",
    "ciZV21": "Base45, insanlar tarafından rahatlıkla kullanılabilen ve bilgisayarlar tarafından işlenebilen sınırlı bir sembol seti kullanarak rastgele bayt verilerini kodlamaya yönelik bir gösterimdir. Yüksek sayı tabanı, ondalık veya onaltılık sisteme göre daha kısa dizelerle sonuçlanır. Base45, QR kodlarıyla kullanım için optimize edilmiştir.",
    "ciZV2deq1": "Base58 (Base64'e benzer), rastgele bayt verilerini kodlamak için kullanılan bir gösterimdir. İnsanların okunabilirliğini artırmak için kolayca yanlış okunan karakterleri (örn. l, I, 0 ve O) kaldırarak Base64'ten farklıdır. Base58, kripto para birimlerinde (Bitcoin, Ripple vb.) yaygın olarak kullanılır.",
    "cj1pd": "Yenileme İşlemi",
    "cjzqj9": "Boşnakça",
    "cmxzpg": "Malayalamca",
    "coM2I": "Akıllı Düzenleyici'yi kullanın",
    "crD7I": "Dönüşümün, uzunluğu sıfır olan boş giriş metnini yok sayıp saymayacağını yapılandırmak için.",
    "cuRCb": "Kategori bulunamadı.",
    "cuRCqb": "Kategori mevcut değil",
    "cxqhqa": "Myanmar (Birmanya)",
    "d-l2l": "Onaylamak",
    "d-qPr": "Bilinmeyen düzen: {0}",
    "d0624": "İnovasyon sadece yeni fikirlerin ortaya çıkması değil, aynı zamanda bunların etkili bir şekilde uygulanmasıdır. -Jeff Bezos",
    "d10c9": "İnovasyon, yeni potansiyelin kilidini açmanın ve yeni pazarların kilidini açmanın anahtarıdır. -Tim Cook",
    "d1820": "İnsan bir çim yaprağını kopyalayıncaya kadar doğa onun sözde bilimsel bilgisine gülebilir. – Thomas Edison",
    "d366a": "Yenilik, yeni büyümenin kilidini açmanın anahtarıdır. -Philip Kotler",
    "d5KZH": "LafTools'u kullandığınız için teşekkür ederiz!",
    "d5LAU": "AGPLv3 kapsamında lisanslanmıştır",
    "d5fmq2": "İtalyan",
    "d5hit": "Oturum - {0}",
    "d5x1rl": "İspanyol",
    "d7dc4": "Test, bir sistemin veya bileşeninin/bileşenlerinin, belirtilen gereksinimleri karşılayıp karşılamadığını belirlemek amacıyla değerlendirme sürecidir - Anonim",
    "dCFIC": "Kod Daha Güzel",
    "dCFIwC": "Kod Oluşturucu",
    "dGKMx": "Çıktı",
    "dGVUB": "Ağ Araçları",
    "dO6b2Tkqwe": "Son Kullanılan Araçlar",
    "dQwjNbi0y": "Dokümantasyon hakkında daha fazla bilgi edinin",
    "dV5Eq": "Çalışma alanı listesini yenile",
    "da74c": "Spekülasyon ve kesin olarak bildiklerimizin ötesindeki fikirlerin araştırılması ilerlemeye yol açan şeylerdir. – Lisa Randall",
    "dc662": "Tek gerçek hata, hiçbir şey öğrenemediğimiz hatadır. - John Powell",
    "dcebe": "Hata ayıklama, yazılım hatalarını kaldırma işlemiyse, programlama da bunları yerleştirme işlemi olmalıdır. - Edsger Dijkstra",
    "ddcc7": "Yenilik, modern ekonomide başarının anahtarıdır. -Satya Nadella",
    "ddsdf3159": "Fizik aslında nihai basitlik arayışından başka bir şey değil, ama şu ana kadar elimizde olan tek şey bir tür zarif dağınıklık. -Bill Bryson",
    "de47c": "Test etmek, kara kutu bulma ve ona şarkı söyleme sanatıdır. -James Bach",
    "dk122q": "Birden fazla aracı bir araya getirmek için iş akışlarınızı yönetin.",
    "dkarh": "Tamam, araç kutusu dizini açtı. Açılan pencere yoksa lütfen platformunuzun bu işlevi destekleyip desteklemediğini veya dizinin sunucuda olup olmadığını kontrol edin.",
    "dkjk12": "bu test",
    "dkkq12": "Aracınızı bu sekmede yapılandırın.",
    "dl4kr": "Parolanızı mı unuttunuz?",
    "download-local": "Ücretsiz indirin",
    "dpRY4": "Sözlük",
    "dqTqyvWY": "Çekmece Menüsü",
    "dsdpA_eJ": "Boyutu Ayarla",
    "dtjdt4": "Kazak",
    "dxLQq": "Kök İzni",
    "dzjTo": "Lütfen hesap şifrenizi buraya girin",
    "e--gB": "Uzantı kimliği sağlanmadı.",
    "e097e": "İnovasyon sadece yeni ürünler değil, yeni olanaklar yaratmakla ilgilidir. -Tony Robbins",
    "e2379": "Bilime ve teknolojiye son derece bağımlı bir toplumda yaşıyoruz ve neredeyse hiç kimse bilim ve teknoloji hakkında hiçbir şey bilmiyor. - Carl sagan",
    "e3WgQaZlb": "{0}'ı sıkıştırır",
    "e4Cd8t": "Temel85",
    "e5rycw": "Kırgız",
    "e8Crq": "Devam etmek için lütfen aşağıdaki kullanıcı adı ve şifre alanını doldurun.",
    "e984f": "Temiz kod her zaman önemseyen biri tarafından yazılmış gibi görünür. — Robert C. Martin",
    "eTmq": "CodeGen ToolBox'un Tarihçesi",
    "e_8pZ": "Geliştiricilerin üretkenliği artırmasına yönelik çok yönlü bir araç kutusu.",
    "ea227": "Geleceği tahmin etmenin en iyi yolu onu yaratmaktır. -Peter Drucker",
    "ediql2": "Macarca",
    "ee7d0": "Bilimin bize verebileceği hayranlık duygusu, insan ruhunun yaşayabileceği en yüksek deneyimlerden biridir. - Richard dawkins",
    "egkqC8t": "Temel58",
    "egkqCd8t": "Base62",
    "eifoni": "Katalanca",
    "englishcorner": "İngilizce",
    "eqkqd4W": "Lütfen yeni etiket için bir ad girin",
    "etV-l": "Dosyaları SIT2'ye Kopyala",
    "eu5mh0": "Belarusça",
    "euaI8": "Yeni Yerel Hesap Oluştur",
    "euhy9v": "Estonyalı",
    "f0d15": "Bilgisayarlar hızlıdır; geliştiriciler onları yavaşlatıyor. – Anonim",
    "f12bb": "İnovasyon, iş dünyasında ilerlemenin arkasındaki itici güçtür. Yeni fikirler üretme ve bunları müşterilere değer katan somut ürün, hizmet veya süreçlere dönüştürme sürecidir.",
    "f23c2": "Yenilik, liderle takipçiyi birbirinden ayırır. -Steve Jobs",
    "f29b1": "İlerleme deneme ve başarısızlıkla sağlanır; başarısızlıkların sayısı genellikle başarılardan yüz kat daha fazladır, ancak bunlar genellikle kronikleştirilmeden bırakılır. –William Ramsay",
    "f3151": "En büyük risk hiç risk almamaktır. -Mark Zuckerberg",
    "f3159": "Matematik, kağıt üzerinde anlamsız işaretler bulunan, belirli basit kurallara göre oynanan bir oyundur. -David Hilbert",
    "f315e7": "Matematik ırk veya coğrafi sınır tanımaz. -David Hilbert",
    "f3160": "Matematik en üstün yargıçtır; kararlarına itiraz yoktur. -Tobias Dantzig",
    "f3161": "Matematikte bir soru önerme sanatı, onu çözmekten daha yüksek değerde tutulmalıdır. -Georg Cantor",
    "f3162": "Matematik gerçek dünyada yapamayacağınız şeyleri yapabileceğiniz bir yerdir. -Marcus du Sautoy",
    "f3163": "Matematiğin ilerlemesi ve mükemmelleşmesi devletin refahıyla yakından bağlantılıdır. -Napolyon Bonapart",
    "f3164": "Matematiğin özü özgürlüğünde yatmaktadır. -Georg Cantor",
    "f3165": "Matematik başlı başına açık olanın bilimidir. -Carl Jacobi",
    "f3166": "Doğru bakıldığında matematik yalnızca gerçeğe değil aynı zamanda üstün güzelliğe de sahiptir. -Bertrand Russell",
    "f3167": "Matematik her türlü soyut kavramla ilgilenmek için özel olarak uygun bir araçtır. -P. Dirac",
    "f3168": "Matematik, sırlarını ancak ona saf sevgiyle, kendi güzelliği için yaklaşanlara açar. -Arşimet",
    "f3169": "Matematik insan ruhunun en güzel ve en güçlü eseridir. -Stefan Banach",
    "f3170": "Matematikçi saf matematiği faydalı olduğu için çalışmaz; onu inceliyor çünkü ondan keyif alıyor ve ondan keyif alıyor çünkü o güzel. -Henri Poincaré",
    "f3171": "Nil Nehri gibi matematik çalışmaları da küçüklükle başlar ama ihtişamla biter. -Charles Caleb Colton",
    "f318e4": "Biyoloji şimdiye kadar yaratılmış en güçlü teknolojidir. DNA yazılımdır, protein donanımdır, hücreler fabrikadır. -Arvind Gupta",
    "f31d71": "Fizik umarım basittir. Fizikçiler öyle değil. -Edward Teller",
    "f31d75": "Fizik aslında nihai basitlik arayışından başka bir şey değil, ama şu ana kadar elimizde olan tek şey bir tür zarif dağınıklık. -Bill Bryson",
    "f31e53": "Matematik bilimlerin kraliçesidir. -Carl Friedrich Gauss",
    "f31q52": "Saf matematik, kendi açısından mantıksal fikirlerin şiiridir. -Albert Einstein",
    "f31q54": "Doğanın kitabı matematiğin diliyle yazılmıştır. -Galileo Galilei",
    "f31q56": "Matematik aklın müziğidir. -James Joseph Sylvester",
    "f31q58": "Matematik sayılar, denklemler, hesaplamalar veya algoritmalarla ilgili değildir; anlamakla ilgilidir. -William Paul Thurston",
    "f31q70": "Biyoloji bilimdir. Evrim, biyolojiyi benzersiz kılan kavramdır. -Jared Diamond",
    "f31q72": "Biyoloji fiziksel dünyanın şiiridir, insan biyolojisi ise evrenimizin şiiridir. -Julian Casablancas",
    "f31q74": "Biyoloji kötü kokmaya başlayan fizikten başka bir şey değil. -Nigel Calder",
    "f31q81": "Fizik, neden-sonuç terimleriyle tasarlanan fiziksel cisimlerin hareket ve eylemlerinin bilimidir. -Arthur Compton",
    "f31qe82": "Biyoloji bir yazılım sürecidir. Vücudumuz her biri bu süreç tarafından yönetilen trilyonlarca hücreden oluşur. Siz ve ben, çok farklı bir çağda gelişen, vücudumuzda çalışan eski yazılımlarla dolaşıyoruz. -Ray Kurzweil",
    "f31r83": "Fizik, fizikçiler için giderek zorlaşıyor. -David Hilbert",
    "f31sq66": "Biyoloji gerçekten kimyadır, kimya gerçekten fiziktir, fizik gerçekten matematiktir. -Matt Ridley",
    "f31x76": "Biyoloji, Evrendeki karmaşık şeylerin incelenmesidir. Fizik basit olanların incelenmesidir. -Richard dawkins",
    "f31x77": "Fizik ekonomik düzene göre düzenlenmiş deneyimdir. -Ernst Mach",
    "f3d169": "Fizik tek gerçek bilimdir. Gerisi sadece pul koleksiyonculuğu. -Ernest Rutherford",
    "f3d179": "Fizik o kadar inanılmaz derecede karmaşık hale geliyor ki, bir fizikçiyi yetiştirmek giderek daha uzun sürüyor. Aslında bir fizikçiyi, fiziksel problemlerin doğasını anlayacak şekilde eğitmek o kadar uzun zaman alır ki, o zaten onları çözemeyecek kadar yaşlıdır. -Eugene Wigner",
    "f3d180": "Biyoloji yaşam bilimidir, ancak birçoğumuz kendi bedenlerimizin temellerini anlamıyoruz. -Kathy Reichs",
    "f3e155": "Matematik bilimlerin kapısı ve anahtarıdır. -Roger Bacon",
    "f3q178": "Biyoloji kader değildir. Hiçbir zaman eğilimden fazlası olmadı. Bu, doğanın etle hesaplaşmanın ilk hızlı ve pis yoluydu. Cipsler kaderdir. -Bart Kosko",
    "f3sd162": "Biyoloji, bir amaç doğrultusunda tasarlanmış gibi görünen karmaşık şeylerin incelenmesidir. -Richard dawkins",
    "f3sd164": "Biyoloji sana bir beyin verir. Hayat onu bir zihne dönüştürür. -Jeffrey Eugenides",
    "f3sd165": "Fizikte, kendinize sorun çıkartmanıza gerek yok; doğa bunu sizin için yapıyor. -Frank Wilczek",
    "f3sq167": "Bilimin iyi yanı, siz ona inansanız da inanmasanız da gerçek olmasıdır. -Neil deGrasse Tyson",
    "f3ttw8": "Maori dili",
    "f477b": "Programlama, algoritma tasarımı sanatı ve hatalı kodda hata ayıklama sanatıdır. – Ellen Ullman",
    "f5bLC": "Dokümantasyon",
    "f7akol": "İngilizce",
    "f7cf7": "Aslında iki şey vardır; bilim ve fikir; birincisi bilgiyi doğurur, ikincisi ise cehaleti. – Hipokrat",
    "f814a": "Bu kodu yazdığımda ne yaptığımı yalnızca Tanrı ve ben anladık. Artık sadece Tanrı knotool'ları var. – Anonim",
    "f96ff": "İnovasyon, iş dünyasında ilerlemenin ve başarının itici gücüdür. -Satya Nadella",
    "fBP5h": "Kullanıcı adı",
    "fEr5j": "Yeni Komut Dosyası Oluştur",
    "fV_1P": "Kayıt olmak",
    "fa94e": "İnovasyon, rekabetçi yarışta önde kalmanın anahtarıdır. -Paul Sloane",
    "fc805": "Yenilik, yapılacak bir işin yaratıcılığıdır. –Tom Peters.",
    "fd3173": "Fizik düz ceketli hayal gücüdür. -John Moffat",
    "fdd2b": "Bilim organize bilgidir. Bilgelik organize yaşamdır. - Immanuel Kant",
    "fdxluz": "Romen",
    "ff02c": "İptal edildi",
    "fgj880": "Telugu dili",
    "forever-foss": "Sonsuza kadar FOSS!",
    "fqV_1P": "LafTools'unuzun Kilidini Açın",
    "g2_aX": "Şifrelenmiş şifreyi dosyaya kopyala",
    "g5SK9": "Son Kullanılanları Aç",
    "gDjbs": "Tarihsel veri",
    "gK3dNQ": "Kopyala",
    "gQhfS": "Dosya araçları",
    "gTOv6abWT": "Giriş yapmak",
    "gTOv6adbWT": "Kayıt olmak",
    "gU1O2": "Tetiklenmiş",
    "geHXwByxy": "Ayarlar",
    "generic-NI-UFPTe0": "Genel Kodu Güzelleştirin",
    "generic-code-beautify.desc.2b3c": "Bu işlem, tutarlı girintileme, satır sonları uygulayarak ve dile özgü stil yönergelerine bağlı kalarak okunabilirliği artırmak için kodu çeşitli programlama dillerinde biçimlendirir.",
    "giveas3tar": "LafTools'u seviyorsanız bize GitHub'da bir yıldız verin.",
    "gkC8t": "Base64",
    "gkdqqC8t": "Temel45",
    "gkqC8t": "Base32",
    "gmK3pKyRI": "{0} En Yüksek Çevrimiçi Sayı",
    "gms7_9n5v": "Onaltılık bayt dizesini ham değerine geri dönüştürür.",
    "gnKMZ": "Yenilendi.",
    "groupnote": "Hafıza",
    "h6AeI": "Websocket bağlantısı şu saatte kapatıldı: {0}",
    "hJUMN": "Hedef dil",
    "hMvh1": "Yedek veritabanı",
    "hRFxV": "Daha fazla bilgi için lütfen web sitemizi ziyaret edin",
    "hX1CWGAhl": "Genişletilebilir İşaretleme Dili (XML) kodunu girintiler ve güzelleştirir.",
    "hcnt1k": "Makedonca",
    "hhOT3": "Ada Göre Ara",
    "htTmvWjsS": "Basamaklı Stil Sayfaları (CSS) kodunu sıkıştırır.",
    "htt1d2": "Esperanto",
    "hu-iz": "Zamanlayıcı",
    "huE6U": "Değişken",
    "hyV-d": "Tamamlamak",
    "hyirc0": "İsveççe",
    "i27qmr": "Frizce",
    "i6hMN": "Resim Doğrulama Kodu",
    "i88tb": "Sonucu Dosyaya Aktar",
    "i8q8tb": "Giriş için WorkFlow'u Yapılandırma",
    "iNQvo": "Başlamak için bir örnek gösterin.",
    "iNqF1T": "Bulut Hesabını Yönet",
    "iOEjZ": "Kullanılabilir Kod Yok",
    "iQL2c": "Hala bu düğmenin tüm işlevlerini araştırıyoruz; onu nasıl geliştirebileceğimize dair herhangi bir geri bildiriminiz veya öneriniz varsa lütfen bize bildirin!",
    "iZXig7E2JF": "LafTools, codec'ler, formatlayıcılar, görüntü işleme araçları ve bilgisayar kaynak yönetimi çözümleri dahil olmak üzere kapsamlı bir geliştirme yardımcı programları paketi sunar. Geliştirme iş akışınızı kolaylaştırmak ve geliştirmek için tasarlanan LafTools, verimli, yüksek kaliteli yazılım geliştirme için başvuracağınız kaynaktır.",
    "i_lang_": "Dil Paketleri",
    "ib135dq": "Durum Mesajınız burada görüntülenecek",
    "iknTS": "Şifre Yöneticisi",
    "init_env": "Sistem Kaynakları Yükleniyor",
    "ip2g1": "Kopyalandı",
    "ipOSQE": "Profesyonel Sürüm",
    "it8ths": "Endonezya dili",
    "ixyP0": "Gerçek zamanlı eylemi otomatik olarak işleme",
    "jJuNz": "Kaynak dil",
    "jO5eP": "TAMAM",
    "jPNCb": "Yeniden denendi.",
    "jQXdi": "Işık Modu",
    "jR1zX": "Yapay Zeka Laboratuvarı",
    "jRFk519Bj-": "Bu topluluk tamamen uluslararası ücretsiz bir açık kaynak kodu projesi tarafından yönlendirilmektedir.",
    "jaj7M": "Her hakkı saklıdır.",
    "jb392": "İsim",
    "jfpqt": "Not Gezgini",
    "jgDoEq": "SSS Verisi Yok",
    "jhDoE": "SSS Verilerini Alma",
    "jlxvpk": "Koreli",
    "jr_7Y98yZ": "LafAraçlar",
    "json-beautify.desc.0912": "Bu işlem, tutarlı bir şekilde uygun girintiler, satır sonları ve sıralama anahtarları ekleyerek okunabilirliği artırmak için JSON verilerini formatlar.",
    "json-beautify.name.0912": "SQL'i biçimlendir",
    "json-beautify.text.93kq": "JSON Verilerini Güzelleştirin",
    "k17PG": "Websoket bağlantısı kapatıldı.",
    "k2SVY": "kapalı",
    "k2ku5p": "Çek",
    "k41a5": "LafAraçlar",
    "k4s5rx": "Slovence",
    "kLH79": "E-posta",
    "kOi5A": "Sayfayı yazdır",
    "kPD22": "Sözlük",
    "kPJ-A4": "Yenile",
    "kcHxr": "Lütfen yönetici hesabı kullanıcı adını buraya girin",
    "kjks1": "Yerel sunucu API'sinden i18n yapılandırmasını alma",
    "kqv5ht": "Yidiş",
    "krxSK": "Yapay Zeka Asistanı",
    "ks12d": "Siber güvenlik",
    "kv4wag": "Flemenkçe",
    "ky6JphiKk": "{0} Çevrimiçi Kullanıcı",
    "l3akoa": "Amharca",
    "l6Djb": "Tercih ettiğiniz tema olarak seçeneklerden birini seçin:",
    "lDXWMq43S": "Bugünün Takvimi",
    "lIn3_": "Yönetici Kullanıcı Adı",
    "lQFII": "Başlatmayı yeniden tetikleyin",
    "lRHDQ": "Tam Ekran Modundan Çık",
    "lUh5c": "Jeneratör",
    "lWqYc": "Bu web sitesi, JSON'dan XML'e, JSON'dan CSV'ye, JSON'dan YAML'ye dahil olmak üzere JSON araçları sağlar.",
    "lastreplyby": "Son yanıt yazan:",
    "lkuulh": "Fransızca",
    "lp0qmd0": "Favori olarak işaretle",
    "lpKAz": "Ayarlar",
    "lpzg83": "Samoalı",
    "lzGS2": "Uzantı Detayı",
    "m0106": "Dönüştürücü",
    "m0107": "jeneratör",
    "m0108": "Biçimlendirici",
    "m7WZw": "Sistem Web Soketi Bozuk",
    "m8rTc1": "Kabuk komut dosyaları yöneticisi uygulandıktan sonra, bunu kabuk komutlarınızı yönetmek için kullanabilirsiniz.",
    "mBgF1": "Fare Eylemi",
    "mSFei": "GitHub'daki Kaynak Kodu",
    "mWXeh": "Çalışma Alanı Kimliği: {0}",
    "mabHq": "Eski Dosyaları Bul",
    "mbzCv": "Bir Hata oluştu: {0}, reddedilen zaman: {1}",
    "md2.desc.1039": "Bu işlem, verileri bir {0} karmasına dönüştürür.",
    "md2.text.192d3": "{0} Karma Oluştur",
    "md2aO2NaJITm": "Basamaklı Stil Sayfaları (CSS) kodunu girintiler ve güzelleştirerek okunmasını ve anlaşılmasını kolaylaştırır.",
    "md4.desc.1039": "Bu işlem, verileri bir {0} karmasına dönüştürür.",
    "md4.text.192d3": "{0} Karma Oluştur",
    "md5.desc.rxsHq": "Bu işlem, verileri bir {0} karmasına dönüştürür.",
    "md5.textiDjMIo": "{0} Karma Oluştur",
    "md6.desc.1039": "Bu işlem, verileri bir {0} karmasına dönüştürür.",
    "md6.text.192d3": "{0} Karma Oluştur",
    "meeMC1Uk7.text.93kq": "{0}'ı küçült",
    "mhWk4dtid": "Kodlama",
    "mihc3": "Bu işlemi tamamladı",
    "mjHoR": "Ayrıca teknik olarak hiç kimse bu jetonu okuyamaz, aksi halde bilgisayarınıza saldırıp kontrol etmiş demektir.",
    "mnb19i": "Almanca",
    "mslw4o": "Yunan",
    "mwn7iv": "Zuluca",
    "myxedr": "Moğolca",
    "n1jA9": "Onaylamak",
    "n24tes": "Portekiz Brezilyası)",
    "n28g4di0L": "Kılavuzlar",
    "n94an4": "Lehçe",
    "n98EW": "Giriş bölgesi ve çıkış bölgesinin metnini değiştirin.",
    "nIDKbSXTw": "{0} Kullanıcı",
    "nSeIq8-": "En önemlisi ücretsiz ve açık kaynaktır. Kişisel veya ticari amacınız için kullanabilirsiniz.",
    "nTvw4": "Verilerinizi ve ayarlarınızı korumak ve ayrı olarak kaydetmek için yerel hesabınızı kullanabilirsiniz. Ayrıca LafTools gelecekte kullanıcılar arasında anlık mesaj widget'larını da destekleyecektir.",
    "nh1W-": "Testler yalnızca hataların varlığını kanıtlayabilir, yokluğunu değil - Edsger Dijkstra",
    "nmb1wx": "Yoruba",
    "nncQE": "Hayat",
    "nodBw": "Bu işlem ham verileri bir ASCII {0} dizisine kodlar.",
    "nrix6l": "Çiçeva",
    "nxJC7": "Transformatör gerçekleştirildiğinde yürütülecek varsayılan eylem.",
    "o1umzi": "Fransızca",
    "o52xW": "İhracat",
    "o8xyzu": "Lüksemburgca",
    "oBz8D": "Yükleniyor",
    "oNLxH": "Kullanıcı adı",
    "oNg3f": "Resmi internet sitesi",
    "ocxsw3": "İrlandalı",
    "of_ox": "Sonuç olarak, LafTools tüm ihtiyaçlarınız için tek elden çözümdür.",
    "oj23X": "Veritabanını Geri Yükle",
    "ojCWEFdVe": "Gereksiz tüm karakterleri kaldırarak JavaScript kodunu sıkıştırır.",
    "ooiFU": "Java Hizmetini yeniden başlatın",
    "oqHqVq": "Göre sırala",
    "oqHqqV": "Toplam: {0} Komut",
    "oqHqqVq": "Kopyalama Zamanları",
    "oqjbcj": "Lao",
    "os8h6u": "Danimarka",
    "p8Exxc1s": "Yapay Zeka Laboratuvarında görevleri daha verimli bir şekilde gerçekleştirmek için yapay zeka teknolojilerinden yararlanan çeşitli araçlar vardır.",
    "pANmj": "Etiketler sunucu türlerine, komut dosyası kullanımlarına veya tercih ettiğiniz diğer kriterlere göre tanımlanabilir.",
    "pA_deJ": "Panoya Aktar",
    "pA_feeJ": "Terminali Yeniden Bağlayın",
    "pA_qweJ": "Tamponu Temizle",
    "pDBSWq": "sağ panel için mevcut içerik yok",
    "pEk1kk": "LafTools burada sizin için faydalı işlevler sunuyor.",
    "pEk1qkk": "Açılan tüm sekmeleri listele",
    "pHZDB": "Gerçek Zamanlı Eylem",
    "pJoOz": "Açık dosya",
    "pKHRT": "Araçlara Git",
    "pKqHRq": "Notlarda Ara",
    "pL6qH": "Tamamlanmış.",
    "pNwe3": "Diğer",
    "pZ4d616m-": "{0}'ı güzelleştir",
    "ph5jH": "Bu kısmı işlemek",
    "piih4x": "Tacikçe",
    "pmAee": "Bu araç hakkında daha fazla bilgi edinin.",
    "pmnp4b": "Ukrayna",
    "ppmz8e": "Haiti Kreyolu",
    "pqs7y3": "Tam tuş haritası desteğine sahip olmak için lütfen bu web sayfasını PWA olarak kaydetmeyi düşünün.",
    "psA_eJ": "Dosya Olarak Dışa Aktar",
    "psZoP": "Dosyaları işlemek için buraya bırakın",
    "psqqpq_o": "Tamam, sonuç panonuza {0} kez kopyalandı.",
    "pzn2IpkDo": "JavaScript Nesne Gösterimi (JSON) kodunu girintiler ve güzel bir şekilde yazdırır.<br><br>Etiketler: json görüntüleyici, güzelleştirme, sözdizimi vurgulama",
    "q0zA1kML_": "Çevrimiçi Araç Kutusu",
    "q12beqwR": "Kullanılabilir Araç Yok",
    "q29t31": "Lehçe",
    "q3VjkLMsP": "Dostluk, değişim, işbirliği ve gelişme",
    "q6K7o": "Notlardan Yükle",
    "q9iuti": "Galce",
    "qDrbEr": "Girdiğiniz kullanıcı adı boş, lütfen kontrol edip tekrar deneyin.",
    "qF4uS2": "Çalışma Alanı Oluştur",
    "qF4uS23": "Yeni Pencere",
    "qHoktx": "Teşekkür ederim!",
    "qN1LdZ2": "Son düzenleme",
    "qQmBr": "Metin Çevirisi",
    "qTqyvWdY": "Henüz bitmedi",
    "qWemXE4": "1 Ocak 2024",
    "qWw3eTH": "Bu bölüm, yerel diskinizdeki veya bulut diskinizdeki dosyaların korunmasına yardımcı olur.",
    "qdeFXx": "Şu anda aradığınız bu sayfa henüz tam olarak uygulanmadı.",
    "qpDBSW": "kullanılabilir panel yok",
    "qpDBSWe1": "kullanılabilir panel yok",
    "qqK_x_": "Kayıt olmak",
    "qqqwYoz": "Yardım",
    "qqwYoz": "Sekmeler",
    "qqwYqwe": "Çalışma alanları",
    "qtpmvP": "Yerel Parolayı Doğrulayın",
    "quality-first": "Önce kalite",
    "qubSJ": "Uzantı VM'si kimlik değildir. (REF: IQnMH).",
    "qzshys": "Urduca",
    "r1GLS": "Etiketler",
    "rE6fUsSGl": "Yapılandırılmış Sorgu Dili (SQL) kodunu girintiler ve güzelleştirir.",
    "rK6cx": "{0}, LafTools ekibi tarafından tasarlanıp geliştirildi",
    "rQkas": "LafTools'a hoş geldiniz",
    "rR1vd": "Dosyadan Giriş",
    "rT34qnO": "İşlenecek metni girin. Sonuç çıktı düzenleyicisinde görüntülenecektir.",
    "rVqlu": "{0} kodunu çöz",
    "rYSpwq": "MD2 (Message-Digest 2) algoritması, 1989 yılında Ronald Rivest tarafından geliştirilen bir kriptografik karma işlevidir. Algoritma 8 bit bilgisayarlar için optimize edilmiştir. MD2 artık güvenli olarak kabul edilmese de 2014 yılı itibarıyla bile halka açık olarak kullanılmaya devam etmektedir. MD2 ve RSA ile oluşturulan sertifikaların bir parçası olarak temel altyapılar. Mesaj özeti algoritması varsayılan olarak 18 turdan oluşur.",
    "r_n6h": "Açık veya Koyu Mod",
    "rf0mql3": "Açık veya Koyu Tema",
    "rpG0G": "Geri bildiriminize değer veriyoruz ve ürünümüzü nasıl geliştirebileceğimize dair düşüncelerinizi duymaktan memnuniyet duyarız; lütfen geri bildiriminizi bizimle paylaşmaktan çekinmeyin!",
    "rub76Z8zx": "C, C++, C#, Java, PHP, JavaScript vb. gibi C tarzı dilleri güzel bir şekilde yazdırmaya çalışır. Bu mükemmel bir iş çıkarmaz ve ortaya çıkan kod artık çalışmayabilir. Bu işlem tamamen gizlenmiş veya küçültülmüş kodun okunmasını ve anlaşılmasını daha kolay hale getirmek için tasarlanmıştır. Düzgün çalışmayacak şeyler: Döngü biçimlendirmesi için, Do-While döngü biçimlendirmesi, Switch/Case girintisi, Bazı bit kaydırma operatörleri",
    "run_text": "Tezgahınıza girmeden önce öncelikle gerekli sistem kaynaklarını önceden yüklemek istiyoruz. Lütfen bir süre bekleyiniz, kısa sürede tamamlanacaktır. Detayları aşağıdaki gibidir.",
    "rycJy": "LafTools, programcılar için özel olarak tasarlanmış çok yönlü bir araç kutusudur. CodeGen Araç Kutusunun ikinci versiyonunu temsil ediyor ve artık Golang ve JavaScript ile yazılmış daha hafif bir çalışma zamanı sunuyor.",
    "ryhkqb": "Bulgarca",
    "rzoFmjStq": "İlgili Araçlar",
    "s-fxP80Dd": "LafTools IDE",
    "s0vrf9": "İbranice",
    "s4OeX": "Sisteme başarıyla giriş yapın",
    "sHoxxW": "Tarih",
    "sO0MOe": "Bir pencerede 5 saniyeden fazla kaldığınızda burada gösterilir.",
    "sR8yc": "Kapalı",
    "sc49my": "Sindhi",
    "sdf3160": "Özellikle biyolojide teorisyenlerin görevi yeni deneyler önermek. İyi bir teori sadece tahminlerde bulunmakla kalmaz, aynı zamanda daha sonra doğru olduğu ortaya çıkan şaşırtıcı tahminlerde bulunur. -Francis Crick",
    "sdfk1": "Sekmeleri sola kaydır",
    "sdfk13": "Sekmeleri sağa kaydır",
    "sglMS": "Zaman yarat",
    "share-this-page": "Bu sayfayı paylaş",
    "sk123": "Henüz bitmedi",
    "slqcWD": "Bu mantık kısmı henüz desteklenmiyor, lütfen takipte kalın.",
    "sojBI": "Dönüştürmek",
    "spCqEa": "YAPMAK",
    "spdh98": "Basitleştirilmiş Çince",
    "ssDaOq": "LafTools'ta yeni misiniz?",
    "ssm80i": "Bask",
    "str.codecs": "Codec'ler",
    "str.converters": "Dönüştürücüler",
    "str.formatter": "Biçimlendiriciler",
    "str.login": "Giriş yapmak",
    "str.mostused": "En çok kullanılan",
    "str.parsers": "Ayrıştırıcılar",
    "str.register": "Kayıt olmak",
    "str.remarks": "Favoriler",
    "str.usercentre": "Kullanıcı Merkezi",
    "svqh06": "Azerice",
    "sys_updates": "En Son Sistem Güncellemeleri",
    "t63Qw": "Azletmek",
    "t6wczq": "Xhosa",
    "t84q1z": "Ermeni",
    "t8DUz20a-": "JSON Biçimlendirici",
    "t8c6xc": "Somalili",
    "tBIX-d": "pencereler",
    "tEiv_": "Uzantı Ayrıntısını Alma",
    "tIy3Q": "Bir hatayla karşılaşıldı",
    "tIyq3Q": "Bir hatayla karşılaşıldı",
    "tWe1yF": "Kullanılabilir kabuk komutu yok.",
    "tY3p1": "Daha fazla bilgi",
    "tiaiB": "İptal etmek",
    "title-laftools": "LafTools - Programcılar için Lider Hepsi Bir Arada Araç Kutusu",
    "tn7duf": "Hırvat",
    "try.laftools.ide": "LafTools IDE'yi deneyin",
    "trywithclassicalwebui": "Klasik Web Kullanıcı Arayüzü ile deneyin",
    "ttAre": "Düz metin şifrenizi buraya girin",
    "twamg": "Yapay Zeka Asistanı, Yaratıcılığınızı Güçlendiriyor",
    "tyhgpr": "Cava",
    "uCEe8": "Gerçek Zamanlı Dönüşüm",
    "uFcDQ": "Durum verileri başlatılıyor...",
    "uV5Bi": "Uzantı Yüklenemiyor",
    "uVseB": "Kısayol tuşu listesini göstermek için {0} tuşuna basın",
    "ucDLv": "Bu kaydı {0} kez kopyaladınız",
    "ui5pZ": "Komut Ayrıştırıcı",
    "ulah0q": "Japonca",
    "unc9E": "Rastgele Metin",
    "usr_defined": "Sistem Tercihleri",
    "uwqGE": "Araçlara Git",
    "v7q3db": "Tay dili",
    "vOjNC": "Şifreyi veya güvenli anahtarı girin",
    "vTsQU": "Lütfen yöneticinizden aldığınız davetiye kodunu sağlayın",
    "vU17B": "İstek gönderilemiyor",
    "vWqac": "Tezgahınıza girmeden önce öncelikle gerekli sistem kaynaklarını önceden yüklemek istiyoruz. Lütfen bir süre bekleyiniz, kısa sürede tamamlanacaktır. Detayları aşağıdaki gibidir.",
    "vaP0vq": "Yerel şifreyi başarıyla ayarlayın.",
    "vci8rd": "Flemenkçe",
    "vh9j4": "Giriş",
    "vo1prl": "İspanyol",
    "vr93oi": "Fince",
    "vrfjnf": "İtalyan",
    "w6otqn": "Korsikalı",
    "w92j07": "Rusça",
    "w9qudj": "Pencap",
    "wAxtg": "Başlangıçta, bu kurulumu yapabilmeniz için yetkili jeton olarak bir UUID oluşturduk. LafTools'un aldığı bilgilere göre sağladığınız jeton {0}, LafTools tarafından başarıyla doğrulandı ve sonuç olarak bu formu kurmaya devam edebilirsiniz.",
    "wI1eh": "Sonraki",
    "wQYoz": "Dosya",
    "wQdYoz": "Düzenlemek",
    "wQdqwYoz": "Görüş",
    "wcl1K": "Kullanım",
    "wgkk6y": "Malta",
    "wi28h5_S2": "Codec'ler",
    "wj3VS": "Bu işlem, bir ASCII {0} dizesindeki verilerin kodunu çözerek ham biçimine geri döndürür.",
    "wsWcXd": "Bildirimler",
    "x009": "Kullanım belgelerimize erişmek için",
    "x5alzu": "Kürtçe (Kurmanci)",
    "x5tHV": "sistem görünümü",
    "xMBv0": "İlgili kaynaklar yükleniyor...",
    "xOJqG1": "Sıkça Sorulan Sorular",
    "xPHqP": "Açıklama henüz tanımlanmadı.",
    "xQ_ls": "Redis'i Yedekle",
    "xbz0B": "Tüm Sekmeleri Kapat",
    "xbz0B2": "Sekmeyi Kapat",
    "xdqwe": "LafTools'u kullanmaya hoş geldiniz!",
    "xeP4zV": "TODO öğelerinizi hızlı bir şekilde görüntüleyin",
    "xeP4zVd": "İngilizce bir kelime hazinesine hızlı bir şekilde bakın.",
    "xhxY6iLDH": "Çıkış Yap",
    "xlqtA": "Geri bildirim",
    "xml-bdeautify.desc.2a5f9": "XML Kodunu Küçült",
    "xml-beautify.desc.2a5f9": "Bu işlem, uygun girintiler ve satır sonları ekleyerek ve iyi biçimlendirilmiş bir yapı sağlayarak okunabilirliği artırmak için XML verilerini formatlar.",
    "xs22XLF": "Bu öğe kimliği için kullanılabilir veri yok. Lütfen diğer öğeleri seçmeyi düşünün.",
    "y3qjdd": "Yerel şifreniz başarıyla doğrulandı.",
    "y8Ir5": "Bu bölüm yönetici hesabınızı başlatmak için kullanılır ancak yöneticiniz tarafından önceden ayarlandığı için şimdilik burada oluşturulması veya ayarlanması gereken hiçbir şey yoktur, lütfen bu bölümü boş bırakın ve kalan adımlarınıza devam edin.",
    "yCsTC": "Erken optimizasyon tüm kötülüklerin köküdür.",
    "yMZW-GEgf": "XML'i biçimlendir",
    "ySVf-": "Bu İsteği yeniden deneyin",
    "yTsqFO": "MD4 (Message-Digest 4) algoritması, 1990 yılında Ronald Rivest tarafından geliştirilen bir kriptografik karma işlevidir. Özet uzunluğu 128 bittir. Algoritma, MD5, SHA-1 ve RIPEMD algoritmaları gibi daha sonraki tasarımları etkilemiştir. MD4'ün güvenliği ciddi şekilde tehlikeye girmiştir.",
    "yVprb": "Bu kısım halen geliştirilme aşamasındadır.",
    "y_2Q1": "Kodlama ve Kod Çözme",
    "y_2Q2": "Simetrik Kripto",
    "y_2Q3": "Asimetrik Kripto",
    "y_2Q4": "Çin Ulusal Algoritmaları",
    "y_2Q5": "Web Kimlik Doğrulaması",
    "y_2Q5dqw": "Metin Eşleştirici",
    "y_9YM": "Çıktı burada görüntülenecektir.",
    "y_9YqM": "Statik kaynaklar yükleniyor...",
    "y_BN6": "Özet Algoritması",
    "ya0cwu": "Malayca",
    "yc7dqiu": "Basitleştirilmiş Çince",
    "yfYeg": "Metin Şablonu",
    "yiRso": "Bulut Notları",
    "ykganl": "Danimarka",
    "ymyfghy1r": "Notlar",
    "yqiRso": "Yerel Notlar",
    "yqrxl4": "Sırpça",
    "yznU9": "Ağaç Verilerini Boşalt",
    "z-o28we": "Süreç Paneli",
    "z0j2nf": "Hintçe",
    "z1oFn": "Kaçış ve Kaçış",
    "z2jzej": "Marathi",
    "z79b1a": "Arapça",
    "zN2ES": "Çalışma alanları",
    "zaSKh": "Yenile",
    "zc3Hf": "Şifre",
    "zjDJk": "Lütfen çalışma alanı dizin yolunu belirtin",
    "zkqUFa": "{0} henüz yapılandırılmadı",
    "zkv375": "Kmer",
    "zmDWx": "Bize Ulaşın",
    "znVRwq": "Dosyalar",
    "zpyd34": "İngilizce",
    "zqiIoqXw": "Hesaplamalar yürütülüyor...",
    "zwd4v": "Uzantı Detayı",
    "zwgYx": "Şifrelenmiş şifre değeri burada görüntülenecektir.",
    "zzcepr": "Cebuano"
}