{
    "-dxG-aEe4w": "Bugün gönderilen maksimum SMS doğrulama kodu sayısına ulaşıldı.",
    "-wHWkv2OC": "Neden oturum açamıyorum?",
    "-wdkeq": "Bu topluluk kar amacı gütmüyor mu?",
    "2RbUh6TyJ": "{0} Okunmamış Bildirim",
    "3I-dkqkwr": "Bu web sitesinde İngilizce sınavları veya diğer konu sınavları için herhangi bir ticari eğitim kursu sağlamadığımızı ve gelecekte de bunu yapmayı planlamadığımızı unutmayın.",
    "43be5": "Günlük",
    "4N79HNWiA": "Kâr amacı gütmeyen bir topluluk olduğundan emin olmak için kaynak kodunun tamamını bu sayfanın alt kısmında bulabileceğiniz GitHub'da da açıyoruz.",
    "4sQWoTgfr": "Doğrulama kodunun süresi doldu, lütfen sayfayı yenileyip tekrar deneyin",
    "4sdQWoTgfr": "Doğrulama kodunun süresi doldu. Lütfen sayfayı yenileyip tekrar deneyin.",
    "5pevqzFXX": "Eğer siz de aramıza katılmanın sizin için anlamlı olduğunu düşünüyorsanız, lütfen aşağıdaki butona tıklayarak profilinizi güncellemeye devam edin, teşekkürler!",
    "6h14B_t4I": "Bugün Katıldınız",
    "7BtpddC": "İkinci olarak, bu toplulukta siyaset veya diğer hassas konular hakkında konuşmayız ve tabii ki spam veya reklamları da hoş karşılamıyoruz. Bu nedenle, herhangi bir yasa dışı veya uygunsuz faaliyeti önlemek amacıyla kayıt için geçerli bir telefon numarasına ihtiyacımız var.",
    "7flKa": "LafTools - Tüm Profesyoneller ve Mühendisler için Her Şeye Gücü Yeten",
    "7zqdufsdddJ": "Evet elbette. ELB3.com web sitesi, samimi, reklamsız ve rahat bir İngilizce öğrenme ortamı yaratmayı amaçlayan, kar amacı gütmeyen WeChat sohbet grubu {0}'dan türetilmiştir.",
    "8s1R5nChx": "Davet kodu boş, bu topluluk herkese açık değil, davet edilen kullanıcılarla sınırlıdır.",
    "8s1dX": "Davet kodu sistemde mevcut değil, lütfen büyük/küçük harfe duyarlı bir sorun olup olmadığını kontrol edin.",
    "8sVG1RXhx": "şifre en az 6 karakter olmalıdır",
    "8sVG1RdXhx": "Kullanıcı kimliği zaten mevcut",
    "8sVG1kqXhx": "Kullanıcı Kimliği en az 2 karakter olmalıdır",
    "8sVGdXhx": "Kullanıcı Kimliği yalnızca harf ve rakamlardan oluşmalıdır",
    "8saIR-LCjyChx": "Davetiye kodunun süresi doldu",
    "8saIt5r5nGxwwChx": "Davetiye kodu kullanıldı",
    "9YPgsPid2M": "SMS Kodu",
    "9pBpiYcCy": "Spam ve reklamları önlemek amacıyla, hesabınızı kaydetmek için bir davetiye koduna ihtiyacımız var.",
    "BqWGnXEzV": "Şehir",
    "Bz_WdwvAPn": "CAPTCHA'nın doğru şekilde sağlanıp sağlanmadığını kontrol edin.",
    "C7jECCVt9": "Zamanınıza değer verin ve bu toplulukta asla sonsuza kadar yasa dışı bir şey yapmayın.",
    "CK5NCw519": "Topluluk Hikayesi",
    "CQ44pYZYj": "giriş yapmak",
    "CuHqw9m": "{0} geçerli bir telefon numarası değil, şu anda sistem yalnızca 11 haneli telefon numarasını kabul etmektedir.",
    "Cz_qjjFw7": "{0} hakkında",
    "DYaOL4Yp7": "kayıt olmak",
    "D_9sNBiZj": "Çok fazla denediniz, lütfen daha sonra tekrar deneyin.",
    "F-D-AewqL": "Son zamanlarda yaptıklarınıza geriye dönüp bakın. Taciz, reklam, kişisel istismar vb. sayılabilecek hiçbir davranışa tahammülümüz yoktur.",
    "GaySMPQHo": "Trend olan",
    "Gy45ssBPS": "Yeni Konu Oluştur",
    "H39ddc0df": "Çok fazla başarısız olursanız daha sonra oturum açmayı deneyin.",
    "HaU4NMabv": "Doğrulama kodu hatalı. Lütfen resmi yeniden girin veya yenileyin.",
    "IWPP6V-tR": "Kaynak kodu",
    "IcvP2d-QY": "Tartışmaya katılmak için lütfen {0} veya {1}",
    "IugAFc4OT": "Verileriniz gönderilirken bir sorun oluştu.",
    "Jf4iDTZ28": "Ayrıca, telefon numaranızı asla satmayacağımızdan veya kamuya açıklayamayacağımızdan emin olabilirsiniz.",
    "Jfr4RzEZG": "Şu anda hesabınızı kaydetmek için yalnızca {0} telefon numarasını kabul ediyoruz.",
    "JuZAli3": "Kullanıcı Kılavuzu",
    "K2UEY4ddl": "Kullanıcı kimliği geçersiz kelimeler içeriyor, lütfen {0} kullanmaktan kaçının",
    "KAiEq6dcwL5": "Son olarak, dostça bir hatırlatma olarak, her kullanıcı kendi söz ve eylemlerinin sorumluluğunu üstlenmelidir.",
    "MnVg5i": "Merhaba tanıştığımıza memnun oldum! Sizi bu topluluğa davet etmekten mutluluk duyuyoruz.",
    "MnVqwid": "Merhaba {0}. Tanıştığıma memnun oldum! Sizi bu topluluğa davet etmekten mutluluk duyuyoruz.",
    "NdqZcRL2QN": "Şifrenizi unutmanız durumunda 'Şifremi Unuttum' linkine tıklayarak şifrenizi sıfırlayabilirsiniz.",
    "OBjaZqTvx": "Ev",
    "OPevedpOM": "Telefon numaram yoksa ne olur?",
    "P1zxX2IQ5": "Ancak bu web sitesi için bu, orijinal grubun bir türetilmesidir ve yalnızca İngilizce öğrenimiyle sınırlı değildir, aynı zamanda diğer konular için de geçerlidir.",
    "Pu0pj23rR": "Telefon numarası neden gerekli?",
    "RYlJHHwg3": "SMS kodu doğru değil.",
    "RjdigcxfV": "Bize Ulaşın",
    "TV09-obNr": "Dönüm noktası",
    "TXdh_K": "Şifre",
    "TdXddh_wK": "Telefon numarası",
    "Te3h_wK": "Telefon numarası",
    "TqXdd3h_wK": "Telefon numarası",
    "TqXddh_K": "Doğrulama kodu",
    "TqXdh_K": "Şifreyi Onayla",
    "UED59zbd-": "LafAraçlar",
    "UjkOS50wO": "Ev",
    "VndKeCfb-": "Hesabı Etkinleştirmek için Telefonu Doğrulayın",
    "VnddCfb-": "Şu anda bir süreliğine yasaklısın",
    "W3M4ivK9U": "Profili Güncelle",
    "WKG7e": "Tüzük",
    "Wpdsp3g5U": "{0} Topluluğuna Hoş Geldiniz!",
    "XIzgAAR": "Genellikle web yöneticisinden veya diğer kullanıcılardan kullanılabilir bir davet kodu sağlanabilir.",
    "Xddh_wK": "Davet Kodu",
    "Y-svpKvUz": "iki şifre eşleşmiyor",
    "Y0drdCSiu": "Konular",
    "Yc5uMym": "ELB3'ün ne anlama geldiğini merak edebilirsiniz, kısacası, İngilizce meraklıları ve İngilizceyi öğrenmek ve takdir etmek için İngilizce meraklıları ve sınava girenler için ilginç bir platform olan, kar amacı gütmeyen WeChat grubunun {0} kısaltmasıdır!",
    "ZCzH8": "En yeni",
    "ZaS8MP8cr": "Not: Doğrulama kodu yenilendi, lütfen form değerlerinizi ayarlayın ve devam etmek için kodu yeniden girin.",
    "aISK9iYc_": "Yasa Dışı Bilgi Raporu",
    "aUdtds_qwY": "Normalde bu toplulukta kuralları ihlal etmiş olsanız bile kullanıcı kimliğiniz veya telefon numaranızla başarılı bir şekilde oturum açabilirsiniz.",
    "b7wgrhuXl": "Teknoloji",
    "b_vts": "Kayıt olmak",
    "dHWho": "Üye olmak",
    "dldeoeqwc": "Dostça Hatırlatmalar",
    "dnsz7fwNx": "Kullanıcı kimliği büyük/küçük harfe duyarlıdır.",
    "dsdfqw": "Kullanıcı yok",
    "dwJucRtar": "Bu kısım halen devam etmektedir, bu kısım için projeye katkıda bulunmanızı bekliyoruz.",
    "dzIC7qPQ": "Bize katılmak isterseniz, davetiye kodunu almak için lütfen web yöneticisine e-postası {0} veya WeChat hesabından {1} ulaşmayı deneyin.",
    "englishcorner": "İngilizce",
    "eqwee": "Şifre doğru değil",
    "fcGTPc7HP": "Davetiye kodunu nereden alabilirim?",
    "gTOv6abWT": "Giriş yapmak",
    "gTOv6adbWT": "Kayıt olmak",
    "geHXwByxy": "Ayarlar",
    "gmK3pKyRI": "{0} En Yüksek Çevrimiçi Sayı",
    "groupnote": "Hafıza",
    "hxCMxpW6Sq": "{0} gün önce katıldı",
    "jRFk519Bj-": "Bu topluluk tamamen uluslararası ücretsiz bir açık kaynak kodu projesi tarafından yönlendirilmektedir.",
    "jdbef_PBl": "Amaç",
    "ky6JphiKk": "{0} Çevrimiçi Kullanıcı",
    "lEDpJMRfG": "Kafanız karıştıysa, lütfen bize bir e-posta göndererek bunu bize bildirmekten çekinmeyin.",
    "lWqYc": "Bu web sitesi, JSON'dan XML'e, JSON'dan CSV'ye, JSON'dan YAML'ye dahil olmak üzere JSON araçları sağlar.",
    "lastreplyby": "Son yanıt yazan:",
    "lidydVO": "Neden engelleniyorum veya sınırlandırılıyorum?",
    "lu2T6idPY": "Hesabınızda bir sorun olduğunu düşünüyorsanız lütfen web yöneticisiyle iletişime geçin.",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "{0} Kullanıcı",
    "nncQE": "Hayat",
    "o4GdNzX6xS": "Öncelikle, dünyada iyi bilinen yönetmelik gereği, her kullanıcının kaydolmak için geçerli bir telefon numarası vermesi gerekmektedir.",
    "oHQNQ4mRw": "Kullanıcı kimliği",
    "p1Jyl4uMv": "Hesabınızdan Çıkış Yapın",
    "pNwe3": "Diğer",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "Web Sitesi Dilini Seçin",
    "uefFV1": "Daha sonra",
    "ufSPh0ad": "Hesabınızı mevcut telefon numaranız aracılığıyla kaydetmeniz mümkün değilse, lütfen web yöneticisine e-postası {0} veya WeChat hesabından {1} ulaşın. Hesabınızı manuel olarak kaydetmenize yardımcı olabiliriz.",
    "wCcPJZK": "{0} geçerli bir e-posta değil",
    "wCctGPJZK": "{0} boş olmamalıdır",
    "xhxY6iLDH": "Çıkış Yap",
    "yOdwRB": "ELB3 Topluluğuna hoş geldiniz!",
    "zr3ZBdUoT": "Kullanıcı Kılavuzu",
    "zuxd0y-kmA": "Kullanıcı Kimliği veya Telefon Numarasında boşluk yoktur."
}