{
    "15424": "Đó là toàn bộ vấn đề với khoa học. Bạn có rất nhiều nhà kinh nghiệm đang cố gắng mô tả những điều kỳ diệu không thể tưởng tượng được. – Bill Watterson",
    "15999": "Đổi mới là quá trình thực hiện những thay đổi trong một cái gì đó đã được thiết lập. -Nhóm định nghĩa đổi mới",
    "16987": "Đôi khi việc nằm trên giường vào thứ Hai sẽ có ích hơn là dành thời gian còn lại của tuần để gỡ lỗi mã của ngày Thứ Hai. – Dan Salomon",
    "19775": "Khoa học là một lối sống. Đó là một quan điểm. Khoa học là quá trình đưa chúng ta từ bối rối đến hiểu biết theo cách chính xác, có thể dự đoán và đáng tin cậy – một sự chuyển đổi mang lại sức mạnh và cảm xúc đối với những người đủ may mắn được trải nghiệm nó. – Brian Greene",
    "38127": "Kiểm tra là quá trình cố gắng phá mã - Ẩn danh",
    "42641": "Phát triển web đã khó, chỉ có thế thì mới thú vị. Bạn chỉ cần đặt ra tiêu chuẩn của mình. Nếu việc đó dễ dàng thì có ai làm được không? - Olawale Daniel",
    "46367": "Đổi mới là chìa khóa để mở ra tiềm năng tăng trưởng. -Omar Ishrak",
    "57225": "Đổi mới là huyết mạch của một doanh nghiệp thịnh vượng. -Michael Dell",
    "63470": "Một nhà khoa học thực sự giải quyết các vấn đề chứ không than vãn rằng chúng không thể giải quyết được. – Anne McCaffrey",
    "66187": "Nói chuyện là rẻ tiền. Cho tôi xem mã. - Linus Torvalds",
    "68518": "Phần mềm và thánh đường rất giống nhau - đầu tiên chúng tôi xây dựng chúng, sau đó chúng tôi cầu nguyện.",
    "77528": "Đổi mới là động lực thúc đẩy sự tiến bộ. -John F. Kennedy",
    "80972": "Tất nhiên, mã xấu có thể được dọn sạch. Nhưng nó rất đắt. — Robert C. Martin",
    "85805": "Chuyên gia là người đã mắc phải tất cả những sai lầm có thể mắc phải trong một lĩnh vực rất hẹp. – Neils Bohr",
    "92941": "Có thơ thực sự trong thế giới thực. Khoa học là thơ ca của hiện thực. - Richard dawkins",
    "": "Tin nhắn: {0}",
    "-8l11": "Đã sao chép",
    "-DqwwR": "Hoạt động đã hoàn tất.",
    "-GJ_72": "Đã chuyển sang không gian làm việc đã chọn {0}",
    "-Jx4J": "Tài khoản địa phương",
    "-Rj3y": "Chủ đề",
    "-XZnW": "Mặt sau",
    "-Yo129I": "Công cụ văn bản",
    "-nL_B5PoN": "Nén {0}",
    "00d36": "Cách tốt nhất để dự đoán tương lai là phát minh ra nó. -Alan Kay",
    "01do0y": "tiếng Kannada",
    "04SSf": "Quên mật khẩu?",
    "07naT": "Lỗi: {0}",
    "07ui6": "Thêm thông tin",
    "0Ceqru": "Base64 là ký hiệu để mã hóa dữ liệu byte tùy ý bằng cách sử dụng một bộ ký hiệu hạn chế mà con người có thể sử dụng thuận tiện và được máy tính xử lý.",
    "0MO3jj": "MD5 (Message-Digest 5) là hàm băm được sử dụng rộng rãi. Nó đã được sử dụng trong nhiều ứng dụng bảo mật và cũng thường được sử dụng để kiểm tra tính toàn vẹn của tệp. Tuy nhiên, MD5 không có khả năng chống va chạm và không phù hợp với các ứng dụng như chứng chỉ SSL/TLS hoặc chữ ký số dựa vào thuộc tính này.",
    "0PgZ_": "Dịch",
    "0YKce": "Chuyển đổi chuỗi thập phân mã nhị phân (BCD) thành số thập phân.",
    "0a310": "Không có con đường hoàng gia nào dẫn đến khoa học, và chỉ những ai không sợ hãi việc leo lên những con đường dốc mệt mỏi mới có cơ hội đạt được những đỉnh cao rực rỡ. – Karl Marx",
    "0a710": "Đổi mới là huyết mạch của bất kỳ tổ chức nào. -Bác sĩ. R. L. Bhatia",
    "0ba15": "Đổi mới thành công đòi hỏi phải chấp nhận rủi ro có tính toán. -Harvard Pruden",
    "0e299": "Về mặt lý thuyết, mọi thứ đều không thể cho đến khi nó được thực hiện. – Robert A. Heinlein",
    "0gvcN": "Chào mừng bạn đến với trang tổng quan, nó vẫn đang được phát triển.",
    "0gywa": "Không tìm thấy không gian làm việc, bạn sẽ được chuyển hướng đến trang chỉ mục không gian làm việc.",
    "0pfdz7": "tiếng Uzbek",
    "114ee": "Viết mã như thơ nên ngắn gọn và súc tích. — Santosh Kalwar",
    "13pmE": "Hỗ trợ chúng tôi",
    "149c0": "Trong các vấn đề khoa học, thẩm quyền của cả ngàn người không xứng đáng với lý luận khiêm tốn của một cá nhân. – Galileo Galilei",
    "1507oa": "tiếng Bengali",
    "1883d": "Khoa học kích thích trí tưởng tượng hơn rất nhiều so với khoa học cổ điển. – J. B. S. Haldane",
    "188cd": "Lập trình được học bằng cách viết chương trình. - Brian Kernighan",
    "18f46": "Tên lửa thật tuyệt. Không thể giải quyết được điều đó. – Elon Musk",
    "1JOFP": "Mở không gian làm việc của tôi",
    "1NTgQ": "Không gian làm việc mở",
    "1Npez": "Vui lòng cung cấp đường dẫn",
    "1Tuab": "Đã sao chép",
    "1X8x7": "Ví dụ",
    "1Xe82x7": "{0} Giảm thiểu",
    "1Xe8wx7": "Chuỗi lục giác",
    "1Xe8x7": "{0} Làm đẹp",
    "1Xe8x7qe": "BCD",
    "1YmJc": "Chọn một trong các tùy chọn làm ngôn ngữ ưa thích của bạn:",
    "1a3Sc": "Hủy tải",
    "1a8b9": "Nhà khoa học không phải là người đưa ra câu trả lời đúng mà là người đặt ra những câu hỏi đúng. – Claude Levi-Strauss",
    "1bd": "Quy trình làm việc",
    "1d71a": "Chúng ta sinh ra vào một thời điểm nhất định, ở một nơi nhất định và giống như những năm rượu vang cổ điển, chúng ta có những đặc điểm của năm và mùa mà chúng ta sinh ra. Chiêm tinh học không khẳng định điều gì hơn nữa. - Carl jung",
    "1da5a": "Đổi mới là nền tảng của sự tiến bộ và thành công trong thế giới kinh doanh hiện đại. -Trang Larry",
    "1e3e5n": "Tiếng Hausa",
    "1ff27": "Khoa học là thứ chúng ta hiểu đủ rõ để giải thích cho máy tính; nghệ thuật là mọi thứ khác. – Donald E. Knuth",
    "1h6jH": "Cảnh báo, đầu ra là một giá trị trống có độ dài bằng 0!",
    "1j62a": "Làm việc này vào lúc khác",
    "1jj0ri": "tiếng Nhật",
    "1k_44": "Hoạt động này giải mã dữ liệu từ chuỗi ASCII Base64 trở lại định dạng thô.",
    "1th2nw": "Sinhala",
    "1yIQu": "Bạn có thể thử xử lý lại hành động của mình hoặc nhấp vào nút bên dưới để loại bỏ lỗi.",
    "20nmcv": "Latin",
    "22XLF": "Chưa hoàn thành",
    "22f3a": "Đổi mới là vấn đề trung tâm của sự thịnh vượng kinh tế. – Michael Porter",
    "23f61": "Đổi mới không chỉ là có một ý tưởng hay; đó là về việc biến ý tưởng đó thành hiện thực. -Erik Qualman",
    "24vLI": "Tạo",
    "277a9": "Khoa học không thể giải quyết được bí ẩn cuối cùng của tự nhiên. Và đó là bởi vì, trong phân tích cuối cùng, bản thân chúng ta là một phần của bí ẩn mà chúng ta đang cố gắng giải đáp. – Max Planck",
    "27ef9": "Đổi mới là khả năng biến ý tưởng thành hóa đơn. -L. Ducan",
    "27j7sy": "Shona",
    "2D9a6": "Quên mật khẩu?",
    "2D9qdk6": "Nó có đủ an toàn không?",
    "2IF6A": "Có vẻ như việc lưu trữ giả mạo gặp phải một số vấn đề",
    "2JyFN": "Sao chép kết quả vào Clipboard",
    "2Ocbey": "Phiên bản",
    "2RhAT": "Có vẻ như quá trình truy xuất giả mạo gặp phải một số vấn đề",
    "2Ruh6": "Tạo tài khoản cục bộ mới",
    "2S5ap": "Bật chế độ toàn màn hình",
    "2S_7EVIsK": "Trình xác thực JSON",
    "2Y1mR": "Xóa văn bản",
    "2b7f7": "Tôi chắc chắn rằng vũ trụ tràn ngập sự sống thông minh. Nó quá thông minh để đến đây. – Arthur C. Clarke",
    "2bqHk": "Tải từ tập tin",
    "2e4fb7": "người Igbo",
    "2giYv": "Kiểm tra mật khẩu: {0}",
    "2khdsv": "Tiếng Pa-tô",
    "2lehqwp": "Tiếng Việt",
    "2lhcqwp": "tiếng Thổ Nhĩ Kỳ",
    "2lhqqwp": "tiếng Indonesia",
    "2lhqqwqp": "Mã Lai",
    "2lhqwwp": "tiếng Thái",
    "2qdin8": "Vui lòng nhập mã xác nhận",
    "2tib5m": "tiếng Thụy Điển",
    "2ybu7j": "người Na Uy",
    "30eo2v": "tiếng Gujarati",
    "321e0": "Việc gỡ lỗi khó gấp đôi việc viết mã ngay từ đầu. Do đó, nếu bạn viết mã một cách khéo léo nhất có thể thì theo định nghĩa, bạn không đủ thông minh để gỡ lỗi - Brian W. Kernighan",
    "32D9a6": "Tạo một tài khoản",
    "32c8d": "Nếu gỡ lỗi là quá trình loại bỏ lỗi thì lập trình phải là quá trình đưa chúng vào. – Sam Redwine",
    "33RXi": "Yêu cầu đã bị từ chối do các tham số không đạt yêu cầu.",
    "33aa4": "Khoa học chỉ là chủ nghĩa kinh nghiệm thuần túy, và do phương pháp của nó, nó loại trừ siêu hình học. – Steve Martin",
    "346qid": "tiếng Nga",
    "380da": "Lập trình ngày nay là một cuộc chạy đua giữa các kỹ sư phần mềm đang cố gắng xây dựng các chương trình chống ngu ngốc lớn hơn và tốt hơn và Vũ trụ đang cố gắng tạo ra những kẻ ngốc lớn hơn và tốt hơn. Cho đến nay, Vũ trụ đang chiến thắng. - Rick Cook",
    "394b6": "Nếu bạn nghĩ rằng khoa học là chắc chắn? à, đó chỉ là lỗi của bạn thôi. – Richard Feynman",
    "398cc": "Các lập trình viên dường như đang thay đổi thế giới. Sẽ thật nhẹ nhõm cho họ và cho tất cả chúng ta nếu họ biết điều gì đó về điều đó. – Ellen Ullman",
    "39dsCt": "Bạn sẽ nhận được thông báo mới nhất từ ​​các dịch vụ ứng dụng nếu có.",
    "3d297": "Điều tôi yêu thích ở khoa học là khi bạn học, bạn không thực sự nhận được câu trả lời. Bạn chỉ nhận được câu hỏi tốt hơn. – John Green",
    "3ii2tt": "Tiếng Gaelic của Scotland",
    "3umnB": "Mã thông báo không xác định",
    "40b7f": "Đổi mới là cách duy nhất để giành chiến thắng về lâu dài. -Jeff Immelt",
    "420b0": "Đổi mới thành công đòi hỏi sự cam kết hợp tác và giao tiếp cởi mở. -Rachel D. Ellison",
    "43be5": "Nhật ký",
    "43e45": "Không có luật nào ngoại trừ luật không có luật. – John Archibald Wheeler",
    "441oja": "tiếng Gruzia",
    "44Ntqw-": "Xử lý thao tác.",
    "45cb0": "Đổi mới không chỉ là tạo ra những ý tưởng mới mà còn là thực hiện chúng một cách thành công. -Arun Pandit",
    "46bksi": "tiếng Litva",
    "4K_vhq": "Sao chép tab này",
    "4PIqD": "Đánh giá mã",
    "4UYIJ": "Chưa hoàn thành.",
    "4cGA_": "Đang truy xuất dữ liệu về tùy chọn hệ thống...",
    "4cf03": "Trên thực tế, mọi thứ có thể được coi là số; vì không thể nắm bắt được bất cứ điều gì bằng tâm trí hoặc nhận ra nó nếu không có điều này. – Philolaus",
    "4d389": "Đổi mới là một lối sống của một doanh nhân thành đạt. -John Rampton",
    "4da84": "Có thể bạn không nghĩ lập trình viên là nghệ sĩ nhưng lập trình là một nghề cực kỳ sáng tạo. Đó là sự sáng tạo dựa trên logic. – John Romero",
    "4kKe4": "Mật khẩu của bạn",
    "4tqb4x": "người Hungary",
    "4vdfwf": "ĐƯỢC RỒI",
    "4wlih": "Yêu cầu đã bị từ chối do các tham số không đạt yêu cầu.",
    "52OiQ": "Đã sao chép {0} lần",
    "532fd": "Đổi mới là khả năng coi sự thay đổi là cơ hội chứ không phải mối đe dọa. -Steve Jobs",
    "54cwb": "API Websocket hệ thống đã gặp lỗi: {0}",
    "56ibcj": "Tiếng Việt",
    "57eaa": "Chúng ta chỉ là một giống khỉ tiên tiến trên một hành tinh nhỏ của một ngôi sao rất bình thường. Nhưng chúng ta có thể hiểu được Vũ trụ. Điều đó làm cho chúng tôi một cái gì đó rất đặc biệt. – Stephen Hawking",
    "58HQX": "Nếu bạn không biết giá trị của nó, vui lòng liên hệ với quản trị viên của bạn để biết thêm chi tiết, bạn có thể tìm thấy thông tin này trong cài đặt của anh ấy.",
    "58c03": "Đổi mới là yếu tố then chốt tạo nên sự thành công của bất kỳ doanh nghiệp nào. -Ravi Venkatesan",
    "58c5f": "Nếu lúc đầu bạn không thành công, hãy gọi nó là phiên bản 1.0. ― Khayri RR Woulfe",
    "59f7d": "Đổi mới là chất xúc tác cho sự tiến bộ và tăng trưởng. -John Donahoe",
    "5BOhl": "mã mời",
    "5Ih2u": "Công cụ điều hướng",
    "5NCPT": "Chế độ tối",
    "5NJeGsu1": "E-Mail, bạn có thể dễ dàng sắp xếp hộp thư đến, soạn và gửi thư cũng như luôn cập nhật thư từ của mình. Cho đến nay, nó chỉ được sử dụng như một công cụ giao tiếp giữa người dùng và nhóm của chúng tôi.",
    "5NJeddqGsu1": "Phần này bao gồm các tài liệu máy tính, bài viết wiki, hướng dẫn sử dụng, v.v.",
    "5NJedqddqGsu1": "Phần này bao gồm các tài nguyên máy tính có thể được sử dụng để xây dựng các dự án của riêng bạn.",
    "5Perd": "Rất tiếc, chức năng 'Sử dụng Trình chỉnh sửa Thông minh' hiện chưa khả dụng. Chúng tôi vẫn đang nỗ lực thực hiện nó. Cảm ơn vì sự kiên nhẫn của bạn.",
    "5ZBYR": "Mặt sau",
    "5a8a1": "Đổi mới là quá trình lấy ý tưởng và biến nó thành hiện thực. -Kevin O'Leary",
    "5dF7o": "Làm cho khỏe lại",
    "5db54": "Khoa học là liều thuốc giải độc tuyệt vời cho chất độc của sự nhiệt tình và mê tín. - Adam Smith",
    "5eXVS": "Nội dung tập lệnh",
    "5ggegx": "Hàn Quốc",
    "5lW8qp": "Hiển thị một ví dụ cho công cụ này",
    "5q-Zxqa": "Trình quản lý tập lệnh",
    "5qPOJL": "Để hỗ trợ LafTools, hãy cân nhắc việc gắn sao cho kho lưu trữ của chúng tôi trên GitHub hoặc nâng cấp lên phiên bản chuyên nghiệp của chúng tôi thông qua đăng ký hàng tháng. Chúng tôi đánh giá rất cao sự giúp đỡ của bạn và chúng tôi hứa rằng LafTools sẽ còn trở nên tốt hơn nữa với số tiền quyên góp được.",
    "5qV5Sf": "Xóa bản ghi này khỏi danh sách",
    "5rg5mt": "Malagasy",
    "5srFq": "LafCông cụ",
    "5v8jl7": "người Mông",
    "626bf": "Nếu chúng ta biết mình đang làm gì thì đó sẽ không được gọi là nghiên cứu, phải không? – Albert Einstein",
    "63d47": "Chất lượng là sản phẩm của sự xung đột giữa lập trình viên và người kiểm thử. - Yegor Bugayenk",
    "662f9": "Bạn chỉ sống một lần nhưng nếu bạn làm điều đó đúng một lần là đủ. - Mae Tây",
    "66ef1": "Mã tốt là tài liệu tốt nhất của riêng nó. Khi bạn chuẩn bị thêm một nhận xét, hãy tự hỏi bản thân: ‘Làm cách nào tôi có thể cải thiện mã để không cần đến nhận xét này? ' - Steve McConnell",
    "66f12": "Khoa học là kiến ​​thức có tổ chức. Trí tuệ là cuộc sống có tổ chức. – Will Durant",
    "6AumW": "Hành động mặc định",
    "6ClPV": "Tạo nên",
    "6MrfIfGc6": "Giảm thiểu mã",
    "6UICxHzVR.name": "Làm đẹp {0}",
    "6a0da": "Nghệ thuật và khoa học đặt câu hỏi là nguồn gốc của mọi kiến ​​thức. – Thomas Berger",
    "6cOPZ": "Thập phân mã hóa nhị phân (BCD) là một lớp mã hóa nhị phân của số thập phân trong đó mỗi chữ số thập phân được biểu thị bằng một số bit cố định, thường là bốn hoặc tám. Các mẫu bit đặc biệt đôi khi được sử dụng cho một dấu hiệu",
    "6hsnqWe": "Mặc dù LafTools là nguồn mở và miễn phí nhưng việc duy trì nó vẫn đòi hỏi một lượng thời gian và năng lượng đáng kể. Đặc biệt, chúng tôi cần tiền để thanh toán cho một số API đám mây nhất định. Nếu bạn đánh giá cao LafTools, hãy cân nhắc ủng hộ chúng tôi.",
    "6j13s3": "tiếng Iceland",
    "6qT9d-N": "Đối với notebook, LafTools không chỉ cung cấp trình quản lý lệnh shell mà còn sẽ bổ sung thêm các công cụ ghi chú mạnh mẽ vào đó trong thời gian tới như MarkDown, Latex, {0}, v.v.",
    "6ulj8i": "tiếng Nepal",
    "6wdtJ4vmg.name.0912": "Giảm thiểu {0}",
    "6yOXx": "Cái tên không quen biết",
    "71L3OI9T7": "Tìm kiếm hòa bình, thúc đẩy hợp tác và tìm kiếm sự phát triển đã trở thành chủ đề của thời đại hiện nay.",
    "71x7x": "Mã nguồn trên GitHub",
    "72bee": "Tôi không phải là một lập trình viên giỏi; Tôi chỉ là một lập trình viên giỏi với những thói quen tuyệt vời. - Kent Beck",
    "74a91": "Thử nghiệm dẫn đến thất bại và thất bại dẫn đến hiểu biết - Burt Rutan",
    "74f90": "Khoa học hôm nay là công nghệ của ngày mai. – Edward Teller",
    "7714b": "Đổi mới là chìa khóa để mở ra những cơ hội mới và thúc đẩy tăng trưởng.",
    "79f2d": "Hầu hết các lập trình viên giỏi làm lập trình không phải vì họ mong được trả tiền hay được công chúng khen ngợi mà vì lập trình rất thú vị. - Linus Torvalds",
    "7MOO1": "Đăng nhập",
    "7affb": "Thế giới sẽ không chờ đợi chúng ta. Cuộc cách mạng công nghệ sẽ bỏ chúng ta lại phía sau nếu chúng ta không bắt kịp. – Kofi Annan",
    "7c59e": "Kinh nghiệm là tên mọi người cho đến những sai lầm của họ. – Oscar Wilde",
    "7d4e4": "Đổi mới là tìm ra những cách mới và tốt hơn để thực hiện mọi việc. -Jim Rohn",
    "7dm0d8": "Truyền thống Trung Quốc",
    "7e19d": "Sự nhầm lẫn là một phần của lập trình. - Felienne Hermans",
    "7flKa": "LafTools - Đấng toàn năng cho mọi chuyên gia và kỹ sư",
    "7g5w22": "người Na Uy",
    "7k56u3": "tiếng Galicia",
    "7q40W": "Không thể khởi tạo quản trị viên",
    "7u4vzu": "Tiếng Slovak",
    "7x3f6": "Tab - 1",
    "8259a": "Lập trình viên: Một chiếc máy biến cà phê thành mã. – Ẩn danh",
    "82r0C": "Quản lý danh sách TODO của bạn và hoàn thành công việc hiệu quả hơn.",
    "83dNp": "Không thể tải ID tiện ích mở rộng. (Tham khảo: 1dl1f)",
    "850c1": "Nhà khoa học chỉ áp đặt hai điều, đó là sự thật và sự chân thành, áp đặt chúng cho chính mình và cho các nhà khoa học khác. - Erwin Schrödinger",
    "8582b": "Nếu muốn người dùng thích phần mềm của mình, chúng ta nên thiết kế nó để cư xử như một người đáng yêu. – Alan Cooper",
    "8692e": "Có rất nhiều kẻ lảm nhảm, hoàn toàn không biết gì về toán học, dám lên án giả thuyết của tôi, dựa trên thẩm quyền của một phần nào đó trong Kinh thánh đã bị bóp méo cho phù hợp với mục đích của họ. Tôi không coi trọng họ và khinh miệt sự phán xét vô căn cứ của họ. – Nicholas Copernicus",
    "886d1": "Chúng tôi cảm thấy rằng ngay cả khi tất cả các câu hỏi khoa học có thể được giải đáp thì các vấn đề của cuộc sống vẫn chưa được đề cập đến. – Ludwig Wittgenstein",
    "8LdRj": "Tổng quan",
    "8LdRjq": "Tính toán",
    "8LdevRj": "Dịch vụ",
    "8M1wY": "Nhà ga địa phương",
    "8OqB7hN1s": "Trang này cung cấp kiểu giao diện người dùng IDE cho LafTools, mức độ trừu tượng cao hơn cho LafTools.",
    "8c224": "Cho dù bạn muốn theo đuổi lĩnh vực công việc nào, điều quan trọng là phải học ít nhất một ngôn ngữ lập trình. ― Ram Ray",
    "8e5d0": "Đổi mới là tiếng gọi của tương lai. – Kofi Annan",
    "8eeL1Kk": "Về",
    "8mn_qa": "Đang lấy dữ liệu từ các dịch vụ đầu cuối...",
    "8qzWJu": "Rất tiếc, hiện tại chúng tôi chưa hỗ trợ thiết bị màn hình nhỏ, vui lòng sử dụng PC để truy cập trang này.",
    "90b5e": "Đó không phải là một lỗi; đó là một tính năng không có giấy tờ. ― Ẩn danh",
    "91f08": "Điều tốt nhất về công nghệ là nó cho phép bạn tập trung vào tầm nhìn của mình và quên đi máy móc. – John Landis",
    "9251d": "Đổi mới là yếu tố then chốt quyết định khả năng thành công lâu dài của bất kỳ công ty nào. -Elon Musk",
    "92b29": "Đổi mới là quá trình lấy ý tưởng sáng tạo và biến nó thành thành công về mặt thương mại. -Richard Branson",
    "9334e": "Vinh quang lớn nhất trong cuộc sống không nằm ở việc không bao giờ vấp ngã mà nằm ở việc đứng dậy sau mỗi lần vấp ngã. – Nelson Mandela",
    "9412b": "Đầu tiên, giải quyết vấn đề. Sau đó, viết mã. – John Johnson",
    "9469a": "Mọi người nên học cách lập trình máy tính vì nó dạy bạn cách suy nghĩ. – Steve Jobs",
    "97um9v": "tiếng Hawaii",
    "98KcL": "Chuyển đổi một số thập phân thành Số thập phân được mã hóa nhị phân (BCD).",
    "98d3f": "Khoa học là phép thuật có tác dụng. - Kurt Vonnegut",
    "9Xv8-": "Lưu dưới dạng ghi chú",
    "9YPgsPid2M": "Mã SMS",
    "9_qaj": "Thoát khỏi biểu mẫu này",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Bộ mã hóa Base64",
    "9b_7a0sdf": "Bộ giải mã Base64",
    "9cb71": "Đổi mới là tạo ra giá trị cho khách hàng và cải thiện cuộc sống của họ. -Reed Hastings",
    "9d18a": "Phần mềm đến từ thiên đường khi bạn có phần cứng tốt. – Ken Olsen",
    "9e4fcl": "Tiếng Tamil",
    "9eZHM": "Ối! Có vẻ như chúng tôi gặp phải một số cảnh báo hoặc lỗi.",
    "9gqo8x": "tiếng Latvia",
    "9m85mf": "Sesotho",
    "9qy1xn": "tiếng Bồ Đào Nha",
    "9tbbkt": "tiếng Phần Lan",
    "9zCSc": "Không có không gian làm việc có sẵn",
    "A69UZ": "Biến",
    "AVUvu": "Base62 là ký hiệu để mã hóa dữ liệu byte tùy ý bằng cách sử dụng một bộ ký hiệu hạn chế mà con người có thể sử dụng thuận tiện và được máy tính xử lý. Cơ sở số cao dẫn đến các chuỗi ngắn hơn so với hệ thập phân hoặc thập lục phân.",
    "AW9N8": "Vùng đầu vào",
    "AfPC0": "Mật khẩu văn bản đơn giản của bạn",
    "Ahrjc": "Thư mục không tồn tại, bạn có muốn tạo nó không?",
    "AkXgF": "Đang tiến hành: {0}%",
    "Apx8D": "Làm cách nào để đặt lại mật khẩu của bạn theo cách thủ công?",
    "AvsWiJHLZ": "Tài nguyên",
    "B-GCloBBt": "Nén mã Ngôn ngữ đánh dấu mở rộng (XML).",
    "B0s0z": "Mục đích của trang này:",
    "BGd7P9": "Hoạt động này mã hóa dữ liệu thô thành chuỗi ASCII Base64.",
    "BGd7dP9": "Thao tác này mã hóa dữ liệu thô thành chuỗi ASCII {0}.",
    "BGdd7dP9": "Thao tác này mã hóa dữ liệu thô thành chuỗi ASCII {0}.",
    "BJbgR": "Báo cáo sự cố",
    "BQs6go-dk": "Tải xuống miễn phí LafTools cho Windows, Linux và macOS.",
    "BShq3M": "Các vấn đề",
    "BW3bpT": "Đọc file từ đĩa...",
    "Bd9h-": "Thêm nó vào bộ sưu tập yêu thích của tôi",
    "BuihG": "Cài đặt hệ thống",
    "C3L9MmdDU7": "Sổ tay",
    "CASef": "Được rồi, hoạt động đã được kích hoạt.",
    "CEv8B": "Bạn có chắc chắn xóa bản ghi này không? Nếu có, hãy nhấp vào nút này một lần nữa.",
    "CFg8B": "Kích thước phải nằm trong khoảng từ 0 đến 512",
    "CK5NCw519": "Câu chuyện cộng đồng",
    "CVUl0": "LafCông cụ",
    "CWoqhy": "Danh sách Exts theo CategoryID đã chọn",
    "C_qzLO7yw": "Vui lòng sử dụng Chrome, Firefox hoặc Edge để có trải nghiệm tốt nhất.",
    "CfZAX": "Tệp {0} đã được chọn, chúng tôi đang tải tệp đó lên dịch vụ cốt lõi.",
    "CidOqAZ": "Với tư cách là người tạo ra LafTools, tôi rất cảm động khi bạn sẵn sàng hỗ trợ chúng tôi. Chúng tôi có những người giỏi trong nhóm làm việc chăm chỉ để liên tục cải tiến LafTools.",
    "Cide2w": "Để xem có vấn đề gì trong khi thực hiện hành động của bạn không.",
    "CqFdiBu6M": "Xem",
    "Cz_qjjFw7": "Giới thiệu về {0}",
    "DIQFq": "Vui lòng kiểm tra xem tham số URL đã được cung cấp đúng chưa, có vẻ như bạn không có quyền điền vào biểu mẫu này. Theo mặc định, bạn sẽ có thể thấy thông báo bên dưới trong đầu ra của dịch vụ khi nó vừa khởi chạy.",
    "DIweGq": "Bảo mật LafTools của bạn",
    "DSEtLTxUU": "Thời gian là tiền tệ của cuộc đời bạn, hãy sử dụng nó một cách khôn ngoan.",
    "DTTPW": "Thiết lập trạng thái",
    "DVoKw": "Đăng xuất hệ thống này",
    "DadYp": "Gỡ lỗi theo thời gian thực",
    "DqFI5": "Cấp độ phải lớn hơn 0",
    "DrXAq": "Chào mừng bạn đến sử dụng LafTools!",
    "DrbEr": "Mật khẩu bạn cung cấp trống, vui lòng kiểm tra và thử lại.",
    "DtlAc": "Đang tải tài nguyên hệ thống",
    "Dxlw0": "Hoàn thành",
    "E62ej": "Lọc lệnh Shell",
    "E6F9B": "Thêm nó vào quy trình làm việc",
    "EEQkeW": "Thuật toán MD6 (Message-Digest 6) là hàm băm mật mã. Nó sử dụng cấu trúc giống cây Merkle để cho phép tính toán băm song song rất lớn cho các đầu vào rất dài.",
    "EO6Qv5dCA": "Giảm thiểu mã JSON, giảm kích thước gói mã JSON của bạn.",
    "ERK7E": "Nếu bạn gặp bất kỳ vấn đề nào hoặc có bất kỳ đề xuất nào khi sử dụng LafTools, vui lòng liên hệ với chúng tôi qua EMail hoặc GitHub bất kỳ lúc nào, chúng tôi sẵn sàng cải tiến vấn đề đó ngay lập tức.",
    "EgBXL": "Chọn hoặc cung cấp thẻ.",
    "Ewvgo": "Vẫn chưa bắt đầu.",
    "ExqvX": "Danh sách phím nóng",
    "Eyq856": "Chúng tôi vẫn chưa hoàn thành - chúng tôi nỗ lực cung cấp các tính năng mới nhất và tuyệt vời nhất, đồng thời chúng tôi sẽ tiếp tục phát hành các bản cập nhật để đảm bảo bạn có trải nghiệm tốt nhất có thể.",
    "Ezsn81tfc": "Xem",
    "F-OUm": "Thiết lập nhanh cho LafTools",
    "F0CCF": "Danh sách phím nóng",
    "F4uS2": "Tập tin mới",
    "FAQ": "Các câu hỏi thường gặp",
    "FBVyc": "Vui lòng nhập lại mã xác minh",
    "FDlRI": "Đặt tên cho tab mới này và nhấn vào để xác nhận.",
    "FLsbFsOZq": "IDE",
    "FOyHW": "Tìm kiếm mọi nơi",
    "FQzhg": "Bỏ qua đầu vào trống",
    "FYRoL": "Thụt lề và chỉnh sửa mã Cascading Style Sheets (CSS).",
    "FhVWl": "Mã hóa mật khẩu của bạn",
    "FjYbR": "đầu ra",
    "Fv-zz": "Sao chép kết quả",
    "Fy217": "Cấu hình công cụ này",
    "Fzp3t": "Vui lòng cung cấp giá trị trong trường này",
    "G2dvTUljF": "Công cụ",
    "G3MJN": "Hiển thị bảng đầu ra",
    "G9QVo": "Quản lý tab",
    "GR7jK": "Kiểu",
    "GaySMPQHo": "Xu hướng",
    "Ggob_": "Hủy bỏ",
    "H-Ae75": "Vui lòng xác nhận mật khẩu cục bộ của bạn.",
    "H-qA75": "Vui lòng cung cấp mật khẩu cục bộ.",
    "H8fQ4": "Chuyển sang chế độ Sáng hoặc Tối",
    "HEAhr": "Sau khi dịch xong kết quả sẽ hiện ra ở đây.",
    "HIc3c": "Hoàn thành",
    "HNDat": "Để thực hiện thay đổi, vui lòng nhấp vào nút \"{0}\". Nếu không, hãy nhấp vào \"{1}\" để áp dụng các thay đổi của bạn. Chúc bạn có thời gian vui vẻ với hộp công cụ này!",
    "Hflf2": "Vì mục đích bảo mật mạng, chúng tôi sẽ không giúp đặt lại mật khẩu của bạn thông qua API hoặc các trang ở đây trừ khi bạn cập nhật tệp được hệ thống bảo vệ theo cách thủ công.",
    "HjvV3": "Chúng tôi sẽ không xóa các tập tin của nó trên đĩa, chỉ xóa bản ghi này khỏi danh sách.",
    "HyIC_": "Phím gạch chéo (/)",
    "HyIC_d": "Phím gạch chéo (/)",
    "I8FLi": "Bây giờ, đã đến lúc thiết lập quản trị viên của bạn, vui lòng đặt mật khẩu phức tạp nhất có thể để có thể khiến những kẻ tấn công bất lịch sự đó bối rối.",
    "IAC0A": "Công cụ tìm kiếm",
    "ICefi": "Đã hủy",
    "IEFy5k39X": "Máy phát điện",
    "IKqqATS": "Làm mới dữ liệu trang hiện tại",
    "IOOrz": "(Nó có gây hại cho hệ thống của bạn không? Chúng tôi không nghĩ như vậy, miễn là bạn có thể sửa đổi tệp cấu hình được bảo toàn hệ thống, điều đó có nghĩa là bạn được cấp quyền đọc mọi thứ về tệp dữ liệu LafTools.)",
    "IWPP6V-tR": "Mã nguồn",
    "IWUH5": "Hiển thị ví dụ",
    "IaSyO": "Hủy bỏ",
    "Ibzs2-Ho1": "Công cụ CSV",
    "IfsGO": "Yêu thích",
    "IfsdGO": "Yêu thích",
    "ImUmf": "Mới",
    "IugAFc4OT": "Đã xảy ra sự cố khi gửi dữ liệu của bạn.",
    "IxAJswoSh": "Phân tích cú pháp và in đẹp mã JavaScript hợp lệ. Cũng hoạt động với Ký hiệu đối tượng JavaScript (JSON).",
    "J-3KA": "Vui lòng cung cấp tên cho tập lệnh này, điều này sẽ hữu ích hơn.",
    "J164i": "ví dụ. Sao chép tập tin vào máy chủ từ xa",
    "J2xoL": "Vui lòng xem lỗi: {0}",
    "JA_Bp": "Trước tiên, vui lòng cung cấp tên cho thẻ mới.",
    "JQEVK": "Mã số",
    "JQLmS": "Đã điều chỉnh kích thước",
    "JQLmSq": "Hoàn thành.",
    "JTBRh": "LafTools đã lưu trữ giá trị mật khẩu vào tệp cục bộ, nhưng đừng lo lắng, chúng tôi đã áp dụng cơ chế mã hóa mật khẩu một chiều, nghĩa là không ai có thể đọc được mật khẩu của phiên bản văn bản thuần túy. Để đặt lại mật khẩu, vui lòng làm theo các công cụ bên dưới để đặt lại mật khẩu theo cách thủ công.",
    "JYqxz2": "Chào mừng bạn đến với LafTools, đây là phiên bản nội bộ.",
    "Jbor69IBw": "Trình định dạng",
    "JdqiUE8": "Thao tác này giải mã dữ liệu từ chuỗi ASCII (với bảng chữ cái bạn chọn, bao gồm các giá trị đặt trước) trở lại dạng thô.",
    "JdqidUE8": "Thao tác này giải mã dữ liệu từ chuỗi ASCII (với bảng chữ cái bạn chọn, bao gồm các giá trị đặt trước) trở lại dạng thô.",
    "JfFHw": "Nhận yêu cầu thông tin về không gian làm việc",
    "JiUE8": "Thao tác này giải mã dữ liệu từ chuỗi ASCII {0} trở lại định dạng thô.",
    "Jq7x3Igk0": "Hãy thử kiểu giao diện người dùng khách hàng",
    "JuZAli3": "Hướng dẫn sử dụng",
    "K1qJZI": "Chào mừng đến với LafTools, thưa Ngài.",
    "KGS2-": "Sau khi hoàn thành các bước trên, bạn có thể sử dụng mật khẩu mới để đăng nhập vào hệ thống của mình. Nếu bạn không thể truy cập hệ thống tệp, vui lòng yêu cầu quản trị viên hoặc bộ phận hỗ trợ CNTT của bạn tạo tệp đó. Nếu tập tin đã tồn tại thì hãy xóa nó đi và tạo lại tập tin mới.",
    "KIc63": "Chức năng chưa được hỗ trợ",
    "KYh1N": "Tất cả ghi chú",
    "KcqrRr": "Thẩm quyền giải quyết",
    "KcrRr": "Truy xuất dữ liệu triển khai mã",
    "KmEUF": "Cung cấp tổng quan nhanh về các công cụ hệ thống hiện tại.",
    "Kw4OJr": "Phần cuối",
    "Kyd9H": "Mã nguồn trên GitHub",
    "L-p-Y": "Sao chép nội dung của lệnh shell hiện tại vào clipboard",
    "L3zEM": "Hiển thị ví dụ",
    "L42mxa": "Vui lòng nhập văn bản nguồn của bạn vào trường này.",
    "L49kCq": "Vui lòng cung cấp và xác nhận mật khẩu khóa trong biểu mẫu này để bảo mật LafTools của bạn.",
    "L71q_N": "Mật khẩu bạn cung cấp trống, vui lòng kiểm tra và thử lại.",
    "L9bQku": "Giải mã {0}",
    "L9qbQku": "Giải mã {0}",
    "LAc1m": "Đã làm mới chế độ xem ứng dụng.",
    "LFdvM": "Chưa đăng nhập",
    "LM715": "Truy xuất cấu hình i18n từ API máy chủ cục bộ",
    "LPJrV": "Sao chép kết quả",
    "LSohY6eZW": "Chuỗi Hex là một chuỗi byte thập lục phân được phân tách bằng dấu phân cách, có thể là dấu cách, dấu phẩy, dấu chấm phẩy hoặc dấu hai chấm.",
    "LU9Jj": "Base85 (còn gọi là Ascii85) là ký hiệu để mã hóa dữ liệu byte tùy ý. Thông thường, Base64 sẽ hiệu quả hơn. Thao tác này giải mã dữ liệu từ chuỗi ASCII (với bảng chữ cái bạn chọn, bao gồm các giá trị đặt trước). Base85 thường được sử dụng ở các định dạng tệp PostScript và PDF của Adobe.",
    "LWaeFqd": "Chuyển sang ngôn ngữ ưa thích của bạn",
    "Le71_N-": "Mật khẩu bạn cung cấp không giống với mật khẩu đã xác nhận, vui lòng kiểm tra và thử lại.",
    "LnJ4H": "Lưu ý rằng tài khoản cục bộ hoàn toàn không giống với người dùng đã đăng ký trên trang web của chúng tôi, tài khoản trước chỉ được xác định trên PC của bạn trong khi tài khoản sau có thể được sử dụng để đồng bộ hóa trên đám mây.",
    "LqWaFd": "Cài đặt hệ thống",
    "LxaEFHbfa": "Giảm thiểu mã SQL, giảm kích thước gói mã SQL của bạn.",
    "M3qytc": "Mã hóa {0}",
    "M3ytc": "Mã hóa {0}",
    "M4ywN1": "Máy tính, Lịch, Đồng hồ, Thời tiết, v.v.",
    "M6MrW": "Tốt",
    "M7jct": "Vào chế độ toàn màn hình",
    "MN2lT": "Độ dài của Mật khẩu không thể nhỏ hơn 6",
    "Ma5mv": "Chuyển đổi chế độ hiển thị của các tab thanh công cụ",
    "Mq9pdpT": "Liệt kê tất cả các tài nguyên có liên quan cho menu chức năng bạn đã chọn.",
    "Mq9ppT": "Xem nhanh trạng thái dịch vụ của bạn",
    "Mqq9pdpT": "Giúp bạn bắt đầu với LafTools.",
    "MrgmU": "Xác nhận",
    "NMLOn": "Sao chép đường dẫn tệp",
    "NMLOn1": "Không gian làm việc mở",
    "NNfJo": "Tải dữ liệu từ tệp",
    "Nq1IR": "Không thể tải tiện ích mở rộng VM",
    "Nqc0LqwX": "Nếu bạn cho rằng có lỗ hổng trong quá trình này, vui lòng liên hệ với chúng tôi qua EMail hoặc GitHub bất kỳ lúc nào, chúng tôi muốn cải thiện lỗ hổng đó một cách khẩn cấp.",
    "NrQc8OJfZ": "Nén mã Ký hiệu đối tượng JavaScript (JSON).",
    "O02-W": "Không tải...",
    "O94Yx": "TRÊN",
    "OBjaZqTvx": "Trang chủ",
    "OO0qPN": "Ví dụ đã được tải",
    "OQWm4": "Báo cáo lỗi",
    "OSHOI": "Trang chào mừng",
    "OSqZQM": "Mật khẩu cục bộ",
    "OeO0PeN": "Được rồi, ví dụ được hiển thị trong trình soạn thảo đầu vào.",
    "OeOQY": "LÀM",
    "Ol1ZcWomT": "{0} Làm đẹp",
    "OpPFe": "Nếu bạn thích LafTools, hãy chia sẻ nó với bạn bè của bạn và cho chúng tôi một ngôi sao, cảm ơn!",
    "Opcty": "Các tập tin",
    "OqqGx2qg": "Đang tải tài nguyên tĩnh, vui lòng đợi...",
    "OrCt5": "Đang chuyển hướng đến bàn làm việc...",
    "Ot6EP": "Dụng cụ đánh bóng",
    "OyZLZokUQ": "Trao quyền phát triển với LafTools!",
    "P4ROa": "Vùng đầu ra",
    "PM_N5": "Phiên - {0}",
    "PUxuU": "Đang lấy dữ liệu cho gói ngôn ngữ...",
    "PapkF": "Nếu bạn có bất kỳ câu hỏi hoặc đề xuất nào về LafTools, vui lòng cho chúng tôi biết. Chúng tôi luôn tìm cách cải thiện sản phẩm của mình và cung cấp trải nghiệm tốt nhất có thể cho người dùng. Bạn có thể liên hệ với chúng tôi tại work7z@outlook.com. Cảm ơn bạn đã sử dụng LafTools!",
    "PpCHA": "Khóa câu hỏi(?)",
    "PqazM-": "Trước hết, vui lòng sử dụng các điều khiển biểu mẫu bên dưới để mã hóa mật khẩu của bạn",
    "QL9Sn": "Hiện tại, dường như không có mô tả nào.",
    "QLKzF": "Nó có rất nhiều tính năng đáp ứng nhu cầu của cả nhà phát triển mới làm quen và nhà phát triển có kinh nghiệm, khiến nó trở thành công cụ bắt buộc phải có trong kho vũ khí của bất kỳ lập trình viên nào.",
    "QM2Ob": "Công cụ gần đây",
    "QM2Oq": "Ghi chú gần đây",
    "QRAdA": "từ tiếng Anh sang tiếng Trung",
    "QZK58Gemi": "Nén mã Ngôn ngữ truy vấn có cấu trúc (SQL).",
    "QhdpH": "Ấn bản cộng đồng",
    "QkJ-TOduip6z_": "IDE LafTools",
    "QvBKp9BBp": "Tìm hiểu thêm về quy hoạch phát triển của LafTools.",
    "QzlA3": "Đã xảy ra lỗi",
    "R12bq": "Liệt kê các tab không được hiển thị",
    "RNBze0": "Công cụ",
    "RNeBze0": "Tab đã mở",
    "RNewBze0": "Cấu hình công cụ",
    "RO4ZP": "Đã xảy ra lỗi",
    "RPVRl": "Có vẻ như tiện ích mở rộng này không tương thích với phiên bản hiện tại của LafTools. Vui lòng xem xét cài đặt phiên bản mới nhất để hỗ trợ tiện ích mở rộng này hoặc vui lòng liên hệ với chúng tôi bằng cách nêu vấn đề trên GitHub.",
    "RhqzcdD": "Cài đặt hệ thống",
    "RjCO3": "Danh sách không gian làm việc",
    "RjdigcxfV": "Liên hệ chúng tôi",
    "S4MMV": "Ối! Chúng tôi đã tìm thấy một số vấn đề khi tải tệp.",
    "SAnnQ": "Đang tải tệp {0}",
    "SBsDz": "Thiết lập cho tài khoản quản trị viên của bạn.",
    "SGs7B": "Thiết lập LafTools của bạn một cách nhanh chóng",
    "SMqD13": "Nhập để lọc",
    "SPem9": "Lĩnh vực này vẫn chưa sẵn sàng.",
    "SQAw7": "Ngôn ngữ nguồn",
    "SYSq1": "Ví dụ",
    "SZgXb": "Thiết lập mật khẩu cục bộ",
    "SdGcT": "Phần khác",
    "Sm9tq": "Vui lòng cung cấp mật khẩu tài khoản tại đây",
    "Sm9tqq": "Vui lòng cung cấp mật khẩu để mở khóa LafTools của bạn",
    "Spcfdee": "Chế độ sáng hoặc tối",
    "TBPqy7": "Ngôn ngữ",
    "TD7DA": "Ngôn ngữ",
    "TNoePE": "Đám mây LafTools",
    "TV09-obNr": "Cột mốc quan trọng",
    "Ttrqqet": "Viết và lưu suy nghĩ của bạn ở đây!",
    "TwFcr": "Ngôn ngữ mục tiêu",
    "TyqvWY3": "Tệp cục bộ",
    "U2ZNl": "Tìm hiểu thêm trên Wikipedia",
    "U4qqq9": "Xóa tab này khỏi danh sách",
    "U7zP2": "Vui lòng cung cấp tên người dùng tài khoản tại đây",
    "UED59zbd-": "LafCông cụ",
    "UF_Dp": "Đã xảy ra lỗi: {0}, thời gian bị từ chối là {1}",
    "UVvJp-vtF": "{0} Giảm thiểu",
    "UZ2Ig": "Tài khoản cục bộ mới",
    "Ugpng": "Yêu thích",
    "UjkOS50wO": "Trang chủ",
    "V2A74ySoN": "Xem",
    "V6U_f": "Điều khoản dịch vụ",
    "V6XEO": "Nhập tên người dùng hoặc Email",
    "VAZq8r": "Nó cho phép các nhà phát triển thực thi nhiều lệnh khác nhau, chẳng hạn như chạy tập lệnh, cài đặt gói và điều hướng hệ thống tệp, tất cả đều từ bên trong trình chỉnh sửa.",
    "VEfeqZG": "Ghi chú",
    "VI6VT": "Lịch sử",
    "VOsZc": "Báo cáo phát hành",
    "VSZ": "Bấm để kích hoạt lại",
    "VZtqg6": "Tạo biểu mẫu tập lệnh mới",
    "Vaf2y": "Tên tab không được để trống.",
    "VeY9K": "Điều khoản sử dụng",
    "VgG5y": "Nhấp vào đây để làm mới trạng thái tiện ích mở rộng của bạn",
    "VjZCv": "Chuyển đổi thời gian thực",
    "Vvt09V2Qo": "Mã chung",
    "WFUWzv_px": "Phân tích cú pháp và in đẹp mã JavaScript hợp lệ. Cũng hoạt động với Ký hiệu đối tượng JavaScript (JSON).",
    "WKG7e": "Quy tắc",
    "WPrTW": "Trang web chính thức",
    "WXo6D": "Đã làm mới",
    "WYCVL": "Cài đặt nhanh",
    "X4L_Z": "VM mở rộng không được cung cấp.",
    "X6Fq4j": "Sau nhiều năm phát triển và cải tiến tận tâm, chúng tôi tin tưởng rằng LafTools có thể nâng cao đáng kể trải nghiệm lập trình của bạn bằng cách mang lại sự thuận tiện và hiệu quả hơn cho quy trình làm việc của bạn.",
    "XKpI0": "Nhấp để xử lý văn bản của bạn trong vùng nhập",
    "XLWoR": "Chọn cái bạn thích và tiếp tục",
    "XQxJB": "Không gian làm việc của tôi",
    "X_HGx": "LafTools là một hộp công cụ đa năng được thiết kế để đáp ứng nhiều nhu cầu khác nhau. Nó hoàn toàn là nguồn mở, đảm bảo tính minh bạch và bảo mật. Mặc dù có thời gian chạy nhẹ nhưng nó cung cấp hỗ trợ nền tảng đầy đủ, bao gồm ARMv8 và hỗ trợ AI gốc tương tự như ChatGPT. LafTools được tích hợp cao với giao diện người dùng hiệu quả và được cập nhật liên tục với các công cụ mới. Nó có thể được sử dụng trên web và với Docker, đồng thời cung cấp các tài nguyên bổ sung như ghi chú và hướng dẫn sử dụng.",
    "XeXF77": "Cài đặt",
    "XikdD": "Xin vui lòng chờ một chút, chúng ta sắp đến nơi rồi!",
    "Y5GAC": "Tên người dùng của bạn",
    "Y9mQ2": "Vui lòng cung cấp tên người dùng tài khoản tại đây",
    "YAAU3q": "Mật khẩu cục bộ",
    "YHCjT": "LafTools hỗ trợ chủ đề sáng và tối toàn cầu, đặc biệt hữu ích với các lập trình viên làm ca đêm.",
    "YNwKz": "Ngôn ngữ không được hỗ trợ: {0}, sẽ sử dụng tiếng Anh theo mặc định.",
    "YOYTp": "Cài đặt nhanh",
    "YPPPL": "Chuyển đổi chế độ hiển thị của các tab thanh công cụ",
    "YQN9u": "Đã xảy ra lỗi khi tải {0}, vui lòng kiểm tra chi tiết bên dưới.",
    "Y__Zb1_4Q": "Giảm thiểu mã Cascading Style Sheets (CSS), loại bỏ tất cả các ký tự không cần thiết.",
    "Y_k0z": "Quên mật khẩu?",
    "Ye3TXses": "Để định cấu hình xem quá trình chuyển đổi có được thực hiện tự động hay không khi văn bản đầu vào được thay đổi.",
    "Ylq2X": "Sửa lỗi",
    "YquQqTXq": "Tự động chạy?",
    "YrTdq": "Tất cả",
    "YrVq683": "Thư",
    "YrVqdd683": "Hướng dẫn sử dụng",
    "Z2QTU": "Về",
    "Z3rhY": "Tin nhắn",
    "Z7ALO": "Đã chuyển sang không gian làm việc đã chọn",
    "Z7OTt": "Tệp bạn chọn quá lớn, vui lòng chọn tệp nhỏ hơn 30MB.",
    "ZAGva": "Bạn có chắc chắn xóa không gian làm việc này không?",
    "ZAKaFq": "Tài khoản đám mây của tôi",
    "ZCzH8": "Mới nhất",
    "ZW1Dgz": "Không có tin nhắn nào",
    "ZXRGC": "Vui lòng xem lỗi: {0}",
    "ZaS8MP8cr": "Lưu ý: Mã xác minh được làm mới, vui lòng điều chỉnh giá trị biểu mẫu của bạn và nhập lại mã để tiếp tục.",
    "ZbD3F": "{0}, được tạo bởi nhóm LafTools",
    "Zk7JI": "Nó vẫn chưa được hỗ trợ",
    "ZrbduC": "Đóng tất cả cửa sổ",
    "ZrbuC": "Đóng tab",
    "_5OqeG": "Bỏ đánh dấu nó",
    "_LFF3": "Nếu bạn gặp bất kỳ vấn đề nào hoặc có bất kỳ đề xuất nào khi sử dụng LafTools, vui lòng liên hệ với chúng tôi qua EMail hoặc GitHub bất cứ lúc nào, chúng tôi sẵn sàng cải thiện nó.",
    "_trez": "Hoán đổi văn bản",
    "_trqL": "Đang truy xuất dữ liệu về tài nguyên hệ thống...",
    "_z3lR": "Làm mới mã",
    "a0ab0": "Nghệ thuật là cây sự sống. Khoa học là cây chết. – William Blake",
    "a2849": "Khoa học là sự chấp nhận những gì hiệu quả và bác bỏ những gì không hiệu quả. Điều đó cần nhiều can đảm hơn chúng ta tưởng. – Jacob Bronowski",
    "a3508": "Được trang bị năm giác quan, con người khám phá vũ trụ xung quanh mình và gọi cuộc phiêu lưu là Khoa học. – Edwin Hubble",
    "a3yqoz": "tiếng Ba Tư",
    "a3z-3k12": "Công cụ địa chỉ IP",
    "a4jbpq": "tiếng Séc",
    "a5354": "Thật kỳ lạ là chỉ có những khám phá phi thường do con người tạo ra sau này mới xuất hiện dễ dàng và đơn giản đến vậy. – George C. Lichtenberg",
    "a7062": "Sự đổi mới là tia lửa khơi dậy sự tiến bộ. -Robyn M. D'Angelo",
    "a8a34": "Đổi mới là tấm thẻ gọi của tương lai. -Anna Eshoo",
    "a8dd9": "Sự sống không thể có một sự khởi đầu ngẫu nhiên… vấn đề là có khoảng 2000 enzyme, và cơ hội có được tất cả chúng trong một thử nghiệm ngẫu nhiên chỉ là một phần trong 10^40.000 một xác suất cực kỳ nhỏ mà thậm chí cả vũ trụ cũng không thể đối mặt được. bao gồm súp hữu cơ. – Fred Hoyle",
    "aCkOP": "Lối ra",
    "aHAfR": "Đang tìm nạp dữ liệu cho {0}...",
    "aISK9iYc_": "Báo cáo thông tin bất hợp pháp",
    "aSOpr": "Trình tạo mô hình dữ liệu",
    "aa2f1": "Khám phá là việc bạn làm khi bạn không biết mình đang làm gì. Đó là những gì các nhà khoa học làm hàng ngày. Nếu một nhà khoa học đã biết họ đang làm gì thì họ sẽ không khám phá được điều gì vì họ đã biết họ đang làm gì rồi. – Neil deGrasse Tyson",
    "aa3a4": "Mã giống như sự hài hước. Khi bạn phải giải thích thì thật tệ. – Nhà Cory",
    "ab5f7": "Điều đáng buồn nhất của cuộc sống hiện nay là khoa học thu thập kiến ​​thức nhanh hơn xã hội thu thập trí tuệ. - Isaac asimov",
    "about_LafTools_toolbox": "Giới thiệu về LafTools",
    "ac615": "Làm cho nó hoạt động, làm cho nó đúng, làm cho nó nhanh chóng. – Kent Beck",
    "adcca": "Bất kỳ kẻ ngốc nào cũng có thể viết mã mà máy tính có thể hiểu được. lập trình viên giỏi viết mã mà con người có thể hiểu được. - Martin Fowler",
    "adpgq": "Tạo không gian làm việc mới",
    "af3158": "Mọi thứ đều được quyết định... bởi những thế lực mà chúng ta không thể kiểm soát được. -Albert Einstein",
    "afcb9": "Không có gì có khả năng mở rộng tâm trí bằng khả năng điều tra một cách có hệ thống và thực sự tất cả những gì bạn quan sát được trong cuộc sống. – Marcus Aurelius",
    "afe52": "Luôn có thêm một lỗi cần sửa. – Ellen Ullman",
    "ah-C4": "Ghi chú mới",
    "aj3nhd": "tiếng Đức",
    "aked6": "Người giới thiệu",
    "aked61": "Giới thiệu",
    "asElV": "Di dời",
    "az4uS2": "Bạn có chắc chắn đăng xuất khỏi hệ thống này không? Lưu ý rằng bạn sẽ được chuyển hướng đến trang đăng nhập.",
    "azpNX": "Hoàn thành.",
    "azsd": "Điều hướng nhanh",
    "b0qjSL": "Vui lòng nhập thư mục {1} và tạo tệp {2}, đặt mật khẩu được mã hóa của bạn làm toàn bộ nội dung tệp.",
    "b194e": "Sự đổi mới đến từ nhà sản xuất – không phải từ khách hàng. -W. Edwards Deming",
    "b19bb": "Ngày mà khoa học bắt đầu nghiên cứu các hiện tượng phi vật chất, nó sẽ đạt được nhiều tiến bộ trong một thập kỷ hơn tất cả các thế kỷ tồn tại trước đó của nó. – Nikola Tesla",
    "b2724": "Lập trình là nghệ thuật nói cho người khác biết người ta muốn máy tính làm gì. - Donald Ervin Knuth",
    "b4603": "Cuộc sống là những gì xảy ra khi bạn đang bận thực hiện những kế hoạch khác. — John Lennon",
    "b5014": "Nhiều người thất bại trong cuộc sống là do họ không nhận ra rằng họ đã gần thành công đến mức nào khi họ từ bỏ.- Thomas A. Edison",
    "b6sx9b": "Tiếng Philippin",
    "b7wgrhuXl": "Công nghệ",
    "bP_6qG": "Lời khuyên cho việc quên mật khẩu của bạn",
    "bT4R6": "Tab mới",
    "bVlBN": "Tiếng Trung sang tiếng Anh",
    "bWQunyU10": "Phòng thí nghiệm AI",
    "bc574": "Đổi mới là huyết mạch của một doanh nghiệp lành mạnh. -Mark Cuba",
    "bc92f": "Sự đổi mới thành công bắt đầu từ nhu cầu của khách hàng. -Michael Dell",
    "be-Favourite-it": "Thêm vào mục ưa thích",
    "beb6e": "Ý tưởng rất dễ dàng. Thực hiện là khó khăn. -Anh chàng Kawasaki",
    "bfb8e": "Đổi mới là chìa khóa để duy trì tính phù hợp và cạnh tranh trên thị trường. -Mark Zuckerberg",
    "bhojei1": "Truyền thống Trung Quốc",
    "bjZyW": "Dịch",
    "bors14": "tiếng Thổ Nhĩ Kỳ",
    "bp_-b": "Để quản lý đầy đủ LafTools, bạn cần thiết lập quản trị viên của mình khi bắt đầu quy trình thiết lập. Chúng tôi đã xác minh danh tính của bạn bằng mã thông báo tham số URL, hãy yên tâm rằng không ai khác có thể thiết lập quyền root của bạn trừ khi họ có được mã thông báo thiết lập.",
    "bqqrij": "tiếng Swahili",
    "bsWpBA73s": "Nén mã JavaScript.",
    "c0eCw": "Dịch văn bản của bạn sang bất kỳ ngôn ngữ nào bạn muốn.",
    "c5meku": "Tiếng Sundan",
    "c7Uoqqe": "Trước khi sử dụng LafTools, vui lòng cung cấp và xác nhận mật khẩu cục bộ của bạn như bên dưới.",
    "c7cfc": "Một bài kiểm thử tốt là bài kiểm thử có khả năng phá mã cao nếu có vấn đề - Michael Bolton",
    "cMBqyyFae": "Thụt lề và chỉnh sửa mã Ngôn ngữ truy vấn có cấu trúc (SQL).",
    "cNQp_": "Tài nguyên",
    "cPS6q": "Tất cả công cụ",
    "cQqwI8r": "Đang tải trạng thái của Dịch vụ đầu cuối",
    "cae2c": "Đổi mới là quá trình lấy ý tưởng và biến chúng thành hiện thực. -Neil Lawrence",
    "cd4d1": "Đổi mới là chìa khóa để tăng trưởng kinh doanh. -Andrew R. Steinberg",
    "cfYYN": "Khám phá nhiều hơn",
    "ciZV2": "Base32 là ký hiệu để mã hóa dữ liệu byte tùy ý bằng cách sử dụng một bộ ký hiệu hạn chế mà con người có thể sử dụng thuận tiện và được máy tính xử lý. Nó sử dụng bộ ký tự nhỏ hơn Base64, thường là bảng chữ cái viết hoa và các số từ 2 đến 7.",
    "ciZV21": "Base45 là ký hiệu để mã hóa dữ liệu byte tùy ý bằng cách sử dụng một bộ ký hiệu hạn chế mà con người có thể sử dụng thuận tiện và được máy tính xử lý. Cơ sở số cao dẫn đến các chuỗi ngắn hơn so với hệ thập phân hoặc thập lục phân. Base45 được tối ưu hóa để sử dụng với mã QR.",
    "ciZV2deq1": "Base58 (tương tự Base64) là ký hiệu dùng để mã hóa dữ liệu byte tùy ý. Nó khác với Base64 ở chỗ loại bỏ các ký tự dễ đọc sai (tức là l, I, 0 và O) để cải thiện khả năng đọc của con người. Base58 thường được sử dụng trong tiền điện tử (Bitcoin, Ripple, v.v.).",
    "cj1pd": "Làm mới hoạt động",
    "cjzqj9": "tiếng Bosnia",
    "cmxzpg": "Mã Lai",
    "coM2I": "Sử dụng Trình chỉnh sửa thông minh",
    "crD7I": "Để định cấu hình xem phép chuyển đổi có nên bỏ qua văn bản đầu vào trống có độ dài bằng 0 hay không.",
    "cuRCb": "Không tìm thấy danh mục.",
    "cuRCqb": "Danh mục không tồn tại",
    "cxqhqa": "Myanmar (Miến Điện)",
    "d-l2l": "Xác nhận",
    "d-qPr": "Bố cục không xác định: {0}",
    "d0624": "Đổi mới không chỉ là nghĩ ra những ý tưởng mới mà còn là thực hiện chúng một cách hiệu quả. -Jeff Bezos",
    "d10c9": "Đổi mới là chìa khóa để mở ra những tiềm năng mới và mở ra những thị trường mới. -Tim Cook",
    "d1820": "Cho đến khi con người sao chép được một ngọn cỏ, thiên nhiên mới có thể cười nhạo cái gọi là kiến ​​thức khoa học của con người. – Thomas Edison",
    "d366a": "Đổi mới là chìa khóa để mở ra sự tăng trưởng mới. -Philip Kotler",
    "d5KZH": "Cảm ơn bạn đã sử dụng LafTools!",
    "d5LAU": "Được cấp phép theo AGPLv3",
    "d5fmq2": "người Ý",
    "d5hit": "Phiên - {0}",
    "d5x1rl": "người Tây Ban Nha",
    "d7dc4": "Kiểm tra là quá trình đánh giá một hệ thống hoặc (các) thành phần của nó với mục đích tìm hiểu xem nó có đáp ứng các yêu cầu đã chỉ định hay không - Ẩn danh",
    "dCFIC": "Mã đẹp hơn",
    "dCFIwC": "Trình tạo mã",
    "dGKMx": "đầu ra",
    "dGVUB": "Công cụ mạng",
    "dO6b2Tkqwe": "Công cụ được sử dụng gần đây",
    "dQwjNbi0y": "Tìm hiểu thêm về Tài liệu",
    "dV5Eq": "Làm mới danh sách không gian làm việc",
    "da74c": "Suy đoán và khám phá những ý tưởng vượt xa những gì chúng ta biết chắc chắn là điều dẫn đến sự tiến bộ. – Lisa Randall",
    "dc662": "Sai lầm thực sự duy nhất là sai lầm mà chúng ta không học được gì - John Powell",
    "dcebe": "Nếu debug là quá trình loại bỏ lỗi phần mềm thì lập trình phải là quá trình đưa chúng vào - Edsger Dijkstra",
    "ddcc7": "Đổi mới là chìa khóa thành công trong nền kinh tế hiện đại. -Satya Nadella",
    "ddsdf3159": "Vật lý thực ra không gì khác hơn là một cuộc tìm kiếm sự đơn giản tối thượng, nhưng cho đến nay tất cả những gì chúng ta có chỉ là một kiểu lộn xộn tao nhã. -Bill Bryson",
    "de47c": "Kiểm thử là nghệ thuật tìm ra chiếc hộp đen và khiến nó cất tiếng hát - James Bach",
    "dk122q": "Quản lý quy trình công việc của bạn để kết hợp nhiều công cụ với nhau.",
    "dkarh": "Okie, hộp công cụ đã mở thư mục. Nếu không có cửa sổ bật lên, vui lòng kiểm tra xem nền tảng của bạn có hỗ trợ chức năng này hay thư mục có trong máy chủ hay không.",
    "dkjk12": "đây là bài kiểm tra",
    "dkkq12": "Định cấu hình công cụ của bạn trong tab này.",
    "dl4kr": "Quên mật khẩu?",
    "download-local": "Tải xuống miễn phí",
    "dpRY4": "Từ điển",
    "dqTqyvWY": "Menu ngăn kéo",
    "dsdpA_eJ": "Điều chỉnh kích thước",
    "dtjdt4": "Kazakhstan",
    "dxLQq": "Quyền gốc",
    "dzjTo": "Vui lòng cung cấp mật khẩu tài khoản tại đây",
    "e--gB": "ID tiện ích mở rộng không được cung cấp.",
    "e097e": "Đổi mới là tạo ra những khả năng mới, không chỉ là sản phẩm mới. -Tony Robbins",
    "e2379": "Chúng ta đang sống trong một xã hội phụ thuộc rất nhiều vào khoa học và công nghệ, trong đó hầu như không ai biết gì về khoa học và công nghệ. - Carl Sagan",
    "e3WgQaZlb": "Nén {0}",
    "e4Cd8t": "Base85",
    "e5rycw": "Tiếng Kyrgyzstan",
    "e8Crq": "Vui lòng điền vào trường tên người dùng và mật khẩu bên dưới để tiếp tục.",
    "e984f": "Mã sạch luôn có vẻ như được viết bởi ai đó quan tâm. — Robert C. Martin",
    "eTmq": "Lịch sử của Hộp công cụ CodeGen",
    "e_8pZ": "Một hộp công cụ đa năng dành cho các nhà phát triển để cải thiện năng suất.",
    "ea227": "Cách tốt nhất để dự đoán tương lai là tạo ra nó. -Peter Drucker",
    "ediql2": "người Hungary",
    "ee7d0": "Cảm giác kinh ngạc mà khoa học có thể mang lại cho chúng ta là một trong những trải nghiệm cao nhất mà tâm lý con người có thể có được. - Richard dawkins",
    "egkqC8t": "cơ sở58",
    "egkqCd8t": "cơ sở62",
    "eifoni": "tiếng Catalan",
    "englishcorner": "Tiếng Anh",
    "eqkqd4W": "Vui lòng cung cấp tên cho thẻ mới",
    "etV-l": "Sao chép tập tin vào SIT2",
    "eu5mh0": "Người Belarus",
    "euaI8": "Tạo tài khoản cục bộ mới",
    "euhy9v": "tiếng Estonia",
    "f0d15": "Máy tính rất nhanh; các nhà phát triển giữ chúng chậm lại. – Ẩn danh",
    "f12bb": "Đổi mới là động lực thúc đẩy sự tiến bộ trong thế giới kinh doanh. Đó là quá trình tạo ra những ý tưởng mới và biến chúng thành những sản phẩm, dịch vụ hoặc quy trình hữu hình mang lại giá trị cho khách hàng.",
    "f23c2": "Sự đổi mới phân biệt giữa người dẫn đầu và người theo sau. -Steve Jobs",
    "f29b1": "Tiến bộ được thực hiện bằng thử nghiệm và thất bại; những thất bại thường nhiều gấp trăm lần những thành công, tuy nhiên chúng thường không được ghi lại. – William Ramsay",
    "f3151": "Rủi ro lớn nhất là không chấp nhận bất kỳ rủi ro nào. -Mark Zuckerberg",
    "f3159": "Toán học là một trò chơi được chơi theo những quy tắc đơn giản nhất định với những dấu hiệu vô nghĩa trên giấy. -David Hilbert",
    "f315e7": "Toán học không phân biệt chủng tộc hay ranh giới địa lý. -David Hilbert",
    "f3160": "Toán học là thẩm phán tối cao; từ các quyết định của mình không có kháng cáo. -Tobias Dantzig",
    "f3161": "Trong toán học, nghệ thuật đặt câu hỏi phải có giá trị cao hơn việc giải quyết nó. -Georg Cantor",
    "f3162": "Toán học là nơi bạn có thể làm những điều mà bạn không thể làm trong thế giới thực. -Marcus du Sautoy",
    "f3163": "Sự tiến bộ và hoàn thiện của toán học có mối liên hệ mật thiết với sự thịnh vượng của nhà nước. -Napoléon Bonaparte",
    "f3164": "Bản chất của toán học nằm ở sự tự do của nó. -Georg Cantor",
    "f3165": "Toán học là khoa học về những gì tự nó rõ ràng. -Carl Jacobi",
    "f3166": "Toán học, nếu được nhìn nhận một cách đúng đắn, không chỉ có chân lý mà còn có vẻ đẹp tối thượng. -Bertrand Russell",
    "f3167": "Toán học là công cụ đặc biệt phù hợp để xử lý các khái niệm trừu tượng thuộc bất kỳ loại nào. -P. dirac",
    "f3168": "Toán học chỉ tiết lộ những bí mật của nó cho những ai tiếp cận nó bằng tình yêu thuần khiết, vì vẻ đẹp riêng của nó. -Archimedes",
    "f3169": "Toán học là sự sáng tạo đẹp đẽ nhất và mạnh mẽ nhất của tinh thần con người. -Stefan Banach",
    "f3170": "Nhà toán học không nghiên cứu toán học thuần túy vì nó hữu ích; anh ấy nghiên cứu nó vì anh ấy thích thú với nó và anh ấy thích thú với nó vì nó đẹp đẽ. -Henri Poincaré",
    "f3171": "Việc nghiên cứu toán học, giống như sông Nile, bắt đầu từ sự nhỏ nhặt nhưng kết thúc trong sự vĩ đại. -Charles Caleb Colton",
    "f318e4": "Sinh học là công nghệ mạnh mẽ nhất từng được tạo ra. DNA là phần mềm, protein là phần cứng, tế bào là nhà máy. -Arvind Gupta",
    "f31d71": "Hy vọng rằng vật lý là đơn giản. Các nhà vật lý thì không. -Edward Teller",
    "f31d75": "Vật lý thực ra không gì khác hơn là một cuộc tìm kiếm sự đơn giản tối thượng, nhưng cho đến nay tất cả những gì chúng ta có chỉ là một kiểu lộn xộn tao nhã. -Bill Bryson",
    "f31e53": "Toán học là nữ hoàng của các ngành khoa học. -Carl Friedrich Gauss",
    "f31q52": "Theo cách riêng của nó, toán học thuần túy là chất thơ của những ý tưởng logic. -Albert Einstein",
    "f31q54": "Cuốn sách của tự nhiên được viết bằng ngôn ngữ toán học. -Galileo Galilei",
    "f31q56": "Toán học là âm nhạc của lý trí. -James Joseph Sylvester",
    "f31q58": "Toán học không phải là những con số, phương trình, phép tính hay thuật toán: nó là sự hiểu biết. -William Paul Thurston",
    "f31q70": "Sinh học là khoa học. Sự tiến hóa là khái niệm làm cho sinh học trở nên độc đáo. -Kim cương Jared",
    "f31q72": "Sinh học là thơ ca của thế giới vật chất, và sinh học con người là thơ ca của vũ trụ chúng ta. -Julian Casablancas",
    "f31q74": "Sinh học chỉ là vật lý đã bắt đầu có mùi khó chịu. -Nigel Calder",
    "f31q81": "Vật lý là khoa học về chuyển động và hành động của các cơ thể vật chất được hình thành dưới dạng nguyên nhân và kết quả. -Arthur Compton",
    "f31qe82": "Sinh học là một quá trình phần mềm. Cơ thể chúng ta được tạo thành từ hàng nghìn tỷ tế bào, mỗi tế bào đều được điều chỉnh bởi quá trình này. Bạn và tôi đang dạo quanh với phần mềm lỗi thời đang chạy trong cơ thể chúng ta, phần mềm này đã phát triển ở một thời đại rất khác. -Ray Kurzweil",
    "f31r83": "Vật lý đang trở nên quá khó đối với các nhà vật lý. -David Hilbert",
    "f31sq66": "Sinh học thực sự là hóa học, hóa học thực sự là vật lý, vật lý thực sự là toán học. -Matt Ridley",
    "f31x76": "Sinh học là nghiên cứu về những điều phức tạp trong vũ trụ. Vật lý là nghiên cứu những cái đơn giản. -Richard dawkins",
    "f31x77": "Vật lý là kinh nghiệm, được sắp xếp theo thứ tự tiết kiệm. -Ernst Mach",
    "f3d169": "Vật lý là môn khoa học thực sự duy nhất. Phần còn lại chỉ là sưu tập tem. -Ernest Rutherford",
    "f3d179": "Vật lý đang trở nên phức tạp đến mức ngày càng mất nhiều thời gian hơn để đào tạo một nhà vật lý. Trên thực tế, phải mất rất nhiều thời gian để đào tạo một nhà vật lý đến mức anh ta hiểu được bản chất của các vấn đề vật lý đến nỗi anh ta đã quá già để giải quyết chúng. -Eugene Wigner",
    "f3d180": "Sinh học là khoa học về sự sống, tuy nhiên nhiều người trong chúng ta không hiểu được những điều cơ bản về cơ thể mình. -Kathy Reichs",
    "f3e155": "Toán học là cánh cửa và là chìa khóa của khoa học. -Roger thịt xông khói",
    "f3q178": "Sinh học không phải là định mệnh. Nó không bao giờ nhiều hơn xu hướng. Đó chỉ là cách tính toán nhanh chóng và bẩn thỉu đầu tiên của tự nhiên với thịt. Chip là định mệnh. -Bart Kosko",
    "f3sd162": "Sinh học là nghiên cứu về những thứ phức tạp có vẻ như được thiết kế có mục đích. -Richard dawkins",
    "f3sd164": "Sinh học cung cấp cho bạn một bộ não. Cuộc sống biến nó thành một tâm trí. -Jeffrey Eugenides",
    "f3sd165": "Trong vật lý, bạn không cần phải tự gây rắc rối cho chính mình - thiên nhiên sẽ làm điều đó cho bạn. -Frank Wilczek",
    "f3sq167": "Điều tốt về khoa học là nó đúng dù bạn có tin vào nó hay không. -Neil deGrasse Tyson",
    "f3ttw8": "người Maori",
    "f477b": "Lập trình là nghệ thuật thiết kế thuật toán và kỹ năng sửa lỗi mã lỗi. – Ellen Ullman",
    "f5bLC": "Tài liệu",
    "f7akol": "Tiếng Anh",
    "f7cf7": "Thực tế có hai thứ, khoa học và quan điểm; cái trước sinh ra kiến ​​thức, cái sau sinh ra sự thiếu hiểu biết. – Hippocrates",
    "f814a": "Khi tôi viết mã này, chỉ có Chúa và tôi mới hiểu tôi đã làm gì. Bây giờ chỉ có God ktools. – Ẩn danh",
    "f96ff": "Đổi mới là động lực của sự tiến bộ và thành công trong kinh doanh. -Satya Nadella",
    "fBP5h": "tên tài khoản",
    "fEr5j": "Tạo tập lệnh mới",
    "fV_1P": "Đăng nhập",
    "fa94e": "Đổi mới là chìa khóa để luôn dẫn đầu trong cuộc đua cạnh tranh. -Paul Sloan",
    "fc805": "Đổi mới là sự sáng tạo với một công việc để làm. – Tom Peters.",
    "fd3173": "Vật lý là trí tưởng tượng trong chiếc áo khoác thẳng. -John Moffat",
    "fdd2b": "Khoa học là kiến ​​thức có tổ chức. Trí tuệ là cuộc sống có tổ chức. – Immanuel Kant",
    "fdxluz": "người Rumani",
    "ff02c": "Đã hủy",
    "fgj880": "tiếng Telugu",
    "forever-foss": "Mãi mãi FOSS!",
    "fqV_1P": "Mở khóa LafTools của bạn",
    "g2_aX": "Sao chép mật khẩu được mã hóa vào tập tin",
    "g5SK9": "Mở gần đây",
    "gDjbs": "Dữ liệu lịch sử",
    "gK3dNQ": "Sao chép",
    "gQhfS": "Công cụ tập tin",
    "gTOv6abWT": "Đăng nhập",
    "gTOv6adbWT": "Đăng ký",
    "gU1O2": "bị kích hoạt",
    "geHXwByxy": "Cài đặt",
    "generic-NI-UFPTe0": "Làm đẹp mã chung",
    "generic-code-beautify.desc.2b3c": "Hoạt động này định dạng mã bằng nhiều ngôn ngữ lập trình khác nhau để cải thiện khả năng đọc bằng cách áp dụng thụt lề, ngắt dòng nhất quán và tuân thủ các nguyên tắc về văn phong dành riêng cho ngôn ngữ.",
    "giveas3tar": "Hãy cho chúng tôi một ngôi sao trên GitHub nếu bạn thích LafTools.",
    "gkC8t": "cơ sở64",
    "gkdqqC8t": "cơ sở45",
    "gkqC8t": "Cơ sở32",
    "gmK3pKyRI": "{0} Số lượng trực tuyến cao nhất",
    "gms7_9n5v": "Chuyển đổi chuỗi byte thập lục phân trở lại giá trị thô của nó.",
    "gnKMZ": "Đã làm mới.",
    "groupnote": "Bản ghi nhớ",
    "h6AeI": "Kết nối Websocket đã đóng lúc {0}",
    "hJUMN": "Ngôn ngữ mục tiêu",
    "hMvh1": "Sao lưu cơ sở dữ liệu",
    "hRFxV": "Để biết thêm thông tin, vui lòng truy cập trang web của chúng tôi",
    "hX1CWGAhl": "Thụt lề và chỉnh sửa mã Ngôn ngữ đánh dấu mở rộng (XML).",
    "hcnt1k": "Tiếng Macedonia",
    "hhOT3": "Tìm kiếm theo tên",
    "htTmvWjsS": "Nén mã Cascading Style Sheets (CSS).",
    "htt1d2": "Quốc tế ngữ",
    "hu-iz": "hẹn giờ",
    "huE6U": "Biến đổi",
    "hyV-d": "Xong",
    "hyirc0": "tiếng Thụy Điển",
    "i27qmr": "tiếng Frisia",
    "i6hMN": "Mã xác minh hình ảnh",
    "i88tb": "Xuất kết quả sang tệp",
    "i8q8tb": "Định cấu hình quy trình làm việc cho đầu vào",
    "iNQvo": "Hiển thị một ví dụ để bắt đầu.",
    "iNqF1T": "Quản lý tài khoản đám mây",
    "iOEjZ": "Không có sẵn mã",
    "iQL2c": "Chúng tôi vẫn đang khám phá đầy đủ các chức năng cho nút này - nếu bạn có bất kỳ phản hồi hoặc đề xuất nào về cách chúng tôi có thể cải thiện nút này, vui lòng cho chúng tôi biết!",
    "iZXig7E2JF": "LafTools cung cấp một bộ tiện ích phát triển toàn diện bao gồm codec, bộ định dạng, công cụ xử lý hình ảnh và giải pháp quản lý tài nguyên máy tính. Được thiết kế để hợp lý hóa và nâng cao quy trình phát triển của bạn, LafTools là nguồn tài nguyên cần thiết để bạn phát triển phần mềm hiệu quả, chất lượng cao.",
    "i_lang_": "Gói ngôn ngữ",
    "ib135dq": "Thông báo trạng thái của bạn sẽ được hiển thị ở đây",
    "iknTS": "Trình quản lý mật khẩu",
    "init_env": "Đang tải tài nguyên hệ thống",
    "ip2g1": "Đã sao chép",
    "ipOSQE": "Phiên bản chuyên nghiệp",
    "it8ths": "tiếng Indonesia",
    "ixyP0": "Tự động xử lý hành động theo thời gian thực",
    "jJuNz": "Ngôn ngữ nguồn",
    "jO5eP": "ĐƯỢC RỒI",
    "jPNCb": "Đã thử lại.",
    "jQXdi": "Chế độ sáng",
    "jR1zX": "Phòng thí nghiệm AI",
    "jRFk519Bj-": "Cộng đồng này được thúc đẩy bởi một dự án mã nguồn mở hoàn toàn miễn phí mang tính quốc tế.",
    "jaj7M": "Đã đăng ký Bản quyền.",
    "jb392": "Tên",
    "jfpqt": "Điều hướng ghi chú",
    "jgDoEq": "Không có dữ liệu câu hỏi thường gặp",
    "jhDoE": "Truy xuất dữ liệu Câu hỏi thường gặp",
    "jlxvpk": "Hàn Quốc",
    "jr_7Y98yZ": "LafCông cụ",
    "json-beautify.desc.0912": "Thao tác này định dạng dữ liệu JSON để cải thiện khả năng đọc bằng cách thêm thụt lề, ngắt dòng và sắp xếp khóa thích hợp một cách nhất quán.",
    "json-beautify.name.0912": "Định dạng SQL",
    "json-beautify.text.93kq": "Làm đẹp dữ liệu JSON",
    "k17PG": "Đã đóng kết nối Websocket.",
    "k2SVY": "tắt",
    "k2ku5p": "tiếng Séc",
    "k41a5": "LafCông cụ",
    "k4s5rx": "tiếng Slovenia",
    "kLH79": "E-mail",
    "kOi5A": "Trang in",
    "kPD22": "Từ điển",
    "kPJ-A4": "Làm cho khỏe lại",
    "kcHxr": "Vui lòng cung cấp tên người dùng tài khoản quản trị viên tại đây",
    "kjks1": "Truy xuất cấu hình i18n từ API máy chủ cục bộ",
    "kqv5ht": "tiếng Yiddish",
    "krxSK": "Trợ lý AI",
    "ks12d": "An ninh mạng",
    "kv4wag": "tiếng Hà Lan",
    "ky6JphiKk": "{0} Người dùng trực tuyến",
    "l3akoa": "tiếng Amharic",
    "l6Djb": "Chọn một trong các tùy chọn làm chủ đề ưa thích của bạn:",
    "lDXWMq43S": "Lịch hôm nay",
    "lIn3_": "Tên người dùng quản trị viên",
    "lQFII": "Kích hoạt lại quá trình khởi tạo",
    "lRHDQ": "Thoát chế độ toàn màn hình",
    "lUh5c": "Máy phát điện",
    "lWqYc": "Trang web này cung cấp các công cụ JSON bao gồm JSON sang XML, JSON sang CSV, JSON sang YAML.",
    "lastreplyby": "Trả lời cuối cùng bởi",
    "lkuulh": "người Pháp",
    "lp0qmd0": "Đánh dấu nó là yêu thích",
    "lpKAz": "Cài đặt",
    "lpzg83": "Tiếng Samoa",
    "lzGS2": "Chi tiết tiện ích mở rộng",
    "m0106": "Bộ chuyển đổi",
    "m0107": "Máy phát điện",
    "m0108": "Trình định dạng",
    "m7WZw": "Hệ thống Websocket bị hỏng",
    "m8rTc1": "Khi trình quản lý tập lệnh shell được triển khai, bạn có thể sử dụng nó để quản lý các lệnh shell của mình.",
    "mBgF1": "Hành động chuột",
    "mSFei": "Mã nguồn trên GitHub",
    "mWXeh": "ID không gian làm việc: {0}",
    "mabHq": "Tìm tập tin cũ",
    "mbzCv": "Đã xảy ra lỗi: {0}, thời gian bị từ chối là {1}",
    "md2.desc.1039": "Thao tác này băm dữ liệu thành hàm băm {0}.",
    "md2.text.192d3": "Tạo hàm băm {0}",
    "md2aO2NaJITm": "Thụt lề và chỉnh sửa mã Cascading Style Sheets (CSS), giúp dễ đọc và dễ hiểu hơn.",
    "md4.desc.1039": "Thao tác này băm dữ liệu thành hàm băm {0}.",
    "md4.text.192d3": "Tạo hàm băm {0}",
    "md5.desc.rxsHq": "Thao tác này băm dữ liệu thành hàm băm {0}.",
    "md5.textiDjMIo": "Tạo hàm băm {0}",
    "md6.desc.1039": "Thao tác này băm dữ liệu thành hàm băm {0}.",
    "md6.text.192d3": "Tạo hàm băm {0}",
    "meeMC1Uk7.text.93kq": "Giảm thiểu {0}",
    "mhWk4dtid": "Mã hóa",
    "mihc3": "Đã hoàn thành thao tác này",
    "mjHoR": "Ngoài ra, về mặt kỹ thuật, không ai có thể đọc được mã thông báo này nếu không họ đã tấn công và kiểm soát máy tính của bạn.",
    "mnb19i": "tiếng Đức",
    "mslw4o": "người Hy Lạp",
    "mwn7iv": "Tiếng Zulu",
    "myxedr": "tiếng Mông Cổ",
    "n1jA9": "Xác nhận",
    "n24tes": "Tiếng Bồ Đào Nha (Brazil)",
    "n28g4di0L": "Hướng dẫn sử dụng",
    "n94an4": "Đánh bóng",
    "n98EW": "Hoán đổi văn bản của vùng đầu vào và vùng đầu ra.",
    "nIDKbSXTw": "{0} Người dùng",
    "nSeIq8-": "Quan trọng nhất, nó miễn phí và là nguồn mở. Bạn có thể sử dụng nó cho mục đích cá nhân hoặc thương mại của bạn.",
    "nTvw4": "Để bảo vệ và lưu riêng dữ liệu cũng như cài đặt của bạn, bạn có thể sử dụng tài khoản cục bộ của mình để đạt được điều đó. Ngoài ra, LafTools sẽ hỗ trợ các tiện ích tin nhắn tức thời giữa những người dùng trong tương lai.",
    "nh1W-": "Kiểm tra chỉ có thể chứng minh sự hiện diện của lỗi chứ không phải sự vắng mặt của chúng - Edsger Dijkstra",
    "nmb1wx": "Tiếng Yoruba",
    "nncQE": "Mạng sống",
    "nodBw": "Thao tác này mã hóa dữ liệu thô thành chuỗi ASCII {0}.",
    "nrix6l": "Chichewa",
    "nxJC7": "Hành động mặc định được thực hiện khi máy biến áp được thực hiện.",
    "o1umzi": "người Pháp",
    "o52xW": "Xuất khẩu",
    "o8xyzu": "Tiếng Luxembourg",
    "oBz8D": "Đang tải",
    "oNLxH": "tên tài khoản",
    "oNg3f": "Trang web chính thức",
    "ocxsw3": "người Ireland",
    "of_ox": "Nói chung, LafTools là giải pháp toàn diện cho mọi nhu cầu của bạn.",
    "oj23X": "Khôi phục cơ sở dữ liệu",
    "ojCWEFdVe": "Nén mã JavaScript, loại bỏ tất cả các ký tự không cần thiết.",
    "ooiFU": "Khởi động lại dịch vụ Java",
    "oqHqVq": "Sắp xếp theo",
    "oqHqqV": "Tổng cộng: {0} Lệnh",
    "oqHqqVq": "Sao chép lần",
    "oqjbcj": "tiếng Lào",
    "os8h6u": "người Đan Mạch",
    "p8Exxc1s": "Có nhiều công cụ khác nhau tận dụng công nghệ AI để thực hiện các nhiệm vụ hiệu quả hơn trong Phòng thí nghiệm AI.",
    "pANmj": "Thẻ có thể được xác định dựa trên loại máy chủ, cách sử dụng tập lệnh hoặc bất kỳ tiêu chí nào khác mà bạn thích.",
    "pA_deJ": "Xuất sang bảng nhớ tạm",
    "pA_feeJ": "Kết nối lại thiết bị đầu cuối",
    "pA_qweJ": "Xóa bộ đệm",
    "pDBSWq": "không có nội dung có sẵn cho bảng bên phải",
    "pEk1kk": "LafTools giới thiệu các chức năng hữu ích cho bạn tại đây.",
    "pEk1qkk": "Liệt kê tất cả các tab đã mở",
    "pHZDB": "Hành động thời gian thực",
    "pJoOz": "Mở tệp",
    "pKHRT": "Đi tới Công cụ",
    "pKqHRq": "Tìm kiếm ghi chú",
    "pL6qH": "Hoàn thành.",
    "pNwe3": "Khác",
    "pZ4d616m-": "Làm đẹp {0}",
    "ph5jH": "Xử lý phần này",
    "piih4x": "Tiếng Tajik",
    "pmAee": "Đọc thêm thông tin về công cụ này.",
    "pmnp4b": "tiếng Ukraina",
    "ppmz8e": "Tiếng Creole Haiti",
    "pqs7y3": "Vui lòng xem xét việc đăng ký trang web này dưới dạng PWA để được hỗ trợ sơ đồ bàn phím đầy đủ.",
    "psA_eJ": "Xuất dưới dạng tệp",
    "psZoP": "Thả tập tin vào đây để xử lý chúng",
    "psqqpq_o": "Được rồi, kết quả đã được sao chép vào khay nhớ tạm của bạn {0} lần.",
    "pzn2IpkDo": "Thụt lề và in đẹp mã Ký hiệu đối tượng JavaScript (JSON).<br><br>Thẻ: trình xem json, làm đẹp, tô sáng cú pháp",
    "q0zA1kML_": "Hộp công cụ trực tuyến",
    "q12beqwR": "Không có công cụ nào",
    "q29t31": "Đánh bóng",
    "q3VjkLMsP": "Hữu nghị, giao lưu, hợp tác và phát triển",
    "q6K7o": "Tải từ ghi chú",
    "q9iuti": "người xứ Wales",
    "qDrbEr": "Tên người dùng bạn cung cấp trống, vui lòng kiểm tra và thử lại.",
    "qF4uS2": "Tạo không gian làm việc",
    "qF4uS23": "Cửa sổ mới",
    "qHoktx": "Cảm ơn!",
    "qN1LdZ2": "Sửa đổi lần cuối",
    "qQmBr": "Dịch văn bản",
    "qTqyvWdY": "Chưa hoàn thành",
    "qWemXE4": "Ngày 1 tháng 1 năm 2024",
    "qWw3eTH": "Phần này giúp duy trì các tệp trên đĩa cục bộ hoặc đĩa đám mây của bạn.",
    "qdeFXx": "Hiện tại, trang bạn đang tìm kiếm này chưa được triển khai đầy đủ.",
    "qpDBSW": "không có bảng điều khiển có sẵn",
    "qpDBSWe1": "không có bảng điều khiển có sẵn",
    "qqK_x_": "Đăng nhập",
    "qqqwYoz": "Giúp đỡ",
    "qqwYoz": "Tab",
    "qqwYqwe": "Không gian làm việc",
    "qtpmvP": "Xác nhận mật khẩu cục bộ",
    "quality-first": "Chất lượng là trên hết",
    "qubSJ": "VM mở rộng không phải là ID. (REF: IQnMH).",
    "qzshys": "tiếng Urdu",
    "r1GLS": "Thẻ",
    "rE6fUsSGl": "Thụt lề và chỉnh sửa mã Ngôn ngữ truy vấn có cấu trúc (SQL).",
    "rK6cx": "{0}, được thiết kế và phát triển bởi nhóm LafTools",
    "rQkas": "Chào mừng đến với LafTools",
    "rR1vd": "Nhập từ tập tin",
    "rT34qnO": "Nhập văn bản để xử lý. Kết quả sẽ hiển thị trong trình chỉnh sửa đầu ra.",
    "rVqlu": "Giải mã {0}",
    "rYSpwq": "Thuật toán MD2 (Message-Digest 2) là hàm băm mật mã được phát triển bởi Ronald Rivest vào năm 1989. Thuật toán được tối ưu hóa cho máy tính 8 bit. Mặc dù MD2 không còn được coi là an toàn, kể từ năm 2014, nó vẫn được sử dụng rộng rãi cơ sở hạ tầng quan trọng như một phần của chứng chỉ được tạo bằng MD2 và RSA. Theo mặc định, thuật toán phân loại tin nhắn bao gồm 18 vòng.",
    "r_n6h": "Chế độ sáng hoặc tối",
    "rf0mql3": "Chủ đề sáng hoặc tối",
    "rpG0G": "Chúng tôi đánh giá cao phản hồi của bạn và muốn nghe suy nghĩ của bạn về cách chúng tôi có thể cải thiện sản phẩm của mình - vui lòng chia sẻ phản hồi của bạn với chúng tôi!",
    "rub76Z8zx": "Cố gắng in đẹp các ngôn ngữ kiểu C như C, C++, C#, Java, PHP, JavaScript, v.v. Điều này sẽ không thực hiện công việc hoàn hảo và mã kết quả có thể không hoạt động nữa. Hoạt động này được thiết kế hoàn toàn để làm cho mã bị xáo trộn hoặc rút gọn dễ đọc và dễ hiểu hơn. Những thứ sẽ không hoạt động bình thường: Đối với định dạng vòng lặp, định dạng vòng lặp Do-while, thụt lề Switch/Case, một số toán tử dịch chuyển bit nhất định",
    "run_text": "Trước khi vào bàn làm việc của bạn, trước tiên chúng tôi muốn tải trước các tài nguyên hệ thống cần thiết. Vui lòng đợi một lát, nó sẽ sớm được hoàn thành, chi tiết có thể xem được như bên dưới.",
    "rycJy": "LafTools là một hộp công cụ đa năng được thiết kế dành riêng cho các lập trình viên. Nó đại diện cho phiên bản thứ hai của Hộp công cụ CodeGen, giờ đây có thời gian chạy nhẹ hơn được viết bằng Golang và JavaScript.",
    "ryhkqb": "tiếng Bungari",
    "rzoFmjStq": "Công cụ liên quan",
    "s-fxP80Dd": "IDE LafTools",
    "s0vrf9": "tiếng Do Thái",
    "s4OeX": "Đăng nhập hệ thống thành công",
    "sHoxxW": "Lịch sử",
    "sO0MOe": "Mỗi khi bạn ở trong một cửa sổ lâu hơn 5 giây, nó sẽ được hiển thị ở đây.",
    "sR8yc": "Đóng",
    "sc49my": "tiếng Sindhi",
    "sdf3160": "Công việc của các nhà lý thuyết, đặc biệt là trong sinh học, là đề xuất những thí nghiệm mới. Một lý thuyết tốt không chỉ đưa ra những dự đoán mà còn đưa ra những dự đoán đáng ngạc nhiên và sau đó lại trở thành sự thật. -Francis Crick",
    "sdfk1": "Cuộn tab sang trái",
    "sdfk13": "Cuộn tab sang phải",
    "sglMS": "Tạo thời gian",
    "share-this-page": "Chia sẻ trang này",
    "sk123": "Chưa hoàn thành",
    "slqcWD": "Phần logic này chưa được hỗ trợ, vui lòng theo dõi.",
    "sojBI": "Chuyển đổi",
    "spCqEa": "LÀM",
    "spdh98": "Tiếng Trung giản thể",
    "ssDaOq": "Bạn mới sử dụng LafTools?",
    "ssm80i": "Tiếng Basque",
    "str.codecs": "Codec",
    "str.converters": "Bộ chuyển đổi",
    "str.formatter": "Trình định dạng",
    "str.login": "Đăng nhập",
    "str.mostused": "Được dùng nhiều nhất",
    "str.parsers": "Trình phân tích cú pháp",
    "str.register": "Đăng ký",
    "str.remarks": "Yêu thích",
    "str.usercentre": "Trung tâm người dùng",
    "svqh06": "Tiếng Azerbaijan",
    "sys_updates": "Cập nhật hệ thống mới nhất",
    "t63Qw": "Miễn nhiệm",
    "t6wczq": "Xhosa",
    "t84q1z": "tiếng Armenia",
    "t8DUz20a-": "Trình định dạng JSON",
    "t8c6xc": "tiếng Somali",
    "tBIX-d": "các cửa sổ",
    "tEiv_": "Truy xuất chi tiết tiện ích mở rộng",
    "tIy3Q": "Gặp phải lỗi",
    "tIyq3Q": "Gặp phải lỗi",
    "tWe1yF": "Không có lệnh shell có sẵn.",
    "tY3p1": "Thêm thông tin",
    "tiaiB": "Hủy bỏ",
    "title-laftools": "LafTools - Hộp công cụ tất cả trong một hàng đầu dành cho lập trình viên",
    "tn7duf": "tiếng Croatia",
    "try.laftools.ide": "Hãy thử IDE LafTools",
    "ttAre": "Nhập mật khẩu văn bản gốc của bạn vào đây",
    "twamg": "Trợ lý AI, nâng cao khả năng sáng tạo của bạn",
    "tyhgpr": "tiếng Java",
    "uCEe8": "Chuyển đổi thời gian thực",
    "uFcDQ": "Đang khởi tạo dữ liệu trạng thái...",
    "uV5Bi": "Không thể tải tiện ích mở rộng",
    "uVseB": "Nhấn {0} để hiển thị danh sách phím nóng",
    "ucDLv": "Bạn đã sao chép bản ghi này {0} lần",
    "ui5pZ": "Trình phân tích lệnh",
    "ulah0q": "tiếng Nhật",
    "unc9E": "Văn bản ngẫu nhiên",
    "usr_defined": "Tùy chọn hệ thống",
    "uwqGE": "Đi tới Công cụ",
    "v7q3db": "tiếng Thái",
    "vOjNC": "Nhập mật khẩu hoặc khóa bảo mật",
    "vTsQU": "Vui lòng cung cấp mã lời mời từ quản trị viên của bạn",
    "vU17B": "Không thể gửi yêu cầu",
    "vWqac": "Trước khi vào bàn làm việc của bạn, trước tiên chúng tôi muốn tải trước các tài nguyên hệ thống cần thiết. Vui lòng đợi một lát, nó sẽ sớm được hoàn thành, chi tiết có thể xem được như bên dưới.",
    "vaP0vq": "Thiết lập mật khẩu cục bộ thành công.",
    "vci8rd": "tiếng Hà Lan",
    "vh9j4": "Đầu vào",
    "vo1prl": "người Tây Ban Nha",
    "vr93oi": "tiếng Phần Lan",
    "vrfjnf": "người Ý",
    "w6otqn": "tiếng Corse",
    "w92j07": "tiếng Nga",
    "w9qudj": "Tiếng Punjab",
    "wAxtg": "Ban đầu, chúng tôi đã tạo UUID làm mã thông báo được ủy quyền để bạn thực hiện thiết lập này. Từ những gì LafTools đã nhận được, mã thông báo bạn cung cấp là {0}, nó đã được LafTools xác minh thành công và do đó bạn có thể tiếp tục thiết lập biểu mẫu này.",
    "wI1eh": "Kế tiếp",
    "wQYoz": "Tài liệu",
    "wQdYoz": "Biên tập",
    "wQdqwYoz": "Xem",
    "wcl1K": "Cách sử dụng",
    "wgkk6y": "cây nho",
    "wi28h5_S2": "Codec",
    "wj3VS": "Thao tác này giải mã dữ liệu từ chuỗi ASCII {0} trở lại định dạng thô.",
    "wsWcXd": "Thông báo",
    "x009": "Để truy cập tài liệu sử dụng của chúng tôi",
    "x5alzu": "Tiếng Kurd (Kurmanji)",
    "x5tHV": "Tổng quan về hệ thống",
    "xMBv0": "Đang tải các tài nguyên liên quan...",
    "xOJqG1": "Các câu hỏi thường gặp",
    "xPHqP": "Mô tả vẫn chưa được xác định.",
    "xQ_ls": "Sao lưu Redis",
    "xbz0B": "Đóng tất cả cửa sổ",
    "xbz0B2": "Đóng tab",
    "xdqwe": "Chào mừng bạn đến sử dụng LafTools!",
    "xeP4zV": "Xem nhanh các mục TODO của bạn",
    "xeP4zVd": "Tra cứu nhanh từ vựng tiếng Anh.",
    "xhxY6iLDH": "Đăng xuất",
    "xlqtA": "Nhận xét",
    "xml-bdeautify.desc.2a5f9": "Giảm thiểu mã XML",
    "xml-beautify.desc.2a5f9": "Hoạt động này định dạng dữ liệu XML để cải thiện khả năng đọc bằng cách thêm thụt lề, ngắt dòng thích hợp và đảm bảo cấu trúc được định dạng đúng.",
    "xs22XLF": "Không có sẵn dữ liệu cho ID mặt hàng này, vui lòng xem xét chọn các mặt hàng khác.",
    "y3qjdd": "Mật khẩu cục bộ của bạn đã được xác minh thành công.",
    "y8Ir5": "Phần này được sử dụng để khởi tạo tài khoản quản trị viên của bạn, tuy nhiên, hiện tại, không có gì cần phải tạo hoặc điều chỉnh ở đây vì nó đã được quản trị viên của bạn thiết lập trước đó, vui lòng bỏ qua phần này và tiếp tục các bước còn lại.",
    "yCsTC": "Tối ưu hóa sớm là gốc rễ của mọi tội lỗi.",
    "yMZW-GEgf": "Định dạng XML",
    "ySVf-": "Thử lại yêu cầu này",
    "yTsqFO": "Thuật toán MD4 (Message-Digest 4) là hàm băm mật mã được phát triển bởi Ronald Rivest vào năm 1990. Độ dài tóm tắt là 128 bit. Thuật toán này đã ảnh hưởng đến các thiết kế sau này, chẳng hạn như thuật toán MD5, SHA-1 và RIPEMD. Tính bảo mật của MD4 đã bị xâm phạm nghiêm trọng.",
    "yVprb": "Phần này vẫn đang được phát triển.",
    "y_2Q1": "Mã hóa và giải mã",
    "y_2Q2": "Tiền điện tử đối xứng",
    "y_2Q3": "Tiền điện tử bất đối xứng",
    "y_2Q4": "Thuật toán quốc gia Trung Quốc",
    "y_2Q5": "Xác thực web",
    "y_2Q5dqw": "Trình so khớp văn bản",
    "y_9YM": "Đầu ra sẽ được hiển thị ở đây.",
    "y_9YqM": "Đang tải tài nguyên tĩnh...",
    "y_BN6": "Thuật toán tóm tắt",
    "ya0cwu": "Mã Lai",
    "yc7dqiu": "Tiếng Trung giản thể",
    "yfYeg": "Mẫu văn bản",
    "yiRso": "Ghi chú đám mây",
    "ykganl": "người Đan Mạch",
    "ymyfghy1r": "Ghi chú",
    "yqiRso": "Ghi chú địa phương",
    "yqrxl4": "tiếng Serbia",
    "yznU9": "Dữ liệu cây trống",
    "z-o28we": "Bảng quy trình",
    "z0j2nf": "Tiếng Hindi",
    "z1oFn": "Thoát và Unescape",
    "z2jzej": "Tiếng Marathi",
    "z79b1a": "tiếng Ả Rập",
    "zN2ES": "Không gian làm việc",
    "zaSKh": "Làm cho khỏe lại",
    "zc3Hf": "Mật khẩu",
    "zjDJk": "Vui lòng cung cấp đường dẫn thư mục không gian làm việc",
    "zkqUFa": "{0} chưa được định cấu hình",
    "zkv375": "tiếng Khmer",
    "zmDWx": "Liên hệ chúng tôi",
    "znVRwq": "Các tập tin",
    "zpyd34": "Tiếng Anh",
    "zqiIoqXw": "Chạy tính toán...",
    "zwd4v": "Chi tiết tiện ích mở rộng",
    "zwgYx": "Giá trị mật khẩu được mã hóa sẽ được hiển thị ở đây.",
    "zzcepr": "Cebuano"
}