{
    "-dxG-aEe4w": "Đã đạt đến số lượng mã xác minh SMS tối đa được gửi hôm nay.",
    "-wHWkv2OC": "Tại sao tôi không thể đăng nhập?",
    "-wdkeq": "Cộng đồng này có phi lợi nhuận không?",
    "2RbUh6TyJ": "{0} Thông báo chưa đọc",
    "3I-dkqkwr": "Lưu ý rằng chúng tôi KHÔNG cung cấp bất kỳ khóa đào tạo thương mại nào cho các kỳ thi tiếng Anh hoặc bất kỳ kỳ thi môn học nào khác trên trang web này và chúng tôi không có kế hoạch thực hiện điều đó trong tương lai.",
    "43be5": "Nhật ký",
    "4N79HNWiA": "Để đảm bảo đây là một cộng đồng phi lợi nhuận, chúng tôi cũng mở toàn bộ mã nguồn của cộng đồng đó trên GitHub, bạn có thể tìm thấy mã này ở chân trang này.",
    "4sQWoTgfr": "Mã xác minh đã hết hạn, vui lòng làm mới trang và thử lại",
    "4sdQWoTgfr": "Mã xác minh đã hết hạn, vui lòng làm mới trang và thử lại.",
    "5pevqzFXX": "Nếu bạn cũng nghĩ rằng việc tham gia cùng chúng tôi là có ý nghĩa, vui lòng tiếp tục cập nhật hồ sơ của bạn bằng cách nhấp vào nút bên dưới, cảm ơn!",
    "6h14B_t4I": "Đã tham gia hôm nay",
    "7BtpddC": "Thứ hai, trong cộng đồng này, chúng tôi không nói về chính trị hay bất kỳ chủ đề nhạy cảm nào khác và tất nhiên không hoan nghênh thư rác hoặc quảng cáo. Đó là lý do tại sao chúng tôi yêu cầu số điện thoại hợp lệ để đăng ký nhằm ngăn chặn mọi hoạt động bất hợp pháp hoặc không phù hợp.",
    "7flKa": "LafTools - Đấng toàn năng cho mọi chuyên gia và kỹ sư",
    "7zqdufsdddJ": "Có chắc chắn. Trang web ELB3.com có ​​nguồn gốc từ nhóm trò chuyện WeChat phi lợi nhuận, {0}, nhằm mục đích tạo ra bầu không khí học tiếng Anh thân thiện, không có quảng cáo và thoải mái.",
    "8s1R5nChx": "Mã lời mời trống, cộng đồng này không mở cửa công khai nhưng giới hạn đối với những người dùng được mời.",
    "8s1dX": "Mã thư mời không tồn tại trong hệ thống, vui lòng kiểm tra xem có vấn đề phân biệt chữ hoa chữ thường hay không.",
    "8sVG1RXhx": "mật khẩu phải có ít nhất 6 ký tự",
    "8sVG1RdXhx": "ID người dùng đã tồn tại",
    "8sVG1kqXhx": "ID người dùng phải có ít nhất 2 ký tự",
    "8sVGdXhx": "ID người dùng chỉ được chứa chữ cái và số",
    "8saIR-LCjyChx": "Mã mời đã hết hạn",
    "8saIt5r5nGxwwChx": "Mã mời đã được sử dụng hết",
    "9YPgsPid2M": "Mã SMS",
    "9pBpiYcCy": "Để ngăn chặn thư rác và quảng cáo, chúng tôi yêu cầu mã mời để đăng ký tài khoản của bạn.",
    "BqWGnXEzV": "Thành phố",
    "Bz_WdwvAPn": "Kiểm tra xem CAPTCHA có được cung cấp chính xác hay không.",
    "C7jECCVt9": "Hãy quý trọng thời gian của bạn và đừng bao giờ làm bất cứ điều gì bất hợp pháp trong cộng đồng này.",
    "CK5NCw519": "Câu chuyện cộng đồng",
    "CQ44pYZYj": "đăng nhập",
    "CuHqw9m": "{0} không phải là số điện thoại hợp lệ, hiện tại hệ thống chỉ chấp nhận số điện thoại 11 chữ số.",
    "Cz_qjjFw7": "Giới thiệu về {0}",
    "DYaOL4Yp7": "đăng ký",
    "D_9sNBiZj": "Bạn đã thử quá nhiều lần, vui lòng thử lại sau.",
    "F-D-AewqL": "Hãy nhìn lại những gì bạn đã làm gần đây. Chúng tôi không thể chịu đựng bất kỳ hành vi nào có thể bị coi là quấy rối, quảng cáo hoặc lạm dụng cá nhân, v.v...",
    "GaySMPQHo": "Xu hướng",
    "Gy45ssBPS": "Tạo chủ đề mới",
    "H39ddc0df": "Hãy thử đăng nhập sau nếu thất bại quá nhiều lần.",
    "HaU4NMabv": "Mã xác minh không chính xác, vui lòng nhập lại hoặc làm mới hình ảnh.",
    "IWPP6V-tR": "Mã nguồn",
    "IcvP2d-QY": "Vui lòng {0} hoặc {1} tham gia thảo luận",
    "IugAFc4OT": "Đã xảy ra sự cố khi gửi dữ liệu của bạn.",
    "Jf4iDTZ28": "Ngoài ra, hãy yên tâm rằng chúng tôi sẽ không bao giờ bán số điện thoại của bạn hoặc công khai.",
    "Jfr4RzEZG": "Hiện tại, chúng tôi chỉ chấp nhận số điện thoại {0} để đăng ký tài khoản của bạn.",
    "JuZAli3": "Hướng dẫn sử dụng",
    "K2UEY4ddl": "ID người dùng chứa các từ không hợp lệ, vui lòng tránh sử dụng {0}",
    "KAiEq6dcwL5": "Cuối cùng, như một lời nhắc nhở thân thiện, mỗi người dùng nên chịu trách nhiệm về lời nói và hành động của mình.",
    "MnVg5i": "Xin chào hân hạnh được gặp bạn! Chúng tôi rất hân hạnh được mời bạn tham gia cộng đồng này.",
    "MnVqwid": "Xin chào, {0}. Rất vui được gặp bạn! Chúng tôi rất hân hạnh được mời bạn tham gia cộng đồng này.",
    "NdqZcRL2QN": "Trong trường hợp bạn quên mật khẩu, bạn có thể đặt lại bằng cách nhấp vào liên kết 'Quên mật khẩu'.",
    "OBjaZqTvx": "Trang chủ",
    "OPevedpOM": "Nếu tôi không có số điện thoại thì sao?",
    "P1zxX2IQ5": "Nhưng đối với trang web này, nó là một phiên bản phái sinh của nhóm ban đầu và không giới hạn ở việc học tiếng Anh mà còn dành cho các chủ đề khác.",
    "Pu0pj23rR": "Tại sao cần có số điện thoại?",
    "RYlJHHwg3": "Mã SMS không chính xác.",
    "RjdigcxfV": "Liên hệ chúng tôi",
    "TV09-obNr": "Cột mốc quan trọng",
    "TXdh_K": "Mật khẩu",
    "TdXddh_wK": "Số điện thoại",
    "Te3h_wK": "Số điện thoại",
    "TqXdd3h_wK": "Số điện thoại",
    "TqXddh_K": "Mã xác nhận",
    "TqXdh_K": "Xác nhận mật khẩu",
    "UED59zbd-": "LafCông cụ",
    "UjkOS50wO": "Trang chủ",
    "VndKeCfb-": "Xác minh số điện thoại để kích hoạt tài khoản",
    "VnddCfb-": "Bạn hiện đang bị cấm trong một thời gian",
    "W3M4ivK9U": "Cập nhật hồ sơ",
    "WKG7e": "Quy tắc",
    "Wpdsp3g5U": "Chào mừng bạn đến với Cộng đồng {0}!",
    "XIzgAAR": "Thông thường, mã mời có sẵn có thể được cung cấp từ quản trị viên web hoặc người dùng khác.",
    "Xddh_wK": "mã mời",
    "Y-svpKvUz": "hai mật khẩu không khớp",
    "Y0drdCSiu": "chủ đề",
    "Yc5uMym": "Bạn có thể thắc mắc ELB3 là viết tắt của từ gì, tóm lại, nó là viết tắt của nhóm WeChat phi lợi nhuận {0}, một nền tảng thú vị dành cho những người đam mê tiếng Anh và các thí sinh học hỏi và đánh giá cao tiếng Anh!",
    "ZCzH8": "Mới nhất",
    "ZaS8MP8cr": "Lưu ý: Mã xác minh được làm mới, vui lòng điều chỉnh giá trị biểu mẫu của bạn và nhập lại mã để tiếp tục.",
    "aISK9iYc_": "Báo cáo thông tin bất hợp pháp",
    "aUdtds_qwY": "Thông thường, bạn có thể đăng nhập thành công bằng ID người dùng hoặc số điện thoại của mình ngay cả khi bạn đã vi phạm các quy tắc trong cộng đồng này.",
    "b7wgrhuXl": "Công nghệ",
    "b_vts": "Đăng nhập",
    "dHWho": "Đăng ký",
    "dldeoeqwc": "Lời nhắc thân thiện",
    "dnsz7fwNx": "ID người dùng phân biệt chữ hoa chữ thường.",
    "dsdfqw": "người dùng không tồn tại",
    "dwJucRtar": "Phần này vẫn đang được tiến hành, hoan nghênh bạn đóng góp cho dự án phần này.",
    "dzIC7qPQ": "Nếu bạn muốn tham gia cùng chúng tôi, vui lòng liên hệ với quản trị viên web qua email {0} hoặc tài khoản WeChat {1} của anh ấy để nhận mã mời.",
    "englishcorner": "Tiếng Anh",
    "eqwee": "Mật khẩu không đúng",
    "fcGTPc7HP": "Tôi có thể lấy mã mời ở đâu?",
    "gTOv6abWT": "Đăng nhập",
    "gTOv6adbWT": "Đăng ký",
    "geHXwByxy": "Cài đặt",
    "gmK3pKyRI": "{0} Số lượng trực tuyến cao nhất",
    "groupnote": "Bản ghi nhớ",
    "hxCMxpW6Sq": "Đã tham gia {0} ngày trước",
    "jRFk519Bj-": "Cộng đồng này được thúc đẩy bởi một dự án mã nguồn mở hoàn toàn miễn phí mang tính quốc tế.",
    "jdbef_PBl": "Mục tiêu",
    "ky6JphiKk": "{0} Người dùng trực tuyến",
    "lEDpJMRfG": "Nếu bạn bối rối, xin vui lòng cho chúng tôi biết bằng cách gửi email cho chúng tôi.",
    "lWqYc": "Trang web này cung cấp các công cụ JSON bao gồm JSON sang XML, JSON sang CSV, JSON sang YAML.",
    "lastreplyby": "Trả lời cuối cùng bởi",
    "lidydVO": "Tại sao tôi bị chặn hoặc bị giới hạn?",
    "lu2T6idPY": "Nếu bạn cho rằng có vấn đề với tài khoản của mình, vui lòng liên hệ với quản trị trang web.",
    "m2LEjrKDS": "未知",
    "nIDKbSXTw": "{0} Người dùng",
    "nncQE": "Mạng sống",
    "o4GdNzX6xS": "Thứ nhất, Do yêu cầu quy định phổ biến trên Trái đất, mỗi người dùng được yêu cầu cung cấp số điện thoại hợp lệ để đăng ký.",
    "oHQNQ4mRw": "Tên người dùng",
    "p1Jyl4uMv": "Đăng xuất tài khoản của bạn",
    "pNwe3": "Khác",
    "tip_JkgcP": "未知",
    "tiv188Gz5": "Chọn ngôn ngữ trang web",
    "uefFV1": "Sau đó",
    "ufSPh0ad": "Nếu không thể đăng ký tài khoản qua số điện thoại hiện tại của bạn, vui lòng liên hệ với quản trị viên web qua email {0} hoặc tài khoản WeChat {1} của họ. Chúng tôi có thể hỗ trợ bạn đăng ký tài khoản theo cách thủ công.",
    "wCcPJZK": "{0} không phải là email hợp lệ",
    "wCctGPJZK": "{0} không được để trống",
    "xhxY6iLDH": "Đăng xuất",
    "yOdwRB": "Chào mừng đến với cộng đồng ELB3!",
    "zr3ZBdUoT": "Hướng dẫn sử dụng",
    "zuxd0y-kmA": "ID người dùng hoặc Số điện thoại không có khoảng trắng."
}