{
    "-8l11": "Kopiert",
    "-DqwwR": "Vorgang abgeschlossen.",
    "-GJ_72": "Zum ausgewählten Arbeitsbereich {0} gewechselt",
    "-Jx4J": "Lokales Konto",
    "-LAmf2wHX": "In CSV konvertieren",
    "-Rj3y": "Themen",
    "-XZnW": "Zurück",
    "-Yo1q29Iq": "Textwerkzeuge",
    "-nL_B5PoN": "Komprimiert {0}",
    "01do0y": "Kannada",
    "04SSf": "Passwort vergessen?",
    "07naT": "Fehler: {0}",
    "0Ceqru": "Base64 ist eine Notation zur Kodierung beliebiger Bytedaten mithilfe eines eingeschränkten Satzes von Symbolen, die bequem von Menschen verwendet und von Computern verarbeitet werden können.",
    "0MO3jj": "MD5 (Message-Digest 5) ist eine weit verbreitete Hash-Funktion. Es wurde in einer Vielzahl von Sicherheitsanwendungen eingesetzt und wird auch häufig zur Überprüfung der Integrität von Dateien verwendet. Allerdings ist MD5 nicht kollisionssicher und eignet sich nicht für Anwendungen wie SSL/TLS-Zertifikate oder digitale Signaturen, die auf dieser Eigenschaft basieren.",
    "0PgZ_": "Übersetzung",
    "0YKce": "Konvertiert eine BCD-Zeichenfolge (Binary-Coded Decimal) in eine Dezimalzahl.",
    "0gvcN": "Willkommen auf der Übersichtsseite, sie befindet sich noch in der Entwicklung.",
    "0pfdz7": "Usbekisch",
    "13pmE": "Unterstütze uns",
    "1507oa": "Bengali",
    "1JOFP": "Öffnen Sie „Mein Arbeitsbereich“.",
    "1NTgQ": "Arbeitsbereich öffnen",
    "1Npez": "Bitte geben Sie den Pfad an",
    "1Tuab": "Kopiert",
    "1X8x7": "Beispiel",
    "1X8x7dqw": "CSV zu JSON",
    "1Xe82x7": "{0} Minimieren",
    "1Xe8wx7": "Hex-String",
    "1Xe8x7": "{0} Verschönern",
    "1Xe8x7qe": "BCD",
    "1YmJc": "Wählen Sie eine der Optionen als Ihre bevorzugte Sprache:",
    "1bd": "Arbeitsablauf",
    "1e3e5n": "Hausa",
    "1fd8x7dqw": "Zeilennummern entfernen",
    "1h6jH": "Achtung, die Ausgabe ist ein leerer Wert mit der Länge Null!",
    "1j62a": "Tun Sie dies zu einem anderen Zeitpunkt",
    "1k_44": "Dieser Vorgang dekodiert Daten aus einer ASCII-Base64-Zeichenfolge zurück in ihr Rohformat.",
    "1th2nw": "Singhalesisch",
    "20nmcv": "Latein",
    "22XLF": "Noch nicht fertig",
    "24vLI": "Erstellt",
    "27j7sy": "Shona",
    "2D9a6": "Passwort vergessen?",
    "2D9qdk6": "Ist es sicher genug?",
    "2IF6A": "Es sieht so aus, als ob beim Forge-Save-Speicher ein Problem aufgetreten ist",
    "2JyFN": "Ergebnis in die Zwischenablage kopieren",
    "2Ocbey": "Ausführung",
    "2RhAT": "Es sieht so aus, als ob beim Fake-Abrufprozess ein Problem aufgetreten ist",
    "2Ruh6": "Erstellen Sie ein neues lokales Konto",
    "2S5ap": "Vollbildmodus umschalten",
    "2Va7Txc-V": "Wie das UNIX-Tail-Dienstprogramm.<br>Ruft die letzten n Zeilen ab.<br>Optional können Sie alle Zeilen nach Zeile n auswählen, indem Sie einen negativen Wert für n eingeben.<br>Das Trennzeichen kann so geändert werden, dass anstelle von Zeilen Felder angezeigt werden (d. h. Kommas) werden stattdessen ausgewählt.",
    "2bdqHk": "Datei",
    "2e4fb7": "Igbo",
    "2giYv": "Testpasswort: {0}",
    "2khdsv": "Paschtu",
    "2qdin8": "Bitte den Bestätigungscode eingeben",
    "30eo2v": "Gujarati",
    "32D9a6": "Ein Konto erstellen",
    "33RXi": "Der Antrag wurde aufgrund unbefriedigender Parameter abgelehnt.",
    "346qid": "Russisch",
    "39dsCt": "Wenn dies der Fall ist, erhalten Sie eine aktuelle Benachrichtigung von den App-Diensten.",
    "3EWVUaSJ7": "Von Base64",
    "3ii2tt": "Schottisches Gälisch",
    "3tsHVcKoI": "Entfernen Sie Zeilennummern vom Anfang jeder Zeile in einem Text.",
    "3umnB": "Unbekanntes Token",
    "441oja": "georgisch",
    "44Ntqw-": "Abwicklung der Operation.",
    "46bksi": "litauisch",
    "4K_vhq": "Duplizieren Sie diese Registerkarte",
    "4PIqD": "Code-Review",
    "4UYIJ": "Noch nicht fertig.",
    "4cGA_": "Daten für Systemeinstellungen werden abgerufen...",
    "4kKe4": "Ihr Passwort",
    "4tqb4x": "ungarisch",
    "4vdfwf": "OK",
    "4wlih": "Der Antrag wurde aufgrund unbefriedigender Parameter abgelehnt.",
    "52OiQ": "{0} Mal kopiert",
    "54cwb": "Die System-Websocket-API hat einen Fehler festgestellt: {0}",
    "56iah1S9Y": "Entfernt Leerzeichen am Anfang und Ende eines Textes.",
    "56ibcj": "Vietnamesisch",
    "58HQX": "Wenn Sie den Wert nicht kennen, wenden Sie sich bitte an Ihren Administrator, um weitere Einzelheiten zu erfahren. Diese finden Sie in seinen Einstellungen.",
    "5BOhl": "Einladungscode",
    "5Ih2u": "Tools-Navigator",
    "5NCPT": "Dunkler Modus",
    "5NJeGsu1": "Mit E-Mail können Sie ganz einfach Ihren Posteingang organisieren, Nachrichten verfassen und senden und den Überblick über Ihre Korrespondenz behalten. Bisher wird es nur als Kommunikationstool zwischen Benutzern und unserem Team verwendet.",
    "5NJeddqGsu1": "Dieser Abschnitt enthält Computermaterialien, Wiki-Artikel, Benutzerhandbücher und mehr.",
    "5NJedqddqGsu1": "Dieser Abschnitt enthält Computerressourcen, die zum Erstellen eigener Projekte verwendet werden können.",
    "5Perd": "Leider ist die Funktion „Smart Editor verwenden“ noch nicht verfügbar. Wir arbeiten noch an der Umsetzung. Vielen Dank für Ihre Geduld.",
    "5RPdtVff3": "Von Hex",
    "5ZBYR": "Zurück",
    "5_EPRncIx": "Linken Navigator ausblenden",
    "5dF7o": "Aktualisierung",
    "5eXVS": "Skriptinhalt",
    "5lW8qp": "Zeigen Sie ein Beispiel für dieses Tool",
    "5q-Zxqa": "Skriptmanager",
    "5qPOJL": "Um LafTools zu unterstützen, sollten Sie erwägen, entweder unserem Repository auf GitHub einen Stern zu geben oder über ein monatliches Abonnement ein Upgrade auf unsere professionelle Version durchzuführen. Wir würden uns über Ihre Hilfe sehr freuen und versprechen, dass LafTools mit den gesammelten Mitteln noch besser wird.",
    "5qV5Sf": "Entfernen Sie diesen Datensatz aus der Liste",
    "5rg5mt": "Madagassisch",
    "5srFq": "LafTools",
    "5v8jl7": "Hmong",
    "6AumW": "Standardaktion",
    "6ClPV": "Erstellen",
    "6MrfIfGc6": "Code minimieren",
    "6SypzjeRz": "Suchen Sie schnell nach den Tools, die Sie benötigen",
    "6UICxHzVR.name": "Verschönern Sie {0}",
    "6cOPZ": "Binary-Coded Decimal (BCD) ist eine Klasse binärer Kodierungen von Dezimalzahlen, bei denen jede Dezimalstelle durch eine feste Anzahl von Bits dargestellt wird, normalerweise vier oder acht. Manchmal werden für ein Zeichen spezielle Bitmuster verwendet",
    "6hsnqWe": "Obwohl LafTools kostenlos und Open Source ist, erfordert die Wartung dennoch viel Zeit und Energie. Insbesondere benötigen wir Mittel, um bestimmte Cloud-APIs zu bezahlen. Wenn Sie LafTools schätzen, denken Sie bitte darüber nach, uns zu unterstützen.",
    "6j13s3": "isländisch",
    "6qT9d-N": "Für das Notebook stellt LafTools nicht nur einen Shell-Befehlsmanager bereit, sondern wird in naher Zukunft auch leistungsstarke Notiztools wie MarkDown, Latex, {0} usw. hinzufügen.",
    "6ulj8i": "Nepali",
    "6wdtJ4vmg.name.0912": "{0} minimieren",
    "6yOXx": "Unbekannter Name",
    "71x7x": "Quellcode auf GitHub",
    "7MOO1": "Anmelden",
    "7g5w22": "norwegisch",
    "7k56u3": "galizisch",
    "7q40W": "Der Administrator konnte nicht initialisiert werden",
    "7u4vzu": "slowakisch",
    "7x3f6": "Registerkarte - 1",
    "7zlGIUGvj": "Ausgabebereich anzeigen",
    "82r0C": "Verwalten Sie Ihre TODO-Liste und erledigen Sie Ihre Aufgaben effizienter.",
    "8LdRj": "Überblick",
    "8LdRjq": "Berechnen",
    "8LdevRj": "Service",
    "8M1wY": "Lokales Terminal",
    "8OqB7hN1s": "Diese Seite bietet einen IDE-UI-Stil für LafTools, eine höhere Abstraktionsebene für LafTools.",
    "8eeL1Kk": "Um",
    "8hlgTVznY": "Entfernt optional alle Leerzeichen, Wagenrückläufe, Zeilenumbrüche, Tabulatoren und Seitenvorschübe aus den Eingabedaten.<br><br>Dieser Vorgang unterstützt auch das Entfernen von Punkten, die manchmal zur Darstellung nicht druckbarer Bytes in der ASCII-Ausgabe verwendet werden.",
    "8mn_qa": "Abrufen der Daten von Terminaldiensten...",
    "97um9v": "hawaiisch",
    "98KcL": "Konvertiert eine Dezimalzahl in eine binär codierte Dezimalzahl (BCD).",
    "9O7RAAblf": "Aktivieren Sie den Vollbildmodus",
    "9_qaj": "Verlassen Sie dieses Formular",
    "9e4fcl": "Tamilisch",
    "9eZHM": "Hoppla! Es scheint, dass wir auf einige Warnungen oder Fehler stoßen.",
    "9gqo8x": "lettisch",
    "9m85mf": "Sesotho",
    "9qy1xn": "Portugiesisch",
    "9zCSc": "Keine verfügbaren Arbeitsbereiche",
    "A69UZ": "Variablen",
    "AVUvu": "Base62 ist eine Notation zum Kodieren beliebiger Bytedaten mithilfe eines eingeschränkten Satzes von Symbolen, die bequem von Menschen verwendet und von Computern verarbeitet werden können. Die hohe Zahlenbasis führt zu kürzeren Zeichenfolgen als beim Dezimal- oder Hexadezimalsystem.",
    "AfPC0": "Ihr Klartext-Passwort",
    "Ahrjc": "Das Verzeichnis existiert nicht. Möchten Sie es erstellen?",
    "AkXgF": "In Bearbeitung: {0} %",
    "Apx8D": "Wie setze ich mein Passwort manuell zurück?",
    "B-GCloBBt": "Komprimiert XML-Code (eXtensible Markup Language).",
    "B0s0z": "Zweck dieser Seite:",
    "B5NLBB_Je": "Aus Sicherheitsgründen ist das Terminal derzeit nicht verfügbar. Bleiben Sie bitte auf dem Laufenden, danke!",
    "BGd7P9": "Dieser Vorgang kodiert Rohdaten in eine ASCII-Base64-Zeichenfolge.",
    "BGd7dP9": "Dieser Vorgang kodiert Rohdaten in eine ASCII-{0}-Zeichenfolge.",
    "BGdd7dP9": "Dieser Vorgang kodiert Rohdaten in eine ASCII-{0}-Zeichenfolge.",
    "BShq3M": "Probleme",
    "B_ekZSOiu": "Die SHA-Hash-Funktionen (Secure Hash Algorithm) wurden von der NSA entwickelt. SHA-1 ist die etablierteste der vorhandenen SHA-Hash-Funktionen und wird in einer Vielzahl von Sicherheitsanwendungen und -protokollen verwendet.<br><br>Die Kollisionsresistenz von SHA-1 hat jedoch nachgelassen, da neue Angriffe entdeckt oder verbessert wurden. Der Message-Digest-Algorithmus besteht standardmäßig aus 80 Runden.",
    "BuihG": "Systemeinstellungen",
    "C3L9MmdDU7": "Handbuch",
    "CEv8B": "Möchten Sie diesen Eintrag wirklich entfernen? Wenn ja, klicken Sie erneut auf diese Schaltfläche.",
    "CFg8B": "Die Größe muss zwischen 0 und 512 liegen",
    "CVUl0": "LafTools",
    "CfZAX": "Die Datei {0} wurde ausgewählt. Wir laden sie in den Kerndienst hoch.",
    "CidOqAZ": "Als Gründer von LafTools bin ich so berührt, dass Sie bereit sind, uns zu unterstützen. Wir haben gute Leute in unserem Team, die hart daran arbeiten, LafTools kontinuierlich zu verbessern.",
    "Cide2w": "Um zu sehen, ob bei der Ausführung Ihrer Aktion ein Problem auftritt.",
    "DIQFq": "Bitte überprüfen Sie, ob der URL-Parameter ordnungsgemäß angegeben wurde. Offenbar verfügen Sie nicht über die Berechtigung zum Ausfüllen dieses Formulars. Standardmäßig wird die folgende Meldung in der Ausgabe des Dienstes angezeigt, wenn dieser gerade gestartet wurde.",
    "DIweGq": "Sichern Sie Ihre LafTools",
    "DSEtLTxUU": "Zeit ist die Währung Ihres Lebens, verbringen Sie sie mit Bedacht.",
    "DTTPW": "Status zurücksetzen",
    "DVoKw": "Melden Sie sich von diesem System ab",
    "DqFI5": "Die Ebenen müssen größer als 0 sein",
    "DrXAq": "Willkommen bei LafTools!",
    "DrbEr": "Das von Ihnen angegebene Passwort ist leer. Bitte überprüfen Sie es und versuchen Sie es erneut.",
    "DtlAc": "Laden von Systemressourcen",
    "Dxlw0": "Vollständig",
    "E62ej": "Shell-Befehle filtern",
    "E6F9B": "Fügen Sie es dem Workflow hinzu",
    "EEQkeW": "Der MD6-Algorithmus (Message-Digest 6) ist eine kryptografische Hash-Funktion. Es verwendet eine Merkle-Baumstruktur, um eine umfangreiche parallele Berechnung von Hashes für sehr lange Eingaben zu ermöglichen.",
    "EO6Qv5dCA": "Minimiert den JSON-Code und reduziert die Bundle-Größe Ihres JSON-Codes.",
    "ERK7E": "Wenn Sie bei der Verwendung von LafTools auf ein Problem stoßen oder Vorschläge haben, können Sie uns jederzeit per E-Mail oder GitHub kontaktieren. Wir sind bereit, es dringend zu verbessern.",
    "EgBXL": "Wählen Sie Tags aus oder stellen Sie sie bereit.",
    "EvZEuiDq3": "JSON entkommen",
    "Ewvgo": "Noch nicht angefangen.",
    "ExqvX": "Hotkeys-Liste",
    "Eyq856": "Wir sind noch nicht fertig – wir sind bestrebt, die neuesten und besten Funktionen bereitzustellen, und wir werden weiterhin Updates veröffentlichen, um sicherzustellen, dass Sie das bestmögliche Erlebnis haben.",
    "F-OUm": "Schnelle Einrichtung für LafTools",
    "F0CCF": "HotKeys-Liste",
    "F4uS2": "Neue Datei",
    "FBVyc": "Bitte geben Sie den Bestätigungscode erneut ein",
    "FDlRI": "Benennen Sie diese neue Registerkarte und klicken Sie, um sie zu bestätigen.",
    "FLsbFsOZq": "IDE",
    "FOyHW": "Überall suchen",
    "FQzhg": "Leere Eingabe ignorieren",
    "FYRoL": "Einrückt und verschönert Cascading Style Sheets (CSS)-Code.",
    "FhVWl": "Verschlüsseln Sie Ihr Passwort",
    "FjYbR": "Ausgabe",
    "Fv-zz": "Ergebnis kopieren",
    "Fy217": "Konfigurieren Sie dieses Tool",
    "Fzp3t": "Bitte geben Sie in diesem Feld einen Wert ein",
    "G3MJN": "Ausgabebereich anzeigen",
    "G9QVo": "Registerkarten verwalten",
    "GR7jK": "Typ",
    "Ggob_": "Stornieren",
    "H-Ae75": "Bitte bestätigen Sie Ihr lokales Passwort.",
    "H-qA75": "Bitte geben Sie ein lokales Passwort ein.",
    "H8fQ4": "Wechseln Sie in den Hell- oder Dunkelmodus",
    "HEAhr": "Nach der Übersetzung erscheint hier das Ergebnis.",
    "HIc3c": "Vollendet",
    "HNDat": "Um Änderungen vorzunehmen, klicken Sie bitte auf die Schaltfläche „{0}“. Andernfalls klicken Sie auf „{1}“, um Ihre Änderungen zu übernehmen. Viel Spaß mit dieser Toolbox!",
    "HjvV3": "Wir werden seine Dateien auf der Festplatte nicht löschen, sondern diesen Eintrag einfach aus der Liste entfernen.",
    "HyIC_": "Schrägstrichtaste (/)",
    "HyIC_d": "Schrägstrichtaste (/)",
    "I8FLi": "Jetzt ist es an der Zeit, Ihren Administrator einzurichten. Bitte legen Sie das Passwort so komplex wie möglich fest, damit Sie unhöfliche Angreifer verwirren können.",
    "IAC0A": "Suchwerkzeuge",
    "ICefi": "Abgesagt",
    "IKqqATS": "Aktuelle Seitendaten aktualisieren",
    "IZ8H4v6fF": "Diese Registerkarte befindet sich im Aufbau. Kurz gesagt, es kann eine Kette von Operationen bereitstellen, die an den Eingabedaten ausgeführt werden. Sie können beispielsweise JSON komprimieren, JSON maskieren, JSON in ein Modell konvertieren, CSV in ein Modell konvertieren und so weiter.",
    "IaSyO": "Stornieren",
    "IdfUH5": "Beispiel",
    "IfsdGO": "Favoriten",
    "ImUmf": "Neu",
    "IxAJswoSh": "Analysiert und druckt gültigen JavaScript-Code. Funktioniert auch mit JavaScript Object Notation (JSON).",
    "J-3KA": "Bitte geben Sie einen Namen für dieses Skript an, der hilfreicher wäre.",
    "J164i": "z.B. Kopieren Sie Dateien auf den Remote-Server",
    "J2xoL": "Bitte sehen Sie sich den Fehler an: {0}",
    "JA_Bp": "Bitte geben Sie zunächst einen Namen für das neue Tag ein.",
    "JQEVK": "Code",
    "JQLmS": "Größe angepasst",
    "JQLmSq": "Vollendet.",
    "JYqxz2": "Willkommen bei LafTools, dies ist eine Insider-Version.",
    "JdqiUE8": "Dieser Vorgang dekodiert Daten aus einer ASCII-Zeichenfolge (mit einem Alphabet Ihrer Wahl, einschließlich Voreinstellungen) zurück in ihre Rohform.",
    "JdqidUE8": "Dieser Vorgang dekodiert Daten aus einer ASCII-Zeichenfolge (mit einem Alphabet Ihrer Wahl, einschließlich Voreinstellungen) zurück in ihre Rohform.",
    "JiUE8": "Dieser Vorgang dekodiert Daten aus einer ASCII-{0}-Zeichenfolge zurück in ihr Rohformat.",
    "K1qJZI": "Willkommen bei LafTools, Eure Exzellenz.",
    "KYh1N": "Alle Notizen",
    "KcqrRr": "Referenz",
    "KcrRr": "Code-Implementierungsdaten abrufen",
    "KmEUF": "Geben Sie einen schnellen Überblick über die aktuellen Systemtools.",
    "Kw4OJr": "Terminal",
    "Kyd9H": "Quellcode auf GitHub",
    "L-p-Y": "Kopieren Sie den Inhalt des aktuellen Shell-Befehls in die Zwischenablage",
    "L42mxa": "Bitte geben Sie in diesem Feld Ihren Quelltext ein.",
    "L49kCq": "Bitte geben Sie in diesem Formular das Sperrkennwort ein und bestätigen Sie es, um Ihre LafTools zu sichern.",
    "L71q_N": "Das von Ihnen angegebene Passwort ist leer. Bitte überprüfen Sie es und versuchen Sie es erneut.",
    "L9bQku": "{0} dekodieren",
    "L9qbQku": "{0} dekodieren",
    "LFdvM": "Nicht eingeloggt",
    "LM715": "Abrufen der i18n-Konfiguration von der lokalen Server-API",
    "LSohY6eZW": "Hex String ist eine Folge hexadezimaler Bytes, die durch ein Trennzeichen getrennt sind. Dabei kann es sich um ein Leerzeichen, ein Komma, ein Semikolon oder einen Doppelpunkt handeln.",
    "LU9Jj": "Base85 (auch Ascii85 genannt) ist eine Notation zur Kodierung beliebiger Bytedaten. Normalerweise ist es effizienter als Base64. Dieser Vorgang dekodiert Daten aus einer ASCII-Zeichenfolge (mit einem Alphabet Ihrer Wahl, einschließlich Voreinstellungen). Base85 wird häufig in den PostScript- und PDF-Dateiformaten von Adobe verwendet.",
    "LWaeFqd": "Wechseln Sie zu Ihrer bevorzugten Sprache",
    "Le71_N-": "Das von Ihnen angegebene Passwort stimmt nicht mit dem bestätigten überein. Bitte überprüfen Sie es und versuchen Sie es erneut.",
    "LgJAz6Xwr": "SHA-0 ist ein Retronym für die Originalversion der 160-Bit-Hash-Funktion, die 1993 unter dem Namen „SHA“ veröffentlicht wurde. Es wurde kurz nach der Veröffentlichung wegen eines nicht genannten „erheblichen Fehlers“ zurückgezogen und durch die leicht überarbeitete Version SHA-1 ersetzt. Der Message-Digest-Algorithmus besteht standardmäßig aus 80 Runden.",
    "LnJ4H": "Beachten Sie, dass das lokale Konto nicht mit dem auf unserer Website registrierten Benutzer identisch ist. Ersteres ist nur auf Ihrem PC definiert, während letzteres für die Cloud-Synchronisierung verwendet werden kann.",
    "LqWaFd": "Systemeinstellungen",
    "LxaEFHbfa": "Minimiert den SQL-Code und reduziert die Bundle-Größe Ihres SQL-Codes.",
    "M3qytc": "Kodieren Sie {0}",
    "M3ytc": "Kodieren Sie {0}",
    "M4ywN1": "Rechner, Kalender, Uhr, Wetter und mehr.",
    "M7jct": "Wechseln Sie in den Vollbildmodus",
    "MN2lT": "Die Länge des Passworts darf nicht weniger als 6 betragen",
    "Ma5mv": "Schalten Sie die Sichtbarkeit der Symbolleisten-Registerkarten um",
    "Mq9pdpT": "Listen Sie alle relevanten Ressourcen für das von Ihnen ausgewählte Funktionsmenü auf.",
    "Mq9ppT": "Sehen Sie sich schnell den Status Ihrer Dienste an",
    "Mqq9pdpT": "Helfen Sie beim Einstieg in LafTools.",
    "MrgmU": "Bestätigen",
    "N8_QO8jAt": "Erzeugt einen SHA-3-Hash aus einem Text. SHA-3 ist das neueste Mitglied der Familie der sicheren Hash-Algorithmen. Es ist nicht anfällig für die gleichen Angriffsarten wie SHA-1 und SHA-2.",
    "NMLOn": "Dateipfad kopieren",
    "NMLOn1": "Arbeitsbereich öffnen",
    "NNfdo": "Daten aus Datei als Eingabe laden",
    "Nqc0LqwX": "Wenn Sie der Meinung sind, dass in diesem Prozess eine Schwachstelle vorliegt, können Sie uns jederzeit per E-Mail oder GitHub kontaktieren, wir würden diese gerne dringend verbessern.",
    "NrQc8OJfZ": "Komprimiert JavaScript Object Notation (JSON)-Code.",
    "O94Yx": "An",
    "OJd-7SdMC": "Textmanipulation",
    "OMrIvzpf5": "Die Hash-Funktionen SHA-3 (Secure Hash Algorithm 3) wurden am 5. August 2015 vom NIST veröffentlicht. Obwohl SHA-3 zur gleichen Reihe von Standards gehört, unterscheidet es sich intern erheblich von der MD5-ähnlichen Struktur von SHA-1 und SHA -2.<br><br>SHA-3 ist eine Teilmenge der breiteren kryptografischen Primitivfamilie Keccak, die von Guido Bertoni, Joan Daemen, Micha\\xebl Peeters und Gilles Van Assche entworfen wurde und auf RadioGat\\xfan aufbaut.",
    "OO0qPN": "Beispiel geladen",
    "OQWm4": "Melde einen technischen Fehler",
    "OSHOI": "Startseite",
    "OSqZQM": "Lokales Passwort",
    "OeO0PeN": "Okay, das Beispiel wird im Eingabeeditor angezeigt.",
    "OeOQY": "MACHEN",
    "Ol1ZcWomT": "{0} Verschönern",
    "OpPFe": "Wenn Ihnen LafTools gefällt, teilen Sie es bitte mit Ihren Freunden und geben Sie uns einen Stern, danke!",
    "Opcty": "Dateien",
    "OqqGx2qg": "Die statischen Ressourcen werden geladen, bitte warten...",
    "OrCD8PqwH": "Zeilennummern entfernen",
    "OrCt5": "Weiterleitung zur Werkbank...",
    "Ot6EP": "Polnische Werkzeuge",
    "PM_N5": "Sitzung – {0}",
    "PUxuU": "Daten für Sprachpakete werden abgerufen...",
    "PpCHA": "Frageschlüssel(?)",
    "QAJ1Y27b7": "Deaktivieren Sie den Vollbildmodus",
    "QLKzF": "Es ist vollgepackt mit Funktionen, die sowohl auf die Bedürfnisse von Anfängern als auch von erfahrenen Entwicklern zugeschnitten sind, was es zu einem unverzichtbaren Werkzeug im Arsenal jedes Programmierers macht.",
    "QM2Ob": "Aktuelle Tools",
    "QM2Oq": "Aktuelle Notizen",
    "QRAdA": "Englisch zu Chinesisch",
    "QZK58Gemi": "Komprimiert SQL-Code (Structured Query Language).",
    "QhdpH": "Gemeinschaftsausgabe",
    "QkJ-TOduip6z_": "LafTools-IDE",
    "QzlA3": "Ein Fehler ist aufgetreten",
    "R12bq": "Listen Sie Registerkarten auf, die nicht angezeigt werden",
    "RNBze0": "Werkzeuge",
    "RNeBze0": "Geöffnete Tabs",
    "RNewBze0": "Werkzeugkonfiguration",
    "RO4ZP": "Ein Fehler ist aufgetreten",
    "RPVRl": "Es scheint, dass diese Erweiterung nicht mit der aktuellen Version von LafTools kompatibel ist. Bitte erwägen Sie die Installation der neuesten Version, um diese Erweiterung zu unterstützen, oder kontaktieren Sie uns, indem Sie ein Problem auf GitHub melden.",
    "RhqzcdD": "Systemeinstellungen",
    "RjCO3": "Arbeitsbereichsliste",
    "RzegarVx1": "Ob Ausgabeergebnisse separat angezeigt werden sollen",
    "S4MMV": "Hoppla! Beim Laden der Datei sind einige Probleme aufgetreten.",
    "SAnnQ": "Laden der Datei {0}",
    "SBsDz": "Einrichtung für Ihr Admin-Konto.",
    "SGalwFBxc": "Erzeugt einen SHA-1-Hash aus einem Text. SHA-1 ist nicht sicher und sollte nicht verwendet werden.",
    "SGs7B": "Richten Sie Ihre LafTools schnell ein",
    "SMqD13": "Geben Sie ein, um zu filtern",
    "SPem9": "Dieses Feld ist noch nicht fertig.",
    "SQAw7": "Ausgangssprache",
    "SYSq1": "Beispiel",
    "SZgXb": "Lokales Passwort einrichten",
    "SdGcT": "Anderer Teil",
    "Sm9tq": "Bitte geben Sie hier Ihr Kontopasswort ein",
    "Sm9tqq": "Bitte geben Sie ein Passwort ein, um Ihre LafTools zu entsperren",
    "Spcfdee": "Heller oder dunkler Modus",
    "TBPqy7": "Sprache",
    "TD7DA": "Sprachen",
    "TNoePE": "LafTools-Cloud",
    "Ttrqqet": "Schreiben und speichern Sie Ihre Gedanken hier!",
    "TwFcr": "Zielsprache",
    "TyqvWY3": "Lokale Datei",
    "U-SKci0LP": "Leerzeichen entfernen",
    "U2ZNl": "Erfahren Sie mehr auf Wikipedia",
    "U4qqq9": "Entfernen Sie diese Registerkarte aus der Liste",
    "U7zP2": "Bitte geben Sie hier den Benutzernamen für Ihr Konto ein",
    "UAmIRsSWN": "Die SHA-2-Hashfunktionen (Secure Hash Algorithm 2) wurden von der NSA entwickelt. SHA-2 enthält wesentliche Änderungen gegenüber seinem Vorgänger SHA-1. Die SHA-2-Familie besteht aus Hash-Funktionen mit Digests (Hash-Werten), die 224, 256, 384 oder 512 Bit lang sind: SHA224, SHA256, SHA384, SHA512.<br><br><ul><li>SHA-512 funktioniert auf 64-Bit-Wörtern.</li><li>SHA-256 arbeitet mit 32-Bit-Wörtern.</li><li>SHA-384 ist weitgehend identisch mit SHA-512, ist jedoch auf 384 Bytes gekürzt.</li ><li>SHA-224 ist weitgehend identisch mit SHA-256, ist jedoch auf 224 Bytes gekürzt.</li><li>SHA-512/224 und SHA-512/256 sind gekürzte Versionen von SHA-512, aber die ursprünglichen Werte werden mit der in Federal Information Processing Standards (FIPS) PUB 180-4 beschriebenen Methode generiert.</li></ul> Der Message Digest-Algorithmus für SHA256-Varianten besteht standardmäßig aus 64 Runden und für SHA512-Varianten aus 64 Runden ist standardmäßig 160.",
    "UF_Dp": "Es ist ein Fehler aufgetreten: {0}, Ablehnungszeit ist {1}",
    "UTeZ46gI4": "Ausgabebereich ausblenden",
    "UVvJp-vtF": "{0} Minimieren",
    "UZ2Ig": "Neues lokales Konto",
    "V6U_f": "Nutzungsbedingungen",
    "V6XEO": "Geben Sie den Benutzernamen oder die E-Mail-Adresse ein",
    "VAZq8r": "Es ermöglicht Entwicklern, verschiedene Befehle auszuführen, beispielsweise das Ausführen von Skripts, das Installieren von Paketen und das Navigieren im Dateisystem – und das alles direkt im Editor.",
    "VEfeqZG": "Anmerkungen",
    "VI6VT": "Geschichte",
    "VOsZc": "Melde Probleme",
    "VSZ": "Klicken Sie, um erneut auszulösen",
    "VZtqg6": "Erstellen Sie ein neues Skriptformular",
    "Vaf2y": "Der Tab-Name darf nicht leer sein.",
    "Vc40-vfod": "Entfernt Zeilennummern aus der Ausgabe, wenn sie trivial erkannt werden können.",
    "VeY9K": "Nutzungsbedingungen",
    "Vvt09V2Qo": "Allgemeiner Code",
    "WFUWzv_px": "Analysiert und druckt gültigen JavaScript-Code. Funktioniert auch mit JavaScript Object Notation (JSON).",
    "WPrTW": "Offizielle Website",
    "WXo6D": "Erfrischt",
    "WYCVL": "Schnelle Einrichtung",
    "X6Fq4j": "Nach Jahren engagierter Entwicklung und Verfeinerung sind wir zuversichtlich, dass LafTools Ihr Programmiererlebnis erheblich verbessern kann, indem es Ihren Arbeitsablauf komfortabler und effizienter macht.",
    "XLWoR": "Wählen Sie Ihr bevorzugtes aus und fahren Sie fort",
    "XQxJB": "Meine Arbeitsbereiche",
    "X_HGx": "LafTools ist eine vielseitige Toolbox, die für verschiedene Anforderungen entwickelt wurde. Es ist vollständig Open Source und gewährleistet Transparenz und Sicherheit. Trotz seiner schlanken Laufzeit bietet es vollständige Plattformunterstützung, einschließlich ARMv8, und native KI-Unterstützung ähnlich wie ChatGPT. LafTools ist hochgradig in eine produktive Benutzeroberfläche integriert und wird kontinuierlich mit neuen Tools aktualisiert. Es kann über das Web und mit Docker verwendet werden und bietet zusätzliche Ressourcen wie Notizen und Handbücher.",
    "XeXF77": "Einstellungen",
    "Y5GAC": "Dein Benutzername",
    "Y9mQ2": "Bitte geben Sie hier den Benutzernamen für Ihr Konto ein",
    "YAAU3q": "Lokales Passwort",
    "YHCjT": "LafTools unterstützt globale Hell- und Dunkelthemen und ist insbesondere für Nachtschicht-Codierer nützlich.",
    "YNwKz": "Nicht unterstützte Sprache: {0}, standardmäßig wird Englisch verwendet.",
    "YOYTp": "Schnelle Einrichtung",
    "YPPPL": "Schalten Sie die Sichtbarkeit der Symbolleisten-Registerkarten um",
    "YQN9u": "Beim Laden von {0} ist ein Fehler aufgetreten. Bitte überprüfen Sie die Details unten.",
    "Y__Zb1_4Q": "Minimiert den CSS-Code (Cascading Style Sheets) und entfernt alle unnötigen Zeichen.",
    "Y_k0z": "Passwort vergessen?",
    "Ye3TXses": "Zum Konfigurieren, ob die Transformation automatisch ausgeführt wird, wenn der Eingabetext geändert wird.",
    "Ylq2X": "Fehler Korrektur",
    "YquQqTXq": "Autostart?",
    "YrTdq": "Alle",
    "YrVq683": "Post",
    "YrVqdd683": "Anleitungen",
    "Z2QTU": "Um",
    "Z3rhY": "Nachricht",
    "Z7ALO": "Zum ausgewählten Arbeitsbereich gewechselt",
    "Z7OTt": "Die von Ihnen ausgewählte Datei ist zu groß. Bitte wählen Sie eine Datei mit weniger als 30 MB aus.",
    "ZAGva": "Möchten Sie diesen Arbeitsbereich wirklich löschen?",
    "ZAKaFq": "Mein Cloud-Konto",
    "ZXRGC": "Bitte sehen Sie sich den Fehler an: {0}",
    "ZbD3F": "{0}, erstellt vom LafTools-Team",
    "Zk7JI": "Es wird noch nicht unterstützt",
    "ZrbduC": "Alle Fenster schließen",
    "ZrbuC": "Tab schließen",
    "_5OqeG": "Deaktivieren Sie es",
    "_Gy58tXpA": "JSON komprimieren",
    "_LFF3": "Sollten Sie bei der Verwendung von LafTools auf ein Problem stoßen oder Vorschläge haben, können Sie uns jederzeit per E-Mail oder GitHub kontaktieren. Wir sind bereit, es zu verbessern.",
    "_trqL": "Daten für Systemressourcen werden abgerufen...",
    "_z3lR": "Code aktualisieren",
    "a3yqoz": "persisch",
    "a3z-3k12": "IP-Adress-Tools",
    "aCkOP": "Ausfahrt",
    "aHAfR": "Daten für {0} werden abgerufen...",
    "aSOpr": "Datenmodellgenerator",
    "aVjps8d6V": "Zeigt den letzten Teil einer Datei oder eines Textes an.",
    "about_LafTools_toolbox": "Über LafTools",
    "actions.list": "Aktionen",
    "adpgq": "Neuen Arbeitsbereich erstellen",
    "ah-C4": "Neue Notiz",
    "aked6": "Verweise",
    "aked61": "Einführung",
    "asElV": "Entfernen",
    "az4uS2": "Sind Sie sicher, dass Sie sich von diesem System abmelden? Beachten Sie, dass Sie zur Anmeldeseite weitergeleitet werden.",
    "azpNX": "Vollendet.",
    "b6sx9b": "Philippinisch",
    "bP_6qG": "Tipps zum Vergessen Ihres Passworts",
    "bT4R6": "Neue Registerkarte",
    "bVlBN": "Chinesisch nach Englisch",
    "bhojei1": "Traditionelles Chinesisch",
    "bjZyW": "Übersetzen",
    "bors14": "Türkisch",
    "bp_-b": "Um die LafTools vollständig zu verwalten, müssen Sie zu Beginn des Einrichtungsvorgangs Ihren Administrator einrichten. Wir haben Ihre Identifizierung anhand des URL-Parameter-Tokens überprüft. Seien Sie versichert, dass niemand sonst Ihre Root-Berechtigung einrichten kann, es sei denn, er oder sie erhält das Setup-Token.",
    "bqqrij": "Suaheli",
    "bsWpBA73s": "Komprimiert JavaScript-Code.",
    "c0eCw": "Übersetzen Sie Ihren Text in jede gewünschte Sprache.",
    "c5meku": "Sundanesisch",
    "c7Uoqqe": "Bevor Sie LafTools verwenden, geben Sie bitte Ihr lokales Passwort ein und bestätigen Sie es wie folgt.",
    "cMBqyyFae": "Einrückt und verschönert SQL-Code (Structured Query Language).",
    "cNQp_": "Ressourcen",
    "cOYuMrncv": "Unbekannter Übersetzungsfehler",
    "cPS6q": "Alle Werkzeuge",
    "cQqwI8r": "Laden des Status des Terminaldienstes",
    "cU0YAMbxU": "Text in der Seitenleiste anzeigen",
    "ciZV2": "Base32 ist eine Notation zum Kodieren beliebiger Bytedaten mithilfe eines eingeschränkten Satzes von Symbolen, die bequem von Menschen verwendet und von Computern verarbeitet werden können. Es verwendet einen kleineren Zeichensatz als Base64, normalerweise das Großbuchstabenalphabet und die Zahlen 2 bis 7.",
    "ciZV21": "Base45 ist eine Notation zur Kodierung beliebiger Bytedaten mithilfe eines eingeschränkten Satzes von Symbolen, die bequem von Menschen verwendet und von Computern verarbeitet werden können. Die hohe Zahlenbasis führt zu kürzeren Zeichenfolgen als beim Dezimal- oder Hexadezimalsystem. Base45 ist für die Verwendung mit QR-Codes optimiert.",
    "ciZV2deq1": "Base58 (ähnlich Base64) ist eine Notation zur Kodierung beliebiger Bytedaten. Der Unterschied zu Base64 besteht darin, dass leicht falsch lesbare Zeichen (z. B. l, I, 0 und O) entfernt werden, um die Lesbarkeit für den Menschen zu verbessern. Base58 wird häufig in Kryptowährungen (Bitcoin, Ripple usw.) verwendet.",
    "cj1pd": "Aktualisierungsvorgang",
    "cjzqj9": "bosnisch",
    "cmxzpg": "Malayalam",
    "coM2I": "Verwenden Sie den Smart Editor",
    "crD7I": "Um zu konfigurieren, ob die Transformation den leeren Eingabetext ignorieren soll, dessen Länge Null ist.",
    "cuRCqb": "Kategorie existiert nicht",
    "cxqhqa": "Myanmar (burmesisch)",
    "d-l2l": "Bestätigen",
    "d-qPr": "Unbekanntes Layout: {0}",
    "d2i7Y9m7b": "In JSON konvertieren",
    "d5KZH": "Vielen Dank, dass Sie LafTools verwenden!",
    "d5LAU": "Lizenziert unter AGPLv3",
    "d5fmq2": "Italienisch",
    "d5hit": "Sitzung – {0}",
    "dCFIC": "Code hübscher",
    "dCFIwC": "Code-Generator",
    "dGKMx": "Ausgabe",
    "dGVUB": "Netzwerk-Tools",
    "dQwjNbi0y": "Erfahren Sie mehr über Dokumentation",
    "dV5Eq": "Arbeitsbereichsliste aktualisieren",
    "dk122q": "Verwalten Sie Ihre Arbeitsabläufe, um mehrere Tools miteinander zu kombinieren.",
    "dkarh": "Okay, Toolbox hat das Verzeichnis geöffnet. Wenn kein Popup-Fenster angezeigt wird, prüfen Sie bitte, ob Ihre Plattform diese Funktion unterstützt oder ob sich das Verzeichnis auf dem Server befindet.",
    "dkkq12": "Konfigurieren Sie Ihr Werkzeug in dieser Registerkarte.",
    "dl4kr": "Passwort vergessen?",
    "dpRY4": "Wörterbuch",
    "dqTqyvWY": "Schubladenmenü",
    "dsdpA_eJ": "Größe anpassen",
    "dtjdt4": "Kasachisch",
    "dxLQq": "Root-Berechtigung",
    "dzjTo": "Bitte geben Sie hier Ihr Kontopasswort ein",
    "e3WgQaZlb": "Komprimiert {0}",
    "e4Cd8t": "Base85",
    "e5rycw": "Kirgisisch",
    "e8Crq": "Bitte füllen Sie das untenstehende Feld mit Benutzername und Passwort aus, um fortzufahren.",
    "eTmq": "Geschichte der CodeGen ToolBox",
    "e_8pZ": "Eine vielseitige Toolbox für Entwickler zur Verbesserung der Produktivität.",
    "egkqC8t": "Base58",
    "egkqCd8t": "Base62",
    "eifoni": "katalanisch",
    "eqkqd4W": "Bitte geben Sie einen Namen für das neue Tag ein",
    "etV-l": "Dateien nach SIT2 kopieren",
    "eu5mh0": "Belarussisch",
    "euaI8": "Erstellen Sie ein neues lokales Konto",
    "euhy9v": "estnisch",
    "f3ttw8": "Maori",
    "f5bLC": "Dokumentation",
    "fBP5h": "Nutzername",
    "fEr5j": "Neues Skript erstellen",
    "fV_1P": "Anmelden",
    "fZsxfYv1v": "CSV zum Modell",
    "fdxluz": "rumänisch",
    "ff02c": "Abgesagt",
    "fgj880": "Telugu",
    "fqV_1P": "Schalten Sie Ihre LafTools frei",
    "g2_aX": "Verschlüsseltes Passwort in Datei kopieren",
    "g5SK9": "Zuletzt geöffnet",
    "gDjbs": "Historische Daten",
    "gK3dNQ": "Kopieren",
    "gMLVY-C4m": "JSON zum Modellieren",
    "gQhfS": "Datei-Tools",
    "gU1O2": "Ausgelöst",
    "generic-NI-UFPTe0": "Generischen Code verschönern",
    "generic-code-beautify.desc.2b3c": "Dieser Vorgang formatiert Code in verschiedenen Programmiersprachen, um die Lesbarkeit zu verbessern, indem konsistente Einrückungen und Zeilenumbrüche angewendet und sprachspezifische Stilrichtlinien eingehalten werden.",
    "gkC8t": "Base64",
    "gkdqqC8t": "Basis45",
    "gkqC8t": "Base32",
    "gms7_9n5v": "Konvertiert eine hexadezimale Bytezeichenfolge zurück in ihren Rohwert.",
    "gnKMZ": "Erfrischt.",
    "goIm36_Ns": "Leider noch nicht implementiert",
    "h6AeI": "Websocket-Verbindung um {0} geschlossen",
    "h97aov0Ab": "Erzeugt einen SHA-0-Hash aus einem Text. SHA-0 ist nicht sicher und sollte nicht verwendet werden.",
    "hJUMN": "Zielsprache",
    "hMvh1": "Backup-Datenbank",
    "hRFxV": "Weitere Informationen finden Sie auf unserer Website",
    "hX1CWGAhl": "Einrückt und verschönert XML-Code (eXtensible Markup Language).",
    "hcnt1k": "mazedonisch",
    "hhOT3": "Suche mit Name",
    "htTmvWjsS": "Komprimiert Cascading Style Sheets (CSS)-Code.",
    "htt1d2": "Esperanto",
    "hu-iz": "Timer",
    "huE6U": "Variable",
    "hyV-d": "Erledigt",
    "hyirc0": "Schwedisch",
    "i27qmr": "Friesisch",
    "i6hMN": "Bildbestätigungscode",
    "i88tb": "Ergebnis in Datei exportieren",
    "i8q8tb": "Konfigurieren Sie Workflow für die Eingabe",
    "iNqF1T": "Cloud-Konto verwalten",
    "iOEjZ": "Kein verfügbarer Code",
    "i_lang_": "Sprachpakete",
    "iknTS": "Passwortmanager",
    "init_env": "Laden von Systemressourcen",
    "ip2g1": "Kopiert",
    "ipOSQE": "Pro-Edition",
    "it8ths": "Indonesisch",
    "ixyP0": "Automatische Verarbeitung der Echtzeitaktion",
    "jIe5giARD": "Kehrt die Reihenfolge der Zeichen in einem Text um.",
    "jJuNz": "Ausgangssprache",
    "jO5eP": "OK",
    "jPNCb": "Wiederholt.",
    "jQXdi": "Lichtmodus",
    "jR1zX": "KI-Labor",
    "jb392": "Name",
    "jfpqt": "Notizen-Navigator",
    "jgDoEq": "Keine FAQ-Daten",
    "jhDoE": "FAQ-Daten abrufen",
    "jlxvpk": "Koreanisch",
    "json-beautify.desc.0912": "Dieser Vorgang formatiert JSON-Daten, um die Lesbarkeit zu verbessern, indem korrekte Einrückungen, Zeilenumbrüche und Sortierschlüssel konsistent hinzugefügt werden.",
    "json-beautify.name.0912": "SQL formatieren",
    "json-beautify.text.93kq": "JSON-Daten verschönern",
    "k17PG": "Websocket-Verbindung geschlossen.",
    "k2SVY": "aus",
    "k2ku5p": "Tschechisch",
    "k41a5": "LafTools",
    "k4s5rx": "Slowenisch",
    "kLH79": "Email",
    "kOi5A": "Seite drucken",
    "kPD22": "Wörterbuch",
    "kPJ-A4": "Aktualisierung",
    "kcHxr": "Bitte geben Sie hier den Benutzernamen des Administratorkontos ein",
    "kjks1": "Abrufen der i18n-Konfiguration von der lokalen Server-API",
    "kqv5ht": "Jiddisch",
    "krxSK": "KI-Assistent",
    "ks12d": "Internet-Sicherheit",
    "kv4wag": "Niederländisch",
    "kz7jdyWRq": "Konvertiert durch Kommas getrennte Werte (CSV) in das JavaScript Object Notation (JSON)-Format.",
    "l3akoa": "Amharisch",
    "l6Djb": "Wählen Sie eine der Optionen als Ihr bevorzugtes Thema:",
    "lIn3_": "Admin-Benutzername",
    "lQFII": "Lösen Sie die Initialisierung erneut aus",
    "lRHDQ": "Verlassen Sie den Vollbildmodus",
    "lUh5c": "Generator",
    "lkuulh": "Französisch",
    "lp0qmd0": "Markieren Sie es als Favorit",
    "lpKAz": "Einstellungen",
    "lpzg83": "Samoaner",
    "m0106": "Konverter",
    "m0107": "Generator",
    "m0108": "Formatierer",
    "m7WZw": "System-Websocket defekt",
    "m8rTc1": "Sobald der Shell-Skript-Manager implementiert ist, können Sie ihn zum Verwalten Ihrer Shell-Befehle verwenden.",
    "mBgF1": "Mausaktion",
    "mSFei": "Quellcode auf GitHub",
    "mWXeh": "Arbeitsbereich-ID: {0}",
    "mabHq": "Finden Sie alte Dateien",
    "mbzCv": "Es ist ein Fehler aufgetreten: {0}, Ablehnungszeit ist {1}",
    "md2.desc.1039": "Dieser Vorgang hasht Daten in einen {0}-Hash.",
    "md2.text.192d3": "Generieren Sie {0} Hash",
    "md2aO2NaJITm": "Einrückt und verschönert Cascading Style Sheets (CSS)-Code, sodass er leichter lesbar und verständlich ist.",
    "md4.desc.1039": "Dieser Vorgang hasht Daten in einen {0}-Hash.",
    "md4.text.192d3": "Generieren Sie {0} Hash",
    "md5.desc.rxsHq": "Dieser Vorgang hasht Daten in einen {0}-Hash.",
    "md5.textiDjMIo": "Generieren Sie {0} Hash",
    "md6.desc.1039": "Dieser Vorgang hasht Daten in einen {0}-Hash.",
    "md6.text.192d3": "Generieren Sie {0} Hash",
    "meeMC1Uk7.text.93kq": "{0} minimieren",
    "mihc3": "Dieser Vorgang wurde abgeschlossen",
    "mjHoR": "Auch technisch gesehen kann niemand dieses Token lesen, sonst hätte er/sie Ihren Computer angegriffen und kontrolliert.",
    "mnb19i": "Deutsch",
    "mslw4o": "griechisch",
    "mwn7iv": "Zulu",
    "myxedr": "mongolisch",
    "n1jA9": "Bestätigen",
    "nSeIq8-": "Am wichtigsten ist, dass es kostenlos und Open Source ist. Sie können es für Ihren persönlichen oder kommerziellen Zweck verwenden.",
    "nTvw4": "Um Ihre Daten und Einstellungen zu schützen und separat zu speichern, können Sie dazu Ihr lokales Konto verwenden. Darüber hinaus wird LafTools in Zukunft Instant-Message-Widgets für Benutzer unterstützen.",
    "nmb1wx": "Yoruba",
    "nodBw": "Dieser Vorgang kodiert Rohdaten in eine ASCII-{0}-Zeichenfolge.",
    "nrix6l": "Chichewa",
    "nxJC7": "Die Standardaktion, die ausgeführt werden soll, wenn der Transformator ausgeführt wird.",
    "o52xW": "Export",
    "o8xyzu": "Luxemburgisch",
    "oBz8D": "Wird geladen",
    "oNLxH": "Nutzername",
    "oNg3f": "Offizielle Website",
    "ocxsw3": "irisch",
    "of_ox": "Alles in allem ist LafTools eine Komplettlösung für alle Ihre Bedürfnisse.",
    "oj23X": "Datenbank wiederherstellen",
    "ojCWEFdVe": "Komprimiert JavaScript-Code und entfernt alle unnötigen Zeichen.",
    "ooiFU": "Starten Sie den Java-Dienst neu",
    "oqHqVq": "Sortiere nach",
    "oqHqqV": "Gesamt: {0} Befehle",
    "oqHqqVq": "Zeiten kopieren",
    "oqjbcj": "Laotisch",
    "os8h6u": "dänisch",
    "p8Exxc1s": "Es gibt verschiedene Tools, die KI-Technologien nutzen, um Aufgaben im KI-Labor effizienter auszuführen.",
    "pANmj": "Tags können basierend auf Servertypen, Skriptverwendungen oder anderen von Ihnen bevorzugten Kriterien definiert werden.",
    "pA_deJ": "In die Zwischenablage exportieren",
    "pA_feeJ": "Terminal wieder anschließen",
    "pA_qweJ": "Puffer löschen",
    "pDBSWq": "Für den rechten Bereich ist kein Inhalt verfügbar",
    "pEk1kk": "LafTools stellt Ihnen hier nützliche Funktionalitäten vor.",
    "pEk1qkk": "Listen Sie alle geöffneten Registerkarten auf",
    "pJoOz": "Datei öffnen",
    "pKHRT": "Gehen Sie zu Extras",
    "pKqHRq": "Suchnotizen",
    "pL6qH": "Vollendet.",
    "ph5jH": "Umgang mit diesem Teil",
    "piih4x": "Tadschikisch",
    "pmnp4b": "ukrainisch",
    "ppmz8e": "Haitianisches Kreol",
    "pqs7y3": "Bitte erwägen Sie die Registrierung dieser Webseite als PWA, um vollständige Keymap-Unterstützung zu erhalten.",
    "psA_eJ": "Als Datei exportieren",
    "psZoP": "Legen Sie Dateien hier ab, um sie zu verarbeiten",
    "psqqpq_o": "Okay, das Ergebnis wurde {0} Mal in Ihre Zwischenablage kopiert.",
    "pzn2IpkDo": "Einrückungen und hübsche Drucke von JSON-Code (JavaScript Object Notation).<br><br>Tags: JSON-Viewer, Prettify, Syntaxhervorhebung",
    "q12beqwR": "Keine verfügbaren Tools",
    "q29t31": "Polieren",
    "q9iuti": "Walisisch",
    "qDrbEr": "Der von Ihnen angegebene Benutzername ist leer. Bitte überprüfen Sie ihn und versuchen Sie es erneut.",
    "qF4uS2": "Arbeitsbereich erstellen",
    "qF4uS23": "Neues Fenster",
    "qHoktx": "Danke schön!",
    "qN1LdZ2": "Zuletzt bearbeitet",
    "qQmBr": "Textübersetzung",
    "qTqyvWdY": "Noch nicht fertig",
    "qWemXE4": "1. Januar 2024",
    "qWw3eTH": "Dieser Teil hilft bei der Verwaltung von Dateien auf Ihrer lokalen Festplatte oder Cloud-Festplatte.",
    "qdeFXx": "Derzeit ist die von Ihnen gesuchte Seite noch nicht vollständig implementiert.",
    "qm6Fy9AB2": "Linken Navigator anzeigen",
    "qpDBSW": "Kein Panel verfügbar",
    "qpDBSWe1": "Kein Panel verfügbar",
    "qqK_x_": "Anmelden",
    "qqqwYoz": "Helfen",
    "qqwYoz": "Tabs",
    "qqwYqwe": "Arbeitsbereiche",
    "qtpmvP": "Bestätigen Sie das lokale Passwort",
    "qzshys": "Urdu",
    "r1GLS": "Stichworte",
    "rE6fUsSGl": "Einrückt und verschönert SQL-Code (Structured Query Language).",
    "rK6cx": "{0}, entworfen und entwickelt vom LafTools-Team",
    "rQkas": "Willkommen bei LafTools",
    "rT34qnO": "Geben Sie Text zur Bearbeitung ein. Das Ergebnis wird im Ausgabeeditor angezeigt.",
    "rVdu": "{0} dekodieren",
    "rVqlu": "{0} dekodieren",
    "rYSpwq": "Der MD2-Algorithmus (Message-Digest 2) ist eine kryptografische Hash-Funktion, die 1989 von Ronald Rivest entwickelt wurde. Der Algorithmus ist für 8-Bit-Computer optimiert. Obwohl MD2 auch seit 2014 nicht mehr als sicher gilt, wird es weiterhin in der Öffentlichkeit verwendet Schlüsselinfrastrukturen als Teil von mit MD2 und RSA generierten Zertifikaten. Der Message-Digest-Algorithmus besteht standardmäßig aus 18 Runden.",
    "r_n6h": "Heller oder dunkler Modus",
    "raTAuBwBz": "Konvertiert eine CSV-Datei in das JSON-Format.",
    "remove-whitespace": "Leerzeichen entfernen",
    "reverse.text": "Text umkehren",
    "rf0mql3": "Helles oder dunkles Thema",
    "rub76Z8zx": "Versucht, Sprachen im C-Stil wie C, C++, C#, Java, PHP, JavaScript usw. hübsch zu drucken. Dies wird keine perfekte Arbeit leisten und der resultierende Code funktioniert möglicherweise nicht mehr. Dieser Vorgang dient ausschließlich dazu, verschleierten oder minimierten Code leichter lesbar und verständlich zu machen. Dinge, die nicht richtig funktionieren: Für Schleifenformatierung, Do-While-Schleifenformatierung, Switch/Case-Einrückung, bestimmte Bitverschiebungsoperatoren",
    "run_text": "Bevor wir Ihre Workbench betreten, möchten wir zunächst die erforderlichen Systemressourcen vorladen. Bitte warten Sie eine Weile, der Vorgang wird bald abgeschlossen sein. Einzelheiten dazu finden Sie unten.",
    "rycJy": "LafTools ist eine vielseitige Toolbox, die speziell für Programmierer entwickelt wurde. Es stellt die zweite Version der CodeGen Toolbox dar, jetzt mit einer schlankeren Laufzeit, geschrieben in Golang und JavaScript.",
    "ryhkqb": "bulgarisch",
    "s-fxP80Dd": "LafTools-IDE",
    "s0vrf9": "hebräisch",
    "s4OeX": "Melden Sie sich erfolgreich am System an",
    "sO0MOe": "Jedes Mal, wenn Sie länger als 5 Sekunden in einem Fenster bleiben, wird es hier angezeigt.",
    "sR8yc": "Schließen",
    "sUg3HK9qI": "Erzeugt einen SHA-2-Hash aus einem Text.",
    "sc49my": "Sindhi",
    "sdfk1": "Scrollen Sie durch die Tabs nach links",
    "sdfk13": "Scrollen Sie mit den Tabs nach rechts",
    "sglMS": "Zeit schaffen",
    "sk123": "Noch nicht fertig",
    "slqcWD": "Dieser Logikteil wird noch nicht unterstützt, bitte bleiben Sie dran.",
    "spCqEa": "MACHEN",
    "ssDaOq": "Neu bei LafTools?",
    "ssm80i": "baskisch",
    "svqh06": "Aserbaidschanisch",
    "sys_updates": "Neueste Systemaktualisierungen",
    "t6wczq": "Xhosa",
    "t84q1z": "Armenisch",
    "t8c6xc": "somali",
    "tBIX-d": "Windows",
    "tINhjycwO": "Doppelter Wert",
    "tIy3Q": "Es ist ein Fehler aufgetreten",
    "tIyq3Q": "Es ist ein Fehler aufgetreten",
    "tWe1yF": "Kein Shell-Befehl verfügbar.",
    "tY3p1": "Mehr Informationen",
    "tZINaUR4b": "CSV zu JSON",
    "tail": "Schwanz",
    "tiaiB": "Stornieren",
    "tn7duf": "kroatisch",
    "trywithclassicalwebui": "Versuchen Sie es mit der klassischen Web-Benutzeroberfläche",
    "ttAre": "Geben Sie hier Ihr Klartext-Passwort ein",
    "twamg": "KI-Assistent, der Ihre Kreativität fördert",
    "tyhgpr": "Javanisch",
    "uVseB": "Drücken Sie {0}, um die Hotkey-Liste anzuzeigen",
    "ucDLv": "Sie haben diesen Datensatz {0} Mal kopiert",
    "ui5pZ": "Befehlsparser",
    "ulah0q": "japanisch",
    "unc9E": "Zufälliger Text",
    "usr_defined": "Systemeinstellungen",
    "uwqGE": "Gehen Sie zu Extras",
    "v7q3db": "Thailändisch",
    "vOjNC": "Geben Sie das Passwort oder den sicheren Schlüssel ein",
    "vTsQU": "Bitte geben Sie den Einladungscode von Ihrem Administrator an",
    "vU17B": "Die Anfrage konnte nicht gesendet werden",
    "vWqac": "Bevor wir Ihre Workbench betreten, möchten wir zunächst die erforderlichen Systemressourcen vorladen. Bitte warten Sie eine Weile, der Vorgang wird bald abgeschlossen sein. Einzelheiten dazu finden Sie unten.",
    "vaP0vq": "Richten Sie das lokale Passwort erfolgreich ein.",
    "vh9j4": "Eingang",
    "vo1prl": "Spanisch",
    "vr93oi": "finnisch",
    "w1ANqKoBf": "Text in der Seitenleiste ausblenden",
    "w6otqn": "Korsisch",
    "w9qudj": "Punjabi",
    "wAxtg": "Zunächst haben wir eine UUID als autorisiertes Token generiert, damit Sie diese Einrichtung durchführen können. Nach dem, was LafTools erhalten hat, ist das von Ihnen bereitgestellte Token {0}. Es wurde von LafTools erfolgreich überprüft und Sie können daher mit der Einrichtung dieses Formulars fortfahren.",
    "wI1eh": "Nächste",
    "wQYoz": "Datei",
    "wQdYoz": "Bearbeiten",
    "wQdqwYoz": "Sicht",
    "wcl1K": "Verwendung",
    "wgkk6y": "maltesisch",
    "wj3VS": "Dieser Vorgang dekodiert Daten aus einer ASCII-{0}-Zeichenfolge zurück in ihr Rohformat.",
    "wmuD_KXJ2": "Kehrt die Eingabezeichenfolge um.",
    "workflow.label": "Arbeitsablauf",
    "wsWcXd": "Benachrichtigungen",
    "x009": "Um auf unsere Nutzungsdokumentation zuzugreifen",
    "x5alzu": "Kurdisch (Kurmanji)",
    "x5tHV": "Systemübersicht",
    "xMBv0": "Verwandte Ressourcen werden geladen...",
    "xOJqG1": "Häufig gestellte Fragen",
    "xPHqP": "Die Beschreibung ist noch nicht definiert.",
    "xQ_ls": "Redis sichern",
    "xbz0B": "Alle Fenster schließen",
    "xbz0B2": "Tab schließen",
    "xdqwe": "Willkommen bei LafTools!",
    "xeP4zV": "Sehen Sie sich schnell Ihre TODO-Elemente an",
    "xeP4zVd": "Schlagen Sie schnell einen englischen Wortschatz nach.",
    "xml-bdeautify.desc.2a5f9": "XML-Code minimieren",
    "xml-beautify.desc.2a5f9": "Dieser Vorgang formatiert XML-Daten, um die Lesbarkeit zu verbessern, indem geeignete Einzüge und Zeilenumbrüche hinzugefügt und eine wohlgeformte Struktur sichergestellt werden.",
    "xs22XLF": "Für diese Artikel-ID sind keine Daten verfügbar. Bitte wählen Sie andere Artikel aus.",
    "y3qjdd": "Ihr lokales Passwort wurde erfolgreich überprüft.",
    "y46w7Q9TH": "Schwanz",
    "y8Ir5": "Dieser Teil wird zum Initialisieren Ihres Administratorkontos verwendet. Im Moment muss hier jedoch nichts erstellt oder angepasst werden, da es zuvor von Ihrem Administrator eingerichtet wurde. Bitte vernachlässigen Sie diesen Teil und fahren Sie mit den verbleibenden Schritten fort.",
    "yMZW-GEgf": "XML formatieren",
    "ySVf-": "Versuchen Sie es noch einmal mit dieser Anfrage",
    "yTsqFO": "Der MD4-Algorithmus (Message-Digest 4) ist eine kryptografische Hash-Funktion, die 1990 von Ronald Rivest entwickelt wurde. Die Digest-Länge beträgt 128 Bit. Der Algorithmus hat spätere Designs beeinflusst, beispielsweise die Algorithmen MD5, SHA-1 und RIPEMD. Die Sicherheit von MD4 wurde stark beeinträchtigt.",
    "yVprb": "Dieser Teil befindet sich noch in der Entwicklung.",
    "y_2Q1": "Kodieren und dekodieren",
    "y_2Q2": "Symmetrische Krypto",
    "y_2Q3": "Asymmetrische Krypto",
    "y_2Q4": "Nationale Algorithmen Chinas",
    "y_2Q5": "Web-Auth",
    "y_2Q5dqw": "Text-Matcher",
    "y_9YM": "Die Ausgabe wird hier angezeigt.",
    "y_9YqM": "Statische Ressourcen werden geladen...",
    "y_BN6": "Digest-Algorithmus",
    "ya0cwu": "malaiisch",
    "yc7dqiu": "Vereinfachtes Chinesisch",
    "yfYeg": "Textvorlage",
    "yiRso": "Cloud-Notizen",
    "yqiRso": "Lokale Notizen",
    "yqrxl4": "serbisch",
    "yznU9": "Leere Baumdaten",
    "z-o28we": "Prozesspanel",
    "z0j2nf": "Hindi",
    "z1oFn": "Flucht und Unflucht",
    "z2jzej": "Marathi",
    "z79b1a": "Arabisch",
    "zN2ES": "Arbeitsbereiche",
    "zc3Hf": "Passwort",
    "zjDJk": "Bitte geben Sie den Pfad zum Arbeitsbereichsverzeichnis an",
    "zkqUFa": "{0} ist noch nicht konfiguriert",
    "zkv375": "Khmer",
    "zmDWx": "Kontaktiere uns",
    "znVRwq": "Dateien",
    "zpyd34": "Englisch",
    "zqiIoqXw": "Berechnungen ausführen...",
    "zzcepr": "Cebuano"
}