{
    "": "Message : {0}",
    "-8l11": "Copié",
    "-DqwwR": "Opération terminée.",
    "-GJ_72": "Basculé vers l'espace de travail sélectionné {0}",
    "-Jx4J": "Compte local",
    "-Rj3y": "Thèmes",
    "-XZnW": "Dos",
    "-Yo129I": "Outils de texte",
    "-nL_B5PoN": "Compresse {0}",
    "01do0y": "Kannada",
    "04SSf": "Mot de passe oublié?",
    "07naT": "Erreur : {0}",
    "07ui6": "Plus d'informations",
    "0Ceqru": "Base64 est une notation permettant de coder des données d'octets arbitraires à l'aide d'un ensemble restreint de symboles qui peuvent être facilement utilisés par les humains et traités par des ordinateurs.",
    "0MO3jj": "MD5 (Message-Digest 5) est une fonction de hachage largement utilisée. Il a été utilisé dans diverses applications de sécurité et est également couramment utilisé pour vérifier l'intégrité des fichiers. Cependant, MD5 n'est pas résistant aux collisions et ne convient pas aux applications telles que les certificats SSL/TLS ou les signatures numériques qui reposent sur cette propriété.",
    "0PgZ_": "Traduction",
    "0YKce": "Convertit une chaîne décimale codée binaire (BCD) en nombre décimal.",
    "0gvcN": "Bienvenue sur la page de présentation, elle est encore en développement.",
    "0gywa": "Espace de travail introuvable, vous serez redirigé vers la page d'index de l'espace de travail.",
    "0pfdz7": "Ouzbek",
    "123e4567": "Qu’est-ce que Base64 ?",
    "13pmE": "Soutenez-nous",
    "1507oa": "bengali",
    "1JOFP": "Ouvrir mon espace de travail",
    "1NTgQ": "Espace de travail ouvert",
    "1Npez": "Veuillez fournir le chemin",
    "1Tuab": "Copié",
    "1X8x7": "Exemple",
    "1Xe82x7": "{0} Réduire",
    "1Xe8wx7": "Chaîne hexagonale",
    "1Xe8x7": "{0} Embellir",
    "1Xe8x7qe": "BCD",
    "1YmJc": "Sélectionnez l'une des options comme langue préférée :",
    "1a2b3c4d": "Pourquoi utiliser Base64 ?",
    "1a3Sc": "Annuler le chargement",
    "1bd": "Flux de travail",
    "1e3e5n": "Haoussa",
    "1h6jH": "Attention, la sortie est une valeur vide dont la longueur est nulle !",
    "1j62a": "Fais ça à un autre moment",
    "1jj0ri": "Japonais",
    "1k_44": "Cette opération décode les données d'une chaîne ASCII Base64 dans son format brut.",
    "1th2nw": "Cinghalais",
    "1yIQu": "Vous pouvez essayer de retraiter votre action ou cliquer sur le bouton ci-dessous pour ignorer l'erreur.",
    "20nmcv": "Latin",
    "22XLF": "Pas encore fini",
    "23fgh456": "Histoire de Base64",
    "24vLI": "Créé",
    "27j7sy": "Shona",
    "2D9a6": "Mot de passe oublié?",
    "2D9qdk6": "Est-ce suffisamment sécurisé ?",
    "2IF6A": "Il semble que le stockage de sauvegarde de Forge rencontre un problème",
    "2JyFN": "Copier le résultat dans le presse-papiers",
    "2Ocbey": "Version",
    "2RhAT": "Il semble que le processus de récupération de forge rencontre un problème",
    "2Ruh6": "Créer un nouveau compte local",
    "2S5ap": "Basculer en mode plein écran",
    "2Y1mR": "Effacer le texte",
    "2bcde3fg": "Inconvénients de Base64",
    "2bqHk": "Charger à partir d'un fichier",
    "2e4fb7": "Igbo",
    "2giYv": "Tester le mot de passe : {0}",
    "2khdsv": "pachtou",
    "2lehqwp": "vietnamien",
    "2lhcqwp": "turc",
    "2lhqqwp": "indonésien",
    "2lhqqwqp": "malais",
    "2lhqwwp": "thaïlandais",
    "2qdin8": "entrez le code de vérification S'il vous plait",
    "2tib5m": "suédois",
    "2ybu7j": "norvégien",
    "30eo2v": "gujarati",
    "32D9a6": "Créer un compte",
    "33RXi": "La demande a été rejetée en raison de paramètres insatisfaisants.",
    "346qid": "russe",
    "34wxyz56": "Comment encoder/décoder Base64 en JavaScript ?",
    "39dsCt": "Vous recevrez la dernière notification des services d'application si vous en avez.",
    "3ii2tt": "Gaélique écossais",
    "3umnB": "Jeton inconnu",
    "441oja": "géorgien",
    "44Ntqw-": "Gestion de l'opération.",
    "46bksi": "lituanien",
    "4K_vhq": "Dupliquer cet onglet",
    "4PIqD": "Révision du code",
    "4UYIJ": "Pas encore terminé.",
    "4cGA_": "Récupération des données pour les préférences système...",
    "4hijk5lm": "Augmentation de la taille : les données codées sont environ 33 % plus grandes que les données binaires d'origine.",
    "4kKe4": "Votre mot de passe",
    "4tqb4x": "hongrois",
    "4vdfwf": "D'ACCORD",
    "4wlih": "La demande a été rejetée en raison de paramètres insatisfaisants.",
    "52OiQ": "Copié {0} fois",
    "54cwb": "L'API Websocket du système a rencontré une erreur : {0}",
    "56ibcj": "vietnamien",
    "58HQX": "Si vous ne connaissez pas sa valeur, veuillez contacter votre administrateur pour plus de détails, qui se trouvent dans ses paramètres.",
    "5BOhl": "code d'invitation",
    "5Ih2u": "Navigateur d'outils",
    "5NCPT": "Mode sombre",
    "5NJeGsu1": "E-Mail, vous pouvez facilement organiser votre boîte de réception, rédiger et envoyer des messages et rester au courant de votre correspondance. Jusqu'à présent, il est utilisé uniquement comme outil de communication entre les utilisateurs et notre équipe.",
    "5NJeddqGsu1": "Cette section comprend du matériel informatique, des articles wiki, des guides d'utilisation, etc.",
    "5NJedqddqGsu1": "Cette section comprend des ressources informatiques qui peuvent être utilisées pour construire vos propres projets.",
    "5Perd": "Désolé, la fonction « Utiliser Smart Editor » n'est pas encore disponible. Nous travaillons toujours à sa mise en œuvre. Merci pour votre patience.",
    "5ZBYR": "Dos",
    "5dF7o": "Rafraîchir",
    "5e6f7g8h": "Base64 est utilisé lorsque les données binaires doivent être transmises via des protocoles basés sur du texte comme le courrier électronique ou JSON, ou intégrées à des endroits où seul le texte est autorisé.",
    "5eXVS": "Contenu du script",
    "5ggegx": "coréen",
    "5lW8qp": "Montrer un exemple pour cet outil",
    "5q-Zxqa": "Gestionnaire de scripts",
    "5qPOJL": "Pour prendre en charge LafTools, pensez soit à donner une étoile à notre référentiel sur GitHub, soit à passer à notre version professionnelle via un abonnement mensuel. Nous apprécierions grandement votre aide et nous promettons que LafTools deviendra encore meilleur grâce aux fonds collectés.",
    "5qV5Sf": "Supprimer cet enregistrement de la liste",
    "5rg5mt": "malgache",
    "5srFq": "LafOutils",
    "5v8jl7": "Hmong",
    "6AumW": "Action par défaut",
    "6ClPV": "Créer",
    "6MrfIfGc6": "Code Réduire",
    "6UICxHzVR.name": "Embellir {0}",
    "6cOPZ": "Le nombre décimal codé binaire (BCD) est une classe de codages binaires de nombres décimaux dans lesquels chaque chiffre décimal est représenté par un nombre fixe de bits, généralement quatre ou huit. Des modèles de bits spéciaux sont parfois utilisés pour un signe",
    "6hsnqWe": "Bien que LafTools soit gratuit et open source, sa maintenance nécessite néanmoins beaucoup de temps et d'énergie. Nous avons notamment besoin de fonds pour payer certaines API cloud. Si vous appréciez LafTools, pensez à nous soutenir.",
    "6j13s3": "islandais",
    "6nopqrst": "Pas de cryptage : Base64 n'est pas une méthode de cryptage ; il est facilement décodé et n’offre aucune sécurité.",
    "6qT9d-N": "Pour le notebook, LafTools fournit non seulement un gestionnaire de commandes shell, mais y ajoutera également de puissants outils de notes dans un avenir proche, tels que MarkDown, Latex, {0}, etc.",
    "6ulj8i": "Népalais",
    "6wdtJ4vmg.name.0912": "Réduire {0}",
    "6yOXx": "Nom inconnu",
    "71x7x": "Code source sur GitHub",
    "78abcdef": "JavaScript propose des fonctions intégrées telles que btoa() et atob() pour l'encodage et le décodage Base64 respectivement.",
    "78ijk9lm": "Base64 a été défini pour la première fois dans la RFC 1421 (1993), puis normalisé dans la RFC 4648 (2006).",
    "7MOO1": "Se connecter",
    "7dm0d8": "Chinois traditionnel",
    "7g5w22": "norvégien",
    "7k56u3": "Galicien",
    "7q40W": "Impossible d'initialiser l'administrateur",
    "7u4vzu": "slovaque",
    "7x3f6": "Onglet - 1",
    "82r0C": "Gérez votre liste TODO et faites les choses plus efficacement.",
    "83dNp": "Impossible de charger l'ID d'extension. (RÉF : 1dl1f)",
    "8LdRj": "Aperçu",
    "8LdRjq": "Calculer",
    "8LdevRj": "Service",
    "8M1wY": "Terminal local",
    "8OqB7hN1s": "Cette page fournit un style d'interface utilisateur IDE pour LafTools, un niveau d'abstraction plus élevé pour LafTools.",
    "8eeL1Kk": "À propos",
    "8mn_qa": "Récupération des données des services terminaux...",
    "8qzWJu": "Désolé, nous ne prenons pas encore en charge les appareils à petit écran pour le moment. Veuillez utiliser un PC pour visiter cette page.",
    "97um9v": "hawaïen",
    "98KcL": "Convertit un nombre décimal en nombre décimal codé binaire (BCD).",
    "9Xv8-": "Enregistrer sous note",
    "9_qaj": "Quitter ce formulaire",
    "9e4fcl": "Tamil",
    "9eZHM": "Oops! Il semble que nous rencontrions des avertissements ou des erreurs.",
    "9gqo8x": "letton",
    "9i0j1k2l": "Il est également utilisé pour intégrer de petites images directement dans HTML ou CSS en tant qu'URL de données.",
    "9m85mf": "Sésotho",
    "9qy1xn": "Portugais",
    "9tbbkt": "finlandais",
    "9zCSc": "Aucun espace de travail disponible",
    "A69UZ": "Variables",
    "AVUvu": "Base62 est une notation permettant de coder des données d'octets arbitraires à l'aide d'un ensemble restreint de symboles qui peuvent être facilement utilisés par les humains et traités par des ordinateurs. La base numérique élevée donne des chaînes plus courtes qu'avec le système décimal ou hexadécimal.",
    "AW9N8": "Région d'entrée",
    "AfPC0": "Votre mot de passe en texte brut",
    "Ahrjc": "Le répertoire n'existe pas, souhaitez-vous le créer ?",
    "AkXgF": "En cours : {0} %",
    "Apx8D": "Comment réinitialiser votre mot de passe manuellement ?",
    "B-GCloBBt": "Compresse le code XML (eXtensible Markup Language).",
    "B0s0z": "Objectif de cette page :",
    "BCySSDEKL": "Il se peut qu'il y ait un problème de compatibilité avec la version actuelle de votre logiciel.",
    "BGd7P9": "Cette opération code les données brutes dans une chaîne ASCII Base64.",
    "BGd7dP9": "Cette opération code les données brutes dans une chaîne ASCII {0}.",
    "BGdd7dP9": "Cette opération code les données brutes dans une chaîne ASCII {0}.",
    "BLAKE2-021": "BLAKE2 est une autre alternative moderne qui offre des vitesses plus rapides que SHA-2 tout en maintenant des niveaux de sécurité élevés. Il propose plusieurs variantes, dont BLAKE2b et BLAKE2s.",
    "BLAKE2_Info-023": "Informations BLAKE2",
    "BShq3M": "Problèmes",
    "BW3bpT": "Lecture du fichier à partir du disque...",
    "Bd9h-": "Ajoutez-le à ma collection préférée",
    "BuihG": "Les paramètres du système",
    "C3L9MmdDU7": "Manuel",
    "CASef": "C'est bon, l'opération est déclenchée.",
    "CEv8B": "Êtes-vous sûr de supprimer cet enregistrement ? Si oui, cliquez à nouveau sur ce bouton.",
    "CFg8B": "La taille doit être comprise entre 0 et 512",
    "CP-Advantage-Career-014": "Apprendre à programmer ouvre des opportunités de carrière dans divers secteurs et vous permet de développer des solutions innovantes, d'automatiser des tâches et de comprendre des systèmes complexes.",
    "CP-Advantages-013": "Quels sont les avantages d’apprendre la programmation informatique ?",
    "CP-Basics-001": "Qu'est-ce que la programmation informatique ?",
    "CP-Def-002": "La programmation informatique consiste à écrire des instructions, ou du code, dans un langage de programmation pour indiquer aux ordinateurs comment effectuer des tâches spécifiques.",
    "CP-History-004": "Quelle est l’histoire de la programmation informatique ?",
    "CP-History-Origin-005": "Les premières machines programmables remontent aux travaux d'Ada Lovelace sur le moteur analytique de Charles Babbage au XIXe siècle. Cependant, la programmation moderne a décollé avec l’invention du premier ordinateur électronique à usage général, ENIAC, dans les années 1940.",
    "CP-Lang-Choice-009": "Le choix de la langue dépend de facteurs tels que les exigences du projet, le soutien de la communauté, la facilité d'apprentissage et les besoins de performance.",
    "CP-Language-Evolution-006": "Depuis lors, les langages de programmation ont évolué du code machine à l'assembleur, puis vers des langages de haut niveau comme FORTRAN, COBOL, C, et maintenant vers des langages modernes tels que Python, JavaScript et Rust.",
    "CP-Languages-007": "Quels sont les langages de programmation populaires ?",
    "CP-Languages-List-008": "Les langages de programmation populaires incluent Java, Python, JavaScript, C++, C#, Swift, Go, PHP, Ruby et Kotlin. Chacun a ses propres atouts et cas d'utilisation, par exemple Python pour la science des données, JavaScript pour le développement Web et C++ pour la programmation système.",
    "CP-Process-010": "Quel est le processus de programmation informatique ?",
    "CP-Process-Explanation-011": "La programmation implique généralement la planification (définition du problème et conception de la solution), le codage (écriture du code source dans un langage choisi), les tests (débogage et vérification des fonctionnalités) et la maintenance (mise à jour et amélioration du programme au fil du temps).",
    "CP-Purpose-003": "Les programmeurs créent des algorithmes, résolvent des problèmes et créent des applications logicielles capables d'automatiser les processus, de manipuler des données et d'interagir avec les utilisateurs ou d'autres systèmes.",
    "CP-SDLC-012": "Ceci est souvent structuré dans un cycle de vie de développement logiciel (SDLC) qui comprend des phases supplémentaires telles que l'analyse des exigences, la conception, le déploiement et les tests d'acceptation des utilisateurs.",
    "CP-Skillset-015": "Il améliore également la pensée logique, les compétences en résolution de problèmes et l'adaptabilité aux nouvelles technologies, ce qui rend l'individu plus polyvalent à l'ère numérique.",
    "CSS-Advantages-010": "Quels sont les avantages de l’utilisation du CSS ?",
    "CSS-Advantages-Customization-012": "Un autre avantage est sa capacité à personnaliser l'apparence de plusieurs pages à la fois, ce qui permet d'économiser du temps et des efforts lors de la mise à jour des styles à l'échelle du site.",
    "CSS-Advantages-Separation-011": "L'un des avantages est la séparation des préoccupations entre le contenu et la présentation, ce qui améliore la maintenabilité et l'évolutivité des sites Web.",
    "CSS-Animations-Transitions-019": "Les animations et transitions CSS permettent des effets visuels fluides sans nécessiter JavaScript.",
    "CSS-Def-002": "CSS (Cascading Style Sheets) est un langage de feuille de style utilisé pour décrire la présentation d'un document écrit en HTML ou XML.",
    "CSS-Disadvantages-013": "Quels sont les inconvénients du CSS ?",
    "CSS-Disadvantages-Browser-Compat-015": "Un autre problème est la compatibilité entre navigateurs, car différents navigateurs peuvent interpréter différemment les règles CSS. Cela oblige les développeurs à utiliser des préfixes de fournisseur ou des techniques de détection de fonctionnalités pour un rendu cohérent sur tous les navigateurs.",
    "CSS-Disadvantages-Cascade-014": "L’un des défis consiste à gérer la nature en cascade des styles, qui peut parfois entraîner des problèmes inattendus d’héritage et de spécificité.",
    "CSS-Evolution-006": "Depuis lors, il a évolué via CSS2 (1998), CSS2.1 (2007), CSS3 (développement en cours), introduisant des fonctionnalités telles que des sélecteurs, des animations, un design réactif, etc.",
    "CSS-Future-020": "Quel est l’avenir de la technologie CSS ?",
    "CSS-Future-Houdini-022": "Houdini, par exemple, vise à fournir des API de bas niveau pour personnaliser le processus de rendu du navigateur, offrant ainsi aux développeurs un contrôle sans précédent sur le style et la mise en page.",
    "CSS-Future-Progress-021": "Le groupe de travail CSS continue de travailler sur de nouveaux modules tels que les variables CSS (propriétés personnalisées), Houdini et les requêtes de conteneur.",
    "CSS-Hist-Origin-005": "CSS a été proposé pour la première fois par Håkon Wium Lie en octobre 1994 et est devenu une recommandation officielle du W3C en décembre 1996 avec CSS1.",
    "CSS-History-004": "Quelle est l’histoire du CSS ?",
    "CSS-History-W3C": "Chronologie des recommandations CSS du W3C",
    "CSS-Key-Features-016": "Quelles sont les fonctionnalités clés de CSS ?",
    "CSS-Layouts-018": "Les systèmes de mise en page Flexbox et Grid fournissent des outils puissants pour créer des mises en page réactives et flexibles.",
    "CSS-MDN-Animations": "Guide MDN des animations CSS",
    "CSS-MDN-Flexbox": "Guide MDN de Flexbox",
    "CSS-MDN-Grid": "Guide MDN de la grille CSS",
    "CSS-MDN-Houdini": "MDN Introduction à Houdini",
    "CSS-Purpose-003": "Il permet aux développeurs de séparer le contenu de la présentation, en définissant des styles tels que la mise en page, les couleurs et les polices, rendant les pages Web visuellement attrayantes et cohérentes sur différents appareils et écrans.",
    "CSS-Selectors-017": "Les sélecteurs permettent de cibler des éléments HTML spécifiques en fonction de leur type, classe, ID, attributs, etc.",
    "CSS-Tech-History-001": "Qu’est-ce que CSS ?",
    "CSS-Usage-007": "Comment utiliser CSS dans mes projets web ?",
    "CSS-Usage-Basics-008": "Pour utiliser CSS, vous créez un fichier séparé (par exemple, style.css) contenant vos styles, puis vous le liez à votre fichier HTML à l'aide de l'élément <link> dans la section <head>.",
    "CSS-Usage-Inline-009": "Alternativement, vous pouvez inclure des styles en ligne directement dans les éléments HTML à l'aide de l'attribut « style » ou intégrer du CSS dans la balise <style> à l'intérieur de la section <head>.",
    "CSS-Vendor-Prefixes": "Guide MDN sur les préfixes des fournisseurs",
    "CSS-W3C-Selectors": "Spécifications des sélecteurs W3C niveau 4",
    "CSS-WG-Future-Modules": "Travaux actuels du W3C CSS",
    "CSSNano": "cssnano - GitHub",
    "CVUl0": "LafOutils",
    "CWoqhy": "Liste des éléments par CategoryID sélectionné",
    "CfZAX": "Le fichier {0} sélectionné, nous le téléchargeons sur le service principal.",
    "CidOqAZ": "En tant que créateur de LafTools, je suis tellement touché que vous souhaitiez nous soutenir. Nous avons de bonnes personnes dans notre équipe qui travaillent dur pour améliorer continuellement LafTools.",
    "Cide2w": "Pour voir s'il y a un problème lors de l'exécution de votre action.",
    "DIQFq": "Veuillez vérifier si le paramètre URL a été correctement fourni, il semble que vous n'ayez pas l'autorisation de remplir ce formulaire. Par défaut, vous pourrez voir le message ci-dessous dans la sortie du service lors de son lancement.",
    "DIweGq": "Sécurisez vos LafTools",
    "DSEtLTxUU": "Le temps est la monnaie de votre vie, dépensez-le judicieusement.",
    "DTTPW": "Statut de réinitialisation",
    "DVoKw": "Déconnectez-vous de ce système",
    "DadYp": "Anti-rebond en temps réel",
    "Diff-XML-JSON-Article": "Différence entre XML et JSON",
    "DqFI5": "Les niveaux doivent être supérieurs à 0",
    "DrXAq": "Bienvenue à utiliser LafTools !",
    "DrbEr": "Le mot de passe que vous avez fourni est vide, veuillez vérifier et réessayer.",
    "DtlAc": "Chargement des ressources système",
    "Dxlw0": "Complet",
    "E62ej": "Commandes du shell de filtre",
    "E6F9B": "Ajoutez-le au flux de travail",
    "EEQkeW": "L'algorithme MD6 (Message-Digest 6) est une fonction de hachage cryptographique. Il utilise une structure arborescente Merkle pour permettre un immense calcul parallèle de hachages pour des entrées très longues.",
    "EO6Qv5dCA": "Réduit le code JSON, réduisez la taille du bundle de votre code JSON.",
    "ERK7E": "Si vous rencontrez un problème ou avez des suggestions lors de l'utilisation de LafTools, n'hésitez pas à nous contacter via EMail ou GitHub à tout moment, nous sommes prêts à l'améliorer de toute urgence.",
    "EgBXL": "Sélectionnez ou fournissez des balises.",
    "Ewvgo": "Pas encore commencé.",
    "ExqvX": "Liste des touches de raccourci",
    "Eyq856": "Nous n'avons pas encore terminé : nous nous engageons à fournir les fonctionnalités les plus récentes et les plus performantes, et nous continuerons à publier des mises à jour pour garantir que vous bénéficiez de la meilleure expérience possible.",
    "F-OUm": "Configuration rapide pour LafTools",
    "F0CCF": "Liste des raccourcis clavier",
    "F4uS2": "Nouveau fichier",
    "FBVyc": "Veuillez saisir à nouveau le code de vérification",
    "FDlRI": "Nommez ce nouvel onglet et cliquez pour le confirmer.",
    "FLsbFsOZq": "EDI",
    "FOyHW": "Rechercher partout",
    "FQzhg": "Ignorer l'entrée vide",
    "FYRoL": "Indente et embellit le code des feuilles de style en cascade (CSS).",
    "FhVWl": "Chiffrez votre mot de passe",
    "FjYbR": "Sortir",
    "Fv-zz": "Copier le résultat",
    "Fy217": "Configurer cet outil",
    "Fzp3t": "Veuillez fournir une valeur dans ce champ",
    "G3MJN": "Afficher le panneau de sortie",
    "G9QVo": "Gérer les onglets",
    "GR7jK": "Taper",
    "Ggob_": "Annuler",
    "H-Ae75": "Veuillez confirmer votre mot de passe local.",
    "H-qA75": "Veuillez fournir un mot de passe local.",
    "H8fQ4": "Basculer en mode clair ou sombre",
    "HEAhr": "Après la traduction, le résultat apparaîtra ici.",
    "HIc3c": "Complété",
    "HNDat": "Pour apporter des modifications, veuillez cliquer sur le bouton \"{0}\". Sinon, cliquez sur \"{1}\" pour appliquer vos modifications. Puissiez-vous passer un bon moment avec cette boîte à outils !",
    "HTMLMinifier": "HTMLMinifier-GitHub",
    "Hflf2": "Pour des raisons de cybersécurité, nous ne vous aiderons pas à réinitialiser votre mot de passe via les API ou les pages ici, sauf si vous mettez à jour manuellement le fichier protégé par le système.",
    "HistOfProg-Wikipedia": "Histoire des langages de programmation — Wikipédia",
    "HjvV3": "Nous ne supprimerons pas ses fichiers sur le disque, supprimerons simplement cet enregistrement de la liste.",
    "HyIC_": "Touche barre oblique (/)",
    "HyIC_d": "Touche barre oblique (/)",
    "I8FLi": "Maintenant, il est temps de configurer votre administrateur, veuillez définir le mot de passe aussi complexe que possible afin de pouvoir perplexe ces attaquants impolis.",
    "IAC0A": "Outils de recherche",
    "ICefi": "Annulé",
    "IKqqATS": "Actualiser les données de la page actuelle",
    "IOOrz": "(Cela serait-il nocif pour votre système ? Nous ne le pensons pas, tant que vous pouvez modifier le fichier de configuration préservé par le système, cela signifie que vous êtes autorisé à tout lire sur les fichiers de données LafTools.)",
    "IWUH5": "Afficher l'exemple",
    "IaSyO": "Annuler",
    "IfsGO": "Favoris",
    "IfsdGO": "Favoris",
    "ImUmf": "Nouveau",
    "IxAJswoSh": "Analyse et imprime joliment le code JavaScript valide. Fonctionne également avec JavaScript Object Notation (JSON).",
    "J-3KA": "Veuillez fournir un nom pour ce script, ce qui serait plus utile.",
    "J164i": "par exemple. Copier les fichiers sur le serveur distant",
    "J2xoL": "Veuillez consulter l'erreur : {0}",
    "JA_Bp": "Veuillez d'abord fournir un nom pour la nouvelle balise.",
    "JQEVK": "Code",
    "JQLmS": "Ajusté la taille",
    "JQLmSq": "Complété.",
    "JS-Basics-001": "Qu'est-ce que JavaScript ?",
    "JS-DOM-API-007": "Comment JavaScript interagit-il avec le DOM ?",
    "JS-DOM-API-Explanation-008": "JavaScript fournit une API DOM (Document Object Model) pour manipuler HTML et CSS, permettant aux développeurs de modifier dynamiquement le contenu, le style et les écouteurs d'événements.",
    "JS-DOM-Example-009": "Par exemple, vous pouvez sélectionner un élément et modifier son contenu textuel : `document.getElementById('myElement').textContent = 'New Text';`",
    "JS-Data-Types-010": "Quels sont les types de données en JavaScript ?",
    "JS-Data-Types-List-011": "JavaScript prend en charge divers types de données, y compris les types primitifs tels que les chaînes, les nombres, les booléens, les valeurs nulles, non définies et les symboles, ainsi que les types complexes tels que les objets et les tableaux.",
    "JS-Def-002": "JavaScript (JS) est un langage de programmation interprété de haut niveau largement utilisé pour créer des applications Web, améliorer les interfaces utilisateur et créer une logique côté serveur avec Node.js.",
    "JS-Event-Loop-013": "Qu'est-ce que la boucle d'événements en JavaScript ?",
    "JS-Event-Loop-Explanation-014": "La boucle d'événements est un élément essentiel du modèle de concurrence de JavaScript, qui permet une exécution asynchrone via des rappels, des promesses et une synchronisation/attente.",
    "JS-Event-Loop-Process-015": "Il exécute d'abord le script principal, puis exécute toutes les fonctions de rappel lorsque leurs événements associés (comme les entrées de l'utilisateur ou les réponses du réseau) se produisent, en les gérant via un système de file d'attente.",
    "JS-Function-Syntax-006": "Les fonctions sont définies à l'aide du mot-clé `function` suivi du nom de la fonction et des paramètres entre parenthèses. Le corps de la fonction est entouré d'accolades : `function greet(name) { console.log(`Hello, ${name}!`); }`",
    "JS-Purpose-003": "Il a été initialement développé par Brendan Eich chez Netscape en 1995 et est depuis devenu l'un des langages les plus populaires, pris en charge par tous les principaux navigateurs Web et plates-formes comme Electron et React Native.",
    "JS-Syntax-004": "Quelle est la syntaxe de base de JavaScript ?",
    "JS-Type-Checking-012": "La vérification de type peut être effectuée à l'aide de constructeurs (`typeof value === 'string'`) ou de l'opérateur `instanceof` pour les objets héritant des constructeurs intégrés (par exemple, `value instanceof Array`).",
    "JSON-Advantages-011": "JSON est généralement plus petit et plus rapide à analyser que XML, ce qui le rend idéal pour les communications client-serveur où la bande passante et la vitesse sont cruciales.",
    "JSON-Basics-001": "Qu’est-ce que JSON ?",
    "JSON-Beautify-007": "Qu’est-ce que l’embellissement JSON ?",
    "JSON-Beautify-Def-008": "L'embellissement JSON fait référence au processus de formatage des données JSON sous une forme plus lisible par l'homme avec une indentation et des sauts de ligne appropriés, ce qui facilite l'analyse et le débogage.",
    "JSON-Beautify-Example-009": "Avant : '{\\\"key\\\":\\\"value\\\",\\\"array\\\":[1,2,3]}', Après : '{\\n \\\"key\\\": \\\"value\\\", \\n \\\"tableau\\\": [\\n 1,\\n 2,\\n 3\\n ]\\n}'",
    "JSON-Def-002": "JSON (JavaScript Object Notation) est un format d'échange de données léger, basé sur du texte, facile à lire et à écrire pour les humains, et facile à analyser et à générer pour les machines.",
    "JSON-JavaScript-Support-020": "JSON est nativement pris en charge par JavaScript via les objets globaux `JSON.parse()` et `JSON.stringify()`. Tout JSON valide est également un objet littéral ou un tableau JavaScript valide, ce qui permet une conversion transparente entre les deux formats.",
    "JSON-JavaScript-Usage-021": "Dans le développement Web, JSON est couramment utilisé pour les requêtes AJAX, le rendu côté serveur et le stockage de données (par exemple, stockage local ou IndexedDB).",
    "JSON-Linting-022": "Qu'est-ce que le linting JSON et pourquoi est-il important ?",
    "JSON-Linting-Benefit-024": "Linters peut éviter les erreurs d'exécution dues à un JSON non valide, garantissant un échange de données fluide et permettant de gagner du temps lors du débogage des problèmes potentiels.",
    "JSON-Linting-Explanation-023": "Le linting JSON est le processus permettant de vérifier si un document JSON adhère à la spécification JSON. Cela permet d'identifier les erreurs de syntaxe avant de tenter d'analyser les données.",
    "JSON-Path-013": "Qu’est-ce que le chemin JSON ?",
    "JSON-Path-Example-015": "$.store.book[0].title sélectionne le titre du premier livre dans un objet JSON avec un magasin contenant un tableau de livres.",
    "JSON-Path-Explanation-014": "JSON Path est un langage de requête similaire à XPath pour XML, vous permettant d'extraire des données de documents JSON à l'aide d'une notation de type chemin.",
    "JSON-Path-Guide": "JSONPath - XPath pour JSON",
    "JSON-Purpose-003": "Il est principalement utilisé pour transmettre des données entre un serveur et une application Web comme alternative au XML, avec un support natif en JavaScript via les méthodes `JSON.parse()` et `JSON.stringify()`.",
    "JSON-Scope-in-JavaScript-019": "Comment JSON s’intègre-t-il dans JavaScript ?",
    "JSON-Security-025": "Quels sont les problèmes de sécurité lorsque vous travaillez avec JSON ?",
    "JSON-Security-Impact-026": "Les risques de sécurité potentiels incluent les attaques par injection JSON, où des données malveillantes sont envoyées et pourraient provoquer un comportement involontaire lors de leur analyse/exécution.",
    "JSON-Security-Prevention-027": "Pour atténuer ces risques, nettoyez toujours les entrées de l'utilisateur et utilisez des bibliothèques qui analysent JSON en toute sécurité sans exécuter son contenu (comme le JSON.parse() intégré à JavaScript). Évitez également d'utiliser eval() pour analyser JSON.",
    "JSON-Serialization-016": "Qu'est-ce que la sérialisation et la désérialisation JSON ?",
    "JSON-Serialization-Def-017": "La sérialisation JSON est le processus de conversion d'un objet JavaScript en une chaîne JSON, tandis que la désérialisation est l'inverse : transformer une chaîne JSON en un objet JavaScript.",
    "JSON-Serialization-W3Schools": "Sérialisation JSON sur W3Schools",
    "JSON-Syntax-004": "Quelle est la syntaxe de base de JSON ?",
    "JSON-Syntax-Example-f005": "Un objet JSON se compose de paires clé-valeur entourées d'accolades {0}. Chaque clé doit être une chaîne entourée de guillemets doubles, suivie de deux points, puis de sa valeur.",
    "JSON-Syntax-Reference": "Documents Web MDN sur JSON",
    "JSON-Value-Types-006": "Les valeurs peuvent être des chaînes, des nombres, des booléens, des tableaux (entre crochets []), d'autres objets ou null.",
    "JSON-vs-XML-010": "Comment JSON se compare-t-il à XML ?",
    "JSON-vs-XML-Article": "Comparaison de JSON et XML",
    "JTBRh": "LafTools a stocké la valeur du mot de passe dans le fichier local, mais ne vous inquiétez pas, nous avons adopté un mécanisme de cryptage du mot de passe unidirectionnel, c'est-à-dire que personne ne peut lire le mot de passe de la version en texte brut. Pour réinitialiser le mot de passe, veuillez suivre les instruments ci-dessous pour réinitialiser manuellement votre mot de passe.",
    "JYqxz2": "Bienvenue sur LafTools, ceci est une version initiée.",
    "JdqiUE8": "Cette opération décode les données d'une chaîne ASCII (avec un alphabet de votre choix, préréglages inclus) dans sa forme brute.",
    "JdqidUE8": "Cette opération décode les données d'une chaîne ASCII (avec un alphabet de votre choix, préréglages inclus) dans sa forme brute.",
    "JfFHw": "Obtenir une demande d'informations sur l'espace de travail",
    "JiUE8": "Cette opération décode les données d'une chaîne ASCII {0} dans son format brut.",
    "K1qJZI": "Bienvenue sur LafTools, Votre Excellence.",
    "KGS2-": "Une fois que vous avez terminé les étapes ci-dessus, vous pouvez utiliser votre nouveau mot de passe pour vous connecter à votre système. Si vous ne parvenez pas à accéder au système de fichiers, veuillez demander à votre administrateur ou à votre support informatique de créer ce fichier. Si le fichier existait déjà, supprimez-le et créez-en un nouveau.",
    "KIc63": "Fonction non encore prise en charge",
    "KYh1N": "Toutes les notes",
    "KcqrRr": "Référence",
    "KcrRr": "Récupération des données d'implémentation du code",
    "KmEUF": "Fournir un aperçu rapide des outils système actuels.",
    "Kw4OJr": "Terminal",
    "Kyd9H": "Code source sur GitHub",
    "L-p-Y": "Copiez le contenu de la commande shell actuelle dans le presse-papiers",
    "L3zEM": "Afficher l'exemple",
    "L42mxa": "Veuillez saisir votre texte source dans ce champ.",
    "L49kCq": "Veuillez fournir et confirmer le mot de passe de verrouillage dans ce formulaire pour sécuriser votre LafTools.",
    "L71q_N": "Le mot de passe que vous avez fourni est vide, veuillez vérifier et réessayer.",
    "L9bQku": "Décoder {0}",
    "L9qbQku": "Décoder {0}",
    "LAc1m": "Actualisation de la vue de l'application.",
    "LFdvM": "Pas connecté",
    "LM715": "Récupération de la configuration i18n à partir de l'API du serveur local",
    "LNvUuKmHR": "L'application ne dispose pas de dépendances ou de bibliothèques essentielles.",
    "LPJrV": "Copier le résultat",
    "LSohY6eZW": "Hex String est une chaîne d'octets hexadécimaux séparés par un délimiteur, qui peut être un espace, une virgule, un point-virgule ou deux points.",
    "LU9Jj": "Base85 (également appelé Ascii85) est une notation permettant de coder des données d'octets arbitraires. Il est généralement plus efficace que Base64. Cette opération décode les données d'une chaîne ASCII (avec un alphabet de votre choix, préréglages inclus). Base85 est couramment utilisé dans les formats de fichiers PostScript et PDF d'Adobe.",
    "LWaeFqd": "Passez à votre langue préférée",
    "Le71_N-": "Le mot de passe que vous avez fourni n'est pas le même que celui confirmé, veuillez vérifier et réessayer.",
    "LnJ4H": "Notez que le compte local n'est absolument pas le même que celui de l'utilisateur enregistré sur notre site Web, le premier est défini uniquement sur votre PC tandis que le second peut être utilisé pour la synchronisation cloud.",
    "LqWaFd": "Les paramètres du système",
    "LxaEFHbfa": "Réduit le code SQL, réduisez la taille du bundle de votre code SQL.",
    "M3qytc": "Encoder {0}",
    "M3ytc": "Encoder {0}",
    "M4ywN1": "Calculatrice, calendrier, horloge, météo et bien plus encore.",
    "M6MrW": "Bien",
    "M7jct": "Passer en mode plein écran",
    "MD2-Advantages-011": "Quels sont les avantages d’utiliser MD2 ?",
    "MD2-AlgorithmDetails-010": "Détails de l'algorithme MD2",
    "MD2-Applications-018": "Quelles applications ont utilisé ou utilisent encore MD2 ?",
    "MD2-Breakdown-016": "Des faiblesses cryptographiques ont été découvertes dans MD2 au fil du temps, et des alternatives plus puissantes comme SHA-256 et SHA-3 sont désormais recommandées pour toutes les applications nécessitant un hachage sécurisé.",
    "MD2-CollisionSecurity-015": "MD2 est considéré comme faible face aux attaques cryptographiques modernes. Sa taille de hachage (128 bits) est petite par rapport aux normes actuelles, ce qui le rend vulnérable aux attaques par collision.",
    "MD2-Def-002": "MD2 (Message-Digest Algorithm 2) est une fonction de hachage cryptographique conçue par Ronald Rivest en 1989. Elle produit une valeur de hachage de 128 bits pour tout message d'entrée donné.",
    "MD2-DigitalSignature-Risks-021": "Risques liés à l'utilisation de MD2 pour les signatures numériques",
    "MD2-Disadvantages-014": "Quels sont les inconvénients et les problèmes de sécurité de MD2 ?",
    "MD2-FAQ-001": "Qu’est-ce que MD2 ?",
    "MD2-HistoricalUse-020": "Historiquement, MD2 a été utilisé dans les contrôles d'intégrité des fichiers et les mises à jour logicielles, bien que ces applications aient largement évolué vers des fonctions de hachage plus sécurisées telles que SHA-256 et SHA-512.)",
    "MD2-History-004": "Comment a été développé MD2 et quelle est son histoire ?",
    "MD2-Implementation-013": "Il a été largement implémenté et standardisé sur diverses plates-formes et langages, ce qui signifie que l'intégration de MD2 dans les systèmes existants peut être relativement simple.",
    "MD2-InsecurityExamples-017": "Exemples de pannes de sécurité MD2",
    "MD2-Operation-007": "Comment fonctionne le fonctionnement MD2 ?",
    "MD2-Origin-005": "MD2 a été initialement créé comme une amélioration par rapport à MD1, corrigeant certaines faiblesses trouvées dans l'algorithme précédent. Il a gagné en popularité en raison de sa relative simplicité et de sa rapidité à l’époque.",
    "MD2-PKI-019": "MD2 était autrefois utilisé dans l'infrastructure à clé publique (PKI) pour les signatures numériques, mais est depuis obsolète en raison de sa vulnérabilité aux attaques. Les certificats signés avec MD2 ne sont plus approuvés par la plupart des systèmes.",
    "MD2-Process-008": "MD2 fonctionne en complétant le message d'entrée à un multiple de 16 octets, puis le traite via une série d'opérations OU exclusif, de rotations de bits et d'ajouts. Le résultat final est une valeur de hachage de 128 bits.",
    "MD2-Purpose-003": "Le but de MD2 est de garantir l'intégrité des données en générant une empreinte numérique unique qui peut être utilisée pour vérifier l'originalité et l'authenticité des données.",
    "MD2-Rounds-009": "L'algorithme utilise un processus en quatre tours avec des opérations spécifiques effectuées sur une variable d'état de 128 bits. Chaque cycle prend des blocs du message complété et met à jour l'état jusqu'à ce que l'intégralité du message soit traitée.",
    "MD2-Speed-012": "MD2 était considéré comme rapide pour l'époque et offre toujours des performances acceptables dans certains scénarios, ce qui le rend adapté aux environnements où les ressources informatiques sont limitées.",
    "MD2-Successors-006": "Cependant, il a été remplacé par des algorithmes plus puissants comme MD5 et SHA-1, qui font partie de la même famille de fonctions de hachage mais offrent des fonctionnalités de sécurité améliorées.",
    "MD4-Advantages-011": "Quels sont les avantages d’utiliser MD4 ?",
    "MD4-AlgorithmDetails-010": "Détails de l'algorithme MD4",
    "MD4-Applications-018": "Quelles applications ont utilisé ou utilisent encore MD4 ?",
    "MD4-Breakdown-016": "Les défauts de conception de l'algorithme ont conduit à des attaques pratiques permettant des collisions de hachage faciles et même des attaques partielles de pré-image, rendant MD4 inadapté à tout cas d'utilisation cryptographique sécurisé aujourd'hui.",
    "MD4-CollisionSecurity-015": "MD4 présente plusieurs faiblesses cryptographiques, notamment la susceptibilité aux attaques par collision. Cela signifie que deux entrées différentes peuvent produire la même sortie de hachage, ce qui la rend peu sûre pour les applications nécessitant une résistance aux collisions ou une forte intégrité des messages.",
    "MD4-Def-002": "MD4 (Message-Digest Algorithm 4) est une fonction de hachage cryptographique conçue par Ronald Rivest en 1990. Elle produit une valeur de hachage de 128 bits pour tout message d'entrée donné.",
    "MD4-DigitalSignature-Risks-021": "Risques liés à l'utilisation de MD4 pour les signatures numériques",
    "MD4-Disadvantages-014": "Quels sont les inconvénients et les problèmes de sécurité de MD4 ?",
    "MD4-FAQ-001": "Qu’est-ce que MD4 ?",
    "MD4-HistoricalUse-019": "Historiquement, MD4 était utilisé dans les signatures numériques, les contrôles d'intégrité des fichiers et les mises à jour logicielles. Cependant, en raison de leurs vulnérabilités, ces applications ont largement migré vers des alternatives plus sécurisées comme SHA-256 et SHA-3.",
    "MD4-History-004": "Comment MD4 a-t-il été développé et quelle est sa signification historique ?",
    "MD4-Implementation-013": "Il a été largement implémenté et standardisé sur diverses plates-formes et langages, facilitant son intégration dans les systèmes existants, bien que cet avantage soit contrebalancé par ses problèmes de sécurité dans les contextes modernes.",
    "MD4-InsecurityExamples-017": "Exemples de pannes de sécurité MD4",
    "MD4-LegacySystems-020": "MD4 peut encore exister dans les systèmes existants, mais son utilisation est déconseillée dans tous les contextes où la sécurité est une préoccupation. Les normes modernes ne recommandent plus MD4 à des fins cryptographiques.",
    "MD4-Operation-007": "Comment fonctionne le fonctionnement du MD4 ?",
    "MD4-Origin-005": "MD4 était une évolution de MD2 et MD3, destinée à offrir des performances plus rapides tout en conservant les propriétés de sécurité. Cependant, il est devenu évident que MD4 présente plusieurs failles de sécurité.",
    "MD4-Process-008": "MD4 traite le message d'entrée en le complétant à un multiple de 512 bits et en le divisant en blocs de 16 mots. L'algorithme opère ensuite sur ces blocs en utilisant quatre cycles de traitement impliquant des opérations au niveau du bit, des ajouts modulaires et des fonctions non linéaires.",
    "MD4-Purpose-003": "L'objectif de MD4 est de garantir l'intégrité des données en générant une empreinte numérique de taille fixe qui peut être utilisée pour vérifier l'authenticité et l'intégrité des données originales.",
    "MD4-Rounds-009": "Une fois tous les blocs traités, l'état interne résultant est transformé en la valeur de hachage finale de 128 bits.",
    "MD4-Speed-012": "MD4 a été initialement conçu pour être plus rapide que ses prédécesseurs, ce qui l'a rendu populaire pour les applications nécessitant un hachage rapide au moment de son introduction.",
    "MD4-Successors-006": "Malgré ses défauts, MD4 a jeté les bases des fonctions de hachage ultérieures telles que MD5 et SHA-1, qui ont amélioré sa conception mais ont également hérité de certaines de ses vulnérabilités au fil du temps.",
    "MD5-Advantages-012": "Quels sont les avantages d’utiliser MD5 ?",
    "MD5-AlgorithmDetails-011": "Détails de l'algorithme MD5",
    "MD5-Alternatives-019": "Quelles sont les alternatives au MD5 pour un hachage sécurisé ?",
    "MD5-Applications-024": "Quelles autres applications utilisent ou ont utilisé MD5 ?",
    "MD5-Breakdown-017": "Plusieurs faiblesses cryptographiques ont été découvertes dans MD5 au fil du temps, et les chercheurs ont démontré des exemples pratiques de création de collisions, compromettant encore davantage son intégrité et sa sécurité.",
    "MD5-Collision-016": "MD5 est vulnérable aux attaques par collision, ce qui signifie que deux entrées différentes peuvent produire la même sortie de hachage. Cela le rend non sécurisé pour des applications telles que les signatures numériques ou le stockage de mots de passe.",
    "MD5-CollisionExample-007": "Exemple de collision MD5",
    "MD5-DataIntegrity-026": "Il était également couramment utilisé pour vérifier l'intégrité des données pendant la transmission et le stockage, par exemple lors de l'utilisation de rsync pour la synchronisation de fichiers ou la somme de contrôle de grands ensembles de données.",
    "MD5-Def-002": "MD5 (Message-Digest Algorithm 5) est une fonction de hachage cryptographique largement utilisée qui prend un message d'entrée et produit une valeur de hachage de 128 bits de taille fixe.",
    "MD5-DigitalSignature-Risks-027": "Risques liés à l'utilisation de MD5 pour les signatures numériques",
    "MD5-Disadvantages-015": "Quels sont les inconvénients et les problèmes de sécurité du MD5 ?",
    "MD5-FAQ-001": "Qu’est-ce que MD5 ?",
    "MD5-FileChecksum-005": "MD5 est souvent utilisé pour vérifier l'intégrité des fichiers lors du téléchargement de logiciels ou de fichiers volumineux. Il génère une somme de contrôle qui peut être comparée à celle fournie par la source pour garantir que le fichier téléchargé n'a pas été falsifié.",
    "MD5-Future-028": "MD5 est-il toujours d’actualité aujourd’hui ?",
    "MD5-InsecurityExamples-018": "Exemples de pannes de sécurité MD5",
    "MD5-Operation-008": "Comment fonctionne le fonctionnement du MD5 ?",
    "MD5-PKI-025": "MD5 a été utilisé dans l'infrastructure à clé publique (PKI) pour créer des signatures numériques, bien que son utilisation soit largement obsolète en raison de problèmes de sécurité. Les certificats signés avec MD5 ne sont plus approuvés par la plupart des systèmes modernes.",
    "MD5-PasswordHashing-006": "Il a également été historiquement utilisé pour le hachage de mots de passe, mais est désormais considéré comme non sécurisé en raison de sa vulnérabilité aux collisions et de sa facilité de piratage. Les systèmes modernes sont passés à des alternatives plus puissantes comme bcrypt ou Argon2.",
    "MD5-Process-009": "MD5 fonctionne en décomposant le message d'entrée en morceaux et en faisant passer chaque morceau par plusieurs cycles de traitement impliquant des fonctions logiques, une arithmétique modulaire et des opérations au niveau du bit. Le résultat est concaténé pour produire la valeur de hachage finale de 128 bits.",
    "MD5-Purpose-003": "Son objectif est de garantir l’intégrité des données en générant une empreinte numérique unique pour toute donnée donnée. Si ne serait-ce qu'un seul bit dans les données d'origine change, le hachage MD5 sera complètement différent.",
    "MD5-Relevance-029": "MD5 n'est plus considéré comme sécurisé à des fins cryptographiques, en particulier pour les nouvelles applications qui nécessitent une résistance aux collisions ou une forte intégrité des messages. Cependant, on peut encore le trouver dans les systèmes existants ou dans les applications non cryptographiques où la vitesse est prioritaire sur la sécurité.",
    "MD5-Rounds-010": "L'algorithme se compose de quatre étapes principales effectuées sur un état interne de 128 bits qui est initialisé avec des constantes. Il y a 64 tours de traitement au total, où chaque tour transforme l'état interne en fonction des blocs de messages d'entrée.",
    "MD5-Speed-013": "MD5 est relativement rapide, ce qui l'a rendu populaire pour les applications où un hachage rapide était essentiel.",
    "MD5-Standardization-014": "Il a été largement standardisé et implémenté dans divers langages et plates-formes de programmation, ce qui facilite son intégration dans les systèmes et outils existants.",
    "MD5-Summary-031": "En résumé, quels sont les points clés à retenir sur MD5 ?",
    "MD5-Summary-Point1-032": "MD5 est une fonction de hachage cryptographique rapide mais non sécurisée, susceptible aux attaques par collision.",
    "MD5-Summary-Point2-033": "Ses principales utilisations étaient de garantir l'intégrité des données et de réaliser certaines opérations cryptographiques, mais il a été largement remplacé par des alternatives plus puissantes comme SHA-256 et BLAKE2.",
    "MD5-Summary-Point3-034": "Même si vous pouvez rencontrer MD5 dans des systèmes existants ou dans des scénarios non sensibles en matière de sécurité, il est crucial d'éviter de l'utiliser pour tout nouveau projet nécessitant une sécurité cryptographique.",
    "MD5-Transition-030": "À mesure que des algorithmes plus récents et plus sécurisés tels que SHA-256 et BLAKE2 deviennent largement disponibles et mieux compris, il est recommandé d'abandonner MD5 dans tous les contextes où la sécurité est une préoccupation.",
    "MD5-Usage-004": "Comment le MD5 est-il utilisé en pratique ?",
    "MD6-AlgorithmDetails-010": "Détails de l'algorithme MD6",
    "MD6-ComparisonSHA3-020": "Comment MD6 se compare-t-il à SHA-3 (Keccak) ?",
    "MD6-Def-002": "MD6 (Message-Digest Algorithm 6) est une fonction de hachage cryptographique conçue par Ronald Rivest en 2008. Il s'agit d'une évolution de la famille MD, offrant des tailles de sortie variables allant de 128 à 512 bits.",
    "MD6-FAQ-001": "Qu’est-ce que MD6 ?",
    "MD6-FutureDevelopments-028": "Y a-t-il des développements ou des améliorations futurs prévus pour MD6 ?",
    "MD6-FutureUnknown-029": "Pour l’instant, il n’existe aucune information publiquement disponible sur le développement en cours ou les projets d’amélioration de l’algorithme MD6. La recherche cryptographique continue d'évoluer et de nouveaux algorithmes pourraient émerger pour répondre aux menaces ou aux exigences émergentes.",
    "MD6-History-004": "Comment MD6 a-t-il été développé et qu’est-ce qui a conduit à sa création ?",
    "MD6-Operation-007": "Comment fonctionne le fonctionnement du MD6 ?",
    "MD6-Origin-005": "MD6 a été créé en réponse aux vulnérabilités trouvées dans MD5 et SHA-1, qui étaient largement utilisées à l'époque. Son objectif était de fournir une alternative plus sécurisée avec une flexibilité accrue concernant la taille de la sortie.",
    "MD6-PKI-Alternatives-027": "Pour les applications PKI et de signature numérique, des normes telles que RSA/SHA-256 ou ECDSA avec des variantes SHA-2 ou SHA-3 sont couramment utilisées. Ceux-ci ont fait l’objet d’analyses approfondies et ont établi la confiance au sein de la communauté cryptographique.",
    "MD6-PKI-Considerations-026": "Alors que MD6 était destiné à fournir une sécurité plus forte que les fonctions de hachage antérieures comme MD5, il n'a pas été largement adopté pour les systèmes PKI ou de signature numérique en raison de sa relative nouveauté et du manque d'acceptation par une large communauté cryptographique.",
    "MD6-Process-008": "MD6 traite les messages d'entrée via une série de fonctions de compression appliquées dans une structure arborescente. L'algorithme peut fonctionner en parallèle, ce qui contribue à ses performances pour des entrées plus importantes.",
    "MD6-Purpose-003": "MD6 vise à fournir des fonctionnalités de sécurité robustes et des performances améliorées par rapport à ses prédécesseurs, ce qui le rend adapté à une variété d'applications nécessitant un hachage résistant aux collisions et des contrôles d'intégrité des messages.",
    "MD6-Rounds-009": "Chaque nœud de l'arborescence MD6 subit plusieurs séries d'opérations de mélange impliquant des additions modulaires, des XOR au niveau du bit et des permutations non linéaires. La valeur finale du nœud racine représente le hachage du message d'entrée.",
    "MD6-SecurityUpgrade-006": "La conception de MD6 repose sur le concept de hachage arborescent, ce qui lui permet d'offrir une meilleure protection contre les attaques par pré-image et par collision que les algorithmes MD précédents, tout en offrant également un débit plus élevé pour les grands ensembles de données.",
    "MD6-StayingCurrent-030": "Il est essentiel de se tenir au courant des derniers résultats de recherche et des recommandations des experts en cryptographie lors du choix d'une fonction de hachage pour toute application, d'autant plus que le paysage de la sécurité cryptographique évolue au fil du temps.",
    "MD6-UseInPKI-025": "MD6 peut-il être utilisé pour l'infrastructure à clé publique (PKI) ou les signatures numériques ?",
    "MD6-vs-SHA3-Adoption-023": "SHA-3 a été adopté comme norme officielle du NIST et a été largement utilisé en raison de sa sécurité et de ses performances robustes. MD6, bien qu'il soit théoriquement sécurisé, n'a pas connu le même niveau d'adoption ou de standardisation.",
    "MD6-vs-SHA3-DiffDesign-021": "MD6 et SHA-3 sont tous deux conçus dans un souci de sécurité, mais ils utilisent des techniques de hachage différentes. MD6 utilise une conception arborescente pour un parallélisme amélioré, tandis que SHA-3 est basé sur la construction en éponge.",
    "MD6-vs-SHA3-Flexibility-022": "MD6 propose des longueurs de sortie variables, ce qui peut être avantageux pour les applications nécessitant des tailles de hachage personnalisées. SHA-3 prend également en charge les longueurs de sortie variables, bien que sa variante la plus courante, SHAKE, offre encore plus de flexibilité avec des sorties de longueur arbitraire.",
    "MDN-DOM-API": "MDN Web Docs - Manipulation de documents",
    "MDN-Event-Loop": "MDN Web Docs - Boucle d'événements",
    "MDN-JS-Guide": "Documents Web MDN - Guide JavaScript",
    "MDN-JS-Types": "MDN Web Docs - Types de données et structures de données",
    "MDN-JSON-in-JavaScript": "MDN Web Docs - Travailler avec JSON",
    "MDN-Minification": "Documents Web MDN - Minification",
    "MDN-XML-Syntax": "MDN Web Docs - Syntaxe XML",
    "MN2lT": "La longueur du mot de passe ne peut pas être inférieure à 6",
    "Ma5mv": "Basculer la visibilité des onglets de la barre d'outils",
    "Minify-Basics-001": "Quelle est la signification de la réduction du code ou des fichiers ?",
    "Minify-CLI-Usage-009": "La plupart de ces outils disposent à la fois d'interfaces de ligne de commande (CLI) et d'API qui permettent aux développeurs d'automatiser le processus de minification pendant le développement et le déploiement.",
    "Minify-Def-002": "La minification est le processus de réduction de la taille du code (HTML, CSS, JavaScript, etc.) en supprimant les caractères inutiles tels que les espaces blancs, les commentaires et les sauts de ligne sans affecter sa fonctionnalité.",
    "Minify-Example-007k": "Par exemple, {0} pourrait devenir {1} après la minification.",
    "Minify-How-Works-004": "Comment fonctionne la minification du code ?",
    "Minify-Process-005": "Les miniificateurs utilisent des algorithmes pour analyser la structure du code source, éliminer les éléments superflus et raccourcir les noms de variables lorsque cela est possible. Cela se traduit par une taille de fichier plus petite tout en conservant le comportement d'origine du code.",
    "Minify-Purpose-003": "L'objectif principal de la minification est d'améliorer les performances du site Web et de réduire les temps de chargement des pages en diminuant la quantité de données qui doivent être transférées entre le serveur et le client.",
    "Minify-Tools-007": "Quels sont les outils populaires pour réduire le code ?",
    "Minify-Tools-List-008": "Les outils populaires pour réduire le code incluent UglifyJS pour JavaScript, Terser qui est une évolution d'UglifyJS, HTMLMinifier pour HTML et CSSNano pour CSS. Ces outils peuvent souvent être intégrés dans les processus de construction à l'aide d'exécuteurs de tâches comme Gulp ou Webpack.",
    "Mq9pdpT": "Répertoriez toutes les ressources pertinentes pour le menu fonctionnel que vous avez sélectionné.",
    "Mq9ppT": "Visualisez rapidement l’état de vos services",
    "Mqq9pdpT": "Vous aider à démarrer avec LafTools.",
    "MrgmU": "Confirmer",
    "MySQL-Performance-Tuning": "Conseils d'optimisation des performances MySQL",
    "NMLOn": "Copier le chemin du fichier",
    "NMLOn1": "Espace de travail ouvert",
    "NNfJo": "Charger des données à partir d'un fichier",
    "Nq1IR": "Impossible de charger la VM d'extension",
    "Nqc0LqwX": "Si vous pensez qu'il existe une vulnérabilité dans ce processus, n'hésitez pas à nous contacter via EMail ou GitHub à tout moment, nous aimerions l'améliorer de toute urgence.",
    "NrQc8OJfZ": "Compresse le code JSON (JavaScript Object Notation).",
    "NvOqE3B9Vxd": "Et ci-dessous vous trouverez les solutions possibles auxquelles vous pourriez vous référer",
    "O02-W": "Ne charge pas...",
    "O94Yx": "sur",
    "OO0qPN": "Exemple chargé",
    "OQWm4": "Signaler un bug",
    "OSHOI": "Page d'accueil",
    "OSqZQM": "Mot de passe local",
    "OWASP-JSON-Injection": "OWASP-Injection JSON",
    "OWASP-SQL-Injection": "Guide d'injection SQL OWASP",
    "OeO0PeN": "Bon, l'exemple est affiché dans l'éditeur de saisie.",
    "OeOQY": "FAIRE",
    "Ol1ZcWomT": "{0} Embellir",
    "OpPFe": "Si vous aimez LafTools, partagez-le avec vos amis et donnez-nous une étoile, merci !",
    "Opcty": "Des dossiers",
    "OqqGx2qg": "Chargement des ressources statiques, veuillez patienter...",
    "OrCt5": "Redirection vers l'établi...",
    "Ot6EP": "Outils de polissage",
    "P4ROa": "Région de sortie",
    "PM_N5": "Séance – {0}",
    "PUxuU": "Récupération des données pour les modules linguistiques...",
    "PapkF": "Si vous avez des questions ou des suggestions concernant LafTools, n'hésitez pas à nous le faire savoir. Nous recherchons toujours des moyens d'améliorer notre produit et d'offrir la meilleure expérience possible à nos utilisateurs. Vous pouvez nous contacter à work7z@outlook.com. Merci d'utiliser LafTools !",
    "PpCHA": "Clé des questions (?)",
    "PqazM-": "Tout d'abord, veuillez utiliser les contrôles de formulaire ci-dessous pour crypter votre mot de passe.",
    "QL9Sn": "Pour le moment, il ne semble pas y avoir de description disponible.",
    "QLKzF": "Il regorge de fonctionnalités qui répondent aux besoins des développeurs débutants et expérimentés, ce qui en fait un outil incontournable dans l'arsenal de tout programmeur.",
    "QM2Ob": "Outils récents",
    "QM2Oq": "Notes récentes",
    "QRAdA": "Anglais vers chinois",
    "QZK58Gemi": "Compresse le code SQL (Structured Query Language).",
    "QhdpH": "Edition communautaire",
    "QkJ-TOduip6z_": "L'EDI LafTools",
    "QzlA3": "Une erreur s'est produite",
    "R12bq": "Liste des onglets qui ne sont pas affichés",
    "RNBze0": "Outils",
    "RNeBze0": "Onglets ouverts",
    "RNewBze0": "Configuration de l'outil",
    "RO4ZP": "Une erreur s'est produite",
    "RPVRl": "Il semble que cette extension ne soit pas compatible avec la version actuelle de LafTools. Veuillez envisager d'installer la dernière version pour prendre en charge cette extension, ou n'hésitez pas à nous contacter en soulevant un problème sur GitHub.",
    "R_S7_CLAo": "Exemple : Pour encoder « TEST12345 » en Base32, vous pouvez utiliser des bibliothèques comme base32-encode dans Node.js, ou des fonctions intégrées dans d'autres langages tels que base64.b32encode de Python.",
    "RhqzcdD": "Les paramètres du système",
    "RjCO3": "Liste des espaces de travail",
    "S4MMV": "Oops! Nous avons trouvé quelques problèmes lors du chargement du fichier.",
    "SAnnQ": "Chargement du fichier {0}",
    "SBsDz": "Configuration de votre compte administrateur.",
    "SDLC-Wikipedia": "Cycle de vie du développement logiciel — Wikipédia",
    "SETxuObyB": "Soulevez un problème sur GitHub pour cette erreur afin de permettre à l'équipe LafTools de l'étudier plus en détail.",
    "SGs7B": "Configurez rapidement vos LafTools",
    "SHA-256-020": "SHA-256 (Secure Hash Algorithm) est une alternative largement utilisée offrant une sécurité plus renforcée que MD5. Il génère une valeur de hachage plus grande de 256 bits et fait partie de la famille SHA-2.",
    "SHA-2_Info-022": "Informations SHA-2",
    "SHA3-NISTStandard-024": "Normalisation SHA-3",
    "SMqD13": "Entrez pour filtrer",
    "SPem9": "Ce champ n'est pas encore prêt.",
    "SQAw7": "Langue originelle",
    "SQL-Basics-001": "Qu’est-ce que SQL ?",
    "SQL-Beautifier-Example": "Formateur SQL en ligne",
    "SQL-Beautify-006": "Qu’est-ce que l’embellissement SQL ?",
    "SQL-Beautify-Def-007": "L'embellissement SQL est le processus de formatage du code SQL pour améliorer la lisibilité en appliquant des conventions cohérentes d'indentation, d'espacement et de casse.",
    "SQL-Beautify-Purpose-008": "Tout comme les embellisseurs de code génériques, il aide les développeurs à comprendre plus facilement les requêtes complexes et à maintenir la cohérence entre leurs scripts ou projets SQL.",
    "SQL-Commands-005": "SQL comprend plusieurs types de commandes : DDL (Data Definition Language - CREATE, ALTER, DROP), DML (Data Manipulation Language - SELECT, INSERT, UPDATE, DELETE) et DCL (Data Control Language - GRANT, REVOKE).",
    "SQL-Components-004": "Quels sont les principaux composants de SQL ?",
    "SQL-Components-Wikipedia": "Composants SQL sur Wikipédia",
    "SQL-Def-002": "SQL (Structured Query Language) est un langage de programmation standard permettant de gérer et d'interroger des bases de données relationnelles.",
    "SQL-Indexing-016": "Que sont les index dans SQL et pourquoi sont-ils importants ?",
    "SQL-Indexing-Benefit-018": "La création d'un index sur les colonnes fréquemment utilisées pour les conditions de la clause WHERE accélère considérablement les requêtes SELECT mais peut ralentir les opérations INSERT, UPDATE et DELETE en raison de la nécessité de conserver la structure de l'index.",
    "SQL-Indexing-Explanation-017": "Les index sont des structures de données (par exemple, des arbres B) qui améliorent la vitesse des opérations de récupération de données dans une table en permettant au moteur de base de données de localiser rapidement les lignes en fonction de valeurs de colonne spécifiques.",
    "SQL-Indexing-MDN": "Documents Web MDN sur les index",
    "SQL-Injection-019": "Qu’est-ce que l’injection SQL et comment peut-elle être évitée ?",
    "SQL-Injection-Def-020": "SQL Injection est une vulnérabilité de sécurité dans laquelle un attaquant peut insérer du code SQL malveillant dans des champs de saisie pour manipuler ou extraire des données d'une base de données.",
    "SQL-Injection-Prevention-021": "Les méthodes de prévention incluent l'utilisation de requêtes paramétrées, d'instructions préparées ou de bibliothèques ORM qui échappent automatiquement aux entrées de l'utilisateur, ainsi que la limitation des autorisations de base de données et l'application des principes du moindre privilège.",
    "SQL-Joins-011": "Que sont les JOIN en SQL ?",
    "SQL-Joins-Explanation-012": "Les JOIN sont utilisés pour combiner des lignes de deux ou plusieurs tables en fonction d'une colonne liée entre elles. Par exemple, INNER JOIN, LEFT JOIN, RIGHT JOIN et FULL JOIN.",
    "SQL-Joins-Tutorial": "Didacticiel sur les jointures SQL",
    "SQL-Perf-Tuning-Methods-024": "D'autres techniques incluent le partitionnement de grandes tables, l'utilisation de types de données appropriés et la mise en cache des résultats lorsque cela est possible.",
    "SQL-Perf-Tuning-Overview-023": "L'optimisation des performances des requêtes SQL implique d'analyser les plans d'exécution, d'indexer de manière appropriée, de minimiser les jointures et sous-requêtes inutiles et d'écrire des clauses WHERE efficaces.",
    "SQL-Performance-Tuning-022": "Comment optimiser les performances des requêtes SQL ?",
    "SQL-Purpose-003": "Il est utilisé pour créer, lire, mettre à jour, supprimer et interroger des données dans des tables, ainsi que pour gérer la structure et les autorisations de la base de données.",
    "SQL-Select-009": "Comment écrire une instruction SELECT de base ?",
    "SQL-Select-Example-0210": "Une simple instruction SELECT récupère les données d'une table. Par exemple : {0}', 'SELECT colonne1, colonne2 FROM ma_table ;",
    "SQL-Transactions-013": "Que sont les transactions en SQL ?",
    "SQL-Transactions-Def-014": "Une transaction est une unité de travail logique qui contient une ou plusieurs instructions SQL. Il garantit que toutes les opérations qu'il contient sont terminées avec succès (atomicité), isolées des autres transactions et durables même en cas de panne du système.",
    "SQL-Transactions-Example-015": "Pour démarrer une transaction, utilisez la commande START TRANSACTION ; validez les modifications avec COMMIT ou revenez à l’état précédent avec ROLLBACK.",
    "SQL-Transactions-W3Schools": "Transactions SQL sur W3Schools",
    "SYSq1": "Exemple",
    "SZgXb": "Configurer le mot de passe local",
    "SdGcT": "Autre partie",
    "Sm9tq": "Veuillez fournir le mot de passe du compte ici",
    "Sm9tqq": "Veuillez fournir un mot de passe pour déverrouiller votre LafTools",
    "Spcfdee": "Mode clair ou sombre",
    "TBPqy7": "Langue",
    "TD7DA": "Langues",
    "TIOBE-Index": "TIOBE Index - La société de qualité logicielle",
    "TNoePE": "Nuage LafTools",
    "Terser": "Terser - GitHub",
    "Ttrqqet": "Écrivez et enregistrez vos pensées ici !",
    "TwFcr": "Langue cible",
    "TyqvWY3": "Fichier local",
    "U2ZNl": "En savoir plus sur Wikipédia",
    "U4qqq9": "Supprimer cet onglet de la liste",
    "U5Eiy7ZRZ": "Envoyez un e-mail à l'équipe LafTools ({0}) pour signaler cette erreur si elle est liée à des informations sensibles.",
    "U7zP2": "Veuillez fournir le nom d'utilisateur du compte ici",
    "UF_Dp": "Une erreur s'est produite : {0}, l'heure de rejet est {1}",
    "UVvJp-vtF": "{0} Réduire",
    "UZ2Ig": "Nouveau compte local",
    "UglifyJS": "UglifyJS - GitHub",
    "Ugpng": "Préféré",
    "V6U_f": "Conditions d'utilisation",
    "V6XEO": "Entrez le nom d'utilisateur ou l'e-mail",
    "VAZq8r": "Il permet aux développeurs d'exécuter diverses commandes, telles que l'exécution de scripts, l'installation de packages et la navigation dans le système de fichiers, le tout depuis l'éditeur.",
    "VEfeqZG": "Remarques",
    "VI6VT": "Histoire",
    "VOsZc": "Signaler un problème",
    "VSZ": "Cliquez pour relancer",
    "VZtqg6": "Créer un nouveau formulaire de script",
    "Vaf2y": "Le nom de l'onglet ne peut pas être vide.",
    "VeY9K": "Conditions d'utilisation",
    "VgG5y": "Cliquez ici pour actualiser le statut de votre extension",
    "VjZCv": "Conversion en temps réel",
    "Vvt09V2Qo": "Code générique",
    "W3Schools-XML-Validation": "W3Schools-Validation XML",
    "WFUWzv_px": "Analyse et imprime joliment le code JavaScript valide. Fonctionne également avec JavaScript Object Notation (JSON).",
    "WPrTW": "Site officiel",
    "WXo6D": "Actualisé",
    "WYCVL": "Installation rapide",
    "X4L_Z": "L'extension VM n'est pas fournie.",
    "X6Fq4j": "Après des années de développement et de perfectionnement, nous sommes convaincus que LafTools peut améliorer considérablement votre expérience de programmation en apportant plus de commodité et d'efficacité à votre flux de travail.",
    "XKpI0": "Cliquez pour traiter votre texte dans la région de saisie",
    "XLWoR": "Sélectionnez votre préféré et continuez",
    "XML-Advantage-Readable-018": "Sa nature lisible par l'homme permet une inspection et un débogage faciles, et la possibilité de définir des structures personnalisées le rend flexible pour de multiples cas d'utilisation.",
    "XML-Advantage-Standardized-017": "XML est une norme largement adoptée, ce qui la rend compatible avec diverses plates-formes et systèmes, favorisant ainsi l'interopérabilité et l'échange de données.",
    "XML-Advantages-012": "XML offre une plus grande flexibilité de structure et prend en charge les espaces de noms, ce qui peut être bénéfique pour les structures de documents complexes et l'interopérabilité entre les systèmes.",
    "XML-Advantages-016": "Quels sont les avantages de l’utilisation de XML ?",
    "XML-Attributes-006": "Les éléments peuvent avoir des attributs qui fournissent des informations supplémentaires sur l'élément dans la balise d'ouverture, tels que {0}",
    "XML-Basics-001": "Qu’est-ce que XML ?",
    "XML-Def-002": "XML (eXtensible Markup Language) est un langage de balisage qui définit un ensemble de règles pour encoder des documents dans un format à la fois lisible par l'homme et par la machine.",
    "XML-Disadvantage-Size-020": "XML peut être relativement verbeux, ce qui entraîne des tailles de fichiers plus grandes que des alternatives comme JSON, ce qui a un impact sur la vitesse de transmission et les exigences de stockage.",
    "XML-Disadvantages-019": "Quels sont les inconvénients de l’utilisation de XML ?",
    "XML-JSON-Diff-Structure-014": "XML utilise des balises verbeuses et hiérarchiques pour la structure, tandis que JSON s'appuie sur des paires clé-valeur et des tableaux. Exemple : XML {0} contre JSON {1}.",
    "XML-JSON-Diff-Syntax-015": "XML a une syntaxe plus stricte avec des balises et des attributs de fermeture, tandis que la syntaxe de JSON est plus légère et plus proche de la notation d'objet JavaScript. JSON est généralement considéré comme plus facile à analyser et à transmettre sur le Web.",
    "XML-JSON-Difference-013": "Quelle est la différence entre XML et JSON ?",
    "XML-Nesting-007": "Comment fonctionne l’imbrication en XML ?",
    "XML-Nesting-Example-009": "Par exemple, `<book><title>My Book Title</title><author>John Doe</author></book>` représente un livre avec son titre et son auteur sous forme d'éléments imbriqués.",
    "XML-Nesting-Explanation-008": "En XML, les éléments peuvent être imbriqués les uns dans les autres pour représenter des relations hiérarchiques. Les éléments enfants sont placés entre les balises d'ouverture et de fermeture de leur élément parent.",
    "XML-Processing-Speed-021": "L'analyse et la génération de XML peuvent être plus lentes en raison de sa syntaxe stricte et de la nécessité d'une validation, en particulier lorsqu'il s'agit de documents complexes.",
    "XML-Purpose-003": "Il est conçu pour transporter des données plutôt que pour les afficher comme le HTML, ce qui lui permet d'être utilisé comme format commun pour partager des informations structurées sur différentes plates-formes et applications.",
    "XML-Syntax-004": "Quelle est la syntaxe de base de XML ?",
    "XML-Syntax-Example-005": "Un simple document XML est constitué d'éléments dans une structure arborescente. Chaque élément commence par une balise entre crochets (<element>) et se termine par une balise de fermeture (</element>).",
    "XML-Validation-010": "Qu’est-ce que la validation XML et comment ça marche ?",
    "XML-Validation-Def-011": "La validation XML garantit qu'un document XML adhère à un ensemble spécifique de règles définies dans une définition de type de document (DTD) ou un schéma XML (XSD).",
    "XML-Validation-Process-012": "Les validateurs vérifient si tous les éléments et attributs requis sont présents, valident les types de données et appliquent toutes les contraintes spécifiées dans le schéma avant de traiter le document.",
    "XQxJB": "Mes espaces de travail",
    "X_HGx": "LafTools est une boîte à outils polyvalente conçue pour répondre à divers besoins. Il est entièrement open source, garantissant transparence et sécurité. Malgré son environnement d'exécution léger, il offre une prise en charge complète de la plate-forme, y compris ARMv8, et une prise en charge native de l'IA similaire à ChatGPT. LafTools est hautement intégré à une interface utilisateur productive et est continuellement mis à jour avec de nouveaux outils. Il peut être utilisé sur le Web et avec Docker et fournit des ressources supplémentaires telles que des notes et des manuels.",
    "XeXF77": "Paramètres",
    "XikdD": "Quelques instants s'il vous plaît, nous y sommes presque !",
    "Y5GAC": "Ton nom d'utilisateur",
    "Y9mQ2": "Veuillez fournir le nom d'utilisateur du compte ici",
    "YAAU3q": "Mot de passe local",
    "YHCjT": "LafTools prend en charge le thème global clair et sombre, il est particulièrement utile avec les codeurs de nuit.",
    "YNwKz": "Langue non prise en charge : {0}, utilisera l'anglais par défaut.",
    "YOYTp": "Installation rapide",
    "YPPPL": "Basculer la visibilité des onglets des barres d'outils",
    "YQN9u": "Une erreur s'est produite lors du chargement de {0}, veuillez vérifier les détails ci-dessous.",
    "Y__Zb1_4Q": "Réduit le code des feuilles de style en cascade (CSS), en supprimant tous les caractères inutiles.",
    "Y_k0z": "Mot de passe oublié?",
    "Ye3TXses": "Pour configurer si la transformation sera exécutée automatiquement lorsque le texte saisi est modifié.",
    "Ylq2X": "Correction des erreurs",
    "YquQqTXq": "Exécution automatique ?",
    "YrTdq": "Tous",
    "YrVq683": "Mail",
    "YrVqdd683": "Manuels",
    "Z2QTU": "À propos",
    "Z3rhY": "Message",
    "Z7ALO": "Passé à l'espace de travail sélectionné",
    "Z7OTt": "Le fichier que vous avez sélectionné est trop volumineux, veuillez sélectionner un fichier inférieur à 30 Mo.",
    "ZAGva": "Êtes-vous sûr de supprimer cet espace de travail ?",
    "ZAKaFq": "Mon compte Cloud",
    "ZW1Dgz": "Aucun message disponible",
    "ZXRGC": "Veuillez consulter l'erreur : {0}",
    "ZbD3F": "{0}, conçu par l'équipe LafTools",
    "Zk7JI": "Ce n'est pas encore pris en charge",
    "ZrbduC": "Fermer tous les onglets",
    "ZrbuC": "Fermer l'onglet",
    "_-JigU2Fg": "Une entrée ou un format de données inattendu a provoqué l'exception.",
    "_5OqeG": "Décochez-le",
    "_LFF3": "Si vous rencontrez un problème ou avez des suggestions lors de l'utilisation de LafTools, n'hésitez pas à nous contacter via EMail ou GitHub à tout moment, nous sommes prêts à l'améliorer.",
    "_trez": "Échanger du texte",
    "_trqL": "Récupération des données pour les ressources système...",
    "_z3lR": "Actualiser le code",
    "a3yqoz": "persan",
    "a3z-3k12": "Outils d'adresse IP",
    "a4jbpq": "tchèque",
    "a4r9t": "Base45 peut-il décoder n'importe quelle chaîne codée en Base45, quelle que soit son origine ?",
    "a4s6x": "Comment fonctionne Base32 ?",
    "a8b7z": "Ainsi, le remplissage n'est nécessaire que si le dernier groupe de bits en cours de codage n'est pas divisible par 40 bits (puisque 8 caractères Base32 représentent 40 bits). Le remplissage sera composé de zéro à six caractères « = » à la fin de la chaîne codée.",
    "aCkOP": "Sortie",
    "aHAfR": "Récupération des données pour {0}...",
    "aSOpr": "Générateur de modèles de données",
    "ab9c0d1e": "Les opérations principales incluent le codage (conversion du binaire en Base64) et le décodage (conversion du Base64 en binaire).",
    "abc12345": "Base64 est un schéma de codage qui représente les données binaires sous la forme d'une séquence de caractères ASCII.",
    "abcdef12": "Comment fonctionne Base64 ?",
    "about_LafTools_toolbox": "À propos de LafTools",
    "adpgq": "Créer un nouvel espace de travail",
    "ah-C4": "Nouvelle remarque",
    "aj3nhd": "Allemand",
    "aked6": "Les références",
    "aked61": "Introduction",
    "asElV": "Retirer",
    "az4uS2": "Êtes-vous sûr de vous déconnecter de ce système ? Notez que vous serez redirigé vers la page de connexion.",
    "azpNX": "Complété.",
    "b0qjSL": "Veuillez entrer dans le répertoire {1} et créer un fichier {2}, mettre votre mot de passe crypté comme contenu complet du fichier.",
    "b6sx9b": "Philippin",
    "b8g2k": "Scénarios d'utilisation pour Base32",
    "bP_6qG": "Conseils pour avoir oublié votre mot de passe",
    "bT4R6": "Nouvel onglet",
    "bVlBN": "Chinois vers anglais",
    "bcdef01a": "Base64 fonctionne en divisant les données binaires en groupes de 6 bits et en mappant chaque groupe à un caractère spécifique d'un alphabet de 64 caractères (A-Za-z0-9+/).",
    "bhojei1": "Chinois traditionnel",
    "bjZyW": "Traduire",
    "bors14": "turc",
    "bp_-b": "Pour gérer entièrement LafTools, vous devez configurer votre administrateur au début du flux de configuration. Nous avons vérifié votre identification grâce au jeton de paramètre URL. Soyez assuré que personne d'autre ne peut configurer votre autorisation root à moins d'obtenir un jeton de configuration.",
    "bqqrij": "Swahili",
    "bsWpBA73s": "Compresse le code JavaScript.",
    "c0eCw": "Traduisez votre texte dans la langue de votre choix.",
    "c0v2p": "Opérations courantes avec Base32",
    "c1p3b": "Une fois intégré, copiez le modèle fourni dans votre programme C++ et remplacez l'espace réservé par la valeur codée réelle avant d'exécuter le programme.",
    "c1p4b": "Chaque nombre décimal est ensuite converti en une séquence unique de cinq caractères Base85. S'il reste moins de quatre octets à la fin, un remplissage peut être appliqué.",
    "c2tpr": "La bibliothèque Apache Commons Codec fournit des fonctionnalités d'encodage et de décodage Base32 en Java.",
    "c2vw9k": "Bien que Base45 ne soit pas aussi largement implémenté que Base64 ou Base32, des bibliothèques open source existent pour plusieurs langages.",
    "c5m1b": "Une autre variante, Base58Flickr, diffère légèrement par son jeu de caractères. Il remplace '+' par ',' et '/' par '-', s'adaptant aux besoins d'URL de Flickr.",
    "c5meku": "Soundanais",
    "c5p1b": "Le rembourrage n'est pas utilisé ; la longueur de la sortie codée dépend directement de la taille des données d'entrée.",
    "c6p4n": "Dans le modèle fourni, remplacez l'espace réservé dans la partie décodage par les octets réels codés en Base85 (préfixés par « b »), puis exécutez le script.",
    "c6p9b": "Si la longueur des données d'entrée n'est pas divisible par 8, le remplissage n'est pas utilisé ; au lieu de cela, chaque groupe non complet est traité indépendamment.",
    "c7Uoqqe": "Avant d'utiliser LafTools, veuillez fournir et confirmer votre mot de passe local comme ci-dessous.",
    "c8me6b": "Les schémas personnalisés de type Base62 peuvent être adaptés à des applications spécifiques, mais ils adhèrent généralement au même principe d'utilisation d'un jeu de caractères plus grand que Base64 ou Base32.",
    "c9j5k": "Téléchargez et incluez l'en-tête 'base32.h' et son implémentation correspondante dans votre projet.",
    "c9j5v": "Installez-le via Composer en ajoutant « composer require christian-riesen/base32 » à votre projet.",
    "c9q7w": "Pourquoi Base45 a-t-il été créé ?",
    "cMBqyyFae": "Indente et embellit le code SQL (Structured Query Language).",
    "cNQp_": "Ressources",
    "cPS6q": "Tous les outils",
    "cQqwI8r": "Chargement de l'état du service Terminal",
    "cbaq54321": "Non, Base64 n'est pas une technique de compression, elle modifie uniquement la représentation des données et non leur taille.",
    "cdefg234": "Des caractères de remplissage (=) sont ajoutés à la fin pour garantir que la longueur des données codées est un multiple de 4 caractères.",
    "cfYYN": "Découvrir plus",
    "ciZV2": "Base32 est une notation permettant de coder des données d'octets arbitraires à l'aide d'un ensemble restreint de symboles qui peuvent être facilement utilisés par les humains et traités par des ordinateurs. Il utilise un jeu de caractères plus petit que Base64, généralement l'alphabet majuscule et les chiffres de 2 à 7.",
    "ciZV21": "Base45 est une notation permettant de coder des données d'octets arbitraires à l'aide d'un ensemble restreint de symboles qui peuvent être facilement utilisés par les humains et traités par des ordinateurs. La base numérique élevée donne des chaînes plus courtes qu'avec le système décimal ou hexadécimal. Base45 est optimisé pour une utilisation avec les codes QR.",
    "ciZV2deq1": "Base58 (similaire à Base64) est une notation pour coder des données d'octets arbitraires. Il diffère de Base64 en supprimant les caractères facilement mal lus (c'est-à-dire l, I, 0 et O) pour améliorer la lisibilité humaine. Base58 est couramment utilisé dans les crypto-monnaies (Bitcoin, Ripple, etc.).",
    "cj1pd": "Opération d'actualisation",
    "cjzqj9": "bosniaque",
    "cmxzpg": "Malayalam",
    "coM2I": "Utiliser l'éditeur intelligent",
    "crD7I": "Pour configurer si la transformation doit ignorer le texte d'entrée vide dont la longueur est nulle.",
    "cuRCb": "Catégorie introuvable.",
    "cuRCqb": "La catégorie n'existe pas",
    "cxqhqa": "Myanmar (birman)",
    "d-l2l": "Confirmer",
    "d-qPr": "Disposition inconnue : {0}",
    "d1x7v": "Un autre exemple est celui de Git, où les objets hachés sont parfois stockés au format Base32 pour éviter les problèmes de fin de ligne et de restrictions de nom de fichier. De plus, HashiCorp Vault utilise Base32 pour la dérivation des clés.",
    "d2w4e": "Semblable à d'autres systèmes de conversion de base, Base62 fonctionne en convertissant les octets d'entrée en un grand entier, puis en l'exprimant sous la forme d'une combinaison de caractères de son jeu de 62 caractères.",
    "d2w6e": "Téléchargez le code source et incluez le fichier d'en-tête base62.h dans votre projet. Compilez/liez les fichiers sources selon les instructions du projet.",
    "d3w2e": "Base58 fonctionne en convertissant les octets d'entrée en un grand entier, puis en exprimant cet entier sous la forme d'une combinaison de caractères de son jeu de 58 caractères (A-Z, a-z, 1-9).",
    "d5KZH": "Merci d'utiliser LafTools !",
    "d5LAU": "Sous licence AGPLv3",
    "d5fmq2": "italien",
    "d5hit": "Séance – {0}",
    "d5x1rl": "Espagnol",
    "d6g0w": "Cet extrait peut être exécuté dans n'importe quel environnement Python, y compris des scripts, des sessions interactives ou dans une application plus grande.",
    "d6y9k": "S'il n'y a pas assez d'octets pour remplir le dernier groupe, le remplissage n'est pas utilisé ; au lieu de cela, les bits restants sont traités et mappés sur leur(s) caractère(s) correspondant(s).",
    "d7w2e": "Base85 fonctionne en divisant les données d'entrée en groupes de quatre octets et en convertissant chaque groupe en un nombre décimal compris entre 0 et 2 ^ 32-1.",
    "d8w1b": "Aucune installation supplémentaire n'est nécessaire puisqu'elle fait partie de la bibliothèque standard. Assurez-vous que votre version de Python est suffisamment récente pour inclure cette fonctionnalité.",
    "d9w7m": "De plus, comme il utilise uniquement des lettres majuscules, il ne peut pas utiliser toutes les combinaisons possibles de sensibilité à la casse comme mesure de sécurité supplémentaire comme le fait parfois Base64 avec le pliage de la casse pendant le décodage.",
    "dCFIC": "Code plus joli",
    "dCFIwC": "Générateur de codes",
    "dGKMx": "Sortir",
    "dGVUB": "Outils réseau",
    "dQwjNbi0y": "En savoir plus sur la documentation",
    "dV5Eq": "Actualiser la liste des espaces de travail",
    "dWbBm": "C# inclut la classe « System.Convert » avec les méthodes intégrées ToBase64String et FromBase64String qui vous permettent d'encoder et de décoder les données Base64. La chaîne d'entrée est d'abord convertie en un tableau d'octets à l'aide du codage UTF-8, puis codée et décodée en conséquence.",
    "dk122q": "Gérez vos flux de travail pour combiner plusieurs outils ensemble.",
    "dkarh": "Okie, la boîte à outils a ouvert le répertoire. Si aucune fenêtre contextuelle ne s'affiche, veuillez vérifier si votre plate-forme prend en charge cette fonction ou si le répertoire se trouve sur le serveur.",
    "dkjk12": "c'est un test",
    "dkkq12": "Configurez votre outil dans cet onglet.",
    "dl4kr": "Mot de passe oublié?",
    "dpRY4": "Dictionnaire",
    "dqTqyvWY": "Menu du tiroir",
    "dsdpA_eJ": "Ajuster la taille",
    "dtjdt4": "Kazakh",
    "dxLQq": "Autorisation racine",
    "dzjTo": "Veuillez fournir le mot de passe du compte ici",
    "e--gB": "L’ID d’extension n’est pas fourni.",
    "e3WgQaZlb": "Compresse {0}",
    "e4Cd8t": "Base85",
    "e5c7r": "Base32 est un schéma de codage binaire en texte qui représente les données dans une chaîne ASCII à l'aide d'un sous-ensemble de 32 caractères. Il est conçu pour être lisible par l’homme et sécurisé pour les URL.",
    "e5rycw": "Kirghize",
    "e8Crq": "Veuillez remplir les champs ci-dessous pour votre nom d'utilisateur et votre mot de passe pour continuer.",
    "e8x2v": "Base45 fonctionne en divisant les données d'entrée en groupes de 5 octets chacun. Il convertit ensuite chaque groupe en nombre décimal et le mappe à un caractère correspondant parmi son jeu de 45 caractères.",
    "eN4fM": "Dans Rust, vous pouvez utiliser la caisse « base64 » pour l'encodage et le décodage Base64. Ajoutez 'base64 = \\\"1.x\\\"' à votre fichier Cargo.toml sous la section [dependencies], exécutez 'cargo build' et incluez les importations nécessaires dans votre code pour utiliser ces fonctions.",
    "eTmq": "Histoire de CodeGen ToolBox",
    "e_8pZ": "Une boîte à outils polyvalente permettant aux développeurs d'améliorer leur productivité.",
    "ediql2": "hongrois",
    "efg45678": "Comparaison avec Base32",
    "efghi678": "Cette variante est souvent utilisée pour les noms de fichiers, les URL ou les situations où les caractères spéciaux doivent être évités.",
    "egkqC8t": "Base58",
    "egkqCd8t": "Base62",
    "eifoni": "catalan",
    "eqkqd4W": "Veuillez fournir un nom pour la nouvelle balise",
    "etV-l": "Copier des fichiers sur SIT2",
    "eu5mh0": "biélorusse",
    "euaI8": "Créer un nouveau compte local",
    "euhy9v": "estonien",
    "f0q4w": "Un scénario d'utilisation populaire consiste à générer des clés secrètes pour l'authentification à deux facteurs (2FA), où des services tels que Google Authenticator et Yubikey utilisent des secrets codés en Base32.",
    "f1t2z": "Base62 a été développé pour fournir une alternative plus courte et sécurisée pour les URL à Base64, en particulier pour les identifiants uniques et les URL courtes.",
    "f3ttw8": "Maori",
    "f4t7z": "Base58 a été initialement développé pour Bitcoin afin de représenter sans ambiguïté les adresses publiques et les clés privées.",
    "f5a0s": "De plus, Base32 produit une sortie plus longue mais peut être plus adapté à des applications spécifiques telles que les noms de fichiers en raison de son manque de caractères spéciaux susceptibles d'entrer en conflit avec les règles du système de fichiers.",
    "f5bLC": "Documentation",
    "f7akol": "Anglais",
    "f7t1z": "Ajoutez la bibliothèque à votre projet Xcode manuellement ou via un gestionnaire de packages comme Swift Package Manager (SPM).",
    "f8n4m": "Sa compacité permet une utilisation plus efficace de l'espace dans les codes QR tout en conservant la lisibilité avec les lecteurs de codes-barres standards.",
    "f8wne": "Incluez le package en exécutant « Install-Package BouncyCastle » dans la console du gestionnaire de packages ou en l'ajoutant à votre fichier .csproj.",
    "f9t1z": "Base85 a été initialement développé pour représenter efficacement les données binaires dans les documents PostScript afin d'obtenir de meilleurs taux de compression.",
    "f9t2z": "Ajoutez la dépendance à votre projet Maven en incluant `<dependency> <groupId>commons-codec</groupId> <artifactId>commons-codec</artifactId> <version>...</version> </dependency>` dans votre fichier pom.xml avec le dernier numéro de version.",
    "fBP5h": "Nom d'utilisateur",
    "fEr5j": "Créer un nouveau script",
    "fTt2N": "Perl nécessite le module 'MIME::Base64' pour l'encodage et le décodage Base64. Installez-le en exécutant 'cpan install MIME::Base64' s'il n'est pas déjà installé.",
    "fV_1P": "Se connecter",
    "fdxluz": "roumain",
    "ff02c": "Annulé",
    "fghi6789": "Il est utilisé pour transmettre ou stocker des fichiers binaires dans des formats texte, garantissant ainsi la compatibilité entre différents systèmes.",
    "fgj880": "Télougou",
    "fqV_1P": "Débloquez vos LafTools",
    "g1h5n": "Comment fonctionne Base45 ?",
    "g2_aX": "Copiez le mot de passe crypté dans le fichier",
    "g3h5s": "Comment fonctionne Base85 ?",
    "g4h7s": "Pour C++, vous pouvez utiliser la bibliothèque 'cpp-base62' qui fournit la fonctionnalité Base62.",
    "g5SK9": "Ouverte récente",
    "g5ybh": "Ajoutez la dépendance à votre projet (Maven : 'org.apache.commons:commons-codec').",
    "g6f0r": "Aucune installation supplémentaire n'est requise pour les bibliothèques principales de Ruby. Remplacez simplement « TEST12345 » par la valeur souhaitée.",
    "g6f0t": "Exécutez « go get github.com/mitchellh/go-base32 » pour ajouter la dépendance à votre projet.",
    "g6v3b": "Cependant, le jeu de caractères plus large de Base45 peut augmenter le risque d'erreurs lors du traitement de caractères non alphanumériques, ce qui pourrait poser problème dans certains environnements ou canaux de transmission.",
    "g7h5k": "Comment fonctionne Base58 ?",
    "g8h7s": "Comment fonctionne Base62 ?",
    "g8r3e": "Le principal inconvénient de Base32 est son efficacité spatiale relativement faible ; il étend les données d'entrée d'environ 25 % de plus que Base64. Cela signifie que cela nécessite plus de stockage ou de bande passante pour la même quantité de données codées.",
    "gDjbs": "Données historiques",
    "gK3dNQ": "Copie",
    "gQhfS": "Outils de fichiers",
    "gT6re": "C++ n'a pas d'implémentation native Base64. Cet exemple utilise la bibliothèque OpenSSL pour effectuer l'encodage et le décodage Base64. Pour utiliser OpenSSL, installez-le sur votre système et établissez un lien avec les bibliothèques appropriées lors de la compilation de votre programme.",
    "gU1O2": "Déclenché",
    "generic-NI-UFPTe0": "Embellir le code générique",
    "generic-code-beautify.desc.2b3c": "Cette opération formate le code dans divers langages de programmation pour améliorer la lisibilité en appliquant une indentation cohérente, des sauts de ligne et en respectant les directives de style spécifiques au langage.",
    "gkC8t": "Base64",
    "gkdqqC8t": "Base45",
    "gkqC8t": "Base32",
    "gms7_9n5v": "Convertit une chaîne d'octets hexadécimaux en sa valeur brute.",
    "gnKMZ": "Rafraîchi.",
    "h4e1b": "Il est également utile dans les situations où les chaînes alphanumériques sensibles à la casse sont plus faciles à gérer que les chaînes hexadécimales ou base64, qui peuvent contenir des caractères non alphanumériques susceptibles de provoquer des problèmes dans certains contextes (comme les URL ou les noms de fichiers).",
    "h6AeI": "Connexion Websocket fermée à {0}",
    "h7rUq": "Dans Node.js, la classe « Buffer » intégrée peut gérer l'encodage et le décodage Base64 sans nécessiter de bibliothèques externes. Cet extrait de code encode la chaîne « TEST12345 » en Base64, puis la décode en chaîne d'origine.",
    "h9j3m": "Rembourrage en Base32",
    "hAH_IjzGN": "Il s'agit d'une version initiée, cette partie est encore en développement.",
    "hGA96yTG4": "Certaines fonctionnalités ne sont pas prises en charge sur cette plateforme.",
    "hJUMN": "Langue cible",
    "hMvh1": "Base de données de sauvegarde",
    "hRFxV": "Pour plus d'information, veuillez visiter notre site web",
    "hX1CWGAhl": "Indente et embellit le code XML (eXtensible Markup Language).",
    "hcnt1k": "Macédonien",
    "hhOT3": "Rechercher par nom",
    "hij90klm": "Base32 utilise un alphabet plus petit (A-Z2-7), ce qui donne des chaînes plus longues mais plus lisibles par l'homme.",
    "htTmvWjsS": "Compresse le code CSS (Cascading Style Sheets).",
    "htt1d2": "espéranto",
    "hu-iz": "Minuteur",
    "huE6U": "Variable",
    "hyV-d": "Fait",
    "hyirc0": "suédois",
    "i27qmr": "frison",
    "i6hMN": "Code de vérification des images",
    "i7w2m": "Existe-t-il des bibliothèques Base45 intégrées dans les langages de programmation populaires ?",
    "i88tb": "Exporter le résultat vers un fichier",
    "i8q8tb": "Configurer WorkFlow pour l'entrée",
    "i9o7k": "Avantages de Base32 par rapport à Base64",
    "iNQvo": "Montrez un exemple pour commencer.",
    "iNqF1T": "Gérer le compte cloud",
    "iOEjZ": "Aucun code disponible",
    "iQL2c": "Nous explorons toujours la gamme complète des fonctions de ce bouton. Si vous avez des commentaires ou des suggestions sur la façon dont nous pouvons l'améliorer, n'hésitez pas à nous le faire savoir !",
    "i_lang_": "Packs de langue",
    "ib135dq": "Votre message de statut sera affiché ici",
    "iknTS": "Gestionnaire de mots de passe",
    "init_env": "Chargement des ressources système",
    "ip2g1": "Copié",
    "ipOSQE": "Édition Pro",
    "it8ths": "indonésien",
    "ixyP0": "Traitement automatique de l'action en temps réel",
    "j1b5k": "Les opérations les plus courantes impliquant Base32 incluent le codage de données binaires dans une chaîne Base32 et le décodage d'une chaîne Base32 dans son format binaire d'origine.",
    "j4s6r": "Comment encoder/décoder avec Base62 en JavaScript ?",
    "j5s7r": "Comment encoder/décoder avec Base85 en JavaScript ?",
    "j6s3r": "Comment encoder/décoder avec Base58 en JavaScript ?",
    "j7k2t": "Pour encoder des données avec Base45, vous avez besoin d'une bibliothèque ou d'une fonction qui implémente l'algorithme Base45.",
    "j8s6r": "Pour Kotlin, vous pouvez utiliser la bibliothèque « barcode-core » qui inclut la fonctionnalité Base45.",
    "j9s5r": "Pour C#, utilisez la bibliothèque « WarrenStranger.Base62 » pour gérer l'encodage et le décodage Base62.",
    "jJuNz": "Langue originelle",
    "jO5eP": "D'ACCORD",
    "jPNCb": "Réessayé.",
    "jQXdi": "Mode lumière",
    "jR1zX": "Laboratoire d'IA",
    "jRzgS": "Le framework Foundation de Swift comprend des méthodes intégrées pour l'encodage et le décodage Base64. Aucune bibliothèque externe n'est nécessaire ; importez simplement « Foundation » pour utiliser ces fonctionnalités.",
    "jZvLJ": "PHP est livré avec les fonctions intégrées « base64_encode() » et « base64_decode() » pour gérer les opérations Base64. Ces fonctions sont facilement disponibles et ne nécessitent aucune configuration ou installation supplémentaire.",
    "jaj7M": "Tous droits réservés.",
    "jb392": "Nom",
    "jfpqt": "Navigateur de notes",
    "jgDoEq": "Aucune donnée FAQ",
    "jhDoE": "Récupération des données FAQ",
    "jlxvpk": "coréen",
    "json-beautify.desc.0912": "Cette opération formate les données JSON pour améliorer la lisibilité en ajoutant une indentation appropriée, des sauts de ligne et en triant les clés de manière cohérente.",
    "json-beautify.name.0912": "Formater SQL",
    "json-beautify.text.93kq": "Embellir les données JSON",
    "k17PG": "Connexion Websocket fermée.",
    "k1m4e": "Cependant, il n'offre pas tout à fait la même efficacité spatiale que Base64 ou Base32 puisqu'il utilise moins de caractères dans son alphabet.",
    "k2SVY": "désactivé",
    "k2em5e": "Cela se traduit par des chaînes de sortie plus courtes pour la même quantité de données d’entrée, ce qui peut être bénéfique dans les scénarios où la réduction de la taille est essentielle.",
    "k2ku5p": "tchèque",
    "k3m2e": "Copiez le modèle fourni dans un nouveau fichier Go, remplacez l'espace réservé par la valeur codée réelle, puis exécutez le fichier en utilisant « go run yourfile.go »",
    "k41a5": "LafOutils",
    "k4s5rx": "slovène",
    "k7d9f": "La bibliothèque « base32 » intégrée de Ruby fournit des méthodes d'encodage et de décodage Base32.",
    "k7d9r": "Le package « go-base32 » fournit des capacités d’encodage et de décodage Base32 dans Go.",
    "k7g0n": "En Base32, tous les 5 bits de données d'entrée sont mappés à l'un des 32 caractères de l'ensemble 'ABCDEFGHIJKLMNOPQRSTUVWXYZ234567='.",
    "k9em5e": "Cela le rend idéal pour les scénarios dans lesquels un identifiant concis et convivial pour les URL est requis sans sacrifier la lisibilité.",
    "k9jtr": "Le package npm 'base32-encoding' est utilisé pour l'encodage et le décodage Base32 dans Node.js.",
    "kLH79": "E-mail",
    "kOi5A": "Imprimer la page",
    "kPD22": "Dictionnaire",
    "kPJ-A4": "Rafraîchir",
    "kZd9G": "Ruby dispose d'une bibliothèque « base64 » intégrée qui fournit des méthodes d'encodage et de décodage Base64. Incluez la bibliothèque avec 'require \\\"base64\\\"' dans votre script.",
    "kcHxr": "Veuillez fournir le nom d'utilisateur du compte administrateur ici",
    "kjks1": "Récupération de la configuration i18n à partir de l'API du serveur local",
    "kqv5ht": "yiddish",
    "krxSK": "Assistant IA",
    "ks12d": "La cyber-sécurité",
    "kv4wag": "Néerlandais",
    "l1p9z": "Qu’est-ce que Base32 ?",
    "l3akoa": "Amharique",
    "l6Djb": "Sélectionnez l'une des options comme thème préféré :",
    "lIn3_": "Nom d'utilisateur administrateur",
    "lQFII": "Re-déclencher l'initialisation",
    "lRHDQ": "Quitter le mode plein écran",
    "lUh5c": "Générateur",
    "lkuulh": "Français",
    "lp0qmd0": "Marquez-le comme favori",
    "lpKAz": "Paramètres",
    "lpzg83": "Samoan",
    "lzGS2": "Détails de l'extension",
    "m0106": "Convertisseur",
    "m0107": "Générateur",
    "m0108": "Formateur",
    "m6d8b": "Chaque valeur de 5 bits est représentée par un seul caractère, permettant un codage et un décodage efficaces pour les systèmes qui préfèrent travailler avec des octets (unités de 8 bits).",
    "m6t1b": "La bibliothèque 'base32' de Daniel R. Collins fournit des fonctionnalités d'encodage et de décodage Base32 en C++.",
    "m7WZw": "Websocket système cassé",
    "m8rTc1": "Une fois le gestionnaire de scripts shell implémenté, vous pouvez l'utiliser pour gérer vos commandes shell.",
    "m9k1z": "Cependant, si les données décodées contiennent une sémantique d'application spécifique (par exemple, des formats de code QR spécifiques), un traitement supplémentaire peut être nécessaire après le décodage.",
    "mBgF1": "Action de la souris",
    "mSFei": "Code source sur GitHub",
    "mWXeh": "ID de l'espace de travail : {0}",
    "mabHq": "Rechercher d'anciens fichiers",
    "mbzCv": "Une erreur s'est produite : {0}, l'heure de rejet est {1}",
    "md2.desc.1039": "Cette opération hache les données dans un hachage {0}.",
    "md2.text.192d3": "Générer {0} hachage",
    "md2aO2NaJITm": "Indente et embellit le code des feuilles de style en cascade (CSS), le rendant plus facile à lire et à comprendre.",
    "md4.desc.1039": "Cette opération hache les données dans un hachage {0}.",
    "md4.text.192d3": "Générer {0} hachage",
    "md5-cpp-install-openssl-0002": "Installez OpenSSL sur votre système et établissez un lien avec les bibliothèques « libssl » et « libcrypto » lors de la création de votre application C++.",
    "md5-cpp-openssl-0001": "C++ utilise la bibliothèque OpenSSL pour générer des hachages MD5. Vous devez installer OpenSSL et créer un lien vers celui-ci dans votre projet.",
    "md5-cpp-use-openssl-0003": "L'extrait crée une fonction « getMD5 » qui prend une chaîne d'entrée, calcule son hachage MD5 à l'aide de l'API MD5 d'OpenSSL et renvoie le hachage sous forme de chaîne hexadécimale. Collez ce code dans votre programme C++ et appelez la fonction « getMD5 » avec l'entrée souhaitée.",
    "md5-csharp-built-in-0001": "En C#, la classe « System.Security.Cryptography.MD5 » est utilisée pour générer des hachages MD5.",
    "md5-csharp-no-install-0002": "Aucune installation de bibliothèque externe n'est nécessaire puisqu'elle fait partie de .NET Framework/Core.",
    "md5-csharp-use-0003": "Cet extrait crée une instance MD5, convertit la chaîne d'entrée en octets, calcule le hachage et enfin code le hachage au format Base64. Placez ce code dans le point d’entrée de votre application C# et exécutez-le pour obtenir le hachage MD5 codé en Base64.",
    "md5-java-built-in-0001": "Java utilise la classe « java.security.MessageDigest » pour générer des hachages MD5.",
    "md5-java-imports-0002": "Vous devez importer « java.security.MessageDigest » et « java.util.Base64 » pour hacher et encoder le résultat.",
    "md5-java-use-0003": "L'extrait obtient une instance de l'algorithme de digestion MD5, la met à jour avec les octets de la chaîne d'entrée, puis code le hachage résultant dans une chaîne Base64. Copiez ce code dans une classe Java et exécutez sa méthode principale pour obtenir le hachage MD5 codé en Base64.",
    "md5-nodejs-built-in-0001": "Dans Node.js, le module « crypto » intégré est utilisé pour générer des hachages MD5.",
    "md5-nodejs-no-install-0002": "Aucune installation de bibliothèque externe n'est requise puisque « crypto » est préinstallé avec Node.js.",
    "md5-nodejs-use-0003": "L'extrait crée un objet de hachage à l'aide de `createHash('md5')`, le met à jour avec la chaîne d'entrée, puis convertit le résumé au format hexadécimal via `.digest('hex')`. Collez ce code dans votre script Node.js et exécutez-le pour obtenir le hachage MD5 de la valeur d'entrée.",
    "md5-php-built-in-0001": "PHP a une fonction intégrée 'md5()' pour générer des hachages MD5.",
    "md5-php-no-install-0002": "Aucune installation de bibliothèque externe n'est nécessaire car « md5() » est préinstallé en PHP.",
    "md5-php-use-0003": "Cet exemple simple définit une fonction 'getMD5' qui appelle la fonction PHP 'md5()' sur la chaîne d'entrée fournie. Copiez ce code dans un fichier PHP, enregistrez-le avec une extension .php et exécutez-le sur un serveur Web ou via la ligne de commande pour voir le hachage MD5 de la valeur d'entrée.",
    "md5-python-built-in-0001": "Python utilise la bibliothèque 'hashlib' intégrée pour générer des hachages MD5.",
    "md5-python-no-install-0002": "Aucune installation supplémentaire n'est nécessaire car « hashlib » est fourni en standard avec Python.",
    "md5-python-use-0003": "Le modèle fourni code la chaîne d'entrée en octets avant de créer un objet de hachage MD5. La méthode '.hexdigest()' est ensuite appelée sur l'objet de hachage pour récupérer le hachage MD5 sous forme hexadécimale. Copiez ce code dans un script Python et exécutez-le pour obtenir le hachage MD5.",
    "md5.desc.rxsHq": "Cette opération hache les données dans un hachage {0}.",
    "md5.textiDjMIo": "Générer {0} hachage",
    "md6.desc.1039": "Cette opération hache les données dans un hachage {0}.",
    "md6.text.192d3": "Générer {0} hachage",
    "meeMC1Uk7.text.93kq": "Réduire {0}",
    "mihc3": "Terminé cette opération",
    "mjHoR": "De plus, techniquement, personne ne peut lire ce jeton sinon il aurait attaqué et contrôlé votre ordinateur.",
    "mnb19i": "Allemand",
    "mno34567": "Avantages de Base64",
    "mnoijklm": "Existe-t-il d'autres encodages BaseXX ?",
    "mslw4o": "grec",
    "mwn7iv": "zoulou",
    "myxedr": "mongol",
    "n0pqrstu": "Exemple d'utilisation de Base64",
    "n1jA9": "Confirmer",
    "n24tes": "Portugais (Brésil)",
    "n3e7r": "Histoire de Base32",
    "n94an4": "polonais",
    "n98EW": "Échangez le texte de la région d’entrée et de la région de sortie.",
    "nSeIq8-": "Plus important encore, c'est gratuit et open source. Vous pouvez l'utiliser à des fins personnelles ou commerciales.",
    "nTvw4": "Pour protéger et enregistrer séparément vos données et paramètres, vous pouvez utiliser votre compte local pour y parvenir. En outre, LafTools prendra à l’avenir en charge les widgets de messagerie instantanée entre les utilisateurs.",
    "nmb1wx": "Yorouba",
    "nodBw": "Cette opération code les données brutes dans une chaîne ASCII {0}.",
    "nopqrs01": "Alors que Base64 optimise la compacité, Base32 est choisi lorsque la minimisation des erreurs de saisie, comme la saisie manuelle, est cruciale.",
    "nrix6l": "Chichewa",
    "nxJC7": "L'action par défaut à exécuter lorsque le transformateur est effectué.",
    "o1umzi": "Français",
    "o52xW": "Exporter",
    "o8xyzu": "luxembourgeois",
    "oBz8D": "Chargement",
    "oNLxH": "Nom d'utilisateur",
    "oNg3f": "Site officiel",
    "ocxsw3": "irlandais",
    "of_ox": "Dans l’ensemble, LafTools est une solution unique pour tous vos besoins.",
    "oj23X": "Restaurer la base de données",
    "ojCWEFdVe": "Compresse le code JavaScript, en supprimant tous les caractères inutiles.",
    "ooiFU": "Redémarrer le service Java",
    "oqHqVq": "Trier par",
    "oqHqqV": "Total : {0} commandes",
    "oqHqqVq": "Temps de copie",
    "oqjbcj": "Laotien",
    "os8h6u": "danois",
    "p5e9n": "Ajoutez la bibliothèque en tant que dépendance dans votre script de build Gradle. Par exemple, dans le fichier build.gradle au niveau de l'application, ajoutez « implémentation 'com.bottlerocketstudios:barcode-core:... » avec le dernier numéro de version.",
    "p6e3n": "Installez le package via NuGet en exécutant « Install-Package WarrenStranger.Base62 » dans la console du gestionnaire de packages ou ajoutez-le via le gestionnaire de packages NuGet.",
    "p8Exxc1s": "Il existe divers outils qui exploitent les technologies d’IA pour effectuer des tâches plus efficacement dans AI Laboratory.",
    "p8eq9n": "Vous pouvez utiliser des bibliothèques telles que « base85 » ou « ascii85 » pour l'encodage et le décodage Base85 en JavaScript.",
    "p9e1n": "Vous pouvez utiliser des bibliothèques telles que « base-x » ou « base62 » pour l'encodage et le décodage Base62 en JavaScript.",
    "p9s5t": "Base32 a été développé par Douglas Crockford, connu pour ses contributions à JavaScript, en 2001. Il a été créé comme une alternative plus fiable aux encodages existants comme Base64, en particulier pour les situations nécessitant des représentations textuelles de données binaires.",
    "pANmj": "Les balises peuvent être définies en fonction des types de serveurs, des utilisations des scripts ou de tout autre critère que vous préférez.",
    "pA_deJ": "Exporter vers le Presse-papiers",
    "pA_feeJ": "Reconnecter le terminal",
    "pA_qweJ": "Effacer le tampon",
    "pDBSWq": "aucun contenu disponible pour le panneau de droite",
    "pEk1kk": "LafTools vous présente ici des fonctionnalités utiles.",
    "pEk1qkk": "Lister tous les onglets ouverts",
    "pHZDB": "Action en temps réel",
    "pJoOz": "Fichier ouvert",
    "pKHRT": "Allez dans Outils",
    "pKqHRq": "Notes de recherche",
    "pL6qH": "Complété.",
    "pZ4d616m-": "Embellir {0}",
    "ph5jH": "Manipulation de cette partie",
    "piih4x": "tadjik",
    "pmAee": "Lisez plus d’informations sur cet outil.",
    "pmnp4b": "ukrainien",
    "ppmz8e": "Créole haïtien",
    "pq5e9n": "Vous pouvez utiliser des bibliothèques telles que « bs58 » pour effectuer l'encodage et le décodage Base58 en JavaScript.",
    "pqrs890t": "Compatibilité universelle : Base64 est largement reconnu et pris en charge dans tous les principaux langages de programmation.",
    "pqs7y3": "Veuillez envisager d'enregistrer cette page Web en tant que PWA pour bénéficier d'une prise en charge complète du clavier.",
    "psA_eJ": "Exporter sous forme de fichier",
    "psZoP": "Déposez les fichiers ici pour les traiter",
    "psqqpq_o": "D'accord, le résultat a été copié dans votre presse-papiers {0} fois.",
    "pzn2IpkDo": "Indentations et jolies impressions du code JavaScript Object Notation (JSON).<br><br>Tags : visionneuse JSON, prettify, coloration syntaxique",
    "q12beqwR": "Aucun outil disponible",
    "q29t31": "polonais",
    "q2n3r": "Aujourd'hui, il est utilisé dans diverses applications où l'efficacité de l'espace et la lisibilité sont cruciales, comme les documents PDF et certains protocoles réseau.",
    "q2n9r": "Une fois ajouté, copiez le modèle fourni dans un fichier Swift. Notez que dans cet exemple, nous utilisons un scénario hypothétique dans lequel vous disposez de la représentation base64 de la chaîne Base45 ; remplacez-le par la valeur codée réelle avant d’exécuter le code.",
    "q2w5m": "Objectif de l'utilisation de Base32 ?",
    "q2x8k": "Son utilisation s'est étendue à d'autres crypto-monnaies et scénarios dans lesquels des chaînes lisibles par l'homme et résistantes aux erreurs sont souhaitées.",
    "q5h8n": "Le principal avantage est la longueur de chaîne réduite pour la même quantité de données codées, ce qui le rend adapté aux applications où l'efficacité de l'espace est critique.",
    "q6K7o": "Charger à partir de notes",
    "q6n1r": "Après avoir installé la bibliothèque, copiez le code du modèle dans une classe Java et remplacez l'espace réservé par la valeur réelle codée en Base85 avant d'exécuter le code.",
    "q7n3r": "Il évite également les caractères ambigus comme « O » et « 0 », « I » et « l », qui peuvent conduire à des erreurs de transcription humaines.",
    "q9iuti": "gallois",
    "qDrbEr": "Le nom d'utilisateur que vous avez fourni est vide, veuillez vérifier et réessayer.",
    "qF4uS2": "Créer un espace de travail",
    "qF4uS23": "Nouvelle fenetre",
    "qHoktx": "Merci!",
    "qN1LdZ2": "Dernière modification",
    "qQmBr": "Traduction de texte",
    "qTqyvWdY": "Pas encore fini",
    "qWemXE4": "1er janvier 2024",
    "qWw3eTH": "Cette partie permet de conserver les fichiers sur votre disque local ou votre disque cloud.",
    "qdeFXx": "Actuellement, la page que vous recherchez n'est pas encore entièrement mise en œuvre.",
    "qpDBSW": "aucun panneau disponible",
    "qpDBSWe1": "aucun panneau disponible",
    "qqK_x_": "Se connecter",
    "qqqwYoz": "Aide",
    "qqwYoz": "Onglets",
    "qqwYqwe": "Espaces de travail",
    "qrstuvwx": "Oui, outre Base64 et Base32, il existe également Base16 (hexadécimal), Base58 et Base85, chacun conçu pour des scénarios différents.",
    "qtpmvP": "Confirmer le mot de passe local",
    "qubSJ": "L'extension VM n'est pas un ID. (RÉF : IQnMH).",
    "qv1p5n": "Par exemple, en Java, vous pouvez utiliser la bibliothèque « org.iso.base45 » pour encoder vos données.",
    "qzshys": "Ourdou",
    "r1GLS": "Mots clés",
    "r2n7v": "Le principal avantage est une lisibilité accrue grâce à l’exclusion des caractères d’apparence similaire, réduisant ainsi les erreurs lors de la saisie manuelle.",
    "r4n6v": "Ajoutez la dépendance à votre projet en exécutant « go get github.com/xyproto/base62 ». Cela téléchargera et installera le package.",
    "r6nq2v": "Le principal avantage de Base62 est son efficacité spatiale accrue grâce à un jeu de caractères plus grand que Base32 mais sans caractères non alphanumériques trouvés dans Base64.",
    "r8c6z": "Remplacez « TEST12345 » par votre propre chaîne et exécutez cette classe en tant que programme Java pour voir les résultats.",
    "r8y2w": "La bibliothèque PHP 'Base32' est utilisée ici pour l'encodage et le décodage Base32.",
    "r9a3t": "Base45 est un système de codage basé sur du texte qui code les données binaires en caractères ASCII.",
    "r9qn8v": "Le principal avantage de Base85 est son efficacité spatiale améliorée grâce à un jeu de caractères plus grand (85 contre 64 en Base64 ou 32 en Base32).",
    "rE6fUsSGl": "Indente et embellit le code SQL (Structured Query Language).",
    "rK6cx": "{0}, conçu et développé par l'équipe LafTools",
    "rLXJN": "Dans Kotlin, la classe « android.util.Base64 » intégrée d'Android peut être utilisée pour l'encodage et le décodage Base64. Cet exemple suppose un environnement Android ; pour les projets Kotlin non Android, pensez à utiliser « java.util.Base64 ».",
    "rQkas": "Bienvenue sur LafTools",
    "rR1vd": "Entrée à partir d'un fichier",
    "rT34qnO": "Saisissez le texte à traiter. Le résultat s'affichera dans l'éditeur de sortie.",
    "rVqlu": "Décoder {0}",
    "rYSpwq": "L'algorithme MD2 (Message-Digest 2) est une fonction de hachage cryptographique développée par Ronald Rivest en 1989. L'algorithme est optimisé pour les ordinateurs 8 bits. Bien que MD2 ne soit plus considéré comme sécurisé, même depuis 2014, il reste utilisé en public. infrastructures clés dans le cadre des certificats générés avec MD2 et RSA. L'algorithme de résumé de message se compose, par défaut, de 18 tours.",
    "r_n6h": "Mode clair ou sombre",
    "rf0mql3": "Thème clair ou sombre",
    "rpG0G": "Nous apprécions vos commentaires et aimerions connaître votre avis sur la façon dont nous pouvons améliorer notre produit - n'hésitez pas à partager vos commentaires avec nous !",
    "rub76Z8zx": "Tentatives d'impression de langages de style C tels que C, C++, C#, Java, PHP, JavaScript, etc. Cela ne fera pas un travail parfait et le code résultant risque de ne plus fonctionner. Cette opération est uniquement conçue pour rendre le code obscurci ou réduit plus facile à lire et à comprendre. Choses qui ne fonctionneront pas correctement : For formatage de boucle, formatage de boucle Do-While, indentation Switch/Case, certains opérateurs de décalage de bits",
    "run_text": "Avant d'entrer dans votre workbench, nous aimerions d'abord précharger les ressources système requises. Veuillez patienter un peu, il sera bientôt terminé, dont les détails sont visibles ci-dessous.",
    "rycJy": "LafTools est une boîte à outils polyvalente spécialement conçue pour les programmeurs. Il représente la deuxième version de CodeGen Toolbox, désormais avec un runtime plus léger écrit en Golang et JavaScript.",
    "ryhkqb": "bulgare",
    "s-fxP80Dd": "L'EDI LafTools",
    "s0vrf9": "hébreu",
    "s1b3m": "Contrairement à Base64 ou Base32, il exclut les caractères « 0 », « O », « I » et « l » faciles à confondre, ce qui le rend adapté aux URL et aux codes QR.",
    "s3e6r": "Comment encoder des données en Base45 ?",
    "s4OeX": "Connectez-vous au système avec succès",
    "s5b8m": "Remplacez 'TEST12345' par vos propres données et exécutez ce script dans un environnement PHP pour effectuer des opérations Base32.",
    "s5e8r": "Remplacez « TEST12345 » par vos données réelles et exécutez cet extrait dans un contexte d'application Swift pour effectuer des opérations Base32.",
    "s5t0n": "Le remplissage en Base32 implique l'ajout de caractères « = » pour garantir que le dernier morceau de données codées contient toujours un multiple de 8 bits. Cependant, contrairement à Base64, le remplissage en Base32 est minime car chaque caractère Base32 code déjà 5 bits.",
    "s7e9r": "Aucune bibliothèque externe n'est nécessaire. Remplacez simplement le 'b'TEST12345'' par votre objet réel de type octets à encoder/décoder.",
    "sBxHr": "Scala utilise la classe « java.util.Base64 » intégrée à Java pour les opérations Base64. Assurez-vous que vous utilisez une plate-forme JVM avec Java 8 ou version ultérieure.",
    "sHoxxW": "Histoire",
    "sKx5t": "La classe intégrée « java.util.Base64 » de Java, disponible depuis Java 8, fournit des méthodes d'encodage et de décodage Base64. La chaîne d'entrée est convertie en octets à l'aide du codage UTF-8, puis codée et décodée selon les besoins.",
    "sO0MOe": "Chaque fois que vous restez dans une fenêtre plus de 5 secondes, cela s'affichera ici.",
    "sR8yc": "Fermer",
    "sc49my": "Sindhi",
    "sdfk1": "Faire défiler les onglets vers la gauche",
    "sdfk13": "Faire défiler les onglets vers la droite",
    "sglMS": "Créer du temps",
    "sk123": "Pas encore fini",
    "slqcWD": "Cette partie logique n'est pas encore supportée, veuillez rester à l'écoute.",
    "sojBI": "Conversion",
    "spCqEa": "FAIRE",
    "spdh98": "Chinois simplifié",
    "ssDaOq": "Vous êtes nouveau sur LafTools ?",
    "ssm80i": "Basque",
    "svqh06": "azerbaïdjanais",
    "sys_updates": "Dernières mises à jour du système",
    "t63Qw": "Rejeter",
    "t6wczq": "Xhosa",
    "t7m4g": "La caisse 'base32' est utilisée pour l'encodage et le décodage Base32 dans Rust.",
    "t84q1z": "arménien",
    "t8c6xc": "somali",
    "t8z1v": "Lorsqu'il ne reste plus assez de bits à la fin pour remplir un groupe complet de 5 bits, les caractères de remplissage '=' sont ajoutés. Par exemple, un octet nécessite deux caractères Base32 et une séquence de 3 octets nécessiterait quatre caractères Base32.",
    "t9m3g": "CryptoSwift est un package Swift populaire qui inclut des fonctionnalités d'encodage et de décodage Base32.",
    "tBIX-d": "les fenêtres",
    "tEiv_": "Récupération des détails de l'extension",
    "tIy3Q": "J'ai rencontré une erreur",
    "tIyq3Q": "J'ai rencontré une erreur",
    "tR8pY": "Go fournit un package de bibliothèque standard « encoding/base64 » avec des fonctions d'encodage et de décodage Base64. Aucune dépendance externe n'est requise ; importez simplement ce package dans votre programme Go et appelez les fonctions appropriées.",
    "tWe1yF": "Aucune commande shell disponible.",
    "tY3p1": "Plus d'information",
    "tiaiB": "Annuler",
    "tn7duf": "croate",
    "trywithclassicalwebui": "Essayez avec l'interface utilisateur Web classique",
    "ttAre": "Saisissez ici votre mot de passe en clair",
    "tuv23456": "Variante sécurisée d'URL Base64",
    "twamg": "Assistant IA, renforcez votre créativité",
    "tyhgpr": "Javanais",
    "u1i2b": "Quels sont les avantages d’utiliser Base85 par rapport à Base64 ou Base32 ?",
    "u2l8s": "Qu’est-ce que Base45 ?",
    "u3i8b": "Quels sont les avantages d’utiliser Base62 par rapport à Base64 ou Base32 ?",
    "u3j9p": "Base32 est souvent utilisé lorsque vous avez besoin d'une représentation textuelle compacte de données binaires pouvant être saisies ou imprimées sans perte d'informations, comme dans le cadre des contrôles d'intégrité de fichiers, du géocaching et de la génération de mots de passe sécurisés.",
    "u7i9b": "Pour Go, utilisez le package « base62 » disponible sur GitHub.",
    "u7vwx8yz": "Opérations Base64 communes",
    "u8i5b": "Quels sont les avantages d’utiliser Base58 par rapport à Base64 ou Base32 ?",
    "u9g6t": "Pour JavaScript, vous devez installer le package « base85 » pour l'encodage et le décodage Base85.",
    "uCEe8": "Conversion en temps réel",
    "uFcDQ": "Initialisation des données d'état...",
    "uV5Bi": "Impossible de charger l'extension",
    "uVseB": "Appuyez sur {0} pour afficher la liste des touches de raccourci",
    "uW7eZ": "En C, il n’existe pas d’implémentation native Base64. Cet exemple utilise la bibliothèque OpenSSL pour l'encodage et le décodage Base64. Pour utiliser cet extrait de code, installez OpenSSL sur votre système et établissez un lien avec les bibliothèques appropriées lors de la compilation de votre programme à l'aide d'une commande similaire à « gcc -o base64_example base64_example.c -lssl -lcrypto ».",
    "ucDLv": "Vous avez copié cet enregistrement {0} fois",
    "ui5pZ": "Analyseur de commandes",
    "ulah0q": "Japonais",
    "unc9E": "Texte aléatoire",
    "usr_defined": "Préférences de système",
    "uvwxyza1": "Aucune perte de données : puisqu'il s'agit d'un processus réversible, l'encodage Base64 n'entraîne aucune perte d'informations.",
    "uwqGE": "Allez dans Outils",
    "v3k5r": "Le jeu de caractères comprend toutes les lettres majuscules et minuscules (A-Z, a-z) et les chiffres (0-9), offrant une représentation plus compacte par rapport à Base64 ou Base32.",
    "v4k6r": "Il encode les données sous une forme plus compacte par rapport à Base64 ou Base32 en utilisant un jeu de caractères plus grand.",
    "v4n9t": "Base58 est un schéma de codage qui représente les données binaires sous la forme d'une séquence de caractères alphanumériques.",
    "v5k3r": "Une fois installé, remplacez l'espace réservé dans la section de décodage par la chaîne réelle codée en Base85 et exécutez le script. La bibliothèque gère la conversion entre les chaînes Buffers et Base85.",
    "v6qkl": "Le package BouncyCastle NuGet fournit l’encodage et le décodage Base32 en C#.",
    "v7q3db": "thaïlandais",
    "v9b7t": "Remplacez « TEST12345 » par votre propre chaîne et exécutez cette application console pour effectuer les opérations d’encodage et de décodage Base32.",
    "vOjNC": "Entrez le mot de passe ou la clé sécurisée",
    "vTsQU": "Veuillez fournir le code d'invitation de votre administrateur",
    "vU17B": "Impossible d'envoyer la demande",
    "vWqac": "Avant d'entrer dans votre workbench, nous aimerions d'abord précharger les ressources système requises. Veuillez patienter un peu, il sera bientôt terminé, dont les détails sont visibles ci-dessous.",
    "vaP0vq": "Configurez le mot de passe local avec succès.",
    "vci8rd": "Néerlandais",
    "vh9j4": "Saisir",
    "vo1prl": "Espagnol",
    "vr93oi": "finlandais",
    "vrfjnf": "italien",
    "vwx1yza2": "Un exemple consiste à encoder un fichier image pour l'intégrer dans une balise HTML <img> :",
    "w1x4k": "Oui, plusieurs variantes existent, notamment Ascii85 (utilisé dans PostScript et PDF), Z85 (ZeroMQ) et UUencode (un format plus ancien). Chacun a un jeu de caractères et des règles légèrement différents.",
    "w2x9qk": "Bien que Base62 lui-même n'ait pas de variantes significatives, certaines implémentations peuvent différer légèrement dans leur choix de jeu de caractères, comme l'exclusion du « + » ou du « / » couramment utilisés en Base64.",
    "w3x7k": "Oui, certaines variantes populaires incluent Base58Check, qui ajoute une somme de contrôle pour la détection des erreurs, couramment utilisée dans Bitcoin.",
    "w6otqn": "Corse",
    "w92j07": "russe",
    "w9qudj": "Pendjabi",
    "wAxtg": "Initialement, nous avons généré un UUID en tant que jeton autorisé pour vous permettre d'effectuer cette configuration. D'après ce que LafTools a reçu, le token que vous avez fourni est {0}, il a été vérifié par LafTools avec succès et vous pouvez donc continuer à configurer ce formulaire.",
    "wI1eh": "Suivant",
    "wQYoz": "Déposer",
    "wQdYoz": "Modifier",
    "wQdqwYoz": "Voir",
    "wcl1K": "Usage",
    "wgkk6y": "maltais",
    "wj3VS": "Cette opération décode les données d'une chaîne ASCII {0} dans son format brut.",
    "wsWcXd": "Notifications",
    "wxyzabcd": "Il existe une version sécurisée pour les URL de Base64 qui remplace « + » par « - » et « / » par « _ », et omet le remplissage « = », ce qui la rend adaptée aux URL Web.",
    "x009": "Pour accéder à notre documentation d'utilisation",
    "x2c5e": "Python dispose d'un module « base85 » intégré qui prend en charge l'encodage et le décodage Base85.",
    "x2z6r": "Qu’est-ce que Base58 ?",
    "x5alzu": "Kurde (Kurmanji)",
    "x5tHV": "Présentation du système",
    "x5z1b": "Base45 a été développé principalement pour l'utilisation du code QR dans le cadre des certificats numériques COVID.",
    "x6v2w": "Il n'existe pas de bibliothèque Base32 standard en C, nous utilisons donc ici une hypothétique bibliothèque 'libbase32'.",
    "x7n1m": "Base62 est un système de codage qui représente les données binaires sous la forme d'une séquence de 62 caractères alphanumériques.",
    "x8mdg": "Le module « base64 » intégré de Python fournit l'encodage et le décodage Base32 via les fonctions « b32encode » et « b32decode ».",
    "x9g7e": "Téléchargez le code source depuis GitHub (https://github.com/dankamongmen/libbase32) ou installez-le sous forme de package s'il est disponible pour votre plateforme.",
    "x9n1b": "Base85 est un schéma de codage qui représente des données binaires à l'aide d'un ensemble de 85 caractères ASCII imprimables.",
    "xMBv0": "Chargement des ressources associées...",
    "xOJqG1": "Questions fréquemment posées",
    "xPHqP": "La description n'est pas encore définie.",
    "xQ_ls": "Sauvegarde Redis",
    "xbz0B": "Fermer tous les onglets",
    "xbz0B2": "Fermer l'onglet",
    "xdqwe": "Bienvenue à utiliser LafTools !",
    "xeP4zV": "Visualisez rapidement vos éléments TODO",
    "xeP4zVd": "Recherchez rapidement un vocabulaire anglais.",
    "xlqtA": "Retour",
    "xml-bdeautify.desc.2a5f9": "Réduire le code XML",
    "xml-beautify.desc.2a5f9": "Cette opération formate les données XML pour améliorer la lisibilité en ajoutant une indentation appropriée, des sauts de ligne et en garantissant une structure bien formée.",
    "xs22XLF": "Aucune donnée disponible pour cet ID d'article, veuillez envisager de sélectionner d'autres articles.",
    "y3b6n": "Oui, tant que la chaîne codée a été générée conformément à la spécification Base45, tout décodeur conforme devrait être capable de la décoder.",
    "y3m7k": "Pour Java, utilisez la bibliothèque « commons-codec » qui inclut la prise en charge de l'encodage et du décodage Base85.",
    "y3m9k": "Pourquoi Base62 a-t-il été créé ?",
    "y3qjdd": "Votre mot de passe local a été vérifié avec succès.",
    "y5nne": "Ce code peut être exécuté directement dans un environnement Node.js ou dans le cadre d'un projet plus vaste où vous avez besoin de la fonctionnalité Base32.",
    "y6m8k": "Pourquoi Base85 a-t-il été créé ?",
    "y6t1n": "Inconvénients de Base32",
    "y8Ir5": "Cette partie est utilisée pour initialiser votre compte administrateur, cependant, pour l'instant, il n'y a rien à créer ou à ajuster ici car il a été précédemment configuré par votre administrateur, veuillez négliger cette partie et poursuivre vos étapes restantes.",
    "y8b1m": "Remplacez « TEST12345 » par vos propres données et assurez-vous que les fonctions de la bibliothèque sont correctement implémentées et liées pour compiler et exécuter ce programme pour les opérations Base32.",
    "y9m1n": "Pourquoi Base58 a-t-il été créé ?",
    "y9m3k": "Pour Swift, vous pouvez utiliser la bibliothèque 'Base45' disponible sur GitHub.",
    "y9z2e": "Remplacez « TEST12345 » par votre tranche d'octets réelle et exécutez ce programme Go pour encoder et décoder à l'aide de l'encodage standard Base32.",
    "y9z2t": "Exécutez ce script dans un environnement Ruby tel qu'IRB ou enregistrez-le en tant que fichier .rb et exécutez-le avec 'ruby filename.rb'.",
    "yMZW-GEgf": "Formater XML",
    "ySVf-": "Réessayez cette demande",
    "yTsqFO": "L'algorithme MD4 (Message-Digest 4) est une fonction de hachage cryptographique développée par Ronald Rivest en 1990. La longueur du résumé est de 128 bits. L'algorithme a influencé les conceptions ultérieures, telles que les algorithmes MD5, SHA-1 et RIPEMD. La sécurité de MD4 a été gravement compromise.",
    "yVprb": "Cette partie est encore en développement.",
    "y_2Q1": "Encoder et décoder",
    "y_2Q2": "Crypto symétrique",
    "y_2Q3": "Crypto asymétrique",
    "y_2Q4": "Algorithmes nationaux chinois",
    "y_2Q5": "Authentification Web",
    "y_2Q5dqw": "Matcheur de texte",
    "y_9YM": "La sortie sera affichée ici.",
    "y_9YqM": "Chargement des ressources statiques...",
    "y_BN6": "Algorithme de résumé",
    "ya0cwu": "malais",
    "yc7dqiu": "Chinois simplifié",
    "yfYeg": "Modèle de texte",
    "yiRso": "Notes sur le nuage",
    "ykganl": "danois",
    "yqiRso": "Remarques locales",
    "yqrxl4": "serbe",
    "yt7kX2fPQ": "J'ai détecté une exception inattendue",
    "yznU9": "Données d'arborescence vide",
    "z-o28we": "Panneau de processus",
    "z0j2nf": "hindi",
    "z1m2t": "Exemple d'utilisation : `const encoded = bs58.encode('your-data'); const décodé = bs58.decode(encodé);`",
    "z1n5qr": "Les exemples incluent le package base45 npm pour JavaScript et dotnet-base45 pour .NET.",
    "z1oFn": "Évasion et évasion",
    "z2jzej": "Marathi",
    "z2m7t": "Exemple d'utilisation : `const base62 = require('base62'); const encoded = base62.encode('vos-données'); const décodé = base62.decode (encodé);`",
    "z2t7m": "Qu’est-ce que Base85 ?",
    "z2x8c": "Base32 présente moins d'ambiguïtés visuelles puisqu'il utilise uniquement des lettres majuscules et des chiffres, ce qui facilite la lecture et la transcription à la main ou par téléphone par rapport à Base64 qui comprend les lettres « + », « / » et minuscules.",
    "z3m1t": "Après avoir ajouté la dépendance et synchronisé le projet, copiez le modèle fourni dans une classe Kotlin, en remplaçant l'espace réservé par la valeur codée réelle avant d'exécuter le code.",
    "z4t9b": "Qu’est-ce que Base62 ?",
    "z5b7m": "Il utilise un alphabet plus grand (0-9, A-Z, a-z, -, ., $, /, +, %, et *) par rapport à Base64 ou Base32, ce qui donne des chaînes codées plus courtes pour les mêmes données d'entrée.",
    "z5bvb": "Installez-le en exécutant « npm install base32-encoding ». Remplacez « TEST12345 » par les données d'entrée souhaitées dans l'extrait de code.",
    "z5m6t": "Exemple d'utilisation : `const base85 = require('base85'); const encoded = base85.encode('vos-données'); const décodé = base85.decode (encodé);`",
    "z6m1c": "Des variantes ultérieures comme z-base-32 ont été introduites pour améliorer la convivialité, en remplaçant certains caractères moins mémorables par d'autres, mais la spécification originale de Crockford reste largement utilisée aujourd'hui.",
    "z79b1a": "arabe",
    "z7n1m": "Installez-le à l'aide de npm en exécutant `npm install base85` ou `yarn add base85`.",
    "z7t1p": "Existe-t-il des variantes spécifiques de Base62 ?",
    "z8em2t": "Après l'installation, copiez le modèle fourni dans une application console C# et remplacez l'espace réservé par la valeur codée réelle avant d'exécuter le programme.",
    "z8m2t": "Quels sont les avantages d’utiliser Base45 par rapport à Base64 ou Base32 ?",
    "z8n6k": "Remplacez 'TEST12345' par la chaîne souhaitée, compilez et exécutez ce programme pour voir les résultats de l'encodage et du décodage Base32.",
    "z8qm2t": "La bibliothèque fournit des classes d'encodeur et de décodeur pour les opérations Base45. Copiez le code du modèle dans une application console C# et exécutez-le après avoir installé le package.",
    "z8qqm2t": "Après l'installation, copiez le modèle fourni dans une application console C# et remplacez l'espace réservé par la valeur codée réelle avant d'exécuter le programme.",
    "z9b6n": "Ajoutez la dépendance à votre projet Xcode via Swift Package Manager ('https://github.com/krzyzanowskim/CryptoSwift').",
    "z9kVv": "Python possède un module « base64 » intégré qui fournit des méthodes d'encodage et de décodage Base64. La chaîne d'entrée est d'abord convertie en octets à l'aide du codage UTF-8 avant d'être codée en Base64, puis décodée sous sa forme originale.",
    "z9t2p": "Existe-t-il des variantes spécifiques de Base58 ?",
    "z9t7p": "Existe-t-il des variantes spécifiques de Base85 ?",
    "zN2ES": "Espaces de travail",
    "zaSKh": "Rafraîchir",
    "zc3Hf": "Mot de passe",
    "zjDJk": "Veuillez fournir le chemin du répertoire de l'espace de travail",
    "zkqUFa": "{0} n'est pas encore configuré",
    "zkv375": "Khmer",
    "zmDWx": "Contactez-nous",
    "znVRwq": "Des dossiers",
    "zpyd34": "Anglais",
    "zqiIoqXw": "Exécution de calculs...",
    "zwd4v": "Détails de l'extension",
    "zwgYx": "La valeur du mot de passe crypté sera affichée ici.",
    "zyx98765": "Base64 peut-il être utilisé pour la compression ?",
    "zzcepr": "Cebuano"
}