{
    "-8l11": "Copié",
    "-DqwwR": "Opération terminée.",
    "-GJ_72": "Basculé vers l'espace de travail sélectionné {0}",
    "-Jx4J": "Compte local",
    "-Rj3y": "Thèmes",
    "-XZnW": "Dos",
    "-Yo129I": "Outils de texte",
    "-nL_B5PoN": "Compresse {0}",
    "01do0y": "Kannada",
    "04SSf": "Mot de passe oublié?",
    "07naT": "Erreur : {0}",
    "0Ceqru": "Base64 est une notation permettant de coder des données d'octets arbitraires à l'aide d'un ensemble restreint de symboles qui peuvent être facilement utilisés par les humains et traités par des ordinateurs.",
    "0MO3jj": "MD5 (Message-Digest 5) est une fonction de hachage largement utilisée. Il a été utilisé dans diverses applications de sécurité et est également couramment utilisé pour vérifier l'intégrité des fichiers. Cependant, MD5 n'est pas résistant aux collisions et ne convient pas aux applications telles que les certificats SSL/TLS ou les signatures numériques qui reposent sur cette propriété.",
    "0PgZ_": "Traduction",
    "0YKce": "Convertit une chaîne décimale codée binaire (BCD) en nombre décimal.",
    "0gvcN": "Bienvenue sur la page de présentation, elle est encore en développement.",
    "0pfdz7": "Ouzbek",
    "13pmE": "Soutenez-nous",
    "1507oa": "bengali",
    "1JOFP": "Ouvrir mon espace de travail",
    "1NTgQ": "Espace de travail ouvert",
    "1Npez": "Veuillez fournir le chemin",
    "1Tuab": "Copié",
    "1X8x7": "Exemple",
    "1Xe82x7": "{0} Réduire",
    "1Xe8wx7": "Chaîne hexagonale",
    "1Xe8x7": "{0} Embellir",
    "1Xe8x7qe": "BCD",
    "1YmJc": "Sélectionnez l'une des options comme langue préférée :",
    "1bd": "Flux de travail",
    "1e3e5n": "Haoussa",
    "1h6jH": "Attention, la sortie est une valeur vide dont la longueur est nulle !",
    "1j62a": "Fais ça à un autre moment",
    "1k_44": "Cette opération décode les données d'une chaîne ASCII Base64 dans son format brut.",
    "1th2nw": "Cinghalais",
    "20nmcv": "Latin",
    "22XLF": "Pas encore fini",
    "24vLI": "Créé",
    "27j7sy": "Shona",
    "2D9a6": "Mot de passe oublié?",
    "2D9qdk6": "Est-ce suffisamment sécurisé ?",
    "2IF6A": "Il semble que le stockage de sauvegarde de Forge rencontre un problème",
    "2JyFN": "Copier le résultat dans le presse-papiers",
    "2Ocbey": "Version",
    "2RhAT": "Il semble que le processus de récupération de forge rencontre un problème",
    "2Ruh6": "Créer un nouveau compte local",
    "2S5ap": "Basculer en mode plein écran",
    "2bqHk": "Charger à partir d'un fichier",
    "2e4fb7": "Igbo",
    "2giYv": "Tester le mot de passe : {0}",
    "2khdsv": "pachtou",
    "2qdin8": "entrez le code de vérification S'il vous plait",
    "30eo2v": "gujarati",
    "32D9a6": "Créer un compte",
    "33RXi": "La demande a été rejetée en raison de paramètres insatisfaisants.",
    "346qid": "russe",
    "39dsCt": "Vous recevrez la dernière notification des services d'application si vous en avez.",
    "3ii2tt": "Gaélique écossais",
    "3umnB": "Jeton inconnu",
    "441oja": "géorgien",
    "44Ntqw-": "Gestion de l'opération.",
    "46bksi": "lituanien",
    "4K_vhq": "Dupliquer cet onglet",
    "4PIqD": "Révision du code",
    "4UYIJ": "Pas encore terminé.",
    "4cGA_": "Récupération des données pour les préférences système...",
    "4kKe4": "Votre mot de passe",
    "4tqb4x": "hongrois",
    "4vdfwf": "D'ACCORD",
    "4wlih": "La demande a été rejetée en raison de paramètres insatisfaisants.",
    "52OiQ": "Copié {0} fois",
    "54cwb": "L'API Websocket du système a rencontré une erreur : {0}",
    "56ibcj": "vietnamien",
    "58HQX": "Si vous ne connaissez pas sa valeur, veuillez contacter votre administrateur pour plus de détails, qui se trouvent dans ses paramètres.",
    "5BOhl": "code d'invitation",
    "5Ih2u": "Navigateur d'outils",
    "5NCPT": "Mode sombre",
    "5NJeGsu1": "E-Mail, vous pouvez facilement organiser votre boîte de réception, rédiger et envoyer des messages et rester au courant de votre correspondance. Jusqu'à présent, il est utilisé uniquement comme outil de communication entre les utilisateurs et notre équipe.",
    "5NJeddqGsu1": "Cette section comprend du matériel informatique, des articles wiki, des guides d'utilisation, etc.",
    "5NJedqddqGsu1": "Cette section comprend des ressources informatiques qui peuvent être utilisées pour construire vos propres projets.",
    "5Perd": "Désolé, la fonction « Utiliser Smart Editor » n'est pas encore disponible. Nous travaillons toujours à sa mise en œuvre. Merci pour votre patience.",
    "5ZBYR": "Dos",
    "5dF7o": "Rafraîchir",
    "5eXVS": "Contenu du script",
    "5lW8qp": "Montrer un exemple pour cet outil",
    "5q-Zxqa": "Gestionnaire de scripts",
    "5qPOJL": "Pour prendre en charge LafTools, pensez soit à donner une étoile à notre référentiel sur GitHub, soit à passer à notre version professionnelle via un abonnement mensuel. Nous apprécierions grandement votre aide et nous promettons que LafTools deviendra encore meilleur grâce aux fonds collectés.",
    "5qV5Sf": "Supprimer cet enregistrement de la liste",
    "5rg5mt": "malgache",
    "5srFq": "LafOutils",
    "5v8jl7": "Hmong",
    "6AumW": "Action par défaut",
    "6ClPV": "Créer",
    "6MrfIfGc6": "Code Réduire",
    "6UICxHzVR.name": "Embellir {0}",
    "6cOPZ": "Le nombre décimal codé binaire (BCD) est une classe de codages binaires de nombres décimaux dans lesquels chaque chiffre décimal est représenté par un nombre fixe de bits, généralement quatre ou huit. Des modèles de bits spéciaux sont parfois utilisés pour un signe",
    "6hsnqWe": "Bien que LafTools soit gratuit et open source, sa maintenance nécessite néanmoins beaucoup de temps et d'énergie. Nous avons notamment besoin de fonds pour payer certaines API cloud. Si vous appréciez LafTools, pensez à nous soutenir.",
    "6j13s3": "islandais",
    "6qT9d-N": "Pour le notebook, LafTools fournit non seulement un gestionnaire de commandes shell, mais y ajoutera également de puissants outils de notes dans un avenir proche, tels que MarkDown, Latex, {0}, etc.",
    "6ulj8i": "Népalais",
    "6wdtJ4vmg.name.0912": "Réduire {0}",
    "6yOXx": "Nom inconnu",
    "71x7x": "Code source sur GitHub",
    "7MOO1": "Se connecter",
    "7g5w22": "norvégien",
    "7k56u3": "Galicien",
    "7q40W": "Impossible d'initialiser l'administrateur",
    "7u4vzu": "slovaque",
    "7x3f6": "Onglet - 1",
    "82r0C": "Gérez votre liste TODO et faites les choses plus efficacement.",
    "8LdRj": "Aperçu",
    "8LdRjq": "Calculer",
    "8LdevRj": "Service",
    "8M1wY": "Terminal local",
    "8OqB7hN1s": "Cette page fournit un style d'interface utilisateur IDE pour LafTools, un niveau d'abstraction plus élevé pour LafTools.",
    "8eeL1Kk": "À propos",
    "8mn_qa": "Récupération des données des services terminaux...",
    "8qzWJu": "Désolé, nous ne prenons pas encore en charge les appareils à petit écran pour le moment. Veuillez utiliser un PC pour visiter cette page.",
    "97um9v": "hawaïen",
    "98KcL": "Convertit un nombre décimal en nombre décimal codé binaire (BCD).",
    "9_qaj": "Quitter ce formulaire",
    "9e4fcl": "Tamil",
    "9eZHM": "Oops! Il semble que nous rencontrions des avertissements ou des erreurs.",
    "9gqo8x": "letton",
    "9m85mf": "Sésotho",
    "9qy1xn": "Portugais",
    "9zCSc": "Aucun espace de travail disponible",
    "A69UZ": "Variables",
    "AVUvu": "Base62 est une notation permettant de coder des données d'octets arbitraires à l'aide d'un ensemble restreint de symboles qui peuvent être facilement utilisés par les humains et traités par des ordinateurs. La base numérique élevée donne des chaînes plus courtes qu'avec le système décimal ou hexadécimal.",
    "AfPC0": "Votre mot de passe en texte brut",
    "Ahrjc": "Le répertoire n'existe pas, souhaitez-vous le créer ?",
    "AkXgF": "En cours : {0} %",
    "Apx8D": "Comment réinitialiser votre mot de passe manuellement ?",
    "B-GCloBBt": "Compresse le code XML (eXtensible Markup Language).",
    "B0s0z": "Objectif de cette page :",
    "B5NLBB_Je": "Pour des raisons de sécurité, le terminal n'est pas disponible pour le moment. Veuillez rester à l'écoute des mises à jour, merci !",
    "BGd7P9": "Cette opération code les données brutes dans une chaîne ASCII Base64.",
    "BGd7dP9": "Cette opération code les données brutes dans une chaîne ASCII {0}.",
    "BGdd7dP9": "Cette opération code les données brutes dans une chaîne ASCII {0}.",
    "BShq3M": "Problèmes",
    "BuihG": "Les paramètres du système",
    "C3L9MmdDU7": "Manuel",
    "CASef": "C'est bon, l'opération est déclenchée.",
    "CEv8B": "Êtes-vous sûr de supprimer cet enregistrement ? Si oui, cliquez à nouveau sur ce bouton.",
    "CFg8B": "La taille doit être comprise entre 0 et 512",
    "CVUl0": "LafOutils",
    "CfZAX": "Le fichier {0} sélectionné, nous le téléchargeons sur le service principal.",
    "CidOqAZ": "En tant que créateur de LafTools, je suis tellement touché que vous souhaitiez nous soutenir. Nous avons de bonnes personnes dans notre équipe qui travaillent dur pour améliorer continuellement LafTools.",
    "Cide2w": "Pour voir s'il y a un problème lors de l'exécution de votre action.",
    "DIQFq": "Veuillez vérifier si le paramètre URL a été correctement fourni, il semble que vous n'ayez pas l'autorisation de remplir ce formulaire. Par défaut, vous pourrez voir le message ci-dessous dans la sortie du service lors de son lancement.",
    "DIweGq": "Sécurisez vos LafTools",
    "DSEtLTxUU": "Le temps est la monnaie de votre vie, dépensez-le judicieusement.",
    "DTTPW": "Statut de réinitialisation",
    "DVoKw": "Déconnectez-vous de ce système",
    "DqFI5": "Les niveaux doivent être supérieurs à 0",
    "DrXAq": "Bienvenue à utiliser LafTools !",
    "DrbEr": "Le mot de passe que vous avez fourni est vide, veuillez vérifier et réessayer.",
    "DtlAc": "Chargement des ressources système",
    "Dxlw0": "Complet",
    "E62ej": "Commandes du shell de filtre",
    "E6F9B": "Ajoutez-le au flux de travail",
    "EEQkeW": "L'algorithme MD6 (Message-Digest 6) est une fonction de hachage cryptographique. Il utilise une structure arborescente Merkle pour permettre un immense calcul parallèle de hachages pour des entrées très longues.",
    "EO6Qv5dCA": "Réduit le code JSON, réduisez la taille du bundle de votre code JSON.",
    "ERK7E": "Si vous rencontrez un problème ou avez des suggestions lors de l'utilisation de LafTools, n'hésitez pas à nous contacter via EMail ou GitHub à tout moment, nous sommes prêts à l'améliorer de toute urgence.",
    "EgBXL": "Sélectionnez ou fournissez des balises.",
    "Ewvgo": "Pas encore commencé.",
    "ExqvX": "Liste des touches de raccourci",
    "Eyq856": "Nous n'avons pas encore terminé : nous nous engageons à fournir les fonctionnalités les plus récentes et les plus performantes, et nous continuerons à publier des mises à jour pour garantir que vous bénéficiez de la meilleure expérience possible.",
    "F-OUm": "Configuration rapide pour LafTools",
    "F0CCF": "Liste des raccourcis clavier",
    "F4uS2": "Nouveau fichier",
    "FBVyc": "Veuillez saisir à nouveau le code de vérification",
    "FDlRI": "Nommez ce nouvel onglet et cliquez pour le confirmer.",
    "FLsbFsOZq": "EDI",
    "FOyHW": "Rechercher partout",
    "FQzhg": "Ignorer l'entrée vide",
    "FYRoL": "Indente et embellit le code des feuilles de style en cascade (CSS).",
    "FhVWl": "Chiffrez votre mot de passe",
    "FjYbR": "Sortir",
    "Fv-zz": "Copier le résultat",
    "Fy217": "Configurer cet outil",
    "Fzp3t": "Veuillez fournir une valeur dans ce champ",
    "G3MJN": "Afficher le panneau de sortie",
    "G9QVo": "Gérer les onglets",
    "GR7jK": "Taper",
    "Ggob_": "Annuler",
    "H-Ae75": "Veuillez confirmer votre mot de passe local.",
    "H-qA75": "Veuillez fournir un mot de passe local.",
    "H8fQ4": "Basculer en mode clair ou sombre",
    "HEAhr": "Après la traduction, le résultat apparaîtra ici.",
    "HIc3c": "Complété",
    "HNDat": "Pour apporter des modifications, veuillez cliquer sur le bouton \"{0}\". Sinon, cliquez sur \"{1}\" pour appliquer vos modifications. Puissiez-vous passer un bon moment avec cette boîte à outils !",
    "HjvV3": "Nous ne supprimerons pas ses fichiers sur le disque, supprimerons simplement cet enregistrement de la liste.",
    "HyIC_": "Touche barre oblique (/)",
    "HyIC_d": "Touche barre oblique (/)",
    "I8FLi": "Maintenant, il est temps de configurer votre administrateur, veuillez définir le mot de passe aussi complexe que possible afin de pouvoir perplexe ces attaquants impolis.",
    "IAC0A": "Outils de recherche",
    "ICefi": "Annulé",
    "IKqqATS": "Actualiser les données de la page actuelle",
    "IWUH5": "Afficher l'exemple",
    "IaSyO": "Annuler",
    "IfsdGO": "Favoris",
    "ImUmf": "Nouveau",
    "IxAJswoSh": "Analyse et imprime joliment le code JavaScript valide. Fonctionne également avec JavaScript Object Notation (JSON).",
    "J-3KA": "Veuillez fournir un nom pour ce script, ce qui serait plus utile.",
    "J164i": "par exemple. Copier les fichiers sur le serveur distant",
    "J2xoL": "Veuillez consulter l'erreur : {0}",
    "JA_Bp": "Veuillez d'abord fournir un nom pour la nouvelle balise.",
    "JQEVK": "Code",
    "JQLmS": "Ajusté la taille",
    "JQLmSq": "Complété.",
    "JYqxz2": "Bienvenue sur LafTools, ceci est une version initiée.",
    "JdqiUE8": "Cette opération décode les données d'une chaîne ASCII (avec un alphabet de votre choix, préréglages inclus) dans sa forme brute.",
    "JdqidUE8": "Cette opération décode les données d'une chaîne ASCII (avec un alphabet de votre choix, préréglages inclus) dans sa forme brute.",
    "JiUE8": "Cette opération décode les données d'une chaîne ASCII {0} dans son format brut.",
    "K1qJZI": "Bienvenue sur LafTools, Votre Excellence.",
    "KYh1N": "Toutes les notes",
    "KcqrRr": "Référence",
    "KcrRr": "Récupération des données d'implémentation du code",
    "KmEUF": "Fournir un aperçu rapide des outils système actuels.",
    "Kw4OJr": "Terminal",
    "Kyd9H": "Code source sur GitHub",
    "L-p-Y": "Copiez le contenu de la commande shell actuelle dans le presse-papiers",
    "L42mxa": "Veuillez saisir votre texte source dans ce champ.",
    "L49kCq": "Veuillez fournir et confirmer le mot de passe de verrouillage dans ce formulaire pour sécuriser votre LafTools.",
    "L71q_N": "Le mot de passe que vous avez fourni est vide, veuillez vérifier et réessayer.",
    "L9bQku": "Décoder {0}",
    "L9qbQku": "Décoder {0}",
    "LFdvM": "Pas connecté",
    "LM715": "Récupération de la configuration i18n à partir de l'API du serveur local",
    "LSohY6eZW": "Hex String est une chaîne d'octets hexadécimaux séparés par un délimiteur, qui peut être un espace, une virgule, un point-virgule ou deux points.",
    "LU9Jj": "Base85 (également appelé Ascii85) est une notation permettant de coder des données d'octets arbitraires. Il est généralement plus efficace que Base64. Cette opération décode les données d'une chaîne ASCII (avec un alphabet de votre choix, préréglages inclus). Base85 est couramment utilisé dans les formats de fichiers PostScript et PDF d'Adobe.",
    "LWaeFqd": "Passez à votre langue préférée",
    "Le71_N-": "Le mot de passe que vous avez fourni n'est pas le même que celui confirmé, veuillez vérifier et réessayer.",
    "LnJ4H": "Notez que le compte local n'est absolument pas le même que celui de l'utilisateur enregistré sur notre site Web, le premier est défini uniquement sur votre PC tandis que le second peut être utilisé pour la synchronisation cloud.",
    "LqWaFd": "Les paramètres du système",
    "LxaEFHbfa": "Réduit le code SQL, réduisez la taille du bundle de votre code SQL.",
    "M3qytc": "Encoder {0}",
    "M3ytc": "Encoder {0}",
    "M4ywN1": "Calculatrice, calendrier, horloge, météo et bien plus encore.",
    "M7jct": "Passer en mode plein écran",
    "MN2lT": "La longueur du mot de passe ne peut pas être inférieure à 6",
    "Ma5mv": "Basculer la visibilité des onglets de la barre d'outils",
    "Mq9pdpT": "Répertoriez toutes les ressources pertinentes pour le menu fonctionnel que vous avez sélectionné.",
    "Mq9ppT": "Visualisez rapidement l’état de vos services",
    "Mqq9pdpT": "Vous aider à démarrer avec LafTools.",
    "MrgmU": "Confirmer",
    "NMLOn": "Copier le chemin du fichier",
    "NMLOn1": "Espace de travail ouvert",
    "NNfJo": "Charger des données à partir d'un fichier",
    "Nqc0LqwX": "Si vous pensez qu'il existe une vulnérabilité dans ce processus, n'hésitez pas à nous contacter via EMail ou GitHub à tout moment, nous aimerions l'améliorer de toute urgence.",
    "NrQc8OJfZ": "Compresse le code JSON (JavaScript Object Notation).",
    "O94Yx": "sur",
    "OO0qPN": "Exemple chargé",
    "OQWm4": "Signaler un bug",
    "OSHOI": "Page d'accueil",
    "OSqZQM": "Mot de passe local",
    "OeO0PeN": "Bon, l'exemple est affiché dans l'éditeur de saisie.",
    "OeOQY": "FAIRE",
    "Ol1ZcWomT": "{0} Embellir",
    "OpPFe": "Si vous aimez LafTools, partagez-le avec vos amis et donnez-nous une étoile, merci !",
    "Opcty": "Des dossiers",
    "OqqGx2qg": "Chargement des ressources statiques, veuillez patienter...",
    "OrCt5": "Redirection vers l'établi...",
    "Ot6EP": "Outils de polissage",
    "PM_N5": "Séance – {0}",
    "PUxuU": "Récupération des données pour les modules linguistiques...",
    "PpCHA": "Clé des questions (?)",
    "QLKzF": "Il regorge de fonctionnalités qui répondent aux besoins des développeurs débutants et expérimentés, ce qui en fait un outil incontournable dans l'arsenal de tout programmeur.",
    "QM2Ob": "Outils récents",
    "QM2Oq": "Notes récentes",
    "QRAdA": "Anglais vers chinois",
    "QZK58Gemi": "Compresse le code SQL (Structured Query Language).",
    "QhdpH": "Edition communautaire",
    "QkJ-TOduip6z_": "L'EDI LafTools",
    "QzlA3": "Une erreur s'est produite",
    "R12bq": "Liste des onglets qui ne sont pas affichés",
    "RNBze0": "Outils",
    "RNeBze0": "Onglets ouverts",
    "RNewBze0": "Configuration de l'outil",
    "RO4ZP": "Une erreur s'est produite",
    "RPVRl": "Il semble que cette extension ne soit pas compatible avec la version actuelle de LafTools. Veuillez envisager d'installer la dernière version pour prendre en charge cette extension, ou n'hésitez pas à nous contacter en soulevant un problème sur GitHub.",
    "RhqzcdD": "Les paramètres du système",
    "RjCO3": "Liste des espaces de travail",
    "S4MMV": "Oops! Nous avons trouvé quelques problèmes lors du chargement du fichier.",
    "SAnnQ": "Chargement du fichier {0}",
    "SBsDz": "Configuration de votre compte administrateur.",
    "SGs7B": "Configurez rapidement vos LafTools",
    "SMqD13": "Entrez pour filtrer",
    "SPem9": "Ce champ n'est pas encore prêt.",
    "SQAw7": "Langue originelle",
    "SYSq1": "Exemple",
    "SZgXb": "Configurer le mot de passe local",
    "SdGcT": "Autre partie",
    "Sm9tq": "Veuillez fournir le mot de passe du compte ici",
    "Sm9tqq": "Veuillez fournir un mot de passe pour déverrouiller votre LafTools",
    "Spcfdee": "Mode clair ou sombre",
    "TBPqy7": "Langue",
    "TD7DA": "Langues",
    "TNoePE": "Nuage LafTools",
    "Ttrqqet": "Écrivez et enregistrez vos pensées ici !",
    "TwFcr": "Langue cible",
    "TyqvWY3": "Fichier local",
    "U2ZNl": "En savoir plus sur Wikipédia",
    "U4qqq9": "Supprimer cet onglet de la liste",
    "U7zP2": "Veuillez fournir le nom d'utilisateur du compte ici",
    "UF_Dp": "Une erreur s'est produite : {0}, l'heure de rejet est {1}",
    "UVvJp-vtF": "{0} Réduire",
    "UZ2Ig": "Nouveau compte local",
    "V6U_f": "Conditions d'utilisation",
    "V6XEO": "Entrez le nom d'utilisateur ou l'e-mail",
    "VAZq8r": "Il permet aux développeurs d'exécuter diverses commandes, telles que l'exécution de scripts, l'installation de packages et la navigation dans le système de fichiers, le tout depuis l'éditeur.",
    "VEfeqZG": "Remarques",
    "VI6VT": "Histoire",
    "VOsZc": "Signaler un problème",
    "VSZ": "Cliquez pour relancer",
    "VZtqg6": "Créer un nouveau formulaire de script",
    "Vaf2y": "Le nom de l'onglet ne peut pas être vide.",
    "VeY9K": "Conditions d'utilisation",
    "Vvt09V2Qo": "Code générique",
    "WFUWzv_px": "Analyse et imprime joliment le code JavaScript valide. Fonctionne également avec JavaScript Object Notation (JSON).",
    "WPrTW": "Site officiel",
    "WXo6D": "Actualisé",
    "WYCVL": "Installation rapide",
    "X6Fq4j": "Après des années de développement et de perfectionnement, nous sommes convaincus que LafTools peut améliorer considérablement votre expérience de programmation en apportant plus de commodité et d'efficacité à votre flux de travail.",
    "XLWoR": "Sélectionnez votre préféré et continuez",
    "XQxJB": "Mes espaces de travail",
    "X_HGx": "LafTools est une boîte à outils polyvalente conçue pour répondre à divers besoins. Il est entièrement open source, garantissant transparence et sécurité. Malgré son environnement d'exécution léger, il offre une prise en charge complète de la plate-forme, y compris ARMv8, et une prise en charge native de l'IA similaire à ChatGPT. LafTools est hautement intégré à une interface utilisateur productive et est continuellement mis à jour avec de nouveaux outils. Il peut être utilisé sur le Web et avec Docker et fournit des ressources supplémentaires telles que des notes et des manuels.",
    "XeXF77": "Paramètres",
    "Y5GAC": "Ton nom d'utilisateur",
    "Y9mQ2": "Veuillez fournir le nom d'utilisateur du compte ici",
    "YAAU3q": "Mot de passe local",
    "YHCjT": "LafTools prend en charge le thème global clair et sombre, il est particulièrement utile avec les codeurs de nuit.",
    "YNwKz": "Langue non prise en charge : {0}, utilisera l'anglais par défaut.",
    "YOYTp": "Installation rapide",
    "YPPPL": "Basculer la visibilité des onglets des barres d'outils",
    "YQN9u": "Une erreur s'est produite lors du chargement de {0}, veuillez vérifier les détails ci-dessous.",
    "Y__Zb1_4Q": "Réduit le code des feuilles de style en cascade (CSS), en supprimant tous les caractères inutiles.",
    "Y_k0z": "Mot de passe oublié?",
    "Ye3TXses": "Pour configurer si la transformation sera exécutée automatiquement lorsque le texte saisi est modifié.",
    "Ylq2X": "Correction des erreurs",
    "YquQqTXq": "Exécution automatique ?",
    "YrTdq": "Tous",
    "YrVq683": "Mail",
    "YrVqdd683": "Manuels",
    "Z2QTU": "À propos",
    "Z3rhY": "Message",
    "Z7ALO": "Passé à l'espace de travail sélectionné",
    "Z7OTt": "Le fichier que vous avez sélectionné est trop volumineux, veuillez sélectionner un fichier inférieur à 30 Mo.",
    "ZAGva": "Êtes-vous sûr de supprimer cet espace de travail ?",
    "ZAKaFq": "Mon compte Cloud",
    "ZXRGC": "Veuillez consulter l'erreur : {0}",
    "ZbD3F": "{0}, conçu par l'équipe LafTools",
    "Zk7JI": "Ce n'est pas encore pris en charge",
    "ZrbduC": "Fermer tous les onglets",
    "ZrbuC": "Fermer l'onglet",
    "_5OqeG": "Décochez-le",
    "_LFF3": "Si vous rencontrez un problème ou avez des suggestions lors de l'utilisation de LafTools, n'hésitez pas à nous contacter via EMail ou GitHub à tout moment, nous sommes prêts à l'améliorer.",
    "_trqL": "Récupération des données pour les ressources système...",
    "_z3lR": "Actualiser le code",
    "a3yqoz": "persan",
    "a3z-3k12": "Outils d'adresse IP",
    "aCkOP": "Sortie",
    "aHAfR": "Récupération des données pour {0}...",
    "aSOpr": "Générateur de modèles de données",
    "about_LafTools_toolbox": "À propos de LafTools",
    "adpgq": "Créer un nouvel espace de travail",
    "ah-C4": "Nouvelle remarque",
    "aked6": "Les références",
    "aked61": "Introduction",
    "asElV": "Retirer",
    "az4uS2": "Êtes-vous sûr de vous déconnecter de ce système ? Notez que vous serez redirigé vers la page de connexion.",
    "azpNX": "Complété.",
    "b6sx9b": "Philippin",
    "bP_6qG": "Conseils pour avoir oublié votre mot de passe",
    "bT4R6": "Nouvel onglet",
    "bVlBN": "Chinois vers anglais",
    "bhojei1": "Chinois traditionnel",
    "bjZyW": "Traduire",
    "bors14": "turc",
    "bp_-b": "Pour gérer entièrement LafTools, vous devez configurer votre administrateur au début du flux de configuration. Nous avons vérifié votre identification grâce au jeton de paramètre URL. Soyez assuré que personne d'autre ne peut configurer votre autorisation root à moins d'obtenir un jeton de configuration.",
    "bqqrij": "Swahili",
    "bsWpBA73s": "Compresse le code JavaScript.",
    "c0eCw": "Traduisez votre texte dans la langue de votre choix.",
    "c5meku": "Soundanais",
    "c7Uoqqe": "Avant d'utiliser LafTools, veuillez fournir et confirmer votre mot de passe local comme ci-dessous.",
    "cMBqyyFae": "Indente et embellit le code SQL (Structured Query Language).",
    "cNQp_": "Ressources",
    "cOYuMrncv": "Échec de traduction inconnu",
    "cPS6q": "Tous les outils",
    "cQqwI8r": "Chargement de l'état du service Terminal",
    "cU0YAMbxU": "Afficher le texte dans la barre latérale",
    "ciZV2": "Base32 est une notation permettant de coder des données d'octets arbitraires à l'aide d'un ensemble restreint de symboles qui peuvent être facilement utilisés par les humains et traités par des ordinateurs. Il utilise un jeu de caractères plus petit que Base64, généralement l'alphabet majuscule et les chiffres de 2 à 7.",
    "ciZV21": "Base45 est une notation permettant de coder des données d'octets arbitraires à l'aide d'un ensemble restreint de symboles qui peuvent être facilement utilisés par les humains et traités par des ordinateurs. La base numérique élevée donne des chaînes plus courtes qu'avec le système décimal ou hexadécimal. Base45 est optimisé pour une utilisation avec les codes QR.",
    "ciZV2deq1": "Base58 (similaire à Base64) est une notation pour coder des données d'octets arbitraires. Il diffère de Base64 en supprimant les caractères facilement mal lus (c'est-à-dire l, I, 0 et O) pour améliorer la lisibilité humaine. Base58 est couramment utilisé dans les crypto-monnaies (Bitcoin, Ripple, etc.).",
    "cj1pd": "Opération d'actualisation",
    "cjzqj9": "bosniaque",
    "cmxzpg": "Malayalam",
    "coM2I": "Utiliser l'éditeur intelligent",
    "crD7I": "Pour configurer si la transformation doit ignorer le texte d'entrée vide dont la longueur est nulle.",
    "cuRCqb": "La catégorie n'existe pas",
    "cxqhqa": "Myanmar (birman)",
    "d-l2l": "Confirmer",
    "d-qPr": "Disposition inconnue : {0}",
    "d5KZH": "Merci d'utiliser LafTools !",
    "d5LAU": "Sous licence AGPLv3",
    "d5fmq2": "italien",
    "d5hit": "Séance – {0}",
    "dCFIC": "Code plus joli",
    "dCFIwC": "Générateur de codes",
    "dGKMx": "Sortir",
    "dGVUB": "Outils réseau",
    "dQwjNbi0y": "En savoir plus sur la documentation",
    "dV5Eq": "Actualiser la liste des espaces de travail",
    "dk122q": "Gérez vos flux de travail pour combiner plusieurs outils ensemble.",
    "dkarh": "Okie, la boîte à outils a ouvert le répertoire. Si aucune fenêtre contextuelle ne s'affiche, veuillez vérifier si votre plate-forme prend en charge cette fonction ou si le répertoire se trouve sur le serveur.",
    "dkkq12": "Configurez votre outil dans cet onglet.",
    "dl4kr": "Mot de passe oublié?",
    "dpRY4": "Dictionnaire",
    "dqTqyvWY": "Menu du tiroir",
    "dsdpA_eJ": "Ajuster la taille",
    "dtjdt4": "Kazakh",
    "dxLQq": "Autorisation racine",
    "dzjTo": "Veuillez fournir le mot de passe du compte ici",
    "e3WgQaZlb": "Compresse {0}",
    "e4Cd8t": "Base85",
    "e5rycw": "Kirghize",
    "e8Crq": "Veuillez remplir les champs ci-dessous pour votre nom d'utilisateur et votre mot de passe pour continuer.",
    "eTmq": "Histoire de CodeGen ToolBox",
    "e_8pZ": "Une boîte à outils polyvalente permettant aux développeurs d'améliorer leur productivité.",
    "egkqC8t": "Base58",
    "egkqCd8t": "Base62",
    "eifoni": "catalan",
    "eqkqd4W": "Veuillez fournir un nom pour la nouvelle balise",
    "etV-l": "Copier des fichiers sur SIT2",
    "eu5mh0": "biélorusse",
    "euaI8": "Créer un nouveau compte local",
    "euhy9v": "estonien",
    "f3ttw8": "Maori",
    "f5bLC": "Documentation",
    "fBP5h": "Nom d'utilisateur",
    "fEr5j": "Créer un nouveau script",
    "fV_1P": "Se connecter",
    "fdxluz": "roumain",
    "ff02c": "Annulé",
    "fgj880": "Télougou",
    "fqV_1P": "Débloquez vos LafTools",
    "g2_aX": "Copiez le mot de passe crypté dans le fichier",
    "g5SK9": "Ouverte récente",
    "gDjbs": "Données historiques",
    "gK3dNQ": "Copie",
    "gQhfS": "Outils de fichiers",
    "gU1O2": "Déclenché",
    "generic-NI-UFPTe0": "Embellir le code générique",
    "generic-code-beautify.desc.2b3c": "Cette opération formate le code dans divers langages de programmation pour améliorer la lisibilité en appliquant une indentation cohérente, des sauts de ligne et en respectant les directives de style spécifiques au langage.",
    "gkC8t": "Base64",
    "gkdqqC8t": "Base45",
    "gkqC8t": "Base32",
    "gms7_9n5v": "Convertit une chaîne d'octets hexadécimaux en sa valeur brute.",
    "gnKMZ": "Rafraîchi.",
    "h6AeI": "Connexion Websocket fermée à {0}",
    "hJUMN": "Langue cible",
    "hMvh1": "Base de données de sauvegarde",
    "hRFxV": "Pour plus d'information, veuillez visiter notre site web",
    "hX1CWGAhl": "Indente et embellit le code XML (eXtensible Markup Language).",
    "hcnt1k": "Macédonien",
    "hhOT3": "Rechercher par nom",
    "htTmvWjsS": "Compresse le code CSS (Cascading Style Sheets).",
    "htt1d2": "espéranto",
    "hu-iz": "Minuteur",
    "huE6U": "Variable",
    "hyV-d": "Fait",
    "hyirc0": "suédois",
    "i27qmr": "frison",
    "i6hMN": "Code de vérification des images",
    "i88tb": "Exporter le résultat vers un fichier",
    "i8q8tb": "Configurer WorkFlow pour l'entrée",
    "iNqF1T": "Gérer le compte cloud",
    "iOEjZ": "Aucun code disponible",
    "i_lang_": "Packs de langue",
    "iknTS": "Gestionnaire de mots de passe",
    "init_env": "Chargement des ressources système",
    "ip2g1": "Copié",
    "ipOSQE": "Édition Pro",
    "it8ths": "indonésien",
    "ixyP0": "Traitement automatique de l'action en temps réel",
    "jJuNz": "Langue originelle",
    "jO5eP": "D'ACCORD",
    "jPNCb": "Réessayé.",
    "jQXdi": "Mode lumière",
    "jR1zX": "Laboratoire d'IA",
    "jb392": "Nom",
    "jfpqt": "Navigateur de notes",
    "jgDoEq": "Aucune donnée FAQ",
    "jhDoE": "Récupération des données FAQ",
    "jlxvpk": "coréen",
    "json-beautify.desc.0912": "Cette opération formate les données JSON pour améliorer la lisibilité en ajoutant une indentation appropriée, des sauts de ligne et en triant les clés de manière cohérente.",
    "json-beautify.name.0912": "Formater SQL",
    "json-beautify.text.93kq": "Embellir les données JSON",
    "k17PG": "Connexion Websocket fermée.",
    "k2SVY": "désactivé",
    "k2ku5p": "tchèque",
    "k41a5": "LafOutils",
    "k4s5rx": "slovène",
    "kLH79": "E-mail",
    "kOi5A": "Imprimer la page",
    "kPD22": "Dictionnaire",
    "kPJ-A4": "Rafraîchir",
    "kcHxr": "Veuillez fournir le nom d'utilisateur du compte administrateur ici",
    "kjks1": "Récupération de la configuration i18n à partir de l'API du serveur local",
    "kqv5ht": "yiddish",
    "krxSK": "Assistant IA",
    "ks12d": "La cyber-sécurité",
    "kv4wag": "Néerlandais",
    "l3akoa": "Amharique",
    "l6Djb": "Sélectionnez l'une des options comme thème préféré :",
    "lIn3_": "Nom d'utilisateur administrateur",
    "lQFII": "Re-déclencher l'initialisation",
    "lRHDQ": "Quitter le mode plein écran",
    "lUh5c": "Générateur",
    "lkuulh": "Français",
    "lp0qmd0": "Marquez-le comme favori",
    "lpKAz": "Paramètres",
    "lpzg83": "Samoan",
    "m0106": "Convertisseur",
    "m0107": "Générateur",
    "m0108": "Formateur",
    "m7WZw": "Websocket système cassé",
    "m8rTc1": "Une fois le gestionnaire de scripts shell implémenté, vous pouvez l'utiliser pour gérer vos commandes shell.",
    "mBgF1": "Action de la souris",
    "mSFei": "Code source sur GitHub",
    "mWXeh": "ID de l'espace de travail : {0}",
    "mabHq": "Rechercher d'anciens fichiers",
    "mbzCv": "Une erreur s'est produite : {0}, l'heure de rejet est {1}",
    "md2.desc.1039": "Cette opération hache les données dans un hachage {0}.",
    "md2.text.192d3": "Générer {0} hachage",
    "md2aO2NaJITm": "Indente et embellit le code des feuilles de style en cascade (CSS), le rendant plus facile à lire et à comprendre.",
    "md4.desc.1039": "Cette opération hache les données dans un hachage {0}.",
    "md4.text.192d3": "Générer {0} hachage",
    "md5.desc.rxsHq": "Cette opération hache les données dans un hachage {0}.",
    "md5.textiDjMIo": "Générer {0} hachage",
    "md6.desc.1039": "Cette opération hache les données dans un hachage {0}.",
    "md6.text.192d3": "Générer {0} hachage",
    "meeMC1Uk7.text.93kq": "Réduire {0}",
    "mihc3": "Terminé cette opération",
    "mjHoR": "De plus, techniquement, personne ne peut lire ce jeton sinon il aurait attaqué et contrôlé votre ordinateur.",
    "mnb19i": "Allemand",
    "mslw4o": "grec",
    "mwn7iv": "zoulou",
    "myxedr": "mongol",
    "n1jA9": "Confirmer",
    "nSeIq8-": "Plus important encore, c'est gratuit et open source. Vous pouvez l'utiliser à des fins personnelles ou commerciales.",
    "nTvw4": "Pour protéger et enregistrer séparément vos données et paramètres, vous pouvez utiliser votre compte local pour y parvenir. En outre, LafTools prendra à l’avenir en charge les widgets de messagerie instantanée entre les utilisateurs.",
    "nmb1wx": "Yorouba",
    "nodBw": "Cette opération code les données brutes dans une chaîne ASCII {0}.",
    "nrix6l": "Chichewa",
    "nxJC7": "L'action par défaut à exécuter lorsque le transformateur est effectué.",
    "o52xW": "Exporter",
    "o8xyzu": "luxembourgeois",
    "oBz8D": "Chargement",
    "oNLxH": "Nom d'utilisateur",
    "oNg3f": "Site officiel",
    "ocxsw3": "irlandais",
    "of_ox": "Dans l’ensemble, LafTools est une solution unique pour tous vos besoins.",
    "oj23X": "Restaurer la base de données",
    "ojCWEFdVe": "Compresse le code JavaScript, en supprimant tous les caractères inutiles.",
    "ooiFU": "Redémarrer le service Java",
    "oqHqVq": "Trier par",
    "oqHqqV": "Total : {0} commandes",
    "oqHqqVq": "Temps de copie",
    "oqjbcj": "Laotien",
    "os8h6u": "danois",
    "p8Exxc1s": "Il existe divers outils qui exploitent les technologies d’IA pour effectuer des tâches plus efficacement dans AI Laboratory.",
    "pANmj": "Les balises peuvent être définies en fonction des types de serveurs, des utilisations des scripts ou de tout autre critère que vous préférez.",
    "pA_deJ": "Exporter vers le Presse-papiers",
    "pA_feeJ": "Reconnecter le terminal",
    "pA_qweJ": "Effacer le tampon",
    "pDBSWq": "aucun contenu disponible pour le panneau de droite",
    "pEk1kk": "LafTools vous présente ici des fonctionnalités utiles.",
    "pEk1qkk": "Lister tous les onglets ouverts",
    "pJoOz": "Fichier ouvert",
    "pKHRT": "Allez dans Outils",
    "pKqHRq": "Notes de recherche",
    "pL6qH": "Complété.",
    "pZ4d616m-": "Embellir {0}",
    "ph5jH": "Manipulation de cette partie",
    "piih4x": "tadjik",
    "pmnp4b": "ukrainien",
    "ppmz8e": "Créole haïtien",
    "pqs7y3": "Veuillez envisager d'enregistrer cette page Web en tant que PWA pour bénéficier d'une prise en charge complète du clavier.",
    "psA_eJ": "Exporter sous forme de fichier",
    "psZoP": "Déposez les fichiers ici pour les traiter",
    "psqqpq_o": "D'accord, le résultat a été copié dans votre presse-papiers {0} fois.",
    "pzn2IpkDo": "Indentations et jolies impressions du code JavaScript Object Notation (JSON).<br><br>Tags : visionneuse JSON, prettify, coloration syntaxique",
    "q12beqwR": "Aucun outil disponible",
    "q29t31": "polonais",
    "q9iuti": "gallois",
    "qDrbEr": "Le nom d'utilisateur que vous avez fourni est vide, veuillez vérifier et réessayer.",
    "qF4uS2": "Créer un espace de travail",
    "qF4uS23": "Nouvelle fenetre",
    "qHoktx": "Merci!",
    "qN1LdZ2": "Dernière modification",
    "qQmBr": "Traduction de texte",
    "qTqyvWdY": "Pas encore fini",
    "qWemXE4": "1er janvier 2024",
    "qWw3eTH": "Cette partie permet de conserver les fichiers sur votre disque local ou votre disque cloud.",
    "qdeFXx": "Actuellement, la page que vous recherchez n'est pas encore entièrement mise en œuvre.",
    "qpDBSW": "aucun panneau disponible",
    "qpDBSWe1": "aucun panneau disponible",
    "qqK_x_": "Se connecter",
    "qqqwYoz": "Aide",
    "qqwYoz": "Onglets",
    "qqwYqwe": "Espaces de travail",
    "qtpmvP": "Confirmer le mot de passe local",
    "qzshys": "Ourdou",
    "r1GLS": "Mots clés",
    "rE6fUsSGl": "Indente et embellit le code SQL (Structured Query Language).",
    "rK6cx": "{0}, conçu et développé par l'équipe LafTools",
    "rQkas": "Bienvenue sur LafTools",
    "rT34qnO": "Saisissez le texte à traiter. Le résultat s'affichera dans l'éditeur de sortie.",
    "rVqlu": "Décoder {0}",
    "rYSpwq": "L'algorithme MD2 (Message-Digest 2) est une fonction de hachage cryptographique développée par Ronald Rivest en 1989. L'algorithme est optimisé pour les ordinateurs 8 bits. Bien que MD2 ne soit plus considéré comme sécurisé, même depuis 2014, il reste utilisé en public. infrastructures clés dans le cadre des certificats générés avec MD2 et RSA. L'algorithme de résumé de message se compose, par défaut, de 18 tours.",
    "r_n6h": "Mode clair ou sombre",
    "rf0mql3": "Thème clair ou sombre",
    "rub76Z8zx": "Tentatives d'impression de langages de style C tels que C, C++, C#, Java, PHP, JavaScript, etc. Cela ne fera pas un travail parfait et le code résultant risque de ne plus fonctionner. Cette opération est uniquement conçue pour rendre le code obscurci ou réduit plus facile à lire et à comprendre. Choses qui ne fonctionneront pas correctement : For formatage de boucle, formatage de boucle Do-While, indentation Switch/Case, certains opérateurs de décalage de bits",
    "run_text": "Avant d'entrer dans votre workbench, nous aimerions d'abord précharger les ressources système requises. Veuillez patienter un peu, il sera bientôt terminé, dont les détails sont visibles ci-dessous.",
    "rycJy": "LafTools est une boîte à outils polyvalente spécialement conçue pour les programmeurs. Il représente la deuxième version de CodeGen Toolbox, désormais avec un runtime plus léger écrit en Golang et JavaScript.",
    "ryhkqb": "bulgare",
    "s-fxP80Dd": "L'EDI LafTools",
    "s0vrf9": "hébreu",
    "s4OeX": "Connectez-vous au système avec succès",
    "sHoxxW": "Histoire",
    "sO0MOe": "Chaque fois que vous restez dans une fenêtre plus de 5 secondes, cela s'affichera ici.",
    "sR8yc": "Fermer",
    "sc49my": "Sindhi",
    "sdfk1": "Faire défiler les onglets vers la gauche",
    "sdfk13": "Faire défiler les onglets vers la droite",
    "sglMS": "Créer du temps",
    "sk123": "Pas encore fini",
    "slqcWD": "Cette partie logique n'est pas encore supportée, veuillez rester à l'écoute.",
    "spCqEa": "FAIRE",
    "ssDaOq": "Vous êtes nouveau sur LafTools ?",
    "ssm80i": "Basque",
    "svqh06": "azerbaïdjanais",
    "sys_updates": "Dernières mises à jour du système",
    "t6wczq": "Xhosa",
    "t84q1z": "arménien",
    "t8c6xc": "somali",
    "tBIX-d": "les fenêtres",
    "tIy3Q": "J'ai rencontré une erreur",
    "tIyq3Q": "J'ai rencontré une erreur",
    "tWe1yF": "Aucune commande shell disponible.",
    "tY3p1": "Plus d'information",
    "tiaiB": "Annuler",
    "tn7duf": "croate",
    "trywithclassicalwebui": "Essayez avec l'interface utilisateur Web classique",
    "ttAre": "Saisissez ici votre mot de passe en clair",
    "twamg": "Assistant IA, renforcez votre créativité",
    "tyhgpr": "Javanais",
    "uVseB": "Appuyez sur {0} pour afficher la liste des touches de raccourci",
    "ucDLv": "Vous avez copié cet enregistrement {0} fois",
    "ui5pZ": "Analyseur de commandes",
    "ulah0q": "Japonais",
    "unc9E": "Texte aléatoire",
    "usr_defined": "Préférences de système",
    "uwqGE": "Allez dans Outils",
    "v7q3db": "thaïlandais",
    "vOjNC": "Entrez le mot de passe ou la clé sécurisée",
    "vTsQU": "Veuillez fournir le code d'invitation de votre administrateur",
    "vU17B": "Impossible d'envoyer la demande",
    "vWqac": "Avant d'entrer dans votre workbench, nous aimerions d'abord précharger les ressources système requises. Veuillez patienter un peu, il sera bientôt terminé, dont les détails sont visibles ci-dessous.",
    "vaP0vq": "Configurez le mot de passe local avec succès.",
    "vh9j4": "Saisir",
    "vo1prl": "Espagnol",
    "vr93oi": "finlandais",
    "w1ANqKoBf": "Masquer le texte dans la barre latérale",
    "w6otqn": "Corse",
    "w9qudj": "Pendjabi",
    "wAxtg": "Initialement, nous avons généré un UUID en tant que jeton autorisé pour vous permettre d'effectuer cette configuration. D'après ce que LafTools a reçu, le token que vous avez fourni est {0}, il a été vérifié par LafTools avec succès et vous pouvez donc continuer à configurer ce formulaire.",
    "wI1eh": "Suivant",
    "wQYoz": "Déposer",
    "wQdYoz": "Modifier",
    "wQdqwYoz": "Voir",
    "wcl1K": "Usage",
    "wgkk6y": "maltais",
    "wj3VS": "Cette opération décode les données d'une chaîne ASCII {0} dans son format brut.",
    "wsWcXd": "Notifications",
    "x009": "Pour accéder à notre documentation d'utilisation",
    "x5alzu": "Kurde (Kurmanji)",
    "x5tHV": "Présentation du système",
    "xMBv0": "Chargement des ressources associées...",
    "xOJqG1": "Questions fréquemment posées",
    "xPHqP": "La description n'est pas encore définie.",
    "xQ_ls": "Sauvegarde Redis",
    "xbz0B": "Fermer tous les onglets",
    "xbz0B2": "Fermer l'onglet",
    "xdqwe": "Bienvenue à utiliser LafTools !",
    "xeP4zV": "Visualisez rapidement vos éléments TODO",
    "xeP4zVd": "Recherchez rapidement un vocabulaire anglais.",
    "xml-bdeautify.desc.2a5f9": "Réduire le code XML",
    "xml-beautify.desc.2a5f9": "Cette opération formate les données XML pour améliorer la lisibilité en ajoutant une indentation appropriée, des sauts de ligne et en garantissant une structure bien formée.",
    "xs22XLF": "Aucune donnée disponible pour cet ID d'article, veuillez envisager de sélectionner d'autres articles.",
    "y3qjdd": "Votre mot de passe local a été vérifié avec succès.",
    "y8Ir5": "Cette partie est utilisée pour initialiser votre compte administrateur, cependant, pour l'instant, il n'y a rien à créer ou à ajuster ici car il a été précédemment configuré par votre administrateur, veuillez négliger cette partie et poursuivre vos étapes restantes.",
    "yMZW-GEgf": "Formater XML",
    "ySVf-": "Réessayez cette demande",
    "yTsqFO": "L'algorithme MD4 (Message-Digest 4) est une fonction de hachage cryptographique développée par Ronald Rivest en 1990. La longueur du résumé est de 128 bits. L'algorithme a influencé les conceptions ultérieures, telles que les algorithmes MD5, SHA-1 et RIPEMD. La sécurité de MD4 a été gravement compromise.",
    "yVprb": "Cette partie est encore en développement.",
    "y_2Q1": "Encoder et décoder",
    "y_2Q2": "Crypto symétrique",
    "y_2Q3": "Crypto asymétrique",
    "y_2Q4": "Algorithmes nationaux chinois",
    "y_2Q5": "Authentification Web",
    "y_2Q5dqw": "Matcheur de texte",
    "y_9YM": "La sortie sera affichée ici.",
    "y_9YqM": "Chargement des ressources statiques...",
    "y_BN6": "Algorithme de résumé",
    "ya0cwu": "malais",
    "yc7dqiu": "Chinois simplifié",
    "yfYeg": "Modèle de texte",
    "yiRso": "Notes sur le nuage",
    "yqiRso": "Remarques locales",
    "yqrxl4": "serbe",
    "yznU9": "Données d'arborescence vide",
    "z-o28we": "Panneau de processus",
    "z0j2nf": "hindi",
    "z1oFn": "Évasion et évasion",
    "z2jzej": "Marathi",
    "z79b1a": "arabe",
    "zN2ES": "Espaces de travail",
    "zc3Hf": "Mot de passe",
    "zjDJk": "Veuillez fournir le chemin du répertoire de l'espace de travail",
    "zkqUFa": "{0} n'est pas encore configuré",
    "zkv375": "Khmer",
    "zmDWx": "Contactez-nous",
    "znVRwq": "Des dossiers",
    "zpyd34": "Anglais",
    "zqiIoqXw": "Exécution de calculs...",
    "zzcepr": "Cebuano"
}