{
    "": "Pesan: {0}",
    "-8l11": "Disalin",
    "-DqwwR": "Operasi Selesai.",
    "-GJ_72": "Beralih ke ruang kerja yang dipilih {0}",
    "-Jx4J": "Akun Lokal",
    "-Rj3y": "Tema",
    "-XZnW": "Kembali",
    "-Yo129I": "Alat Teks",
    "-nL_B5PoN": "Kompres {0}",
    "01do0y": "Kannada",
    "04SSf": "Tidak ingat kata sandi?",
    "07naT": "Kesalahan: {0}",
    "07ui6": "Info lebih lanjut",
    "0Ceqru": "Base64 adalah notasi untuk menyandikan data byte arbitrer menggunakan serangkaian simbol terbatas yang mudah digunakan oleh manusia dan diproses oleh komputer.",
    "0MO3jj": "MD5 (Message-Digest 5) adalah fungsi hash yang banyak digunakan. Ini telah digunakan dalam berbagai aplikasi keamanan dan juga biasa digunakan untuk memeriksa integritas file. Namun, MD5 tidak tahan benturan dan tidak cocok untuk aplikasi seperti sertifikat SSL/TLS atau tanda tangan digital yang mengandalkan properti ini.",
    "0PgZ_": "Terjemahan",
    "0YKce": "Mengonversi string Desimal Berkode Biner (BCD) menjadi angka desimal.",
    "0gvcN": "Selamat datang di halaman ikhtisar, ini masih dalam pengembangan.",
    "0pfdz7": "Uzbekistan",
    "123e4567": "Apa itu Base64?",
    "13pmE": "Dukung Kami",
    "1507oa": "Benggala",
    "1JOFP": "Buka Ruang Kerja Saya",
    "1NTgQ": "Buka Ruang Kerja",
    "1Npez": "Tolong berikan jalannya",
    "1Tuab": "Disalin",
    "1X8x7": "Contoh",
    "1Xe82x7": "{0} Perkecil",
    "1Xe8wx7": "Tali Heksa",
    "1Xe8x7": "{0} Mempercantik",
    "1Xe8x7qe": "BCD",
    "1YmJc": "Pilih salah satu opsi sebagai bahasa pilihan Anda:",
    "1a2b3c4d": "Mengapa menggunakan Base64?",
    "1a3Sc": "Batalkan Memuat",
    "1bd": "Alur kerja",
    "1e3e5n": "rumah",
    "1h6jH": "Peringatan, outputnya adalah nilai kosong yang panjangnya nol!",
    "1j62a": "Lakukan ini di lain waktu",
    "1jj0ri": "Jepang",
    "1k_44": "Operasi ini menerjemahkan data dari string ASCII Base64 kembali ke format mentahnya.",
    "1th2nw": "Sinhala",
    "1yIQu": "Anda dapat mencoba memproses ulang tindakan Anda atau klik tombol di bawah untuk menghilangkan kesalahan.",
    "20nmcv": "Latin",
    "22XLF": "Belum selesai",
    "23fgh456": "Sejarah Base64",
    "24vLI": "Dibuat",
    "27j7sy": "Shona",
    "2D9a6": "Tidak ingat kata sandi?",
    "2D9qdk6": "Apakah Cukup Aman?",
    "2IF6A": "Sepertinya penyimpanan penyimpanan palsu mengalami beberapa masalah",
    "2JyFN": "Salin Hasil ke Clipboard",
    "2Ocbey": "Versi: kapan",
    "2RhAT": "Sepertinya proses pengambilan palsu mengalami beberapa masalah",
    "2Ruh6": "Buat Akun Lokal Baru",
    "2S5ap": "Alihkan Mode Layar Penuh",
    "2Y1mR": "Teks bersih",
    "2bcde3fg": "Kekurangan Base64",
    "2bqHk": "Muat dari File",
    "2e4fb7": "Igbo",
    "2giYv": "Uji Kata Sandi: {0}",
    "2khdsv": "pasto",
    "2lehqwp": "Orang Vietnam",
    "2lhcqwp": "Turki",
    "2lhqqwp": "bahasa Indonesia",
    "2lhqqwqp": "Melayu",
    "2lhqwwp": "Thai",
    "2qdin8": "Silakan masukkan kode verifikasi",
    "2tib5m": "Orang Swedia",
    "2ybu7j": "Norwegia",
    "30eo2v": "Gujarati",
    "32D9a6": "Buat sebuah akun",
    "33RXi": "Permintaan ditolak karena parameter tidak memuaskan.",
    "346qid": "Rusia",
    "34wxyz56": "Bagaimana cara menyandikan/mendekode Base64 dalam JavaScript?",
    "39dsCt": "Anda akan menerima pemberitahuan terbaru dari layanan aplikasi jika ada.",
    "3ii2tt": "Gaelik Skotlandia",
    "3umnB": "Tanda tidak diketahui",
    "441oja": "orang Georgia",
    "44Ntqw-": "Menangani operasi.",
    "46bksi": "Lithuania",
    "4K_vhq": "Gandakan tab ini",
    "4PIqD": "Tinjauan Kode",
    "4UYIJ": "Belum selesai.",
    "4cGA_": "Mengambil data untuk preferensi sistem...",
    "4hijk5lm": "Peningkatan Ukuran: Data yang dikodekan kira-kira 33% lebih besar dari data biner asli.",
    "4kKe4": "Kata sandi Anda",
    "4tqb4x": "Hongaria",
    "4vdfwf": "OKE",
    "4wlih": "Permintaan ditolak karena parameter tidak memuaskan.",
    "52OiQ": "Disalin {0} kali",
    "54cwb": "API Websocket Sistem mengalami kesalahan: {0}",
    "56ibcj": "Orang Vietnam",
    "58HQX": "Jika Anda tidak mengetahui nilainya, harap hubungi administrator Anda untuk detail lebih lanjut, yang dapat ditemukan di pengaturannya.",
    "5BOhl": "Kode Undangan",
    "5Ih2u": "Alat Navigator",
    "5NCPT": "Mode Gelap",
    "5NJeGsu1": "E-Mail, Anda dapat dengan mudah mengatur kotak masuk, menulis dan mengirim pesan, serta memantau korespondensi Anda. Selama ini hanya digunakan sebagai alat komunikasi antara pengguna dan tim kami.",
    "5NJeddqGsu1": "Bagian ini mencakup materi komputer, artikel wiki, panduan penggunaan, dan banyak lagi.",
    "5NJedqddqGsu1": "Bagian ini mencakup sumber daya komputer yang dapat digunakan untuk membangun proyek Anda sendiri.",
    "5Perd": "Maaf, fungsi 'Gunakan Editor Cerdas' belum tersedia. Kami masih berupaya menerapkannya. Terima kasih atas kesabaran Anda.",
    "5ZBYR": "Kembali",
    "5dF7o": "Menyegarkan",
    "5e6f7g8h": "Base64 digunakan ketika data biner perlu dikirim melalui protokol berbasis teks seperti email atau JSON, atau disematkan di tempat yang hanya mengizinkan teks.",
    "5eXVS": "Isi Naskah",
    "5ggegx": "Korea",
    "5lW8qp": "Tunjukkan contoh alat ini",
    "5q-Zxqa": "Manajer Skrip",
    "5qPOJL": "Untuk mendukung LafTools, pertimbangkan untuk memberi bintang pada repositori kami di GitHub atau meningkatkan ke versi profesional kami melalui langganan bulanan. Kami sangat menghargai bantuan Anda, dan kami berjanji LafTools akan menjadi lebih baik lagi dengan dana yang terkumpul.",
    "5qV5Sf": "Hapus catatan ini dari daftar",
    "5rg5mt": "Malagasi",
    "5srFq": "alat laf",
    "5v8jl7": "Hmong",
    "6AumW": "Tindakan Bawaan",
    "6ClPV": "Membuat",
    "6MrfIfGc6": "Perkecil Kode",
    "6UICxHzVR.name": "Mempercantik {0}",
    "6cOPZ": "Desimal Berkode Biner (BCD) adalah kelas pengkodean biner angka desimal di mana setiap digit desimal diwakili oleh sejumlah bit tetap, biasanya empat atau delapan. Pola bit khusus terkadang digunakan untuk sebuah tanda",
    "6hsnqWe": "Meskipun LafTools gratis dan open source, pemeliharaannya tetap memerlukan banyak waktu dan tenaga. Secara khusus, kami memerlukan dana untuk membayar API cloud tertentu. Jika Anda menghargai LafTools, mohon pertimbangkan untuk mendukung kami.",
    "6j13s3": "Islandia",
    "6nopqrst": "Tanpa Enkripsi: Base64 bukanlah metode enkripsi; itu mudah diterjemahkan dan tidak memberikan keamanan.",
    "6qT9d-N": "Untuk notebook, LafTools tidak hanya menyediakan pengelola perintah shell, tetapi juga akan menambahkan alat catatan canggih ke dalamnya dalam waktu dekat seperti MarkDown, Latex, {0}, dan seterusnya.",
    "6ulj8i": "Nepal",
    "6wdtJ4vmg.name.0912": "Perkecil {0}",
    "6yOXx": "Nama Tidak Dikenal",
    "71x7x": "Kode Sumber di GitHub",
    "78abcdef": "JavaScript menawarkan fungsi bawaan seperti btoa() dan atob() untuk pengkodean dan decoding Base64.",
    "78ijk9lm": "Base64 pertama kali didefinisikan dalam RFC 1421 (1993) dan kemudian distandarisasi dalam RFC 4648 (2006).",
    "7MOO1": "Masuk",
    "7dm0d8": "Cina tradisional",
    "7g5w22": "Norwegia",
    "7k56u3": "Galisia",
    "7q40W": "Tidak dapat menginisialisasi administrator",
    "7u4vzu": "Orang Slovakia",
    "7x3f6": "Tab - 1",
    "82r0C": "Kelola daftar TODO Anda, dan selesaikan segala sesuatunya dengan lebih efisien.",
    "83dNp": "Tidak Dapat Memuat ID Ekstensi. (REF: 1dl1f)",
    "8LdRj": "Ringkasan",
    "8LdRjq": "Menghitung",
    "8LdevRj": "Melayani",
    "8M1wY": "Terminal Lokal",
    "8OqB7hN1s": "Halaman ini menyediakan gaya IDE UI untuk LafTools, tingkat abstraksi yang lebih tinggi untuk LafTools.",
    "8eeL1Kk": "Tentang",
    "8mn_qa": "Mengambil data dari layanan terminal...",
    "8qzWJu": "Maaf, saat ini kami belum mendukung perangkat layar kecil, silakan gunakan PC untuk mengunjungi halaman ini.",
    "97um9v": "Hawaii",
    "98KcL": "Mengonversi bilangan desimal menjadi Desimal Berkode Biner (BCD).",
    "9Xv8-": "Simpan Sebagai Catatan",
    "9_qaj": "Keluar dari Formulir ini",
    "9e4fcl": "Tamil",
    "9eZHM": "Ups! Sepertinya kami menemui beberapa peringatan atau kesalahan.",
    "9gqo8x": "Latvia",
    "9i0j1k2l": "Ini juga digunakan untuk menyematkan gambar kecil langsung ke HTML atau CSS sebagai URL data.",
    "9m85mf": "Sesoto",
    "9qy1xn": "Portugis",
    "9tbbkt": "Finlandia",
    "9zCSc": "Tidak ada ruang kerja yang tersedia",
    "A69UZ": "Variabel",
    "AVUvu": "Base62 adalah notasi untuk menyandikan data byte arbitrer menggunakan serangkaian simbol terbatas yang mudah digunakan oleh manusia dan diproses oleh komputer. Basis angka yang tinggi menghasilkan string yang lebih pendek dibandingkan dengan sistem desimal atau heksadesimal.",
    "AW9N8": "Wilayah Masukan",
    "AfPC0": "Kata sandi teks biasa Anda",
    "Ahrjc": "Direktorinya tidak ada, apakah Anda ingin membuatnya?",
    "AkXgF": "Sedang Berlangsung: {0}%",
    "Apx8D": "Bagaimana Cara Mengatur Ulang Kata Sandi Anda Secara Manual?",
    "B-GCloBBt": "Mengompresi kode eXtensible Markup Language (XML).",
    "B0s0z": "Tujuan halaman ini:",
    "BCySSDEKL": "Mungkin ada masalah kompatibilitas dengan versi perangkat lunak Anda saat ini.",
    "BGd7P9": "Operasi ini mengkodekan data mentah ke dalam string ASCII Base64.",
    "BGd7dP9": "Operasi ini mengkodekan data mentah ke dalam string ASCII {0}.",
    "BGdd7dP9": "Operasi ini mengkodekan data mentah ke dalam string ASCII {0}.",
    "BLAKE2-021": "BLAKE2 adalah alternatif modern lainnya yang memberikan kecepatan lebih cepat dibandingkan SHA-2 dengan tetap menjaga tingkat keamanan yang tinggi. Ia menawarkan beberapa varian termasuk BLAKE2b dan BLAKE2s.",
    "BLAKE2_Info-023": "Informasi BLAKE2",
    "BShq3M": "Masalah",
    "BW3bpT": "Membaca file dari disk...",
    "Bd9h-": "Tambahkan ke koleksi favorit saya",
    "BuihG": "Pengaturan sistem",
    "C3L9MmdDU7": "Buku Pegangan",
    "CASef": "Oke, operasinya dipicu.",
    "CEv8B": "Apakah Anda yakin akan menghapus catatan ini? Jika ya, klik tombol ini lagi.",
    "CFg8B": "Ukuran harus antara 0 dan 512",
    "CP-Advantage-Career-014": "Mempelajari program membuka peluang karir di berbagai industri dan memungkinkan Anda mengembangkan solusi inovatif, mengotomatiskan tugas, dan memahami sistem yang kompleks.",
    "CP-Advantages-013": "Apa keuntungan mempelajari pemrograman komputer?",
    "CP-Basics-001": "Apa itu pemrograman komputer?",
    "CP-Def-002": "Pemrograman komputer melibatkan penulisan instruksi, atau kode, dalam bahasa pemrograman untuk menginstruksikan komputer tentang cara melakukan tugas tertentu.",
    "CP-History-004": "Bagaimana sejarah pemrograman komputer?",
    "CP-History-Origin-005": "Mesin pertama yang dapat diprogram berasal dari karya Ada Lovelace pada Analytical Engine karya Charles Babbage pada abad ke-19. Namun, pemrograman modern berkembang pesat dengan ditemukannya komputer elektronik serba guna pertama, ENIAC, pada tahun 1940-an.",
    "CP-Lang-Choice-009": "Pilihan bahasa bergantung pada faktor-faktor seperti persyaratan proyek, dukungan komunitas, kemudahan belajar, dan kebutuhan kinerja.",
    "CP-Language-Evolution-006": "Sejak itu, bahasa pemrograman berevolusi dari kode mesin ke bahasa assembly, kemudian ke bahasa tingkat tinggi seperti FORTRAN, COBOL, C, dan sekarang ke bahasa modern seperti Python, JavaScript, dan Rust.",
    "CP-Languages-007": "Apa sajakah bahasa pemrograman yang populer?",
    "CP-Languages-List-008": "Bahasa pemrograman populer termasuk Java, Python, JavaScript, C++, C#, Swift, Go, PHP, Ruby, dan Kotlin. Masing-masing memiliki kekuatan dan kasus penggunaannya sendiri, misalnya Python untuk ilmu data, JavaScript untuk pengembangan web, dan C++ untuk pemrograman sistem.",
    "CP-Process-010": "Bagaimana proses pemrograman komputer?",
    "CP-Process-Explanation-011": "Pemrograman biasanya melibatkan perencanaan (mendefinisikan masalah dan merancang solusi), pengkodean (menulis kode sumber dalam bahasa yang dipilih), pengujian (debugging dan memverifikasi fungsionalitas), dan pemeliharaan (memperbarui dan meningkatkan program seiring waktu).",
    "CP-Purpose-003": "Pemrogram membuat algoritma, memecahkan masalah, dan membangun aplikasi perangkat lunak yang dapat mengotomatiskan proses, memanipulasi data, dan berinteraksi dengan pengguna atau sistem lain.",
    "CP-SDLC-012": "Hal ini sering kali disusun dalam Siklus Hidup Pengembangan Perangkat Lunak (SDLC) yang mencakup fase tambahan seperti analisis kebutuhan, desain, penerapan, dan pengujian penerimaan pengguna.",
    "CP-Skillset-015": "Hal ini juga meningkatkan pemikiran logis, keterampilan memecahkan masalah, dan kemampuan beradaptasi terhadap teknologi baru, menjadikannya lebih serbaguna di era digital.",
    "CSS-Advantages-010": "Apa keuntungan menggunakan CSS?",
    "CSS-Advantages-Customization-012": "Keuntungan lainnya adalah kemampuannya untuk menyesuaikan tampilan dan nuansa beberapa halaman sekaligus, menghemat waktu dan tenaga saat memperbarui gaya seluruh situs.",
    "CSS-Advantages-Separation-011": "Salah satu keuntungannya adalah pemisahan perhatian antara konten dan presentasi, yang meningkatkan pemeliharaan dan skalabilitas situs web.",
    "CSS-Animations-Transitions-019": "Animasi dan Transisi CSS memungkinkan efek visual yang halus tanpa memerlukan JavaScript.",
    "CSS-Def-002": "CSS (Cascading Style Sheets) adalah bahasa stylesheet yang digunakan untuk mendeskripsikan presentasi dokumen yang ditulis dalam HTML atau XML.",
    "CSS-Disadvantages-013": "Apa saja kelemahan CSS?",
    "CSS-Disadvantages-Browser-Compat-015": "Masalah lainnya adalah kompatibilitas lintas-browser, karena browser yang berbeda mungkin menafsirkan aturan CSS secara berbeda. Hal ini mengharuskan pengembang untuk menggunakan awalan vendor atau teknik deteksi fitur untuk rendering yang konsisten di seluruh browser.",
    "CSS-Disadvantages-Cascade-014": "Salah satu tantangannya adalah mengelola sifat gaya yang berjenjang, yang terkadang dapat menyebabkan masalah pewarisan dan kekhususan yang tidak terduga.",
    "CSS-Evolution-006": "Sejak itu, ia telah berkembang melalui CSS2 (1998), CSS2.1 (2007), CSS3 (pengembangan berkelanjutan), memperkenalkan fitur-fitur seperti penyeleksi, animasi, desain responsif, dan banyak lagi.",
    "CSS-Future-020": "Bagaimana masa depan teknologi CSS?",
    "CSS-Future-Houdini-022": "Houdini, misalnya, bertujuan untuk menyediakan API tingkat rendah untuk menyesuaikan proses rendering browser, memberdayakan pengembang dengan kontrol yang belum pernah ada sebelumnya terhadap gaya dan tata letak.",
    "CSS-Future-Progress-021": "Kelompok Kerja CSS terus mengerjakan modul baru seperti Variabel CSS (Properti Khusus), Houdini, dan Kueri Kontainer.",
    "CSS-Hist-Origin-005": "CSS pertama kali diusulkan oleh Håkon Wium Lie pada bulan Oktober 1994 dan menjadi Rekomendasi resmi W3C pada bulan Desember 1996 dengan CSS1.",
    "CSS-History-004": "Bagaimana sejarah CSS?",
    "CSS-History-W3C": "Garis Waktu Rekomendasi CSS W3C",
    "CSS-Key-Features-016": "Apa sajakah fitur utama dalam CSS?",
    "CSS-Layouts-018": "Sistem tata letak Flexbox dan Grid menyediakan alat canggih untuk membuat tata letak halaman yang responsif dan fleksibel.",
    "CSS-MDN-Animations": "Panduan MDN untuk Animasi CSS",
    "CSS-MDN-Flexbox": "Panduan MDN untuk Flexbox",
    "CSS-MDN-Grid": "Panduan MDN untuk CSS Grid",
    "CSS-MDN-Houdini": "Pengantar MDN tentang Houdini",
    "CSS-Purpose-003": "Hal ini memungkinkan pengembang untuk memisahkan konten dari presentasi, menentukan gaya seperti tata letak, warna, dan font, membuat halaman web menarik secara visual dan konsisten di berbagai perangkat dan layar.",
    "CSS-Selectors-017": "Penyeleksi memungkinkan penargetan elemen HTML tertentu berdasarkan jenis, kelas, ID, atribut, dan lainnya.",
    "CSS-Tech-History-001": "Apa itu CSS?",
    "CSS-Usage-007": "Bagaimana cara menggunakan CSS dalam proyek web saya?",
    "CSS-Usage-Basics-008": "Untuk menggunakan CSS, Anda membuat file terpisah (misalnya, style.css) yang berisi gaya Anda, lalu menautkannya ke file HTML menggunakan elemen <link> di bagian <head>.",
    "CSS-Usage-Inline-009": "Alternatifnya, Anda dapat memasukkan gaya sebaris langsung ke dalam elemen HTML menggunakan atribut 'style' atau menyematkan CSS di tag <style> di dalam bagian <head>.",
    "CSS-Vendor-Prefixes": "Panduan MDN tentang Awalan Vendor",
    "CSS-W3C-Selectors": "Spesifikasi Pemilih W3C Level 4",
    "CSS-WG-Future-Modules": "W3C CSS Pekerjaan Saat Ini",
    "CSSNano": "cssnano - GitHub",
    "CVUl0": "alat laf",
    "CWoqhy": "Daftar Exts berdasarkan ID Kategori yang dipilih",
    "CfZAX": "File {0} Dipilih, kami mengunggahnya ke layanan inti.",
    "CidOqAZ": "Sebagai pencipta LafTools, saya sangat tersentuh karena Anda bersedia mendukung kami. Kami memiliki orang-orang baik di tim kami yang bekerja keras untuk terus meningkatkan LafTools.",
    "Cide2w": "Untuk melihat apakah ada masalah saat menjalankan tindakan Anda.",
    "DIQFq": "Silakan periksa apakah parameter URL telah diberikan dengan benar, sepertinya Anda tidak memiliki izin untuk mengisi formulir ini. Secara default, Anda akan dapat melihat pesan di bawah ini pada keluaran layanan ketika baru saja diluncurkan.",
    "DIweGq": "Amankan LafTools Anda",
    "DSEtLTxUU": "Waktu adalah mata uang hidup Anda, gunakanlah dengan bijak.",
    "DTTPW": "Setel ulang status",
    "DVoKw": "Keluar dari Sistem ini",
    "DadYp": "Debounce Waktu Nyata",
    "Diff-XML-JSON-Article": "Perbedaan Antara XML dan JSON",
    "DqFI5": "Level harus lebih besar dari 0",
    "DrXAq": "Selamat menggunakan LafTools!",
    "DrbEr": "Kata sandi yang Anda berikan kosong, silakan periksa dan coba lagi.",
    "DtlAc": "Memuat Sumber Daya Sistem",
    "Dxlw0": "Menyelesaikan",
    "E62ej": "Filter Perintah Shell",
    "E6F9B": "Tambahkan ke alur kerja",
    "EEQkeW": "Algoritma MD6 (Message-Digest 6) adalah fungsi hash kriptografi. Ia menggunakan struktur seperti pohon Merkle untuk memungkinkan komputasi hash paralel yang sangat besar untuk input yang sangat panjang.",
    "EO6Qv5dCA": "Memperkecil kode JSON, mengurangi ukuran bundel kode JSON Anda.",
    "ERK7E": "Jika Anda mengalami masalah apa pun atau memiliki saran saat menggunakan LafTools, jangan ragu untuk menghubungi kami melalui EMail atau GitHub kapan saja, kami bersedia untuk segera memperbaikinya.",
    "EgBXL": "Pilih atau berikan tag.",
    "Ewvgo": "Belum dimulai.",
    "ExqvX": "Daftar Tombol Pintas",
    "Eyq856": "Kami belum selesai - kami berdedikasi untuk menyediakan fitur terbaru dan terhebat, dan kami akan terus merilis pembaruan untuk memastikan Anda mendapatkan pengalaman terbaik.",
    "F-OUm": "Pengaturan Cepat untuk LafTools",
    "F0CCF": "Daftar Tombol Pintas",
    "F4uS2": "File baru",
    "FBVyc": "Silakan masukkan kembali kode verifikasi",
    "FDlRI": "Beri nama tab baru ini dan klik untuk mengonfirmasinya.",
    "FLsbFsOZq": "IDE",
    "FOyHW": "Cari Di Mana Saja",
    "FQzhg": "Abaikan Input Kosong",
    "FYRoL": "Mengindentasi dan mempercantik kode Cascading Style Sheets (CSS).",
    "FhVWl": "Enkripsi Kata Sandi Anda",
    "FjYbR": "Keluaran",
    "Fv-zz": "Salin Hasil",
    "Fy217": "Konfigurasikan Alat ini",
    "Fzp3t": "Harap berikan nilai di bidang ini",
    "G3MJN": "Tampilkan Panel Keluaran",
    "G9QVo": "Kelola Tab",
    "GR7jK": "Jenis",
    "Ggob_": "Membatalkan",
    "H-Ae75": "Harap konfirmasi kata sandi lokal Anda.",
    "H-qA75": "Harap berikan kata sandi lokal.",
    "H8fQ4": "Beralih ke Mode Terang atau Gelap",
    "HEAhr": "Setelah diterjemahkan, hasilnya akan muncul di sini.",
    "HIc3c": "Lengkap",
    "HNDat": "Untuk melakukan perubahan, klik tombol \"{0}\". Jika tidak, klik \"{1}\" untuk menerapkan perubahan Anda. Semoga Anda bersenang-senang dengan kotak peralatan ini!",
    "HTMLMinifier": "HTMLMinifier - GitHub",
    "Hflf2": "Demi keamanan cyber, kami tidak akan membantu mengatur ulang kata sandi Anda melalui API atau halaman di sini kecuali Anda memperbarui file yang dilindungi sistem secara manual.",
    "HistOfProg-Wikipedia": "Sejarah Bahasa Pemrograman - Wikipedia",
    "HjvV3": "Kami tidak akan menghapus file-filenya di disk, cukup hapus catatan ini dari daftar.",
    "HyIC_": "Tombol Tebas (/)",
    "HyIC_d": "Tombol Tebas (/)",
    "I8FLi": "Sekarang saatnya mengatur administrator Anda, harap atur kata sandi serumit mungkin sehingga Anda dapat membingungkan para penyerang yang tidak sopan itu.",
    "IAC0A": "Alat pencari",
    "ICefi": "Dibatalkan",
    "IKqqATS": "Segarkan Data Halaman Saat Ini",
    "IOOrz": "(Apakah ini akan membahayakan sistem Anda? Menurut kami tidak, selama Anda dapat memodifikasi file konfigurasi yang disimpan sistem, itu berarti Anda diperbolehkan membaca segala sesuatu tentang file data LafTools.)",
    "IWUH5": "Tunjukkan Contoh",
    "IaSyO": "Membatalkan",
    "IfsGO": "Favorit",
    "IfsdGO": "Favorit",
    "ImUmf": "Baru",
    "IxAJswoSh": "Parsing dan cetak cantik kode JavaScript yang valid. Juga berfungsi dengan Notasi Objek JavaScript (JSON).",
    "J-3KA": "Harap berikan nama untuk skrip ini, yang akan lebih membantu.",
    "J164i": "misalnya Salin file ke server jauh",
    "J2xoL": "Silakan lihat kesalahannya: {0}",
    "JA_Bp": "Harap berikan nama untuk tag baru terlebih dahulu.",
    "JQEVK": "Kode",
    "JQLmS": "Menyesuaikan ukurannya",
    "JQLmSq": "Lengkap.",
    "JS-Basics-001": "Apa itu JavaScript?",
    "JS-DOM-API-007": "Bagaimana JavaScript berinteraksi dengan DOM?",
    "JS-DOM-API-Explanation-008": "JavaScript menyediakan API Model Objek Dokumen (DOM) untuk memanipulasi HTML dan CSS, memungkinkan pengembang mengubah konten, gaya, dan pendengar acara secara dinamis.",
    "JS-DOM-Example-009": "Misalnya, Anda dapat memilih elemen dan mengubah konten teksnya: `document.getElementById('myElement').textContent = 'New Text';`",
    "JS-Data-Types-010": "Apa saja tipe data dalam JavaScript?",
    "JS-Data-Types-List-011": "JavaScript mendukung berbagai tipe data termasuk tipe data primitif seperti string, angka, boolean, null, tidak terdefinisi, dan simbol, serta tipe kompleks seperti objek dan array.",
    "JS-Def-002": "JavaScript (JS) adalah bahasa pemrograman interpretasi tingkat tinggi yang banyak digunakan untuk membuat aplikasi web, meningkatkan antarmuka pengguna, dan membangun logika sisi server dengan Node.js.",
    "JS-Event-Loop-013": "Apa yang dimaksud dengan perulangan peristiwa dalam JavaScript?",
    "JS-Event-Loop-Explanation-014": "Perulangan peristiwa adalah bagian inti dari model konkurensi JavaScript, yang memungkinkan eksekusi asinkron melalui panggilan balik, janji, dan async/menunggu.",
    "JS-Event-Loop-Process-015": "Ini menjalankan skrip utama terlebih dahulu, kemudian menjalankan fungsi panggilan balik apa pun ketika peristiwa terkait (seperti masukan pengguna atau respons jaringan) terjadi, mengelolanya melalui sistem antrian.",
    "JS-Function-Syntax-006": "Fungsi didefinisikan menggunakan kata kunci `fungsi` diikuti dengan nama fungsi dan parameter yang diapit tanda kurung. Badan fungsi dibungkus dengan kurung kurawal: `functiongreet(name) { console.log(`Hello, ${name}!`); }`",
    "JS-Purpose-003": "Ini awalnya dikembangkan oleh Brendan Eich di Netscape pada tahun 1995 dan sejak itu berkembang menjadi salah satu bahasa paling populer, didukung oleh semua browser web dan platform utama seperti Electron dan React Native.",
    "JS-Syntax-004": "Apa sintaks dasar JavaScript?",
    "JS-Type-Checking-012": "Pemeriksaan tipe dapat dilakukan menggunakan konstruktor (`typeof value === 'string'`) atau operator `instanceof` untuk objek yang diwarisi dari konstruktor bawaan (misalnya, `value instanceof Array`).",
    "JSON-Advantages-011": "JSON umumnya lebih kecil dan lebih cepat untuk diurai dibandingkan XML, sehingga ideal untuk komunikasi klien-server di mana bandwidth dan kecepatan sangat penting.",
    "JSON-Basics-001": "Apa itu JSON?",
    "JSON-Beautify-007": "Apa itu Kecantikan JSON?",
    "JSON-Beautify-Def-008": "Kecantikan JSON mengacu pada proses memformat data JSON menjadi bentuk yang lebih mudah dibaca manusia dengan lekukan dan jeda baris yang tepat, sehingga lebih mudah untuk dianalisis dan di-debug.",
    "JSON-Beautify-Example-009": "Sebelum: '{\\\"key\\\":\\\"value\\\",\\\"array\\\":[1,2,3]}', Setelah: '{\\n \\\"key\\\": \\\"value\\\", \\n \\\"array\\\": [\\n 1,\\n 2,\\n 3\\n ]\\n}'",
    "JSON-Def-002": "JSON (JavaScript Object Notation) adalah format pertukaran data ringan berbasis teks yang mudah dibaca dan ditulis oleh manusia, serta mudah diurai dan dibuat oleh mesin.",
    "JSON-JavaScript-Support-020": "JSON secara asli didukung oleh JavaScript melalui objek global `JSON.parse()` dan `JSON.stringify()`. JSON apa pun yang valid juga merupakan objek atau larik literal JavaScript yang valid, yang memungkinkan konversi lancar antara kedua format tersebut.",
    "JSON-JavaScript-Usage-021": "Dalam pengembangan web, JSON biasanya digunakan untuk permintaan AJAX, rendering sisi server, dan penyimpanan data (misalnya penyimpanan lokal atau IndexedDB).",
    "JSON-Linting-022": "Apa itu linting JSON dan mengapa itu penting?",
    "JSON-Linting-Benefit-024": "Linter dapat mencegah kesalahan runtime karena JSON yang tidak valid, memastikan kelancaran pertukaran data dan menghemat waktu dalam men-debug potensi masalah.",
    "JSON-Linting-Explanation-023": "Linting JSON adalah proses memeriksa apakah dokumen JSON mematuhi spesifikasi JSON. Ini membantu mengidentifikasi kesalahan sintaksis sebelum mencoba mengurai data.",
    "JSON-Path-013": "Apa itu Jalur JSON?",
    "JSON-Path-Example-015": "$.store.book[0].title memilih judul buku pertama dalam objek JSON dengan toko yang berisi array buku.",
    "JSON-Path-Explanation-014": "JSON Path adalah bahasa kueri yang mirip dengan XPath untuk XML, memungkinkan Anda mengekstrak data dari dokumen JSON menggunakan notasi seperti jalur.",
    "JSON-Path-Guide": "JSONPath - XPath untuk JSON",
    "JSON-Purpose-003": "Ini terutama digunakan untuk mengirimkan data antara server dan aplikasi web sebagai alternatif XML, dengan dukungan asli dalam JavaScript melalui metode `JSON.parse()` dan `JSON.stringify()`.",
    "JSON-Scope-in-JavaScript-019": "Bagaimana JSON cocok dengan JavaScript?",
    "JSON-Security-025": "Apa saja masalah keamanan saat bekerja dengan JSON?",
    "JSON-Security-Impact-026": "Potensi risiko keamanan mencakup serangan injeksi JSON, yaitu pengiriman data berbahaya yang dapat menyebabkan perilaku yang tidak diinginkan saat diurai/dieksekusi.",
    "JSON-Security-Prevention-027": "Untuk memitigasi risiko ini, selalu bersihkan input pengguna dan gunakan pustaka yang mengurai JSON dengan aman tanpa mengeksekusi kontennya (seperti JSON.parse() bawaan JavaScript). Selain itu, hindari penggunaan eval() untuk mengurai JSON.",
    "JSON-Serialization-016": "Apa itu serialisasi dan deserialisasi JSON?",
    "JSON-Serialization-Def-017": "Serialisasi JSON adalah proses mengubah objek JavaScript menjadi string JSON, sedangkan deserialisasi adalah kebalikannya – mengubah string JSON kembali menjadi objek JavaScript.",
    "JSON-Serialization-W3Schools": "Serialisasi JSON di W3Schools",
    "JSON-Syntax-004": "Apa sintaks dasar JSON?",
    "JSON-Syntax-Example-f005": "Objek JSON terdiri dari pasangan nilai kunci yang diapit kurung kurawal {0}. Setiap kunci harus berupa string yang diapit tanda kutip ganda, diikuti dengan titik dua, dan kemudian nilainya.",
    "JSON-Syntax-Reference": "Dokumen Web MDN di JSON",
    "JSON-Value-Types-006": "Nilai dapat berupa string, angka, boolean, array (diapit tanda kurung siku []), objek lain, atau null.",
    "JSON-vs-XML-010": "Bagaimana JSON dibandingkan dengan XML?",
    "JSON-vs-XML-Article": "Membandingkan JSON dan XML",
    "JTBRh": "LafTools menyimpan nilai kata sandi ke dalam file lokal, tapi jangan khawatir, kami mengadopsi mekanisme enkripsi kata sandi satu arah, artinya tidak ada yang bisa membaca kata sandi versi teks biasa. Untuk mengatur ulang kata sandi, silakan ikuti instrumen di bawah ini untuk mengatur ulang kata sandi Anda secara manual.",
    "JYqxz2": "Selamat datang di LafTools, ini adalah versi orang dalam.",
    "JdqiUE8": "Operasi ini menerjemahkan data dari string ASCII (dengan alfabet pilihan Anda, termasuk preset) kembali ke bentuk aslinya.",
    "JdqidUE8": "Operasi ini menerjemahkan data dari string ASCII (dengan alfabet pilihan Anda, termasuk preset) kembali ke bentuk aslinya.",
    "JiUE8": "Operasi ini mendekode data dari string ASCII {0} kembali ke format aslinya.",
    "K1qJZI": "Selamat datang di LafTools, Yang Mulia.",
    "KGS2-": "Setelah Anda menyelesaikan langkah-langkah di atas, Anda dapat menggunakan kata sandi baru untuk masuk ke sistem Anda. Jika Anda tidak dapat mengakses sistem file, mintalah administrator atau dukungan TI Anda untuk membuat file tersebut. Jika file sudah ada, hapus dan perbarui lagi.",
    "KIc63": "Fungsi belum didukung",
    "KYh1N": "Semua Catatan",
    "KcqrRr": "Referensi",
    "KcrRr": "Mengambil Data Implementasi Kode",
    "KmEUF": "Memberikan gambaran singkat tentang alat sistem saat ini.",
    "Kw4OJr": "Terminal",
    "Kyd9H": "Kode Sumber di GitHub",
    "L-p-Y": "Salin konten perintah shell saat ini ke clipboard",
    "L3zEM": "Tunjukkan Contoh",
    "L42mxa": "Silakan masukkan teks sumber Anda di bidang ini.",
    "L49kCq": "Harap berikan dan konfirmasi kata sandi kunci dalam formulir ini untuk mengamankan LafTools Anda.",
    "L71q_N": "Kata sandi yang Anda berikan kosong, silakan periksa dan coba lagi.",
    "L9bQku": "Dekode {0}",
    "L9qbQku": "Dekode {0}",
    "LAc1m": "Menyegarkan tampilan aplikasi.",
    "LFdvM": "Belum masuk",
    "LM715": "Mengambil konfigurasi i18n dari API server lokal",
    "LNvUuKmHR": "Aplikasi tidak memiliki dependensi atau pustaka penting.",
    "LPJrV": "Salin Hasil",
    "LSohY6eZW": "Hex String adalah string byte heksadesimal yang dipisahkan oleh pembatas, yang dapat berupa spasi, koma, titik koma, atau titik dua.",
    "LU9Jj": "Base85 (juga disebut Ascii85) adalah notasi untuk menyandikan data byte arbitrer. Biasanya lebih efisien daripada Base64. Operasi ini mendekode data dari string ASCII (dengan alfabet pilihan Anda, termasuk preset). Base85 umumnya digunakan dalam format file Adobe PostScript dan PDF.",
    "LWaeFqd": "Beralih ke bahasa pilihan Anda",
    "Le71_N-": "Kata sandi yang Anda berikan tidak sama dengan kata sandi yang telah dikonfirmasi, silakan periksa dan coba lagi.",
    "LnJ4H": "Perhatikan bahwa akun lokal sama sekali tidak sama dengan pengguna terdaftar di situs web kami, akun lokal hanya ditentukan di PC Anda sedangkan akun lokal dapat digunakan untuk sinkronisasi cloud.",
    "LqWaFd": "Pengaturan sistem",
    "LxaEFHbfa": "Memperkecil kode SQL, mengurangi ukuran bundel kode SQL Anda.",
    "M3qytc": "Menyandikan {0}",
    "M3ytc": "Menyandikan {0}",
    "M4ywN1": "Kalkulator, Kalender, Jam, Cuaca, dan lainnya.",
    "M6MrW": "Bagus",
    "M7jct": "Masuk ke Mode Layar Penuh",
    "MD2-Advantages-011": "Apa keuntungan menggunakan MD2?",
    "MD2-AlgorithmDetails-010": "Detail Algoritma MD2",
    "MD2-Applications-018": "Aplikasi apa saja yang sudah atau masih menggunakan MD2?",
    "MD2-Breakdown-016": "Kelemahan kriptografi telah ditemukan di MD2 dari waktu ke waktu, dan alternatif yang lebih kuat seperti SHA-256 dan SHA-3 kini direkomendasikan untuk semua aplikasi yang memerlukan hashing aman.",
    "MD2-CollisionSecurity-015": "MD2 dianggap lemah terhadap serangan kriptografi modern. Ukuran hashnya (128 bit) kecil menurut standar saat ini, sehingga rentan terhadap serangan tabrakan.",
    "MD2-Def-002": "MD2 (Message-Digest Algorithm 2) adalah fungsi hash kriptografi yang dirancang oleh Ronald Rivest pada tahun 1989. Fungsi ini menghasilkan nilai hash 128-bit untuk setiap pesan masukan yang diberikan.",
    "MD2-DigitalSignature-Risks-021": "Resiko Penggunaan MD2 untuk Tanda Tangan Digital",
    "MD2-Disadvantages-014": "Apa saja kelemahan dan masalah keamanan MD2?",
    "MD2-FAQ-001": "Apa itu MD2?",
    "MD2-HistoricalUse-020": "Secara historis, MD2 digunakan dalam pemeriksaan integritas file dan pembaruan perangkat lunak, meskipun sebagian besar aplikasi ini telah beralih ke fungsi hash yang lebih aman seperti SHA-256 dan SHA-512.)",
    "MD2-History-004": "Bagaimana MD2 dikembangkan dan bagaimana sejarahnya?",
    "MD2-Implementation-013": "Hal ini telah diterapkan secara luas dan distandarisasi di berbagai platform dan bahasa, yang berarti bahwa mengintegrasikan MD2 ke dalam sistem yang ada relatif mudah.",
    "MD2-InsecurityExamples-017": "Contoh Kerusakan Keamanan MD2",
    "MD2-Operation-007": "Bagaimana cara kerja operasi MD2?",
    "MD2-Origin-005": "MD2 awalnya dibuat sebagai penyempurnaan dari MD1, mengatasi beberapa kelemahan yang ditemukan pada algoritma sebelumnya. Ini mendapatkan popularitas karena kesederhanaan dan kecepatannya pada saat itu.",
    "MD2-PKI-019": "MD2 pernah digunakan di Infrastruktur Kunci Publik (PKI) untuk tanda tangan digital, namun sudah tidak digunakan lagi karena kerentanannya terhadap serangan. Sertifikat yang ditandatangani dengan MD2 tidak lagi dipercaya oleh sebagian besar sistem.",
    "MD2-Process-008": "MD2 beroperasi dengan memasukkan pesan masukan ke kelipatan 16 byte dan kemudian memprosesnya melalui serangkaian operasi OR eksklusif, rotasi bit, dan penambahan. Hasil akhirnya adalah nilai hash 128-bit.",
    "MD2-Purpose-003": "Tujuan MD2 adalah untuk memastikan integritas data dengan menghasilkan sidik jari digital unik yang dapat digunakan untuk memverifikasi keaslian dan keaslian data.",
    "MD2-Rounds-009": "Algoritme ini menggunakan proses empat putaran dengan operasi spesifik yang dilakukan pada variabel status 128-bit. Setiap putaran mengambil blok pesan berlapis dan memperbarui status hingga seluruh pesan diproses.",
    "MD2-Speed-012": "MD2 dianggap cepat pada masanya dan masih memiliki kinerja yang dapat diterima dalam beberapa skenario, sehingga cocok untuk lingkungan di mana sumber daya komputasi terbatas.",
    "MD2-Successors-006": "Namun, hal ini telah digantikan oleh algoritme yang lebih kuat seperti MD5 dan SHA-1, yang merupakan bagian dari rangkaian fungsi hash yang sama tetapi menawarkan fitur keamanan yang lebih baik.",
    "MD4-Advantages-011": "Apa keuntungan menggunakan MD4?",
    "MD4-AlgorithmDetails-010": "Detail Algoritma MD4",
    "MD4-Applications-018": "Aplikasi apa saja yang sudah atau masih menggunakan MD4?",
    "MD4-Breakdown-016": "Kelemahan desain algoritme telah menyebabkan serangan praktis yang memungkinkan terjadinya tabrakan hash dengan mudah dan bahkan serangan preimage parsial, menjadikan MD4 tidak cocok untuk kasus penggunaan kriptografi aman apa pun saat ini.",
    "MD4-CollisionSecurity-015": "MD4 memiliki beberapa kelemahan kriptografi, termasuk kerentanan terhadap serangan tabrakan. Artinya, dua masukan berbeda dapat menghasilkan keluaran hash yang sama, sehingga tidak aman untuk aplikasi yang memerlukan ketahanan benturan atau integritas pesan yang kuat.",
    "MD4-Def-002": "MD4 (Message-Digest Algorithm 4) adalah fungsi hash kriptografi yang dirancang oleh Ronald Rivest pada tahun 1990. Fungsi ini menghasilkan nilai hash 128-bit untuk setiap pesan masukan yang diberikan.",
    "MD4-DigitalSignature-Risks-021": "Resiko Penggunaan MD4 untuk Tanda Tangan Digital",
    "MD4-Disadvantages-014": "Apa saja kelemahan dan masalah keamanan MD4?",
    "MD4-FAQ-001": "Apa itu MD4?",
    "MD4-HistoricalUse-019": "Secara historis, MD4 digunakan dalam tanda tangan digital, pemeriksaan integritas file, dan pembaruan perangkat lunak. Namun, karena kerentanannya, sebagian besar aplikasi ini telah beralih ke alternatif yang lebih aman seperti SHA-256 dan SHA-3.",
    "MD4-History-004": "Bagaimana MD4 dikembangkan dan apa makna historisnya?",
    "MD4-Implementation-013": "Teknologi ini telah diterapkan dan distandarisasi secara luas di berbagai platform dan bahasa, memberikan kemudahan integrasi ke dalam sistem yang ada, meskipun keunggulan ini tidak sebanding dengan masalah keamanannya dalam konteks modern.",
    "MD4-InsecurityExamples-017": "Contoh Kerusakan Keamanan MD4",
    "MD4-LegacySystems-020": "MD4 mungkin masih ada di sistem lama, namun penggunaannya tidak disarankan dalam semua konteks yang mengutamakan keamanan. Standar modern tidak lagi merekomendasikan MD4 untuk tujuan kriptografi apa pun.",
    "MD4-Operation-007": "Bagaimana cara kerja operasi MD4?",
    "MD4-Origin-005": "MD4 merupakan evolusi dari MD2 dan MD3, yang dimaksudkan untuk memberikan kinerja lebih cepat dengan tetap menjaga properti keamanan. Namun, terbukti bahwa MD4 memiliki beberapa kelemahan keamanan.",
    "MD4-Process-008": "MD4 memproses pesan masukan dengan menambahkannya ke kelipatan 512 bit dan membaginya menjadi blok 16 kata. Algoritme kemudian beroperasi pada blok-blok ini menggunakan empat putaran pemrosesan yang melibatkan operasi bitwise, penambahan modular, dan fungsi non-linier.",
    "MD4-Purpose-003": "Tujuan MD4 adalah untuk memastikan integritas data dengan menghasilkan sidik jari digital berukuran tetap yang dapat digunakan untuk memverifikasi keaslian dan integritas data asli.",
    "MD4-Rounds-009": "Setelah semua blok diproses, keadaan internal yang dihasilkan diubah menjadi nilai hash 128-bit akhir.",
    "MD4-Speed-012": "MD4 pada awalnya dirancang agar lebih cepat dari pendahulunya, yang membuatnya populer untuk aplikasi yang memerlukan hashing cepat pada saat diperkenalkan.",
    "MD4-Successors-006": "Terlepas dari kekurangannya, MD4 meletakkan dasar bagi fungsi hash berikutnya seperti MD5 dan SHA-1, yang menyempurnakan desainnya tetapi juga mewarisi beberapa kerentanannya seiring berjalannya waktu.",
    "MD5-Advantages-012": "Apa keuntungan menggunakan MD5?",
    "MD5-AlgorithmDetails-011": "Detail Algoritma MD5",
    "MD5-Alternatives-019": "Apa sajakah alternatif selain MD5 untuk hashing yang aman?",
    "MD5-Applications-024": "Aplikasi lain apa yang menggunakan atau pernah menggunakan MD5?",
    "MD5-Breakdown-017": "Beberapa kelemahan kriptografi telah ditemukan di MD5 dari waktu ke waktu, dan para peneliti telah menunjukkan contoh praktis yang menciptakan tabrakan, yang selanjutnya membahayakan integritas dan keamanannya.",
    "MD5-Collision-016": "MD5 rentan terhadap serangan tabrakan, artinya dua masukan berbeda dapat menghasilkan keluaran hash yang sama. Hal ini membuatnya tidak aman untuk aplikasi seperti tanda tangan digital atau penyimpanan kata sandi.",
    "MD5-CollisionExample-007": "Contoh Tabrakan MD5",
    "MD5-DataIntegrity-026": "Itu juga biasa digunakan untuk memverifikasi integritas data selama transmisi dan penyimpanan, seperti saat menggunakan rsync untuk sinkronisasi file atau memeriksa kumpulan data besar.",
    "MD5-Def-002": "MD5 (Message-Digest Algorithm 5) adalah fungsi hash kriptografi yang banyak digunakan yang mengambil pesan masukan dan menghasilkan nilai hash 128-bit berukuran tetap.",
    "MD5-DigitalSignature-Risks-027": "Resiko Penggunaan MD5 untuk Tanda Tangan Digital",
    "MD5-Disadvantages-015": "Apa saja kelemahan dan masalah keamanan MD5?",
    "MD5-FAQ-001": "Apa itu MD5?",
    "MD5-FileChecksum-005": "MD5 sering digunakan untuk memverifikasi integritas file saat mengunduh perangkat lunak atau file besar. Ini menghasilkan checksum yang dapat dibandingkan dengan yang disediakan oleh sumber untuk memastikan file yang diunduh tidak dirusak.",
    "MD5-Future-028": "Apakah MD5 masih relevan saat ini?",
    "MD5-InsecurityExamples-018": "Contoh Kerusakan Keamanan MD5",
    "MD5-Operation-008": "Bagaimana cara kerja operasi MD5?",
    "MD5-PKI-025": "MD5 telah digunakan dalam Infrastruktur Kunci Publik (PKI) untuk membuat tanda tangan digital, meskipun penggunaannya sebagian besar sudah tidak digunakan lagi karena masalah keamanan. Sertifikat yang ditandatangani dengan MD5 tidak lagi dipercaya oleh sebagian besar sistem modern.",
    "MD5-PasswordHashing-006": "Itu juga secara historis digunakan dalam hashing kata sandi tetapi sekarang dianggap tidak aman karena kerentanannya terhadap tabrakan dan kemudahan retak. Sistem modern telah beralih ke alternatif yang lebih kuat seperti bcrypt atau Argon2.",
    "MD5-Process-009": "MD5 beroperasi dengan memecah pesan masukan menjadi beberapa bagian dan meneruskan setiap bagian melalui beberapa putaran pemrosesan yang melibatkan fungsi logika, aritmatika modular, dan operasi bitwise. Hasilnya digabungkan untuk menghasilkan nilai hash akhir 128-bit.",
    "MD5-Purpose-003": "Tujuannya adalah untuk memastikan integritas data dengan menghasilkan sidik jari digital unik untuk setiap data tertentu. Jika bahkan satu bit pun pada data asli berubah, hash MD5 akan sangat berbeda.",
    "MD5-Relevance-029": "MD5 tidak lagi dianggap aman untuk tujuan kriptografi, terutama untuk aplikasi baru yang memerlukan ketahanan tabrakan atau integritas pesan yang kuat. Namun, hal ini masih dapat ditemukan pada sistem lama atau aplikasi non-kriptografi yang mengutamakan kecepatan dibandingkan keamanan.",
    "MD5-Rounds-010": "Algoritme ini terdiri dari empat tahapan utama yang dilakukan pada keadaan internal 128-bit yang diinisialisasi dengan konstanta. Ada total 64 putaran pemrosesan, di mana setiap putaran mengubah keadaan internal berdasarkan blok pesan masukan.",
    "MD5-Speed-013": "MD5 relatif cepat, sehingga membuatnya populer untuk aplikasi yang memerlukan hashing cepat.",
    "MD5-Standardization-014": "Ini telah distandarisasi secara luas dan diimplementasikan dalam berbagai bahasa pemrograman dan platform, sehingga mudah untuk diintegrasikan ke dalam sistem dan alat yang ada.",
    "MD5-Summary-031": "Singkatnya, poin penting apa yang harus saya ingat tentang MD5?",
    "MD5-Summary-Point1-032": "MD5 adalah fungsi hash kriptografi yang cepat namun tidak aman yang rentan terhadap serangan tabrakan.",
    "MD5-Summary-Point2-033": "Kegunaan utamanya adalah untuk memastikan integritas data dan untuk beberapa operasi kriptografi, namun sebagian besar telah digantikan oleh alternatif yang lebih kuat seperti SHA-256 dan BLAKE2.",
    "MD5-Summary-Point3-034": "Meskipun Anda mungkin menemukan MD5 dalam sistem lama atau skenario yang tidak sensitif terhadap keamanan, sangat penting untuk menghindari penggunaannya untuk proyek baru yang memerlukan keamanan kriptografi.",
    "MD5-Transition-030": "Karena algoritme yang lebih baru dan lebih aman seperti SHA-256 dan BLAKE2 tersedia secara luas dan lebih dipahami, disarankan untuk beralih dari MD5 dalam semua konteks yang mengutamakan keamanan.",
    "MD5-Usage-004": "Bagaimana MD5 digunakan dalam praktik?",
    "MD6-AlgorithmDetails-010": "Detail Algoritma MD6",
    "MD6-ComparisonSHA3-020": "Bagaimana MD6 dibandingkan dengan SHA-3 (Keccak)?",
    "MD6-Def-002": "MD6 (Message-Digest Algorithm 6) adalah fungsi hash kriptografi yang dirancang oleh Ronald Rivest pada tahun 2008. Ini merupakan evolusi dari keluarga MD, menawarkan ukuran keluaran variabel mulai dari 128 hingga 512 bit.",
    "MD6-FAQ-001": "Apa itu MD6?",
    "MD6-FutureDevelopments-028": "Apakah ada perkembangan atau perbaikan di masa depan yang direncanakan untuk MD6?",
    "MD6-FutureUnknown-029": "Sampai saat ini, belum ada informasi yang tersedia untuk umum mengenai pengembangan yang sedang berlangsung atau rencana untuk memperbaiki algoritma MD6. Penelitian kriptografi terus berkembang, dan algoritma baru mungkin muncul untuk mengatasi ancaman atau persyaratan yang muncul.",
    "MD6-History-004": "Bagaimana MD6 dikembangkan dan apa yang menyebabkan terciptanya?",
    "MD6-Operation-007": "Bagaimana cara kerja operasi MD6?",
    "MD6-Origin-005": "MD6 dibuat sebagai respons terhadap kerentanan yang ditemukan di MD5 dan SHA-1, yang banyak digunakan pada saat itu. Hal ini bertujuan untuk memberikan alternatif yang lebih aman dengan peningkatan fleksibilitas mengenai ukuran keluaran.",
    "MD6-PKI-Alternatives-027": "Untuk aplikasi PKI dan tanda tangan digital, standar seperti RSA/SHA-256 atau ECDSA dengan varian SHA-2 atau SHA-3 biasanya digunakan. Ini telah melalui analisis ekstensif dan telah membangun kepercayaan dalam komunitas kriptografi.",
    "MD6-PKI-Considerations-026": "Meskipun MD6 dimaksudkan untuk memberikan keamanan yang lebih kuat dibandingkan fungsi hash sebelumnya seperti MD5, MD6 belum banyak diadopsi untuk PKI atau skema tanda tangan digital karena relatif baru dan kurangnya penerimaan komunitas kriptografi secara luas.",
    "MD6-Process-008": "MD6 memproses pesan masukan melalui serangkaian fungsi kompresi yang diterapkan dalam struktur mirip pohon. Algoritme ini dapat beroperasi secara paralel, sehingga berkontribusi terhadap kinerjanya untuk masukan yang lebih besar.",
    "MD6-Purpose-003": "MD6 bertujuan untuk menyediakan fitur keamanan yang kuat dan peningkatan kinerja dibandingkan pendahulunya, sehingga cocok untuk berbagai aplikasi yang memerlukan hashing tahan benturan dan pemeriksaan integritas pesan.",
    "MD6-Rounds-009": "Setiap node di pohon MD6 mengalami beberapa putaran operasi pencampuran yang melibatkan penambahan modular, XOR bitwise, dan permutasi non-linier. Nilai simpul akar terakhir mewakili intisari hash dari pesan masukan.",
    "MD6-SecurityUpgrade-006": "Desain MD6 dibangun berdasarkan konsep hashing berbasis pohon, yang memungkinkannya menawarkan perlindungan yang lebih baik terhadap serangan preimage dan tabrakan dibandingkan algoritma MD sebelumnya, sekaligus memberikan throughput yang lebih tinggi untuk kumpulan data yang besar.",
    "MD6-StayingCurrent-030": "Sangat penting untuk terus mengikuti perkembangan temuan penelitian terbaru dan rekomendasi dari para ahli kriptografi ketika memilih fungsi hash untuk aplikasi apa pun, terutama karena lanskap keamanan kriptografi berkembang seiring waktu.",
    "MD6-UseInPKI-025": "Bisakah MD6 digunakan untuk Infrastruktur Kunci Publik (PKI) atau tanda tangan digital?",
    "MD6-vs-SHA3-Adoption-023": "SHA-3 telah diadopsi sebagai standar resmi NIST dan digunakan secara luas karena keamanan dan kinerjanya yang kuat. MD6, meskipun secara teoritis aman, belum mencapai tingkat adopsi atau standardisasi yang sama.",
    "MD6-vs-SHA3-DiffDesign-021": "MD6 dan SHA-3 keduanya dirancang dengan mempertimbangkan keamanan, namun menggunakan teknik hashing yang berbeda. MD6 menggunakan desain berbasis pohon untuk meningkatkan paralelisme, sedangkan SHA-3 didasarkan pada konstruksi spons.",
    "MD6-vs-SHA3-Flexibility-022": "MD6 menawarkan panjang keluaran yang bervariasi, yang dapat bermanfaat untuk aplikasi yang memerlukan ukuran hash khusus. SHA-3 juga mendukung panjang keluaran variabel, meskipun varian paling umum, SHAKE, memberikan lebih banyak fleksibilitas dengan keluaran panjang sewenang-wenang.",
    "MDN-DOM-API": "MDN Web Docs - Memanipulasi Dokumen",
    "MDN-Event-Loop": "Dokumen Web MDN - Perulangan Peristiwa",
    "MDN-JS-Guide": "Dokumen Web MDN - Panduan JavaScript",
    "MDN-JS-Types": "Dokumen Web MDN - Tipe Data dan Struktur Data",
    "MDN-JSON-in-JavaScript": "Dokumen Web MDN - Bekerja dengan JSON",
    "MDN-Minification": "Dokumen Web MDN - Minifikasi",
    "MDN-XML-Syntax": "Dokumen Web MDN - Sintaks XML",
    "MN2lT": "Panjang Kata Sandi tidak boleh kurang dari 6",
    "Ma5mv": "Alihkan visibilitas tab toolbar",
    "Minify-Basics-001": "Apa yang dimaksud dengan mengecilkan kode atau file?",
    "Minify-CLI-Usage-009": "Sebagian besar alat ini memiliki antarmuka baris perintah (CLI) dan API yang memungkinkan pengembang mengotomatiskan proses minifikasi selama pengembangan dan penerapan.",
    "Minify-Def-002": "Minifikasi adalah proses memperkecil ukuran kode (HTML, CSS, JavaScript, dll.) dengan menghapus karakter yang tidak perlu seperti spasi, komentar, dan jeda baris tanpa memengaruhi fungsinya.",
    "Minify-Example-007k": "Misalnya, {0} mungkin menjadi {1} setelah minifikasi.",
    "Minify-How-Works-004": "Bagaimana cara kerja minifikasi kode?",
    "Minify-Process-005": "Minifier menggunakan algoritme untuk menganalisis struktur kode sumber, menghilangkan elemen yang berlebihan, dan mempersingkat nama variabel jika memungkinkan. Hal ini menghasilkan ukuran file yang lebih kecil dengan tetap mempertahankan perilaku asli kode.",
    "Minify-Purpose-003": "Tujuan utama minifikasi adalah untuk meningkatkan kinerja situs web dan mengurangi waktu muat halaman dengan mengurangi jumlah data yang perlu ditransfer antara server dan klien.",
    "Minify-Tools-007": "Apa sajakah alat populer untuk mengecilkan kode?",
    "Minify-Tools-List-008": "Alat populer untuk mengecilkan kode termasuk UglifyJS untuk JavaScript, Terser yang merupakan evolusi dari UglifyJS, HTMLMinifier untuk HTML, dan CSSNano untuk CSS. Alat-alat ini sering kali dapat diintegrasikan ke dalam proses pembangunan menggunakan task runner seperti Gulp atau Webpack.",
    "Mq9pdpT": "Cantumkan semua sumber daya yang relevan untuk menu fungsional yang Anda pilih.",
    "Mq9ppT": "Lihat status layanan Anda dengan cepat",
    "Mqq9pdpT": "Membantu Anda memulai dengan LafTools.",
    "MrgmU": "Mengonfirmasi",
    "MySQL-Performance-Tuning": "Tip Penyetelan Kinerja MySQL",
    "NMLOn": "Salin Jalur File",
    "NMLOn1": "Buka Ruang Kerja",
    "NNfJo": "Muat Data dari File",
    "Nq1IR": "Tidak Dapat Memuat VM Ekstensi",
    "Nqc0LqwX": "Jika menurut Anda ada kerentanan dalam proses ini, jangan ragu untuk menghubungi kami melalui EMail atau GitHub kapan saja, kami ingin segera memperbaikinya.",
    "NrQc8OJfZ": "Mengompresi kode Notasi Objek JavaScript (JSON).",
    "NvOqE3B9Vxd": "Dan di bawah ini adalah kemungkinan solusi yang bisa Anda rujuk",
    "O94Yx": "pada",
    "OO0qPN": "Contoh Dimuat",
    "OQWm4": "Laporkan Bug",
    "OSHOI": "Halaman Selamat Datang",
    "OSqZQM": "Kata Sandi Lokal",
    "OWASP-JSON-Injection": "OWASP - Injeksi JSON",
    "OWASP-SQL-Injection": "Panduan Injeksi SQL OWASP",
    "OeO0PeN": "Oke, contohnya ditampilkan di editor input.",
    "OeOQY": "MELAKUKAN",
    "Ol1ZcWomT": "{0} Mempercantik",
    "OpPFe": "Jika Anda menyukai LafTools, silakan bagikan dengan teman Anda dan beri kami bintang, terima kasih!",
    "Opcty": "File",
    "OqqGx2qg": "Memuat sumber daya statis, harap tunggu...",
    "OrCt5": "Mengarahkan ke meja kerja...",
    "Ot6EP": "Alat Polandia",
    "P4ROa": "Wilayah Keluaran",
    "PM_N5": "Sesi - {0}",
    "PUxuU": "Mengambil data untuk paket bahasa...",
    "PapkF": "Jika Anda memiliki pertanyaan atau saran tentang LafTools, silakan beri tahu kami. Kami selalu mencari cara untuk meningkatkan produk kami dan memberikan pengalaman terbaik bagi pengguna kami. Anda dapat menghubungi kami di work7z@outlook.com. Terima kasih telah menggunakan LafTools!",
    "PpCHA": "Kunci Pertanyaan(?)",
    "PqazM-": "Pertama-tama, silakan gunakan kontrol formulir di bawah ini untuk mengenkripsi kata sandi Anda",
    "QL9Sn": "Saat ini, tampaknya belum ada deskripsi yang tersedia.",
    "QLKzF": "Ini dikemas dengan fitur-fitur yang memenuhi kebutuhan pengembang pemula dan berpengalaman, menjadikannya alat yang harus dimiliki di gudang senjata programmer mana pun.",
    "QM2Ob": "Alat Terbaru",
    "QM2Oq": "Catatan Terbaru",
    "QRAdA": "Bahasa Inggris ke Bahasa Mandarin",
    "QZK58Gemi": "Mengompresi kode Structured Query Language (SQL).",
    "QhdpH": "Edisi Komunitas",
    "QkJ-TOduip6z_": "IDE LafTools",
    "QzlA3": "Terjadi kesalahan",
    "R12bq": "Daftar tab yang tidak ditampilkan",
    "RNBze0": "Peralatan",
    "RNeBze0": "Tab yang Dibuka",
    "RNewBze0": "Konfigurasi Alat",
    "RO4ZP": "Terjadi kesalahan",
    "RPVRl": "Tampaknya ekstensi ini tidak kompatibel dengan versi LafTools saat ini. Harap pertimbangkan untuk menginstal versi terbaru untuk mendukung ekstensi ini, atau jangan ragu untuk menghubungi kami dengan menyampaikan masalah di GitHub.",
    "R_S7_CLAo": "Contoh: Untuk mengkodekan 'TEST12345' di Base32, Anda dapat menggunakan perpustakaan seperti base32-encode di Node.js, atau fungsi bawaan dalam bahasa lain seperti base64.b32encode Python.",
    "RhqzcdD": "Pengaturan sistem",
    "RjCO3": "Daftar Ruang Kerja",
    "S4MMV": "Ups! Kami menemukan beberapa masalah saat memuat file.",
    "SAnnQ": "Memuat berkas {0}",
    "SBsDz": "Pengaturan untuk Akun Admin Anda.",
    "SDLC-Wikipedia": "Siklus Hidup Pengembangan Perangkat Lunak - Wikipedia",
    "SETxuObyB": "Ajukan Masalah di GitHub atas kesalahan ini agar tim LafTools dapat menyelidikinya lebih lanjut.",
    "SGs7B": "Siapkan LafTools Anda dengan Cepat",
    "SHA-256-020": "SHA-256 (Secure Hash Algorithm) adalah alternatif yang banyak digunakan dan menawarkan keamanan yang lebih kuat daripada MD5. Ini menghasilkan nilai hash 256-bit yang lebih besar dan merupakan bagian dari keluarga SHA-2.",
    "SHA-2_Info-022": "Informasi SHA-2",
    "SHA3-NISTStandard-024": "Standardisasi SHA-3",
    "SMqD13": "Masukkan untuk memfilter",
    "SPem9": "Bidang ini belum siap.",
    "SQAw7": "Bahasa sumber",
    "SQL-Basics-001": "Apa itu SQL?",
    "SQL-Beautifier-Example": "Pemformat SQL Online",
    "SQL-Beautify-006": "Apa itu Kecantikan SQL?",
    "SQL-Beautify-Def-007": "Kecantikan SQL adalah proses memformat kode SQL untuk meningkatkan keterbacaan dengan menerapkan indentasi, spasi, dan konvensi huruf yang konsisten.",
    "SQL-Beautify-Purpose-008": "Sama seperti penghias kode umum, ini membantu pengembang memahami kueri kompleks dengan lebih mudah dan menjaga konsistensi di seluruh skrip atau proyek SQL mereka.",
    "SQL-Commands-005": "SQL mencakup beberapa jenis perintah: DDL (Data Definition Language - CREATE, ALTER, DROP), DML (Data Manipulation Language - SELECT, INSERT, UPDATE, DELETE), dan DCL (Data Control Language - GRANT, REVOKE).",
    "SQL-Components-004": "Apa saja komponen utama SQL?",
    "SQL-Components-Wikipedia": "Komponen SQL di Wikipedia",
    "SQL-Def-002": "SQL (Structured Query Language) adalah bahasa pemrograman standar untuk mengelola dan menanyakan database relasional.",
    "SQL-Indexing-016": "Apa itu indeks dalam SQL dan mengapa itu penting?",
    "SQL-Indexing-Benefit-018": "Membuat indeks pada kolom yang sering digunakan untuk kondisi klausa WHERE secara signifikan mempercepat kueri SELECT tetapi dapat memperlambat operasi INSERT, UPDATE, dan DELETE karena kebutuhan untuk mempertahankan struktur indeks.",
    "SQL-Indexing-Explanation-017": "Indeks adalah struktur data (misalnya, pohon-B) yang meningkatkan kecepatan operasi pengambilan data dalam tabel dengan memungkinkan mesin basis data menemukan baris dengan cepat berdasarkan nilai kolom tertentu.",
    "SQL-Indexing-MDN": "Dokumen Web MDN tentang Indeks",
    "SQL-Injection-019": "Apa itu SQL Injection dan bagaimana cara mencegahnya?",
    "SQL-Injection-Def-020": "SQL Injection adalah kerentanan keamanan di mana penyerang dapat memasukkan kode SQL berbahaya ke dalam kolom input untuk memanipulasi atau mengekstrak data dari database.",
    "SQL-Injection-Prevention-021": "Metode pencegahan mencakup penggunaan kueri berparameter, pernyataan yang disiapkan, atau pustaka ORM yang secara otomatis menghindari input pengguna, serta membatasi izin database dan menerapkan prinsip hak istimewa paling rendah.",
    "SQL-Joins-011": "Apa itu GABUNG di SQL?",
    "SQL-Joins-Explanation-012": "JOIN digunakan untuk menggabungkan baris dari dua tabel atau lebih berdasarkan kolom terkait di antara keduanya. Misalnya, INNER JOIN, LEFT JOIN, RIGHT JOIN, dan FULL JOIN.",
    "SQL-Joins-Tutorial": "Tutorial Gabung SQL",
    "SQL-Perf-Tuning-Methods-024": "Teknik lainnya termasuk mempartisi tabel besar, menggunakan tipe data yang sesuai, dan menyimpan hasil dalam cache jika memungkinkan.",
    "SQL-Perf-Tuning-Overview-023": "Mengoptimalkan kinerja kueri SQL melibatkan analisis rencana eksekusi, pengindeksan yang tepat, meminimalkan gabungan dan subkueri yang tidak perlu, dan menulis klausa WHERE yang efisien.",
    "SQL-Performance-Tuning-022": "Bagaimana cara mengoptimalkan kinerja kueri SQL?",
    "SQL-Purpose-003": "Ini digunakan untuk membuat, membaca, memperbarui, menghapus, dan mengkueri data dalam tabel serta mengelola struktur dan izin database.",
    "SQL-Select-009": "Bagaimana cara menulis pernyataan SELECT dasar?",
    "SQL-Select-Example-0210": "Pernyataan SELECT sederhana mengambil data dari tabel. Misalnya: {0}', 'PILIH kolom1, kolom2 DARI tabel_saya;",
    "SQL-Transactions-013": "Apa itu transaksi di SQL?",
    "SQL-Transactions-Def-014": "Transaksi adalah unit kerja logis yang berisi satu atau lebih pernyataan SQL. Ini memastikan bahwa semua operasi di dalamnya diselesaikan dengan sukses (atomisitas), terisolasi dari transaksi lain, dan tahan lama bahkan jika terjadi kegagalan sistem.",
    "SQL-Transactions-Example-015": "Untuk memulai transaksi, gunakan perintah MULAI TRANSAKSI; melakukan perubahan dengan COMMIT atau kembalikan ke keadaan sebelumnya dengan ROLLBACK.",
    "SQL-Transactions-W3Schools": "Transaksi SQL di W3Schools",
    "SYSq1": "Contoh",
    "SZgXb": "Siapkan Kata Sandi Lokal",
    "SdGcT": "Bagian lain",
    "Sm9tq": "Silakan berikan kata sandi akun di sini",
    "Sm9tqq": "Harap berikan kata sandi untuk membuka kunci LafTools Anda",
    "Spcfdee": "Mode Terang atau Gelap",
    "TBPqy7": "Bahasa",
    "TD7DA": "Bahasa",
    "TIOBE-Index": "Indeks TIOBE - Perusahaan Kualitas Perangkat Lunak",
    "TNoePE": "Awan LafTools",
    "Terser": "Terser - GitHub",
    "Ttrqqet": "Tulis dan Simpan pemikiran Anda di sini!",
    "TwFcr": "Bahasa Sasaran",
    "TyqvWY3": "File Lokal",
    "U2ZNl": "Pelajari lebih lanjut di Wikipedia",
    "U4qqq9": "Hapus tab ini dari daftar",
    "U5Eiy7ZRZ": "Kirim email ke tim LafTools({0}) untuk melaporkan kesalahan ini jika terkait dengan informasi sensitif.",
    "U7zP2": "Harap berikan nama pengguna akun di sini",
    "UF_Dp": "Terjadi Kesalahan: {0}, waktu yang ditolak adalah {1}",
    "UVvJp-vtF": "{0} Perkecil",
    "UZ2Ig": "Akun Lokal Baru",
    "UglifyJS": "UglifyJS - GitHub",
    "Ugpng": "Favorit",
    "V6U_f": "Ketentuan Layanan",
    "V6XEO": "Masukkan nama pengguna atau Email",
    "VAZq8r": "Hal ini memungkinkan pengembang untuk menjalankan berbagai perintah, seperti menjalankan skrip, menginstal paket, dan menavigasi sistem file, semuanya dari dalam editor.",
    "VEfeqZG": "Catatan",
    "VI6VT": "Sejarah",
    "VOsZc": "Laporkan Masalah",
    "VSZ": "Klik untuk memicu kembali",
    "VZtqg6": "Buat Formulir Skrip Baru",
    "Vaf2y": "Nama tab wajib diisi.",
    "VeY9K": "Syarat Penggunaan",
    "VgG5y": "Klik di sini untuk menyegarkan status ekstensi Anda",
    "Vvt09V2Qo": "Kode Generik",
    "W3Schools-XML-Validation": "W3Schools - Validasi XML",
    "WFUWzv_px": "Parsing dan cetak cantik kode JavaScript yang valid. Juga berfungsi dengan Notasi Objek JavaScript (JSON).",
    "WPrTW": "Situs Resmi",
    "WXo6D": "Disegarkan",
    "WYCVL": "Pengaturan Cepat",
    "X4L_Z": "Ekstensi VM tidak disediakan.",
    "X6Fq4j": "Setelah bertahun-tahun melakukan pengembangan dan penyempurnaan khusus, kami yakin bahwa LafTools dapat meningkatkan pengalaman pemrograman Anda secara signifikan dengan menghadirkan lebih banyak kenyamanan dan efisiensi pada alur kerja Anda.",
    "XKpI0": "Klik untuk memproses teks Anda di wilayah input",
    "XLWoR": "Pilih yang Anda sukai dan lanjutkan",
    "XML-Advantage-Readable-018": "Sifatnya yang dapat dibaca manusia memungkinkan pemeriksaan dan debugging dengan mudah, dan kemampuan untuk menentukan struktur khusus membuatnya fleksibel untuk berbagai kasus penggunaan.",
    "XML-Advantage-Standardized-017": "XML adalah standar yang diadopsi secara luas, membuatnya kompatibel dengan berbagai platform dan sistem, meningkatkan interoperabilitas dan pertukaran data.",
    "XML-Advantages-012": "XML memberikan lebih banyak fleksibilitas struktur dan mendukung namespace, yang dapat bermanfaat untuk struktur dokumen yang kompleks dan interoperabilitas antar sistem.",
    "XML-Advantages-016": "Apa keuntungan menggunakan XML?",
    "XML-Attributes-006": "Elemen dapat memiliki atribut, yang memberikan informasi tambahan tentang elemen dalam tag pembuka, seperti {0}",
    "XML-Basics-001": "Apa itu XML?",
    "XML-Def-002": "XML (eXtensible Markup Language) adalah bahasa markup yang mendefinisikan seperangkat aturan untuk menyandikan dokumen dalam format yang dapat dibaca manusia dan mesin.",
    "XML-Disadvantage-Size-020": "XML relatif bertele-tele, sehingga menghasilkan ukuran file yang lebih besar dibandingkan alternatif seperti JSON, sehingga memengaruhi kecepatan transmisi dan persyaratan penyimpanan.",
    "XML-Disadvantages-019": "Apa saja kelemahan menggunakan XML?",
    "XML-JSON-Diff-Structure-014": "XML menggunakan tag hierarki yang bertele-tele untuk strukturnya, sementara JSON mengandalkan pasangan nilai kunci dan array. Contoh: XML {0} vs. JSON {1}.",
    "XML-JSON-Diff-Syntax-015": "XML memiliki sintaks yang lebih ketat dengan tag dan atribut penutup, sedangkan sintaksis JSON lebih ringan dan mendekati notasi objek JavaScript. JSON umumnya dianggap lebih mudah untuk diurai dan dikirim melalui web.",
    "XML-JSON-Difference-013": "Apa perbedaan antara XML dan JSON?",
    "XML-Nesting-007": "Bagaimana cara kerja bersarang di XML?",
    "XML-Nesting-Example-009": "Misalnya, `<book><title>Judul Buku Saya</title><author>John Doe</author></book>` mewakili buku dengan judul dan pengarangnya sebagai elemen bertumpuk.",
    "XML-Nesting-Explanation-008": "Dalam XML, elemen dapat disarangkan satu sama lain untuk mewakili hubungan hierarki. Elemen anak ditempatkan di antara tag pembuka dan penutup elemen induknya.",
    "XML-Processing-Speed-021": "Penguraian dan pembuatan XML bisa lebih lambat karena sintaksisnya yang ketat dan perlunya validasi, terutama saat menangani dokumen yang kompleks.",
    "XML-Purpose-003": "Ini dirancang untuk membawa data, bukan menampilkan data seperti HTML, sehingga memungkinkannya digunakan sebagai format umum untuk berbagi informasi terstruktur di berbagai platform dan aplikasi.",
    "XML-Syntax-004": "Apa sintaks dasar XML?",
    "XML-Syntax-Example-005": "Dokumen XML sederhana terdiri dari elemen-elemen dalam struktur seperti pohon. Setiap elemen dimulai dengan tag dalam tanda kurung siku (<element>) dan diakhiri dengan tag penutup (</element>).",
    "XML-Validation-010": "Apa itu validasi XML dan bagaimana cara kerjanya?",
    "XML-Validation-Def-011": "Validasi XML memastikan bahwa dokumen XML mematuhi seperangkat aturan tertentu yang ditentukan dalam Definisi Tipe Dokumen (DTD) atau Skema XML (XSD).",
    "XML-Validation-Process-012": "Validator memeriksa apakah semua elemen dan atribut yang diperlukan ada, memvalidasi tipe data, dan menerapkan batasan apa pun yang ditentukan dalam skema sebelum memproses dokumen.",
    "XQxJB": "Ruang Kerja Saya",
    "X_HGx": "LafTools adalah kotak peralatan serbaguna yang dirancang untuk memenuhi berbagai kebutuhan. Ini sepenuhnya open-source, memastikan transparansi dan keamanan. Meskipun runtime-nya ringan, ia menawarkan dukungan platform penuh, termasuk ARMv8, dan dukungan AI asli yang mirip dengan ChatGPT. LafTools sangat terintegrasi dengan UI yang produktif dan terus diperbarui dengan alat-alat baru. Ini dapat digunakan melalui web dan dengan Docker, dan menyediakan sumber daya tambahan seperti catatan dan manual.",
    "XeXF77": "Pengaturan",
    "XikdD": "Mohon tunggu sebentar, kita hampir sampai!",
    "Y5GAC": "Nama pengguna Anda",
    "Y9mQ2": "Harap berikan nama pengguna akun di sini",
    "YAAU3q": "Kata Sandi Lokal",
    "YHCjT": "LafTools mendukung tema terang dan gelap global, ini berguna khususnya dengan pembuat kode shift malam.",
    "YNwKz": "Bahasa tidak didukung: {0}, akan menggunakan bahasa Inggris secara default.",
    "YOYTp": "Pengaturan Cepat",
    "YPPPL": "Alihkan visibilitas tab toolbar",
    "YQN9u": "Terjadi Kesalahan saat memuat {0}, silakan periksa detail di bawah.",
    "Y__Zb1_4Q": "Meminimalkan kode Cascading Style Sheets (CSS), menghapus semua karakter yang tidak perlu.",
    "Y_k0z": "Tidak ingat kata sandi?",
    "Ye3TXses": "Untuk mengonfigurasi apakah transformasi akan dijalankan secara otomatis ketika teks input diubah.",
    "Ylq2X": "Koreksi kesalahan",
    "YquQqTXq": "Jalankan Otomatis?",
    "YrTdq": "Semua",
    "YrVq683": "Surat",
    "YrVqdd683": "manual",
    "Z2QTU": "Tentang",
    "Z3rhY": "Pesan",
    "Z7ALO": "Beralih ke ruang kerja yang dipilih",
    "Z7OTt": "File yang Anda pilih terlalu besar, silakan pilih file kurang dari 30MB.",
    "ZAGva": "Apakah Anda yakin akan menghapus ruang kerja ini?",
    "ZAKaFq": "Akun Cloud Saya",
    "ZW1Dgz": "Tidak Ada Pesan yang Tersedia",
    "ZXRGC": "Silakan lihat kesalahannya: {0}",
    "ZbD3F": "{0}, dibuat oleh tim LafTools",
    "Zk7JI": "Itu belum didukung",
    "ZrbduC": "Tutup semua tab",
    "ZrbuC": "Tutup Tab",
    "_-JigU2Fg": "Input atau format data yang tidak terduga menyebabkan pengecualian.",
    "_5OqeG": "Hapus tanda itu",
    "_LFF3": "Jika Anda mengalami masalah apa pun atau memiliki saran saat menggunakan LafTools, jangan ragu untuk menghubungi kami melalui EMail atau GitHub kapan saja, kami bersedia memperbaikinya.",
    "_trez": "Tukar Teks",
    "_trqL": "Mengambil data untuk sumber daya sistem...",
    "_z3lR": "Segarkan Kode",
    "a3yqoz": "Orang Persia",
    "a3z-3k12": "Alat Alamat IP",
    "a4jbpq": "Ceko",
    "a4r9t": "Bisakah Base45 mendekode string apa pun yang dikodekan Base45 terlepas dari asalnya?",
    "a4s6x": "Bagaimana cara kerja Base32?",
    "a8b7z": "Jadi, padding hanya diperlukan jika kelompok bit terakhir yang dikodekan tidak habis dibagi 40 bit (karena 8 karakter Base32 mewakili 40 bit). Padding akan terdiri dari nol hingga enam karakter '=' di akhir string yang disandikan.",
    "aCkOP": "KELUAR",
    "aHAfR": "Mengambil data untuk {0}...",
    "aSOpr": "Penghasil Model Data",
    "ab9c0d1e": "Operasi utama meliputi pengkodean (mengonversi biner ke Base64) dan decoding (mengonversi Base64 kembali ke biner).",
    "abc12345": "Base64 adalah skema pengkodean yang merepresentasikan data biner sebagai rangkaian karakter ASCII.",
    "abcdef12": "Bagaimana cara kerja Base64?",
    "about_LafTools_toolbox": "Tentang LafTools",
    "adpgq": "Buat ruang kerja baru",
    "ah-C4": "Catatan Baru",
    "aj3nhd": "Jerman",
    "aked6": "Referensi",
    "aked61": "Perkenalan",
    "asElV": "Menghapus",
    "az4uS2": "Apakah Anda yakin untuk keluar dari sistem ini? Perhatikan bahwa Anda akan diarahkan ke halaman login.",
    "azpNX": "Lengkap.",
    "b0qjSL": "Silakan masuk ke direktori {1} dan buat berkas {2}, masukkan kata sandi terenkripsi Anda sebagai seluruh isi berkasnya.",
    "b6sx9b": "Filipina",
    "b8g2k": "Skenario penggunaan untuk Base32",
    "bP_6qG": "Tips Lupa Kata Sandi Anda",
    "bT4R6": "Tab baru",
    "bVlBN": "Bahasa Cina ke Bahasa Inggris",
    "bcdef01a": "Base64 bekerja dengan membagi data biner menjadi kelompok 6 bit dan memetakan setiap kelompok ke karakter tertentu dari alfabet 64 karakter (A-Za-z0-9+/).",
    "bhojei1": "Cina tradisional",
    "bjZyW": "Menerjemahkan",
    "bors14": "Turki",
    "bp_-b": "Untuk mengelola LafTools sepenuhnya, Anda perlu menyiapkan administrator Anda di awal alur penyiapan. Kami telah memverifikasi identifikasi Anda dengan token parameter URL, yakinlah bahwa tidak ada orang lain yang dapat mengatur izin root Anda kecuali dia mendapatkan token pengaturan.",
    "bqqrij": "Swahili",
    "bsWpBA73s": "Mengompresi kode JavaScript.",
    "c0eCw": "Terjemahkan teks Anda ke dalam bahasa apa pun yang Anda inginkan.",
    "c0v2p": "Operasi umum dengan Base32",
    "c1p3b": "Setelah terintegrasi, salin templat yang disediakan ke dalam program C++ Anda dan ganti placeholder dengan nilai yang disandikan sebenarnya sebelum menjalankan program.",
    "c1p4b": "Setiap angka desimal kemudian diubah menjadi urutan unik lima karakter Base85. Jika tersisa kurang dari empat byte di bagian akhir, padding mungkin diterapkan.",
    "c2tpr": "Pustaka Apache Commons Codec menyediakan fungsionalitas pengkodean dan dekode Base32 di Java.",
    "c2vw9k": "Meskipun Base45 tidak diterapkan secara luas seperti Base64 atau Base32, perpustakaan sumber terbuka tersedia untuk beberapa bahasa.",
    "c5m1b": "Varian lainnya, Base58Flickr, sedikit berbeda dalam rangkaian karakternya. Ini menggantikan '+' dengan ',' dan '/' dengan '-', menyesuaikan dengan kebutuhan URL Flickr.",
    "c5meku": "Sunda",
    "c5p1b": "Bantalan tidak digunakan; panjang keluaran yang dikodekan bergantung langsung pada ukuran data masukan.",
    "c6p4n": "Dalam templat yang disediakan, ganti placeholder di bagian dekode dengan byte aktual yang dikodekan Base85 (diawali dengan 'b'), lalu jalankan skrip.",
    "c6p9b": "Jika panjang data masukan tidak habis dibagi 8, padding tidak digunakan; sebaliknya, setiap kelompok yang tidak lengkap diperlakukan secara independen.",
    "c7Uoqqe": "Sebelum menggunakan LafTools, harap berikan dan konfirmasi kata sandi lokal Anda seperti di bawah ini.",
    "c8me6b": "Skema khusus seperti Base62 mungkin disesuaikan untuk aplikasi tertentu, tetapi umumnya mengikuti prinsip yang sama dalam menggunakan kumpulan karakter yang lebih besar daripada Base64 atau Base32.",
    "c9j5k": "Unduh dan sertakan header 'base32.h' dan penerapannya yang sesuai dalam proyek Anda.",
    "c9j5v": "Instal melalui Composer dengan menambahkan 'composer require christian-riesen/base32' ke proyek Anda.",
    "c9q7w": "Mengapa Base45 dibuat?",
    "cMBqyyFae": "Mengindentasi dan mempercantik kode Structured Query Language (SQL).",
    "cNQp_": "Sumber daya",
    "cPS6q": "Semua Alat",
    "cQqwI8r": "Memuat status Layanan Terminal",
    "cU0YAMbxU": "Tampilkan Teks di Sidebar",
    "cbaq54321": "Tidak, Base64 bukanlah teknik kompresi, ini hanya mengubah representasi data, bukan ukurannya.",
    "cdefg234": "Karakter padding (=) ditambahkan di akhir untuk memastikan panjang data yang dikodekan adalah kelipatan 4 karakter.",
    "cfYYN": "Temukan Lebih Banyak",
    "ciZV2": "Base32 adalah notasi untuk menyandikan data byte arbitrer menggunakan serangkaian simbol terbatas yang mudah digunakan oleh manusia dan diproses oleh komputer. Ini menggunakan kumpulan karakter yang lebih kecil dari Base64, biasanya alfabet huruf besar dan angka 2 hingga 7.",
    "ciZV21": "Base45 adalah notasi untuk menyandikan data byte arbitrer menggunakan serangkaian simbol terbatas yang mudah digunakan oleh manusia dan diproses oleh komputer. Basis angka yang tinggi menghasilkan string yang lebih pendek dibandingkan dengan sistem desimal atau heksadesimal. Base45 dioptimalkan untuk penggunaan dengan kode QR.",
    "ciZV2deq1": "Base58 (mirip dengan Base64) adalah notasi untuk menyandikan data byte arbitrer. Ini berbeda dari Base64 dengan menghapus karakter yang mudah salah dibaca (yaitu l, I, 0 dan O) untuk meningkatkan keterbacaan manusia. Base58 umumnya digunakan dalam mata uang kripto (Bitcoin, Ripple, dll).",
    "cj1pd": "Segarkan Operasi",
    "cjzqj9": "Bosnia",
    "cmxzpg": "Malayalam",
    "coM2I": "Gunakan Editor Cerdas",
    "crD7I": "Untuk mengonfigurasi apakah transformasi harus mengabaikan teks masukan kosong yang panjangnya nol.",
    "cuRCb": "Kategori tidak ditemukan.",
    "cuRCqb": "Kategori tidak ada",
    "cxqhqa": "Myanmar (Burma)",
    "d-l2l": "Mengonfirmasi",
    "d-qPr": "Tata letak tidak diketahui: {0}",
    "d1x7v": "Contoh lainnya adalah di Git, di mana objek hash terkadang disimpan dalam format Base32 untuk menghindari masalah dengan akhiran baris dan batasan nama file. Selain itu, HashiCorp Vault menggunakan Base32 untuk derivasi kunci.",
    "d2w4e": "Mirip dengan sistem konversi dasar lainnya, Base62 bekerja dengan mengubah byte input menjadi bilangan bulat besar, kemudian mengekspresikannya sebagai kombinasi karakter dari kumpulan 62 karakternya.",
    "d2w6e": "Unduh kode sumber dan sertakan file header base62.h di proyek Anda. Kompilasi/tautkan ke file sumber sesuai dengan instruksi proyek.",
    "d3w2e": "Base58 bekerja dengan mengubah byte input menjadi bilangan bulat besar, kemudian mengekspresikan bilangan bulat tersebut sebagai kombinasi karakter dari kumpulan 58 karakternya (A-Z, a-z, 1-9).",
    "d5KZH": "Terima kasih telah menggunakan LafTools!",
    "d5LAU": "Berlisensi di bawah AGPLv3",
    "d5fmq2": "Italia",
    "d5hit": "Sesi - {0}",
    "d5x1rl": "Orang Spanyol",
    "d6g0w": "Cuplikan ini dapat dijalankan di lingkungan Python apa pun, termasuk skrip, sesi interaktif, atau dalam aplikasi yang lebih besar.",
    "d6y9k": "Jika byte tidak cukup untuk mengisi grup terakhir, padding tidak digunakan; sebaliknya, bit-bit yang tersisa diproses dan dipetakan ke karakter yang sesuai.",
    "d7w2e": "Base85 bekerja dengan membagi data masukan menjadi kelompok empat byte dan mengubah setiap kelompok menjadi angka desimal antara 0 dan 2^32-1.",
    "d8w1b": "Tidak diperlukan instalasi tambahan karena ini adalah bagian dari perpustakaan standar. Pastikan versi Python Anda cukup baru untuk menyertakan fungsi ini.",
    "d9w7m": "Selain itu, karena hanya menggunakan huruf besar, ia tidak dapat memanfaatkan semua kemungkinan kombinasi sensitivitas huruf besar-kecil sebagai tindakan keamanan tambahan seperti yang terkadang dilakukan Base64 dengan pelipatan huruf besar-kecil selama decoding.",
    "dCFIC": "Kode Lebih Cantik",
    "dCFIwC": "Pembuat Kode",
    "dGKMx": "Keluaran",
    "dGVUB": "Alat Jaringan",
    "dQwjNbi0y": "Pelajari lebih lanjut tentang Dokumentasi",
    "dV5Eq": "Segarkan daftar ruang kerja",
    "dWbBm": "C# menyertakan kelas 'System.Convert' dengan metode bawaan ToBase64String dan FromBase64String yang memungkinkan Anda menyandikan dan mendekode data Base64. String input pertama-tama diubah menjadi array byte menggunakan pengkodean UTF-8, kemudian dikodekan dan didekodekan sesuai dengan itu.",
    "dk122q": "Kelola alur kerja Anda untuk menggabungkan beberapa alat secara bersamaan.",
    "dkarh": "Oke, kotak alat membuka direktori. Jika tidak ada jendela pop-up, periksa apakah platform Anda mendukung fungsi ini, atau direktorinya ada di server.",
    "dkjk12": "ini adalah ujian",
    "dkkq12": "Konfigurasikan alat Anda di tab ini.",
    "dl4kr": "Tidak ingat kata sandi?",
    "dpRY4": "Kamus",
    "dqTqyvWY": "Menu Laci",
    "dsdpA_eJ": "Sesuaikan Ukuran",
    "dtjdt4": "Kazakh",
    "dxLQq": "Izin Akar",
    "dzjTo": "Silakan berikan kata sandi akun di sini",
    "e--gB": "ID Ekstensi tidak diberikan.",
    "e3WgQaZlb": "Kompres {0}",
    "e4Cd8t": "Basis85",
    "e5c7r": "Base32 adalah skema pengkodean biner-ke-teks yang mewakili data dalam string ASCII menggunakan subset 32 ​​karakter. Ini dirancang agar dapat dibaca manusia dan aman untuk URL.",
    "e5rycw": "Kirgistan",
    "e8Crq": "Silakan isi kolom nama pengguna dan kata sandi di bawah ini untuk melanjutkan.",
    "e8x2v": "Base45 bekerja dengan membagi data masukan menjadi kelompok-kelompok yang masing-masing terdiri dari 5 byte. Ia kemudian mengubah setiap grup menjadi angka desimal dan memetakannya ke karakter yang sesuai dari kumpulan 45 karakternya.",
    "eN4fM": "Di Rust, Anda dapat menggunakan peti 'base64' untuk pengkodean dan dekode Base64. Tambahkan 'base64 = \\\"1.x\\\"' ke file Cargo.toml Anda di bawah bagian [dependencies], jalankan 'cargo build', dan sertakan impor yang diperlukan dalam kode Anda untuk memanfaatkan fungsi-fungsi ini.",
    "eTmq": "Sejarah Kotak Alat CodeGen",
    "e_8pZ": "Kotak peralatan serbaguna bagi pengembang untuk meningkatkan produktivitas.",
    "ediql2": "Hongaria",
    "efg45678": "Perbandingan dengan Base32",
    "efghi678": "Varian ini sering digunakan untuk nama file, URL, atau situasi di mana karakter khusus harus dihindari.",
    "egkqC8t": "Basis58",
    "egkqCd8t": "Basis62",
    "eifoni": "Katalan",
    "eqkqd4W": "Harap berikan nama untuk tag baru",
    "etV-l": "Salin File ke SIT2",
    "eu5mh0": "Belarusia",
    "euaI8": "Buat Akun Lokal Baru",
    "euhy9v": "Estonia",
    "f0q4w": "Salah satu skenario penggunaan yang populer adalah dalam menghasilkan kunci rahasia untuk Otentikasi Dua Faktor (2FA), di mana layanan seperti Google Authenticator dan Yubikey menggunakan rahasia yang dikodekan Base32.",
    "f1t2z": "Base62 dikembangkan untuk memberikan alternatif yang lebih pendek dan aman untuk URL dibandingkan Base64, khususnya untuk pengidentifikasi unik dan URL pendek.",
    "f3ttw8": "Maori",
    "f4t7z": "Base58 awalnya dikembangkan untuk Bitcoin untuk mewakili alamat publik dan kunci pribadi tanpa ambiguitas.",
    "f5a0s": "Selain itu, Base32 menghasilkan output yang lebih panjang tetapi lebih cocok untuk aplikasi tertentu seperti nama file karena kurangnya karakter khusus yang mungkin bertentangan dengan aturan sistem file.",
    "f5bLC": "Dokumentasi",
    "f7akol": "Bahasa inggris",
    "f7t1z": "Tambahkan perpustakaan ke proyek Xcode Anda secara manual atau melalui manajer paket seperti Swift Package Manager (SPM).",
    "f8n4m": "Kekompakannya memungkinkan penggunaan ruang yang lebih efisien dalam kode QR dengan tetap menjaga keterbacaan dengan pemindai kode batang standar.",
    "f8wne": "Sertakan paket dengan menjalankan 'Install-Package BouncyCastle' di Package Manager Console atau menambahkannya ke file .csproj Anda.",
    "f9t1z": "Base85 awalnya dikembangkan untuk merepresentasikan data biner secara efisien dalam dokumen PostScript untuk rasio kompresi yang lebih baik.",
    "f9t2z": "Tambahkan ketergantungan ke proyek Maven Anda dengan memasukkan `<dependency> <groupId>commons-codec</groupId> <artifactId>commons-codec</artifactId> <version>...</version> </dependency>` di file pom.xml dengan nomor versi terbaru.",
    "fBP5h": "Nama belakang",
    "fEr5j": "Buat Skrip Baru",
    "fTt2N": "Perl memerlukan modul 'MIME::Base64' untuk pengkodean dan dekode Base64. Instal dengan menjalankan 'cpan install MIME::Base64' jika belum diinstal.",
    "fV_1P": "Masuk",
    "fdxluz": "Rumania",
    "ff02c": "Dibatalkan",
    "fghi6789": "Ini digunakan untuk mengirimkan atau menyimpan file biner dalam format berbasis teks, memastikan kompatibilitas di berbagai sistem.",
    "fgj880": "Telugu",
    "fqV_1P": "Buka kunci LafTools Anda",
    "g1h5n": "Bagaimana cara kerja Base45?",
    "g2_aX": "Salin kata sandi terenkripsi ke dalam file",
    "g3h5s": "Bagaimana cara kerja Base85?",
    "g4h7s": "Untuk C++, Anda dapat menggunakan perpustakaan 'cpp-base62' yang menyediakan fungsionalitas Base62.",
    "g5SK9": "Buka Terbaru",
    "g5ybh": "Tambahkan ketergantungan ke proyek Anda (Maven: 'org.apache.commons:commons-codec').",
    "g6f0r": "Tidak diperlukan instalasi tambahan untuk perpustakaan inti Ruby. Cukup ganti 'TEST12345' dengan nilai yang Anda inginkan.",
    "g6f0t": "Jalankan 'go get github.com/mitchellh/go-base32' untuk menambahkan ketergantungan pada proyek Anda.",
    "g6v3b": "Namun, kumpulan karakter Base45 yang lebih besar dapat meningkatkan kemungkinan kesalahan saat menangani karakter non-alfanumerik, yang dapat menjadi masalah di beberapa lingkungan atau saluran transmisi.",
    "g7h5k": "Bagaimana cara kerja Base58?",
    "g8h7s": "Bagaimana cara kerja Base62?",
    "g8r3e": "Kerugian utama Base32 adalah efisiensi ruangnya yang relatif buruk; itu memperluas data masukan sekitar 25% lebih banyak daripada Base64. Artinya, diperlukan lebih banyak penyimpanan atau bandwidth untuk jumlah data yang dikodekan sama.",
    "gDjbs": "Data historis",
    "gK3dNQ": "Menyalin",
    "gQhfS": "Alat Berkas",
    "gT6re": "C++ tidak memiliki implementasi Base64 asli. Contoh ini menggunakan perpustakaan OpenSSL untuk melakukan pengkodean dan decoding Base64. Untuk menggunakan OpenSSL, instal di sistem Anda dan tautkan ke perpustakaan yang sesuai saat mengkompilasi program Anda.",
    "gU1O2": "Dipicu",
    "generic-NI-UFPTe0": "Mempercantik Kode Generik",
    "generic-code-beautify.desc.2b3c": "Operasi ini memformat kode dalam berbagai bahasa pemrograman untuk meningkatkan keterbacaan dengan menerapkan indentasi yang konsisten, jeda baris, dan mengikuti pedoman gaya bahasa tertentu.",
    "gkC8t": "Basis64",
    "gkdqqC8t": "Basis45",
    "gkqC8t": "Basis32",
    "gms7_9n5v": "Mengonversi string byte heksadesimal kembali ke nilai mentahnya.",
    "gnKMZ": "Disegarkan.",
    "h4e1b": "Ini juga berguna untuk situasi di mana string alfanumerik peka huruf besar-kecil lebih mudah ditangani dibandingkan heksadesimal atau base64, yang mungkin berisi karakter non-alfanumerik yang dapat menyebabkan masalah dalam konteks tertentu (seperti URL atau nama file).",
    "h6AeI": "Sambungan websocket ditutup pada {0}",
    "h7rUq": "Di Node.js, kelas 'Buffer' bawaan dapat menangani pengkodean dan decoding Base64 tanpa memerlukan perpustakaan eksternal apa pun. Cuplikan kode ini mengkodekan string 'TEST12345' ke Base64 dan kemudian menerjemahkannya kembali ke string asli.",
    "h9j3m": "Bantalan di Base32",
    "hAH_IjzGN": "Ini adalah versi orang dalam, bagian ini masih dalam pengembangan.",
    "hGA96yTG4": "Beberapa fitur tidak didukung di platform ini.",
    "hJUMN": "Bahasa Sasaran",
    "hMvh1": "Basis Data Cadangan",
    "hRFxV": "Untuk informasi lebih lanjut, silakan kunjungi situs web kami",
    "hX1CWGAhl": "Mengindentasi dan mempercantik kode eXtensible Markup Language (XML).",
    "hcnt1k": "Makedonia",
    "hhOT3": "Cari berdasarkan nama",
    "hij90klm": "Base32 menggunakan alfabet yang lebih kecil (A-Z2-7), menghasilkan string yang lebih panjang namun lebih mudah dibaca manusia.",
    "htTmvWjsS": "Mengompresi kode Cascading Style Sheets (CSS).",
    "htt1d2": "Esperanto",
    "hu-iz": "pengatur waktu",
    "huE6U": "Variabel",
    "hyV-d": "Selesai",
    "hyirc0": "Orang Swedia",
    "i27qmr": "Frisia",
    "i6hMN": "Kode Verifikasi Gambar",
    "i7w2m": "Apakah ada perpustakaan Base45 bawaan dalam bahasa pemrograman populer?",
    "i88tb": "Ekspor Hasil ke File",
    "i8q8tb": "Konfigurasikan Alur Kerja untuk Input",
    "i9o7k": "Keunggulan Base32 dibandingkan Base64",
    "iNQvo": "Tunjukkan contoh untuk memulai.",
    "iNqF1T": "Kelola Akun Cloud",
    "iOEjZ": "Tidak Ada Kode yang Tersedia",
    "iQL2c": "Kami masih mengeksplorasi berbagai fungsi tombol ini - jika Anda memiliki masukan atau saran tentang bagaimana kami dapat memperbaikinya, beri tahu kami!",
    "i_lang_": "Paket Bahasa",
    "ib135dq": "Pesan Status Anda akan ditampilkan di sini",
    "iknTS": "Pengelola Kata Sandi",
    "init_env": "Memuat Sumber Daya Sistem",
    "ip2g1": "Disalin",
    "ipOSQE": "Edisi Pro",
    "it8ths": "bahasa Indonesia",
    "ixyP0": "Memproses tindakan realtime secara otomatis",
    "j1b5k": "Operasi paling umum yang melibatkan Base32 mencakup pengkodean data biner ke dalam string Base32 dan mendekode string Base32 kembali ke format biner aslinya.",
    "j4s6r": "Bagaimana cara menyandikan/mendekode dengan Base62 di JavaScript?",
    "j5s7r": "Bagaimana cara menyandikan/mendekode dengan Base85 di JavaScript?",
    "j6s3r": "Bagaimana cara menyandikan/mendekode dengan Base58 di JavaScript?",
    "j7k2t": "Untuk mengkodekan data dengan Base45, Anda memerlukan perpustakaan atau fungsi yang mengimplementasikan algoritma Base45.",
    "j8s6r": "Untuk Kotlin, Anda dapat menggunakan perpustakaan 'barcode-core' yang mencakup fungsionalitas Base45.",
    "j9s5r": "Untuk C#, gunakan perpustakaan 'WarrenStranger.Base62' untuk menangani pengkodean dan decoding Base62.",
    "jJuNz": "Bahasa sumber",
    "jO5eP": "OKE",
    "jPNCb": "Mencoba lagi.",
    "jQXdi": "Modus Cahaya",
    "jR1zX": "laboratorium AI",
    "jRzgS": "Kerangka kerja Foundation Swift mencakup metode bawaan untuk pengkodean dan dekode Base64. Tidak diperlukan perpustakaan eksternal; cukup impor 'Foundation' untuk menggunakan fitur ini.",
    "jZvLJ": "PHP hadir dengan fungsi bawaan 'base64_encode()' dan 'base64_decode()' untuk menangani operasi Base64. Fungsi-fungsi ini sudah tersedia dan tidak memerlukan pengaturan atau instalasi tambahan.",
    "jaj7M": "Seluruh hak cipta.",
    "jb392": "Nama",
    "jfpqt": "Navigator Catatan",
    "jgDoEq": "Tidak ada Data Pertanyaan Umum",
    "jhDoE": "Mengambil Data FAQ",
    "jlxvpk": "Korea",
    "json-beautify.desc.0912": "Operasi ini memformat data JSON untuk meningkatkan keterbacaan dengan menambahkan indentasi yang tepat, jeda baris, dan kunci pengurutan secara konsisten.",
    "json-beautify.name.0912": "Memformat SQL",
    "json-beautify.text.93kq": "Mempercantik Data JSON",
    "k17PG": "Koneksi soket web ditutup.",
    "k1m4e": "Namun, ia tidak menawarkan efisiensi ruang yang sama seperti Base64 atau Base32 karena menggunakan lebih sedikit karakter dalam alfabetnya.",
    "k2SVY": "mati",
    "k2em5e": "Hal ini menghasilkan string keluaran yang lebih pendek untuk jumlah data masukan yang sama, yang dapat bermanfaat dalam skenario di mana meminimalkan ukuran sangatlah penting.",
    "k2ku5p": "Ceko",
    "k3m2e": "Salin templat yang disediakan ke file Go baru, ganti placeholder dengan nilai sebenarnya yang disandikan, lalu jalankan file menggunakan `go run yourfile.go`",
    "k41a5": "alat laf",
    "k4s5rx": "Slovenia",
    "k7d9f": "Pustaka 'base32' bawaan Ruby menyediakan metode untuk pengkodean dan decoding Base32.",
    "k7d9r": "Paket 'go-base32' menyediakan kemampuan pengkodean dan decoding Base32 di Go.",
    "k7g0n": "Di Base32, setiap 5 bit data masukan dipetakan ke salah satu dari 32 karakter dari kumpulan 'ABCDEFGHIJKLMNOPQRSTUVWXYZ234567='.",
    "k9em5e": "Hal ini menjadikannya ideal untuk skenario yang memerlukan pengidentifikasi yang ringkas dan ramah URL tanpa mengorbankan keterbacaan.",
    "k9jtr": "Paket npm 'base32-encoding' digunakan untuk pengkodean dan decoding Base32 di Node.js.",
    "kLH79": "Surel",
    "kOi5A": "Halaman Cetak",
    "kPD22": "Kamus",
    "kPJ-A4": "Menyegarkan",
    "kZd9G": "Ruby memiliki perpustakaan 'base64' bawaan yang menyediakan metode untuk pengkodean dan decoding Base64. Sertakan perpustakaan dengan 'memerlukan \\\"base64\\\"' dalam skrip Anda.",
    "kcHxr": "Silakan berikan nama pengguna akun admin di sini",
    "kjks1": "Mengambil konfigurasi i18n dari API server lokal",
    "kqv5ht": "Yiddi",
    "krxSK": "Asisten AI",
    "ks12d": "Keamanan cyber",
    "kv4wag": "Belanda",
    "l1p9z": "Apa itu Base32?",
    "l3akoa": "Amharik",
    "l6Djb": "Pilih salah satu opsi sebagai tema pilihan Anda:",
    "lIn3_": "Nama Pengguna Admin",
    "lQFII": "Picu kembali inisialisasi",
    "lRHDQ": "Keluar dari Mode Layar Penuh",
    "lUh5c": "Generator",
    "lkuulh": "Perancis",
    "lp0qmd0": "Tandai sebagai favorit",
    "lpKAz": "Pengaturan",
    "lpzg83": "Samoa",
    "lzGS2": "Detil Ekstensi",
    "m0106": "Konverter",
    "m0107": "pembangkit",
    "m0108": "Pemformat",
    "m6d8b": "Setiap nilai 5-bit diwakili oleh satu karakter, memungkinkan pengkodean dan penguraian kode yang efisien untuk sistem yang lebih suka bekerja dengan oktet (unit 8-bit).",
    "m6t1b": "Pustaka 'base32' oleh Daniel R. Collins menyediakan fungsionalitas pengkodean dan dekode Base32 di C++.",
    "m7WZw": "Soket Web Sistem Rusak",
    "m8rTc1": "Setelah manajer skrip shell diimplementasikan, Anda dapat menggunakannya untuk mengelola perintah shell Anda.",
    "m9k1z": "Namun, jika data yang didekode berisi semantik aplikasi tertentu (misalnya, format kode QR tertentu), pemrosesan tambahan mungkin diperlukan setelah dekode.",
    "mBgF1": "Aksi Tikus",
    "mSFei": "Kode Sumber di GitHub",
    "mWXeh": "ID Ruang Kerja: {0}",
    "mabHq": "Temukan File Lama",
    "mbzCv": "Terjadi Kesalahan: {0}, waktu yang ditolak adalah {1}",
    "md2.desc.1039": "Operasi ini meng-hash data menjadi hash {0}.",
    "md2.text.192d3": "Hasilkan {0} Hash",
    "md2aO2NaJITm": "Mengindentasi dan mempercantik kode Cascading Style Sheets (CSS), sehingga lebih mudah dibaca dan dipahami.",
    "md4.desc.1039": "Operasi ini meng-hash data menjadi hash {0}.",
    "md4.text.192d3": "Hasilkan {0} Hash",
    "md5-cpp-install-openssl-0002": "Instal OpenSSL di sistem Anda dan tautkan ke pustaka 'libssl' dan 'libcrypto' saat membangun aplikasi C++ Anda.",
    "md5-cpp-openssl-0001": "C++ menggunakan perpustakaan OpenSSL untuk menghasilkan hash MD5. Anda perlu menginstal OpenSSL dan menautkannya ke proyek Anda.",
    "md5-cpp-use-openssl-0003": "Cuplikan tersebut membuat fungsi 'getMD5' yang mengambil string masukan, menghitung hash MD5 menggunakan API MD5 OpenSSL, dan mengembalikan hash sebagai string heksadesimal. Rekatkan kode ini ke program C++ Anda dan panggil fungsi 'getMD5' dengan input yang Anda inginkan.",
    "md5-csharp-built-in-0001": "Di C#, kelas 'System.Security.Cryptography.MD5' digunakan untuk menghasilkan hash MD5.",
    "md5-csharp-no-install-0002": "Tidak diperlukan instalasi perpustakaan eksternal karena ini adalah bagian dari .NET Framework/Core.",
    "md5-csharp-use-0003": "Cuplikan ini membuat instance MD5, mengubah string input menjadi byte, menghitung hash, dan terakhir mengkodekan hash dalam format Base64. Tempatkan kode ini di titik masuk aplikasi C# Anda dan jalankan untuk mendapatkan hash MD5 yang dikodekan Base64.",
    "md5-java-built-in-0001": "Java menggunakan kelas 'java.security.MessageDigest' untuk menghasilkan hash MD5.",
    "md5-java-imports-0002": "Anda perlu mengimpor 'java.security.MessageDigest' dan 'java.util.Base64' untuk melakukan hashing dan menyandikan hasilnya.",
    "md5-java-use-0003": "Cuplikan tersebut mendapatkan instance algoritma intisari MD5, memperbaruinya dengan byte string input, dan kemudian mengkodekan hash yang dihasilkan ke dalam string Base64. Salin kode ini ke kelas Java dan jalankan metode utamanya untuk mendapatkan hash MD5 yang dikodekan Base64.",
    "md5-nodejs-built-in-0001": "Di Node.js, modul 'crypto' bawaan digunakan untuk menghasilkan hash MD5.",
    "md5-nodejs-no-install-0002": "Tidak diperlukan instalasi perpustakaan eksternal karena 'crypto' sudah diinstal sebelumnya dengan Node.js.",
    "md5-nodejs-use-0003": "Cuplikan ini membuat objek hash menggunakan `createHash('md5')`, memperbaruinya dengan string input, lalu mengonversi intisari ke format heksadesimal melalui `.digest('hex')`. Tempelkan kode ini ke skrip Node.js Anda dan jalankan untuk mendapatkan hash MD5 dari nilai input.",
    "md5-php-built-in-0001": "PHP memiliki fungsi bawaan 'md5()' untuk menghasilkan hash MD5.",
    "md5-php-no-install-0002": "Tidak diperlukan instalasi perpustakaan eksternal karena 'md5()' sudah diinstal sebelumnya di PHP.",
    "md5-php-use-0003": "Contoh sederhana ini mendefinisikan fungsi 'getMD5' yang memanggil fungsi PHP 'md5()' pada string input yang disediakan. Salin kode ini ke dalam file PHP, simpan dengan ekstensi .php, dan jalankan di server web atau melalui baris perintah untuk melihat hash MD5 dari nilai input.",
    "md5-python-built-in-0001": "Python menggunakan perpustakaan 'hashlib' bawaan untuk menghasilkan hash MD5.",
    "md5-python-no-install-0002": "Tidak diperlukan instalasi tambahan karena 'hashlib' hadir sebagai standar dengan Python.",
    "md5-python-use-0003": "Templat yang disediakan mengkodekan string input ke byte sebelum membuat objek hash MD5. Metode '.hexdigest()' kemudian dipanggil pada objek hash untuk mengambil hash MD5 dalam bentuk heksadesimal. Salin kode ini ke dalam skrip Python dan jalankan untuk mendapatkan hash MD5.",
    "md5.desc.rxsHq": "Operasi ini meng-hash data menjadi hash {0}.",
    "md5.textiDjMIo": "Hasilkan {0} Hash",
    "md6.desc.1039": "Operasi ini meng-hash data menjadi hash {0}.",
    "md6.text.192d3": "Hasilkan {0} Hash",
    "meeMC1Uk7.text.93kq": "Perkecil {0}",
    "mihc3": "Menyelesaikan operasi ini",
    "mjHoR": "Selain itu, secara teknis, tidak ada seorang pun yang dapat membaca token ini jika tidak, dia telah menyerang dan mengendalikan komputer Anda.",
    "mnb19i": "Jerman",
    "mno34567": "Keuntungan Base64",
    "mnoijklm": "Apakah ada pengkodean BaseXX lainnya?",
    "mslw4o": "Orang yunani",
    "mwn7iv": "Zulu",
    "myxedr": "Mongolia",
    "n0pqrstu": "Contoh penggunaan Base64",
    "n1jA9": "Mengonfirmasi",
    "n24tes": "Portugis (Brasil)",
    "n3e7r": "Sejarah Base32",
    "n94an4": "Polandia",
    "n98EW": "Tukar teks wilayah masukan dan wilayah keluaran.",
    "nSeIq8-": "Yang terpenting, ini gratis dan open source. Anda dapat menggunakannya untuk tujuan pribadi atau komersial.",
    "nTvw4": "Untuk melindungi dan menyimpan data dan pengaturan Anda secara terpisah, Anda dapat menggunakan akun lokal Anda untuk mencapainya. Selain itu, LafTools akan mendukung widget pesan instan antar pengguna di masa depan.",
    "nmb1wx": "Yoruba",
    "nodBw": "Operasi ini mengkodekan data mentah ke dalam string ASCII {0}.",
    "nopqrs01": "Meskipun Base64 mengoptimalkan kekompakan, Base32 dipilih ketika meminimalkan kesalahan input, seperti entri manual, sangatlah penting.",
    "nrix6l": "Chichewa",
    "nxJC7": "Tindakan default yang akan dijalankan saat transformator dijalankan.",
    "o1umzi": "Perancis",
    "o52xW": "Ekspor",
    "o8xyzu": "Luksemburg",
    "oBz8D": "Memuat",
    "oNLxH": "Nama belakang",
    "oNg3f": "Situs Resmi",
    "ocxsw3": "orang Irlandia",
    "of_ox": "Secara keseluruhan, LafTools adalah solusi terpadu untuk semua kebutuhan Anda.",
    "oj23X": "Pulihkan Basis Data",
    "ojCWEFdVe": "Mengompresi kode JavaScript, menghapus semua karakter yang tidak perlu.",
    "ooiFU": "Mulai ulang Layanan Java",
    "oqHqVq": "Sortir dengan",
    "oqHqqV": "Total: {0} Perintah",
    "oqHqqVq": "Salin Waktu",
    "oqjbcj": "Laos",
    "os8h6u": "Orang Denmark",
    "p5e9n": "Tambahkan pustaka sebagai dependensi dalam skrip build Gradle Anda. Misalnya, di file build.gradle tingkat aplikasi, tambahkan `implementation 'com.bottlerocketstudios:barcode-core:...'` dengan nomor versi terbaru.",
    "p6e3n": "Instal paket melalui NuGet dengan menjalankan `Install-Package WarrenStranger.Base62` di Package Manager Console atau tambahkan melalui NuGet Package Manager.",
    "p8Exxc1s": "Ada berbagai alat yang memanfaatkan teknologi AI untuk melakukan tugas dengan lebih efisien di Laboratorium AI.",
    "p8eq9n": "Anda dapat menggunakan perpustakaan seperti 'base85' atau 'ascii85' untuk pengkodean dan decoding Base85 dalam JavaScript.",
    "p9e1n": "Anda dapat menggunakan perpustakaan seperti 'base-x' atau 'base62' untuk pengkodean dan decoding Base62 dalam JavaScript.",
    "p9s5t": "Base32 dikembangkan oleh Douglas Crockford, yang dikenal karena kontribusinya pada JavaScript, pada tahun 2001. Base32 dibuat sebagai alternatif yang lebih andal untuk pengkodean yang ada seperti Base64, terutama untuk situasi yang memerlukan representasi data biner berbasis teks.",
    "pANmj": "Tag dapat ditentukan berdasarkan jenis server, penggunaan skrip, atau kriteria lain yang Anda inginkan.",
    "pA_deJ": "Ekspor ke Papan Klip",
    "pA_feeJ": "Hubungkan kembali Terminal",
    "pA_qweJ": "Hapus Penyangga",
    "pDBSWq": "tidak ada konten yang tersedia untuk panel kanan",
    "pEk1kk": "LafTools menghadirkan fungsionalitas yang berguna untuk Anda di sini.",
    "pEk1qkk": "Daftar semua tab yang dibuka",
    "pHZDB": "Aksi Waktu Nyata",
    "pJoOz": "Membuka file",
    "pKHRT": "Buka Alat",
    "pKqHRq": "Catatan Pencarian",
    "pL6qH": "Lengkap.",
    "pZ4d616m-": "Mempercantik {0}",
    "ph5jH": "Menangani bagian ini",
    "piih4x": "Tajik",
    "pmAee": "Baca informasi lebih lanjut tentang alat ini.",
    "pmnp4b": "Orang Ukraina",
    "ppmz8e": "Kreol Haiti",
    "pq5e9n": "Anda dapat menggunakan perpustakaan seperti 'bs58' untuk melakukan pengkodean dan decoding Base58 dalam JavaScript.",
    "pqrs890t": "Kompatibilitas Universal: Base64 dikenal luas dan didukung di semua bahasa pemrograman utama.",
    "pqs7y3": "Mohon pertimbangkan untuk mendaftarkan halaman web ini sebagai PWA untuk mendapatkan dukungan keymap penuh.",
    "psA_eJ": "Ekspor sebagai File",
    "psZoP": "Letakkan file di sini untuk memprosesnya",
    "psqqpq_o": "Oke, hasilnya telah disalin ke clipboard Anda sebanyak {0} kali.",
    "pzn2IpkDo": "Membuat indentasi dan cetakan cantik kode JavaScript Object Notation (JSON).<br><br>Tag: json viewer, prettify, penyorotan sintaksis",
    "q12beqwR": "Tidak Ada Alat yang Tersedia",
    "q29t31": "Polandia",
    "q2n3r": "Saat ini, ini digunakan dalam berbagai aplikasi yang mengutamakan efisiensi ruang dan keterbacaan, seperti dokumen PDF dan protokol jaringan tertentu.",
    "q2n9r": "Setelah ditambahkan, salin template yang disediakan ke file Swift. Perhatikan bahwa dalam contoh ini, kami menggunakan skenario hipotetis di mana Anda memiliki representasi base64 string Base45; ganti dengan nilai aktual yang disandikan sebelum menjalankan kode.",
    "q2w5m": "Tujuan menggunakan Base32?",
    "q2x8k": "Penggunaannya telah meluas ke mata uang kripto lain dan skenario yang menginginkan string yang dapat dibaca manusia dan tahan kesalahan.",
    "q5h8n": "Keuntungan utamanya adalah pengurangan panjang string untuk jumlah data yang dikodekan sama, sehingga cocok untuk aplikasi yang mengutamakan efisiensi ruang.",
    "q6n1r": "Setelah menginstal perpustakaan, salin kode templat ke kelas Java dan ganti placeholder dengan nilai aktual yang dikodekan Base85 sebelum menjalankan kode.",
    "q7n3r": "Hal ini juga menghindari karakter ambigu seperti 'O' dan '0', 'I' dan 'l', yang dapat menyebabkan kesalahan transkripsi manusia.",
    "q9iuti": "bahasa Wales",
    "qDrbEr": "Nama pengguna yang Anda berikan kosong, silakan periksa dan coba lagi.",
    "qF4uS2": "Buat Ruang Kerja",
    "qF4uS23": "Jendela baru",
    "qHoktx": "Terima kasih!",
    "qN1LdZ2": "Terakhir diubah",
    "qQmBr": "Terjemahan Teks",
    "qTqyvWdY": "Belum selesai",
    "qWemXE4": "1 Januari 2024",
    "qWw3eTH": "Bagian ini membantu memelihara file di disk lokal atau disk cloud Anda.",
    "qdeFXx": "Saat ini, halaman yang Anda cari belum sepenuhnya diterapkan.",
    "qpDBSW": "tidak ada panel yang tersedia",
    "qpDBSWe1": "tidak ada panel yang tersedia",
    "qqK_x_": "Masuk",
    "qqqwYoz": "Membantu",
    "qqwYoz": "tab",
    "qqwYqwe": "Ruang kerja",
    "qrstuvwx": "Ya, selain Base64 dan Base32, ada juga Base16 (Heksadesimal), Base58, dan Base85, masing-masing dirancang untuk skenario berbeda.",
    "qtpmvP": "Konfirmasi Kata Sandi Lokal",
    "qubSJ": "Ekstensi VM bukan ID. (REF: IQnMH).",
    "qv1p5n": "Misalnya, di Java, Anda bisa menggunakan perpustakaan 'org.iso.base45' untuk menyandikan data Anda.",
    "qzshys": "bahasa Urdu",
    "r1GLS": "Tag",
    "r2n7v": "Keuntungan utamanya adalah peningkatan keterbacaan karena tidak termasuk karakter yang tampak serupa, mengurangi kesalahan selama entri manual.",
    "r4n6v": "Tambahkan ketergantungan ke proyek Anda dengan menjalankan `go get github.com/xyproto/base62`. Ini akan mengunduh dan menginstal paket.",
    "r6nq2v": "Keuntungan utama Base62 adalah peningkatan efisiensi ruang karena kumpulan karakter yang lebih besar daripada Base32 tetapi tanpa karakter non-alfanumerik yang ditemukan di Base64.",
    "r8c6z": "Ganti 'TEST12345' dengan string Anda sendiri dan jalankan kelas ini sebagai program Java untuk melihat hasilnya.",
    "r8y2w": "Pustaka PHP 'Base32' digunakan di sini untuk pengkodean dan decoding Base32.",
    "r9a3t": "Base45 adalah skema pengkodean berbasis teks yang mengkodekan data biner menjadi karakter ASCII.",
    "r9qn8v": "Keuntungan utama Base85 adalah peningkatan efisiensi ruang karena kumpulan karakter yang lebih besar (85 vs. 64 di Base64 atau 32 di Base32).",
    "rE6fUsSGl": "Mengindentasi dan mempercantik kode Structured Query Language (SQL).",
    "rK6cx": "{0}, dirancang dan dikembangkan oleh tim LafTools",
    "rLXJN": "Di Kotlin, kelas 'android.util.Base64' bawaan Android dapat digunakan untuk pengkodean dan decoding Base64. Contoh ini mengasumsikan lingkungan Android; untuk proyek Kotlin non-Android, pertimbangkan untuk menggunakan 'java.util.Base64'.",
    "rQkas": "Selamat datang di LafTools",
    "rR1vd": "Masukan Dari File",
    "rT34qnO": "Masukkan teks untuk diproses. Hasilnya akan ditampilkan di editor keluaran.",
    "rVqlu": "Dekode {0}",
    "rYSpwq": "Algoritme MD2 (Message-Digest 2) adalah fungsi hash kriptografi yang dikembangkan oleh Ronald Rivest pada tahun 1989. Algoritme ini dioptimalkan untuk komputer 8-bit. Meskipun MD2 tidak lagi dianggap aman, bahkan mulai tahun 2014, MD2 tetap digunakan di publik. infrastruktur utama sebagai bagian dari sertifikat yang dihasilkan dengan MD2 dan RSA. Algoritma intisari pesan, secara default, terdiri dari 18 putaran.",
    "r_n6h": "Mode Terang atau Gelap",
    "rf0mql3": "Tema Terang atau Gelap",
    "rpG0G": "Kami menghargai masukan Anda dan ingin mendengar pendapat Anda tentang bagaimana kami dapat meningkatkan produk kami - jangan ragu untuk menyampaikan masukan Anda kepada kami!",
    "rub76Z8zx": "Mencoba mencetak bahasa gaya C seperti C, C++, C#, Java, PHP, JavaScript, dll. Ini tidak akan berfungsi dengan sempurna, dan kode yang dihasilkan mungkin tidak berfungsi lagi. Operasi ini dirancang murni untuk membuat kode yang dikaburkan atau diperkecil menjadi lebih mudah dibaca dan dipahami. Hal-hal yang tidak akan berfungsi dengan baik: Untuk pemformatan loop, pemformatan loop Do-While, indentasi Switch/Case, Operator pergeseran bit tertentu",
    "run_text": "Sebelum memasuki meja kerja Anda, kami ingin memuat sumber daya sistem yang diperlukan terlebih dahulu. Mohon tunggu beberapa saat, akan segera selesai, detailnya dapat dilihat seperti di bawah ini.",
    "rycJy": "LafTools adalah kotak peralatan serbaguna yang dirancang khusus untuk programmer. Ini mewakili versi kedua dari CodeGen Toolbox, sekarang dengan runtime yang lebih ringan yang ditulis dalam Golang dan JavaScript.",
    "ryhkqb": "Bulgaria",
    "s-fxP80Dd": "IDE LafTools",
    "s0vrf9": "Ibrani",
    "s1b3m": "Tidak seperti Base64 atau Base32, ini tidak menyertakan karakter '0', 'O', 'I', dan 'l' yang mudah membingungkan, sehingga cocok untuk URL dan kode QR.",
    "s3e6r": "Bagaimana cara menyandikan data menggunakan Base45?",
    "s4OeX": "Berhasil masuk ke sistem",
    "s5b8m": "Ganti 'TEST12345' dengan data Anda sendiri dan jalankan skrip ini di lingkungan PHP untuk melakukan operasi Base32.",
    "s5e8r": "Ganti 'TEST12345' dengan data aktual Anda dan jalankan cuplikan ini dalam konteks aplikasi Swift untuk melakukan operasi Base32.",
    "s5t0n": "Padding di Base32 melibatkan penambahan karakter '=' untuk memastikan bahwa potongan akhir data yang disandikan masih berisi kelipatan 8 bit. Namun, tidak seperti Base64, padding Base32 minimal karena setiap karakter Base32 sudah mengkodekan 5 bit.",
    "s7e9r": "Tidak diperlukan perpustakaan eksternal. Cukup ganti 'b'TEST12345'' dengan objek mirip byte Anda yang sebenarnya untuk menyandikan/mendekode.",
    "sBxHr": "Scala menggunakan kelas 'java.util.Base64' bawaan Java untuk operasi Base64. Pastikan Anda menjalankan platform JVM dengan Java 8 atau lebih tinggi.",
    "sHoxxW": "Sejarah",
    "sKx5t": "Kelas 'java.util.Base64' bawaan Java, tersedia sejak Java 8, menyediakan metode untuk pengkodean dan decoding Base64. String masukan diubah menjadi byte menggunakan pengkodean UTF-8, kemudian dikodekan dan didekode sesuai kebutuhan.",
    "sO0MOe": "Setiap kali Anda berada di jendela lebih dari 5 detik, itu akan ditampilkan di sini.",
    "sR8yc": "Menutup",
    "sc49my": "Sindhi",
    "sdfk1": "Gulir tab ke kiri",
    "sdfk13": "Gulir tab ke kanan",
    "sglMS": "Ciptakan Waktu",
    "sk123": "Belum selesai",
    "slqcWD": "Bagian logika ini belum didukung, harap pantau terus.",
    "sojBI": "Konversi",
    "spCqEa": "MELAKUKAN",
    "spdh98": "Cina disederhanakan",
    "ssDaOq": "Baru mengenal LafTools?",
    "ssm80i": "Basque",
    "svqh06": "Azerbaijan",
    "sys_updates": "Pembaruan Sistem Terbaru",
    "t63Qw": "Membubarkan",
    "t6wczq": "Xhosa",
    "t7m4g": "Peti 'base32' digunakan untuk pengkodean dan decoding Base32 di Rust.",
    "t84q1z": "orang Armenia",
    "t8c6xc": "Somalia",
    "t8z1v": "Jika tidak ada cukup bit tersisa di akhir untuk mengisi grup 5-bit penuh, karakter padding '=' ditambahkan. Misalnya, satu byte memerlukan dua karakter Base32, dan urutan 3 byte memerlukan empat karakter Base32.",
    "t9m3g": "CryptoSwift adalah paket Swift populer yang mencakup fungsionalitas pengkodean dan dekode Base32.",
    "tBIX-d": "jendela",
    "tEiv_": "Mengambil Detail Ekstensi",
    "tIy3Q": "Mengalami kesalahan",
    "tIyq3Q": "Mengalami kesalahan",
    "tR8pY": "Go menyediakan paket perpustakaan standar 'encoding/base64' dengan fungsi untuk pengkodean dan decoding Base64. Tidak diperlukan ketergantungan eksternal; cukup impor paket ini ke program Go Anda dan panggil fungsi yang sesuai.",
    "tWe1yF": "Tidak ada perintah shell yang tersedia.",
    "tY3p1": "Informasi Lebih Lanjut",
    "tiaiB": "Membatalkan",
    "tn7duf": "Kroasia",
    "trywithclassicalwebui": "Coba dengan UI Web Klasik",
    "ttAre": "Masukkan kata sandi teks biasa Anda di sini",
    "tuv23456": "Varian aman URL Base64",
    "twamg": "Asisten AI, Memberdayakan Kreativitas Anda",
    "tyhgpr": "Jawa",
    "u1i2b": "Apa keuntungan menggunakan Base85 dibandingkan Base64 atau Base32?",
    "u2l8s": "Apa itu Base45?",
    "u3i8b": "Apa keuntungan menggunakan Base62 dibandingkan Base64 atau Base32?",
    "u3j9p": "Base32 sering digunakan ketika Anda memerlukan representasi tekstual kompak dari data biner yang dapat diketik atau dicetak tanpa kehilangan informasi, seperti dalam pemeriksaan integritas file, geocaching, dan pembuatan kata sandi yang aman.",
    "u7i9b": "Untuk Go, gunakan paket 'base62' yang tersedia di GitHub.",
    "u7vwx8yz": "Operasi umum Base64",
    "u8i5b": "Apa keuntungan menggunakan Base58 dibandingkan Base64 atau Base32?",
    "u9g6t": "Untuk JavaScript, Anda perlu menginstal paket 'base85' untuk pengkodean dan decoding Base85.",
    "uCEe8": "Konversi Waktu Nyata",
    "uFcDQ": "Menginisialisasi data status...",
    "uV5Bi": "Tidak Dapat Memuat Ekstensi",
    "uVseB": "Tekan {0} untuk menampilkan daftar tombol pintas",
    "uW7eZ": "Di C, tidak ada implementasi Base64 asli. Contoh ini menggunakan perpustakaan OpenSSL untuk pengkodean dan decoding Base64. Untuk menggunakan cuplikan kode ini, instal OpenSSL di sistem Anda dan tautkan ke pustaka yang sesuai saat mengkompilasi program Anda menggunakan perintah yang mirip dengan 'gcc -o base64_example base64_example.c -lssl -lcrypto'.",
    "ucDLv": "Anda telah menyalin data ini sebanyak {0} kali",
    "ui5pZ": "Pengurai Perintah",
    "ulah0q": "Jepang",
    "unc9E": "Teks Acak",
    "usr_defined": "Preferensi Sistem",
    "uvwxyza1": "Tidak Ada Kehilangan Data: Karena ini adalah proses yang dapat dibalik, pengkodean Base64 tidak mengakibatkan hilangnya informasi apa pun.",
    "uwqGE": "Buka Alat",
    "v3k5r": "Kumpulan karakter mencakup semua huruf besar dan kecil (A-Z, a-z) serta angka (0-9), memberikan representasi yang lebih ringkas dibandingkan dengan Base64 atau Base32.",
    "v4k6r": "Ini mengkodekan data ke dalam bentuk yang lebih kompak dibandingkan dengan Base64 atau Base32 dengan menggunakan kumpulan karakter yang lebih besar.",
    "v4n9t": "Base58 adalah skema pengkodean yang merepresentasikan data biner sebagai rangkaian karakter alfanumerik.",
    "v5k3r": "Setelah terinstal, ganti placeholder di bagian dekode dengan string berkode Base85 sebenarnya dan jalankan skrip. Pustaka menangani konversi antara string Buffer dan Base85.",
    "v6qkl": "Paket BouncyCastle NuGet menyediakan pengkodean dan decoding Base32 dalam C#.",
    "v7q3db": "Thai",
    "v9b7t": "Ganti 'TEST12345' dengan string Anda sendiri dan jalankan aplikasi konsol ini untuk melakukan operasi pengkodean dan dekode Base32.",
    "vOjNC": "Masukkan kata sandi atau kunci aman",
    "vTsQU": "Silakan berikan kode undangan dari administrator Anda",
    "vU17B": "Tidak dapat mengirim permintaan",
    "vWqac": "Sebelum memasuki meja kerja Anda, kami ingin memuat sumber daya sistem yang diperlukan terlebih dahulu. Mohon tunggu beberapa saat, akan segera selesai, detailnya dapat dilihat seperti di bawah ini.",
    "vaP0vq": "Atur kata sandi lokal berhasil.",
    "vci8rd": "Belanda",
    "vh9j4": "Memasukkan",
    "vo1prl": "Orang Spanyol",
    "vr93oi": "Finlandia",
    "vrfjnf": "Italia",
    "vwx1yza2": "Contohnya adalah menyandikan file gambar untuk menyematkannya dalam tag HTML <img>:",
    "w1ANqKoBf": "Sembunyikan Teks di Sidebar",
    "w1x4k": "Ya, ada beberapa varian, termasuk Ascii85 (digunakan dalam PostScript dan PDF), Z85 (ZeroMQ), dan UUencode (format lama). Masing-masing memiliki karakter dan aturan yang sedikit berbeda.",
    "w2x9qk": "Meskipun Base62 sendiri tidak memiliki varian yang signifikan, beberapa implementasi mungkin sedikit berbeda dalam pilihan rangkaian karakternya, seperti mengecualikan '+' atau '/' yang umum digunakan di Base64.",
    "w3x7k": "Ya, beberapa varian populer termasuk Base58Check, yang menambahkan checksum untuk deteksi kesalahan, yang biasa digunakan dalam Bitcoin.",
    "w6otqn": "Korsika",
    "w92j07": "Rusia",
    "w9qudj": "Punjabi",
    "wAxtg": "Awalnya, kami membuat UUID sebagai token resmi agar Anda dapat melakukan penyiapan ini. Dari apa yang diterima LafTools, token yang Anda berikan adalah {0}, berhasil diverifikasi oleh LafTools dan akibatnya Anda dapat melanjutkan menyiapkan formulir ini.",
    "wI1eh": "Berikutnya",
    "wQYoz": "Mengajukan",
    "wQdYoz": "Sunting",
    "wQdqwYoz": "Melihat",
    "wcl1K": "Penggunaan",
    "wgkk6y": "Malta",
    "wj3VS": "Operasi ini mendekode data dari string ASCII {0} kembali ke format aslinya.",
    "wsWcXd": "Pemberitahuan",
    "wxyzabcd": "Ada versi Base64 yang aman untuk URL yang menggantikan '+' dengan '-' dan '/' dengan '_', dan menghilangkan padding '=', sehingga cocok untuk URL web.",
    "x009": "Untuk mengakses dokumentasi penggunaan kami",
    "x2c5e": "Python memiliki modul 'base85' bawaan yang mendukung pengkodean dan decoding Base85.",
    "x2z6r": "Apa itu Base58?",
    "x5alzu": "Kurdi (Kurmanji)",
    "x5tHV": "Ikhtisar Sistem",
    "x5z1b": "Base45 dikembangkan terutama untuk penggunaan kode QR dalam konteks sertifikat COVID digital.",
    "x6v2w": "Tidak ada perpustakaan Base32 standar di C, jadi kami menggunakan perpustakaan hipotetis 'libbase32' di sini.",
    "x7n1m": "Base62 adalah skema pengkodean yang mewakili data biner sebagai urutan 62 karakter alfanumerik.",
    "x8mdg": "Modul 'base64' bawaan Python menyediakan pengkodean dan decoding Base32 melalui fungsi 'b32encode' dan 'b32decode'.",
    "x9g7e": "Unduh kode sumber dari GitHub (https://github.com/dankamongmen/libbase32) atau instal sebagai paket jika tersedia untuk platform Anda.",
    "x9n1b": "Base85 adalah skema pengkodean yang merepresentasikan data biner menggunakan sekumpulan 85 karakter ASCII yang dapat dicetak.",
    "xMBv0": "Memuat sumber daya terkait...",
    "xOJqG1": "Pertanyaan yang Sering Diajukan",
    "xPHqP": "Deskripsinya belum ditentukan.",
    "xQ_ls": "Cadangan Redis",
    "xbz0B": "Tutup semua tab",
    "xbz0B2": "Tutup Tab",
    "xdqwe": "Selamat menggunakan LafTools!",
    "xeP4zV": "Lihat item TODO Anda dengan cepat",
    "xeP4zVd": "Cari kosakata bahasa Inggris dengan cepat.",
    "xlqtA": "Masukan",
    "xml-bdeautify.desc.2a5f9": "Perkecil Kode XML",
    "xml-beautify.desc.2a5f9": "Operasi ini memformat data XML untuk meningkatkan keterbacaan dengan menambahkan indentasi yang tepat, jeda baris, dan memastikan struktur terbentuk dengan baik.",
    "xs22XLF": "Tidak ada data yang tersedia untuk ID item ini, harap pertimbangkan untuk memilih item lainnya.",
    "y3b6n": "Ya, selama string yang disandikan dihasilkan sesuai dengan spesifikasi Base45, dekoder yang sesuai harus dapat mendekodekannya.",
    "y3m7k": "Untuk Java, gunakan perpustakaan 'commons-codec' yang mencakup dukungan untuk pengkodean dan decoding Base85.",
    "y3m9k": "Mengapa Base62 dibuat?",
    "y3qjdd": "Kata sandi lokal Anda telah berhasil diverifikasi.",
    "y5nne": "Kode ini dapat dijalankan langsung di lingkungan Node.js atau sebagai bagian dari proyek yang lebih besar di mana Anda memerlukan fungsionalitas Base32.",
    "y6m8k": "Mengapa Base85 dibuat?",
    "y6t1n": "Kekurangan Base32",
    "y8Ir5": "Bagian ini digunakan untuk menginisialisasi akun administrator Anda, namun untuk saat ini, tidak ada yang perlu dibuat atau disesuaikan di sini seperti yang telah diatur sebelumnya oleh administrator Anda, harap abaikan bagian ini dan lanjutkan dengan langkah selanjutnya.",
    "y8b1m": "Ganti 'TEST12345' dengan data Anda sendiri dan pastikan bahwa fungsi perpustakaan diterapkan dengan benar dan ditautkan untuk mengkompilasi dan menjalankan program ini untuk operasi Base32.",
    "y9m1n": "Mengapa Base58 dibuat?",
    "y9m3k": "Untuk Swift, Anda dapat menggunakan perpustakaan 'Base45' yang tersedia di GitHub.",
    "y9z2e": "Ganti 'TEST12345' dengan potongan byte Anda yang sebenarnya dan jalankan program Go ini untuk menyandikan dan mendekode menggunakan pengkodean standar Base32.",
    "y9z2t": "Jalankan skrip ini di lingkungan Ruby seperti IRB atau simpan sebagai file .rb dan jalankan dengan 'ruby filename.rb'.",
    "yMZW-GEgf": "Format XML",
    "ySVf-": "Coba lagi Permintaan ini",
    "yTsqFO": "Algoritma MD4 (Message-Digest 4) adalah fungsi hash kriptografi yang dikembangkan oleh Ronald Rivest pada tahun 1990. Panjang intisari adalah 128 bit. Algoritma ini telah mempengaruhi desain selanjutnya, seperti algoritma MD5, SHA-1 dan RIPEMD. Keamanan MD4 telah sangat terganggu.",
    "yVprb": "Bagian ini masih dalam pengembangan.",
    "y_2Q1": "Menyandikan dan Mendekode",
    "y_2Q2": "Kripto Simetris",
    "y_2Q3": "Kripto Asimetris",
    "y_2Q4": "Algoritma Nasional Tiongkok",
    "y_2Q5": "Otentikasi Web",
    "y_2Q5dqw": "Pencocokan Teks",
    "y_9YM": "Output akan ditampilkan di sini.",
    "y_9YqM": "Memuat sumber daya statis...",
    "y_BN6": "Algoritma Intisari",
    "ya0cwu": "Melayu",
    "yc7dqiu": "Cina disederhanakan",
    "yfYeg": "Templat Teks",
    "yiRso": "Catatan Awan",
    "ykganl": "Orang Denmark",
    "yqiRso": "Catatan Lokal",
    "yqrxl4": "Orang Serbia",
    "yt7kX2fPQ": "Mendapat Pengecualian Tak Terduga",
    "yznU9": "Data Pohon Kosong",
    "z-o28we": "Panel Proses",
    "z0j2nf": "Hindi",
    "z1m2t": "Contoh penggunaan: `const encoded = bs58.encode('data-Anda'); const diterjemahkan = bs58.decode(dikodekan);`",
    "z1n5qr": "Contohnya termasuk paket npm base45 untuk JavaScript dan dotnet-base45 untuk .NET.",
    "z1oFn": "Melarikan diri dan tidak melarikan diri",
    "z2jzej": "Marathi",
    "z2m7t": "Contoh penggunaan: `const base62 = require('base62'); const dikodekan = base62.encode('data-Anda'); const didekodekan = base62.decode(dikodekan);`",
    "z2t7m": "Apa itu Base85?",
    "z2x8c": "Base32 memiliki lebih sedikit ambiguitas visual karena hanya menggunakan huruf besar dan angka, sehingga lebih mudah dibaca dan ditranskripsikan dengan tangan atau melalui telepon dibandingkan dengan Base64 yang menyertakan '+', '/', dan huruf kecil.",
    "z3m1t": "Setelah menambahkan ketergantungan dan menyinkronkan proyek, salin templat yang disediakan ke kelas Kotlin, ganti placeholder dengan nilai sebenarnya yang dikodekan sebelum menjalankan kode.",
    "z4t9b": "Apa itu Base62?",
    "z5b7m": "Ini menggunakan alfabet yang lebih besar (0-9, A-Z, a-z, -, ., $, /, +, %, dan *) dibandingkan dengan Base64 atau Base32, menghasilkan string yang dikodekan lebih pendek untuk data input yang sama.",
    "z5bvb": "Instal dengan menjalankan 'npm install base32-encoding'. Ganti 'TEST12345' dengan data masukan yang Anda inginkan dalam cuplikan kode.",
    "z5m6t": "Contoh penggunaan: `const base85 = require('base85'); const dikodekan = base85.encode('data-Anda'); const didekodekan = base85.decode(dikodekan);`",
    "z6m1c": "Variasi selanjutnya seperti z-base-32 diperkenalkan untuk meningkatkan kegunaan, menggantikan beberapa karakter yang kurang berkesan dengan yang lain, namun spesifikasi asli Crockford tetap banyak digunakan hingga saat ini.",
    "z79b1a": "Arab",
    "z7n1m": "Instal menggunakan npm dengan menjalankan `npm install base85` atau `yarn add base85`.",
    "z7t1p": "Apakah ada varian spesifik dari Base62?",
    "z8em2t": "Setelah instalasi, salin templat yang disediakan ke aplikasi konsol C# dan ganti placeholder dengan nilai yang disandikan sebenarnya sebelum menjalankan program.",
    "z8m2t": "Apa kelebihan menggunakan Base45 dibandingkan Base64 atau Base32?",
    "z8n6k": "Ganti 'TEST12345' dengan string yang Anda inginkan, kompilasi dan jalankan program ini untuk melihat hasil pengkodean dan dekode Base32.",
    "z8qm2t": "Perpustakaan menyediakan kelas encoder dan decoder untuk operasi Base45. Salin kode templat ke aplikasi konsol C# dan jalankan setelah menginstal paket.",
    "z8qqm2t": "Setelah instalasi, salin templat yang disediakan ke aplikasi konsol C# dan ganti placeholder dengan nilai yang disandikan sebenarnya sebelum menjalankan program.",
    "z9b6n": "Tambahkan ketergantungan ke proyek Xcode Anda melalui Swift Package Manager ('https://github.com/krzyzanowskim/CryptoSwift').",
    "z9kVv": "Python memiliki modul 'base64' bawaan yang menyediakan metode untuk pengkodean dan decoding Base64. String masukan terlebih dahulu diubah menjadi byte menggunakan pengkodean UTF-8 sebelum dikodekan ke Base64, dan kemudian didekodekan kembali ke bentuk aslinya.",
    "z9t2p": "Apakah ada varian spesifik dari Base58?",
    "z9t7p": "Apakah ada varian spesifik dari Base85?",
    "zN2ES": "Ruang kerja",
    "zaSKh": "Menyegarkan",
    "zc3Hf": "Kata sandi",
    "zjDJk": "Harap berikan jalur direktori ruang kerja",
    "zkqUFa": "{0} belum dikonfigurasi",
    "zkv375": "Khmer",
    "zmDWx": "Hubungi kami",
    "znVRwq": "File",
    "zpyd34": "Bahasa inggris",
    "zqiIoqXw": "Menjalankan perhitungan...",
    "zwd4v": "Detil Ekstensi",
    "zwgYx": "Nilai kata sandi terenkripsi akan ditampilkan di sini.",
    "zyx98765": "Bisakah Base64 digunakan untuk kompresi?",
    "zzcepr": "Cebuano"
}