{
    "": "Mesej: {0}",
    "-8l11": "disalin",
    "-DqwwR": "Operasi Selesai.",
    "-GJ_72": "Bertukar ke ruang kerja yang dipilih {0}",
    "-Jx4J": "Akaun Tempatan",
    "-Rj3y": "Tema",
    "-XZnW": "belakang",
    "-Yo129I": "Alat Teks",
    "-nL_B5PoN": "Memampatkan {0}",
    "01do0y": "Kannada",
    "04SSf": "Lupa kata laluan?",
    "07naT": "Ralat: {0}",
    "07ui6": "Maklumat Lanjut",
    "0Ceqru": "Base64 ialah tatatanda untuk pengekodan data bait arbitrari menggunakan set simbol terhad yang boleh digunakan dengan mudah oleh manusia dan diproses oleh komputer.",
    "0MO3jj": "MD5 (Message-Digest 5) ialah fungsi cincang yang digunakan secara meluas. Ia telah digunakan dalam pelbagai aplikasi keselamatan dan juga biasa digunakan untuk menyemak integriti fail. Walau bagaimanapun, MD5 tidak tahan perlanggaran dan ia tidak sesuai untuk aplikasi seperti sijil SSL/TLS atau tandatangan digital yang bergantung pada sifat ini.",
    "0PgZ_": "Terjemahan",
    "0YKce": "Menukar rentetan Perpuluhan Berkod Binari (BCD) kepada nombor perpuluhan.",
    "0gvcN": "Selamat datang ke halaman ikhtisar, ia masih dalam pembangunan.",
    "0pfdz7": "Uzbek",
    "123e4567": "Apakah itu Base64?",
    "13pmE": "Sokong Kami",
    "1507oa": "Benggali",
    "1JOFP": "Buka Ruang Kerja Saya",
    "1NTgQ": "Buka Ruang Kerja",
    "1Npez": "Sila berikan laluan",
    "1Tuab": "disalin",
    "1X8x7": "Contoh",
    "1Xe82x7": "{0} Kecilkan",
    "1Xe8wx7": "Rentetan Hex",
    "1Xe8x7": "{0} Cantikkan",
    "1Xe8x7qe": "BCD",
    "1YmJc": "Pilih salah satu pilihan sebagai bahasa pilihan anda:",
    "1a2b3c4d": "Mengapa menggunakan Base64?",
    "1a3Sc": "Batalkan Memuatkan",
    "1bd": "Aliran kerja",
    "1e3e5n": "Hausa",
    "1h6jH": "Amaran, output ialah nilai kosong yang panjangnya sifar!",
    "1j62a": "Lakukan ini pada masa lain",
    "1jj0ri": "Jepun",
    "1k_44": "Operasi ini menyahkod data daripada rentetan ASCII Base64 kembali ke dalam format mentahnya.",
    "1th2nw": "Sinhala",
    "1yIQu": "Anda boleh cuba memproses semula tindakan anda atau klik butang di bawah untuk mengetepikan ralat.",
    "20nmcv": "bahasa Latin",
    "22XLF": "Belum habis lagi",
    "23fgh456": "Sejarah Pangkalan64",
    "24vLI": "Dicipta",
    "27j7sy": "Shona",
    "2D9a6": "Lupa kata laluan?",
    "2D9qdk6": "Adakah ia Cukup Selamat?",
    "2IF6A": "Nampaknya pemalsuan simpan storan menghadapi beberapa masalah",
    "2JyFN": "Salin Keputusan ke Papan Klip",
    "2Ocbey": "Versi",
    "2RhAT": "Nampaknya proses mendapatkan semula palsu menghadapi beberapa masalah",
    "2Ruh6": "Buat Akaun Tempatan Baharu",
    "2S5ap": "Togol Mod Skrin Penuh",
    "2Y1mR": "Kosongkan Teks",
    "2bcde3fg": "Kelemahan Base64",
    "2bqHk": "Muatkan daripada Fail",
    "2e4fb7": "Igbo",
    "2giYv": "Uji Kata Laluan: {0}",
    "2khdsv": "Pashto",
    "2lehqwp": "bahasa Vietnam",
    "2lhcqwp": "bahasa Turki",
    "2lhqqwp": "Indonesia",
    "2lhqqwqp": "Melayu",
    "2lhqwwp": "Thai",
    "2qdin8": "Sila masukkan kod pengesahan",
    "2tib5m": "bahasa Sweden",
    "2ybu7j": "bahasa Norway",
    "30eo2v": "Gujerat",
    "32D9a6": "Buat Akaun",
    "33RXi": "Permintaan telah ditolak kerana parameter yang tidak memuaskan.",
    "346qid": "bahasa Rusia",
    "34wxyz56": "Bagaimana untuk mengekod / menyahkod Base64 dalam JavaScript?",
    "39dsCt": "Anda akan menerima pemberitahuan terkini daripada perkhidmatan aplikasi jika ada.",
    "3ii2tt": "Gaelik Scotland",
    "3umnB": "Token tidak diketahui",
    "441oja": "Georgian",
    "44Ntqw-": "Mengendalikan operasi.",
    "46bksi": "bahasa Lithuania",
    "4K_vhq": "Duplikat tab ini",
    "4PIqD": "Semakan Kod",
    "4UYIJ": "Belum selesai.",
    "4cGA_": "Mendapatkan semula data untuk pilihan sistem...",
    "4hijk5lm": "Peningkatan Saiz: Data yang dikodkan adalah kira-kira 33% lebih besar daripada data binari asal.",
    "4kKe4": "Kata laluan Awak",
    "4tqb4x": "bahasa Hungary",
    "4vdfwf": "okey",
    "4wlih": "Permintaan telah ditolak kerana parameter yang tidak memuaskan.",
    "52OiQ": "Disalin {0} kali",
    "54cwb": "Sistem Websocket API mengalami ralat: {0}",
    "56ibcj": "bahasa Vietnam",
    "58HQX": "Jika anda tidak mengetahui nilainya, sila hubungi pentadbir anda untuk mendapatkan butiran lanjut, yang boleh didapati dalam tetapannya.",
    "5BOhl": "Kod Jemputan",
    "5Ih2u": "Alat Navigator",
    "5NCPT": "Mod Gelap",
    "5NJeGsu1": "E-Mel, anda boleh mengatur peti masuk anda dengan mudah, mengarang dan menghantar mesej, serta sentiasa mengetahui surat-menyurat anda. Sehingga kini, ia digunakan sebagai alat komunikasi antara pengguna dan pasukan kami sahaja.",
    "5NJeddqGsu1": "Bahagian ini termasuk bahan komputer, artikel wiki, panduan penggunaan dan banyak lagi.",
    "5NJedqddqGsu1": "Bahagian ini termasuk sumber komputer yang boleh digunakan untuk membina projek anda sendiri.",
    "5Perd": "Maaf, fungsi 'Gunakan Editor Pintar' belum tersedia. Kami masih berusaha untuk melaksanakannya. Terima kasih atas kesabaran anda.",
    "5ZBYR": "belakang",
    "5dF7o": "Segarkan semula",
    "5e6f7g8h": "Base64 digunakan apabila data binari perlu dihantar melalui protokol berasaskan teks seperti e-mel atau JSON, atau dibenamkan di tempat yang hanya teks dibenarkan.",
    "5eXVS": "Kandungan Skrip",
    "5ggegx": "Korea",
    "5lW8qp": "Tunjukkan contoh untuk alat ini",
    "5q-Zxqa": "Pengurus Skrip",
    "5qPOJL": "Untuk menyokong LafTools, pertimbangkan sama ada memberi bintang kepada repositori kami di GitHub atau menaik taraf kepada versi profesional kami melalui langganan bulanan. Kami amat menghargai bantuan anda, dan kami berjanji bahawa LafTools akan menjadi lebih baik dengan dana yang dikumpul.",
    "5qV5Sf": "Alih keluar rekod ini daripada senarai",
    "5rg5mt": "Malagasy",
    "5srFq": "LafTools",
    "5v8jl7": "Hmong",
    "6AumW": "Tindakan Lalai",
    "6ClPV": "Buat",
    "6MrfIfGc6": "Kecilkan Kod",
    "6UICxHzVR.name": "Cantikkan {0}",
    "6cOPZ": "Perpuluhan Berkod Binari (BCD) ialah kelas pengekodan binari nombor perpuluhan di mana setiap digit perpuluhan diwakili oleh bilangan bit tetap, biasanya empat atau lapan. Corak bit khas kadangkala digunakan untuk tanda",
    "6hsnqWe": "Walaupun LafTools adalah percuma dan sumber terbuka, mengekalkannya masih memerlukan sejumlah besar masa dan tenaga. Khususnya, kami memerlukan dana untuk membayar API awan tertentu. Jika anda menghargai LafTools, sila pertimbangkan untuk menyokong kami.",
    "6j13s3": "bahasa Iceland",
    "6nopqrst": "Tiada Penyulitan: Base64 bukan kaedah penyulitan; ia mudah dinyahkod dan tidak memberikan keselamatan.",
    "6qT9d-N": "Untuk buku nota, LafTools bukan sahaja menyediakan pengurus arahan shell, tetapi juga akan menambah alat nota yang berkuasa ke dalamnya dalam masa terdekat seperti MarkDown, Latex, {0} dan sebagainya.",
    "6ulj8i": "Nepal",
    "6wdtJ4vmg.name.0912": "Kecilkan {0}",
    "6yOXx": "Nama Tidak Diketahui",
    "71x7x": "Kod Sumber pada GitHub",
    "78abcdef": "JavaScript menawarkan fungsi terbina dalam seperti btoa() dan atob() untuk pengekodan dan penyahkodan Base64 masing-masing.",
    "78ijk9lm": "Base64 pertama kali ditakrifkan dalam RFC 1421 (1993) dan kemudiannya diseragamkan dalam RFC 4648 (2006).",
    "7MOO1": "Log Masuk",
    "7dm0d8": "Cina tradisional",
    "7g5w22": "bahasa Norway",
    "7k56u3": "Galicia",
    "7q40W": "Tidak dapat memulakan pentadbir",
    "7u4vzu": "bahasa Slovak",
    "7x3f6": "Tab - 1",
    "82r0C": "Urus senarai TODO anda dan selesaikan sesuatu dengan lebih cekap.",
    "83dNp": "Tidak dapat Memuatkan ID Sambungan. (RUJ: 1dl1f)",
    "8LdRj": "Gambaran keseluruhan",
    "8LdRjq": "Pengiraan",
    "8LdevRj": "Perkhidmatan",
    "8M1wY": "Terminal Tempatan",
    "8OqB7hN1s": "Halaman ini menyediakan gaya UI IDE untuk LafTools, tahap abstraksi yang lebih tinggi untuk LafTools.",
    "8eeL1Kk": "Tentang",
    "8mn_qa": "Mendapatkan semula data daripada perkhidmatan terminal...",
    "8qzWJu": "Maaf, pada masa ini kami belum menyokong peranti skrin kecil lagi, sila gunakan PC untuk melawat halaman ini.",
    "97um9v": "Hawaii",
    "98KcL": "Menukar nombor perpuluhan kepada Perpuluhan Berkod Binari (BCD).",
    "9Xv8-": "Simpan Sebagai Nota",
    "9_qaj": "Keluar dari Borang ini",
    "9e4fcl": "bahasa Tamil",
    "9eZHM": "Aduh! Nampaknya kita menghadapi beberapa amaran atau ralat.",
    "9gqo8x": "bahasa Latvia",
    "9i0j1k2l": "Ia juga digunakan untuk membenamkan imej kecil terus ke dalam HTML atau CSS sebagai URL data.",
    "9m85mf": "bahasa sesotho",
    "9qy1xn": "Portugis",
    "9tbbkt": "bahasa Finland",
    "9zCSc": "Tiada ruang kerja yang tersedia",
    "A69UZ": "Pembolehubah",
    "AVUvu": "Base62 ialah notasi untuk pengekodan data bait sewenang-wenang menggunakan set simbol terhad yang boleh digunakan dengan mudah oleh manusia dan diproses oleh komputer. Asas nombor yang tinggi menghasilkan rentetan yang lebih pendek berbanding dengan sistem perpuluhan atau perenambelasan.",
    "AW9N8": "Wilayah Input",
    "AfPC0": "Kata laluan teks biasa anda",
    "Ahrjc": "Direktori tidak wujud, adakah anda mahu menciptanya?",
    "AkXgF": "Sedang Berlangsung: {0}%",
    "Apx8D": "Bagaimana untuk Tetapkan Semula Kata Laluan Anda Secara Manual?",
    "B-GCloBBt": "Memampatkan kod Bahasa Penanda eXtensible (XML).",
    "B0s0z": "Tujuan halaman ini:",
    "BCySSDEKL": "Mungkin terdapat masalah keserasian dengan versi perisian semasa anda.",
    "BGd7P9": "Operasi ini mengekod data mentah ke dalam rentetan ASCII Base64.",
    "BGd7dP9": "Operasi ini mengekod data mentah ke dalam rentetan ASCII {0}.",
    "BGdd7dP9": "Operasi ini mengekod data mentah ke dalam rentetan ASCII {0}.",
    "BLAKE2-021": "BLAKE2 ialah satu lagi alternatif moden yang memberikan kelajuan lebih pantas berbanding SHA-2 sambil mengekalkan tahap keselamatan yang tinggi. Ia menawarkan pelbagai varian termasuk BLAKE2b dan BLAKE2s.",
    "BLAKE2_Info-023": "Maklumat BLAKE2",
    "BShq3M": "Masalah",
    "BW3bpT": "Membaca fail dari cakera...",
    "Bd9h-": "Tambah ke koleksi kegemaran saya",
    "BuihG": "Tetapan sistem",
    "C3L9MmdDU7": "Buku panduan",
    "CASef": "Okey, operasi dicetuskan.",
    "CEv8B": "Adakah anda pasti akan mengalih keluar rekod ini? Jika ya, kemudian klik butang ini sekali lagi.",
    "CFg8B": "Saiz mestilah antara 0 dan 512",
    "CP-Advantage-Career-014": "Mempelajari program membuka peluang kerjaya merentas pelbagai industri dan membolehkan anda membangunkan penyelesaian inovatif, mengautomasikan tugas dan memahami sistem yang kompleks.",
    "CP-Advantages-013": "Apakah kelebihan mempelajari pengaturcaraan komputer?",
    "CP-Basics-001": "Apakah pengaturcaraan komputer?",
    "CP-Def-002": "Pengaturcaraan komputer melibatkan penulisan arahan, atau kod, dalam bahasa pengaturcaraan untuk mengarahkan komputer tentang cara melaksanakan tugas tertentu.",
    "CP-History-004": "Apakah sejarah pengaturcaraan komputer?",
    "CP-History-Origin-005": "Mesin boleh atur cara pertama bermula sejak kerja Ada Lovelace pada Enjin Analitik Charles Babbage pada abad ke-19. Walau bagaimanapun, pengaturcaraan moden bermula dengan penciptaan komputer elektronik tujuan umum pertama, ENIAC, pada tahun 1940-an.",
    "CP-Lang-Choice-009": "Pilihan bahasa bergantung pada faktor seperti keperluan projek, sokongan komuniti, kemudahan pembelajaran dan keperluan prestasi.",
    "CP-Language-Evolution-006": "Sejak itu, bahasa pengaturcaraan berkembang daripada kod mesin kepada pemasangan, kemudian kepada bahasa peringkat tinggi seperti FORTRAN, COBOL, C, dan kini kepada bahasa moden seperti Python, JavaScript dan Rust.",
    "CP-Languages-007": "Apakah beberapa bahasa pengaturcaraan yang popular?",
    "CP-Languages-List-008": "Bahasa pengaturcaraan popular termasuk Java, Python, JavaScript, C++, C#, Swift, Go, PHP, Ruby dan Kotlin. Setiap satu mempunyai kekuatan dan kes penggunaannya sendiri, cth., Python untuk sains data, JavaScript untuk pembangunan web dan C++ untuk pengaturcaraan sistem.",
    "CP-Process-010": "Apakah proses pengaturcaraan komputer?",
    "CP-Process-Explanation-011": "Pengaturcaraan biasanya melibatkan perancangan (mendefinisikan masalah dan mereka bentuk penyelesaian), pengekodan (menulis kod sumber dalam bahasa yang dipilih), ujian (menyahpepijat dan mengesahkan fungsi) dan penyelenggaraan (mengemas kini dan menambah baik program dari semasa ke semasa).",
    "CP-Purpose-003": "Pengaturcara mencipta algoritma, menyelesaikan masalah dan membina aplikasi perisian yang boleh mengautomasikan proses, memanipulasi data dan berinteraksi dengan pengguna atau sistem lain.",
    "CP-SDLC-012": "Ini sering distrukturkan dalam Kitaran Hayat Pembangunan Perisian (SDLC) yang merangkumi fasa tambahan seperti analisis keperluan, reka bentuk, penggunaan dan ujian penerimaan pengguna.",
    "CP-Skillset-015": "Ia juga meningkatkan pemikiran logik, kemahiran menyelesaikan masalah, dan kebolehsuaian kepada teknologi baharu, menjadikan teknologi ini lebih serba boleh dalam era digital.",
    "CSS-Advantages-010": "Apakah kelebihan menggunakan CSS?",
    "CSS-Advantages-Customization-012": "Kelebihan lain ialah keupayaannya untuk menyesuaikan rupa dan rasa berbilang halaman sekaligus, menjimatkan masa dan usaha semasa mengemas kini gaya seluruh tapak.",
    "CSS-Advantages-Separation-011": "Satu kelebihan ialah pengasingan kebimbangan antara kandungan dan persembahan, yang meningkatkan kebolehselenggaraan dan kebolehskalaan tapak web.",
    "CSS-Animations-Transitions-019": "Animasi dan Peralihan CSS membolehkan kesan visual yang lancar tanpa memerlukan JavaScript.",
    "CSS-Def-002": "CSS (Cascading Style Sheets) ialah bahasa lembaran gaya yang digunakan untuk menerangkan pembentangan dokumen yang ditulis dalam HTML atau XML.",
    "CSS-Disadvantages-013": "Apakah beberapa kelemahan CSS?",
    "CSS-Disadvantages-Browser-Compat-015": "Isu lain ialah keserasian merentas pelayar, kerana penyemak imbas yang berbeza mungkin mentafsir peraturan CSS secara berbeza. Ini memerlukan pembangun menggunakan awalan vendor atau teknik pengesanan ciri untuk pemaparan yang konsisten merentas penyemak imbas.",
    "CSS-Disadvantages-Cascade-014": "Satu cabaran ialah mengurus sifat gaya yang melata, yang kadangkala boleh membawa kepada isu pewarisan dan kekhususan yang tidak dijangka.",
    "CSS-Evolution-006": "Sejak itu, ia telah berkembang melalui CSS2 (1998), CSS2.1 (2007), CSS3 (pembangunan berterusan), memperkenalkan ciri seperti pemilih, animasi, reka bentuk responsif dan banyak lagi.",
    "CSS-Future-020": "Apakah masa depan teknologi CSS?",
    "CSS-Future-Houdini-022": "Houdini, misalnya, bertujuan untuk menyediakan API peringkat rendah untuk menyesuaikan proses pemaparan penyemak imbas, memperkasakan pembangun dengan kawalan yang tidak pernah berlaku sebelum ini ke atas penggayaan dan reka letak.",
    "CSS-Future-Progress-021": "Kumpulan Kerja CSS terus mengusahakan modul baharu seperti Pembolehubah CSS (Sifat Tersuai), Houdini dan Pertanyaan Kontainer.",
    "CSS-Hist-Origin-005": "CSS pertama kali dicadangkan oleh Håkon Wium Lie pada Oktober 1994 dan menjadi Pengesyoran W3C rasmi pada Disember 1996 dengan CSS1.",
    "CSS-History-004": "Apakah sejarah CSS?",
    "CSS-History-W3C": "Garis Masa Syor W3C CSS",
    "CSS-Key-Features-016": "Apakah beberapa ciri utama dalam CSS?",
    "CSS-Layouts-018": "Sistem susun atur Flexbox dan Grid menyediakan alatan berkuasa untuk mencipta reka letak halaman yang responsif dan fleksibel.",
    "CSS-MDN-Animations": "Panduan MDN untuk Animasi CSS",
    "CSS-MDN-Flexbox": "Panduan MDN untuk Flexbox",
    "CSS-MDN-Grid": "Panduan MDN untuk Grid CSS",
    "CSS-MDN-Houdini": "MDN Pengenalan kepada Houdini",
    "CSS-Purpose-003": "Ia membolehkan pembangun mengasingkan kandungan daripada pembentangan, menentukan gaya seperti reka letak, warna dan fon, menjadikan halaman web menarik secara visual dan konsisten merentas peranti dan skrin yang berbeza.",
    "CSS-Selectors-017": "Pemilih membenarkan penyasaran elemen HTML tertentu berdasarkan jenis, kelas, ID, atribut dan banyak lagi.",
    "CSS-Tech-History-001": "Apakah CSS?",
    "CSS-Usage-007": "Bagaimanakah cara saya menggunakan CSS dalam projek web saya?",
    "CSS-Usage-Basics-008": "Untuk menggunakan CSS, anda membuat fail berasingan (cth., style.css) yang mengandungi gaya anda, kemudian memautkannya ke fail HTML anda menggunakan elemen <link> dalam bahagian <head>.",
    "CSS-Usage-Inline-009": "Sebagai alternatif, anda boleh memasukkan gaya sebaris terus dalam elemen HTML menggunakan atribut 'gaya' atau benamkan CSS dalam teg <style> di dalam bahagian <head>.",
    "CSS-Vendor-Prefixes": "Panduan MDN tentang Awalan Vendor",
    "CSS-W3C-Selectors": "Spesifikasi Pemilih W3C Tahap 4",
    "CSS-WG-Future-Modules": "Kerja Semasa W3C CSS",
    "CSSNano": "cssnano - GitHub",
    "CVUl0": "LafTools",
    "CWoqhy": "Senarai Exts mengikut CategoryID yang dipilih",
    "CfZAX": "Fail {0} Dipilih, kami memuat naiknya ke perkhidmatan teras.",
    "CidOqAZ": "Sebagai pencipta LafTools, saya sangat terharu kerana anda sanggup menyokong kami. Kami mempunyai orang yang baik dalam pasukan kami yang bekerja keras untuk terus menambah baik LafTools.",
    "Cide2w": "Untuk melihat sama ada terdapat sebarang masalah semasa melaksanakan tindakan anda.",
    "DIQFq": "Sila semak sama ada parameter URL telah disediakan dengan betul, nampaknya anda tidak mempunyai kebenaran untuk mengisi borang ini. Secara lalai, anda akan dapat melihat mesej di bawah dalam output perkhidmatan apabila ia baru dilancarkan.",
    "DIweGq": "Lindungi LafTools Anda",
    "DSEtLTxUU": "Masa adalah mata wang hidup anda, gunakan dengan bijak.",
    "DTTPW": "Tetapkan semula status",
    "DVoKw": "Log keluar dari Sistem ini",
    "DadYp": "Nyahpantun Masa Nyata",
    "Diff-XML-JSON-Article": "Perbezaan Antara XML dan JSON",
    "DqFI5": "Tahap mestilah lebih besar daripada 0",
    "DrXAq": "Selamat datang untuk menggunakan LafTools!",
    "DrbEr": "Kata laluan yang anda berikan kosong, sila semak dan cuba lagi.",
    "DtlAc": "Memuatkan Sumber Sistem",
    "Dxlw0": "lengkap",
    "E62ej": "Perintah Shell Penapis",
    "E6F9B": "Tambahkannya ke dalam aliran kerja",
    "EEQkeW": "Algoritma MD6 (Message-Digest 6) ialah fungsi cincang kriptografi. Ia menggunakan struktur seperti pokok Merkle untuk membolehkan pengiraan cincang selari yang besar untuk input yang sangat panjang.",
    "EO6Qv5dCA": "Meminimumkan kod JSON, mengurangkan saiz berkas kod JSON anda.",
    "ERK7E": "Jika anda menghadapi sebarang isu atau mempunyai sebarang cadangan semasa menggunakan LafTools, sila hubungi kami melalui EMail atau GitHub pada bila-bila masa, kami bersedia untuk meningkatkannya dengan segera.",
    "EgBXL": "Pilih atau sediakan teg.",
    "Ewvgo": "Belum bermula.",
    "ExqvX": "Senarai Kekunci Panas",
    "Eyq856": "Kami belum selesai - kami berdedikasi untuk menyediakan ciri terkini dan terbaik, dan kami akan terus mengeluarkan kemas kini untuk memastikan anda mendapat pengalaman terbaik yang mungkin.",
    "F-OUm": "Persediaan Pantas untuk LafTools",
    "F0CCF": "Senarai HotKeys",
    "F4uS2": "Fail Baharu",
    "FBVyc": "Sila masukkan semula kod pengesahan",
    "FDlRI": "Namakan tab baharu ini dan klik untuk mengesahkannya.",
    "FLsbFsOZq": "IDE",
    "FOyHW": "Cari Di Mana-mana",
    "FQzhg": "Abaikan Input Kosong",
    "FYRoL": "Inden dan cantikkan kod Cascading Style Sheets (CSS).",
    "FhVWl": "Sulitkan Kata Laluan Anda",
    "FjYbR": "Pengeluaran",
    "Fv-zz": "Salin Keputusan",
    "Fy217": "Konfigurasikan Alat ini",
    "Fzp3t": "Sila berikan nilai dalam medan ini",
    "G3MJN": "Tunjukkan Panel Output",
    "G9QVo": "Urus Tab",
    "GR7jK": "taip",
    "Ggob_": "Batal",
    "H-Ae75": "Sila sahkan kata laluan setempat anda.",
    "H-qA75": "Sila berikan kata laluan setempat.",
    "H8fQ4": "Togol ke Mod Cerah atau Gelap",
    "HEAhr": "Selepas menterjemah, hasilnya akan muncul di sini.",
    "HIc3c": "Selesai",
    "HNDat": "Untuk membuat perubahan, sila klik butang \"{0}\". Jika tidak, klik \"{1}\" untuk menggunakan perubahan anda. Semoga anda berseronok dengan kotak alat ini!",
    "HTMLMinifier": "HTMLMinifier - GitHub",
    "Hflf2": "Demi keselamatan siber, kami tidak akan membantu menetapkan semula kata laluan anda melalui API atau halaman di sini melainkan anda mengemas kini fail yang dilindungi sistem secara manual.",
    "HistOfProg-Wikipedia": "Sejarah Bahasa Pengaturcaraan - Wikipedia",
    "HjvV3": "Kami tidak akan memadamkan failnya pada cakera, cuma keluarkan rekod ini daripada senarai.",
    "HyIC_": "Kunci Slash (/)",
    "HyIC_d": "Kunci Slash (/)",
    "I8FLi": "Kini, tiba masanya untuk menyediakan pentadbir anda, sila tetapkan kata laluan sekompleks yang anda boleh supaya anda boleh membingungkan penyerang yang tidak sopan itu.",
    "IAC0A": "Alat Carian",
    "ICefi": "Dibatalkan",
    "IKqqATS": "Muat semula Data Halaman Semasa",
    "IOOrz": "(Adakah ia memudaratkan sistem anda? Kami tidak fikir begitu, selagi anda boleh mengubah suai fail konfigurasi sistem yang dipelihara, itu bermakna anda dibenarkan membaca segala-galanya tentang fail data LafTools.)",
    "IWUH5": "Tunjukkan Contoh",
    "IaSyO": "Batal",
    "IfsGO": "Kegemaran",
    "IfsdGO": "Kegemaran",
    "ImUmf": "Baru",
    "IxAJswoSh": "Menghuraikan dan mencetak kod JavaScript yang sah. Juga berfungsi dengan Notasi Objek JavaScript (JSON).",
    "J-3KA": "Sila berikan nama untuk skrip ini, yang akan lebih membantu.",
    "J164i": "cth. Salin fail ke pelayan jauh",
    "J2xoL": "Sila lihat ralat: {0}",
    "JA_Bp": "Sila berikan nama untuk teg baharu pada mulanya.",
    "JQEVK": "Kod",
    "JQLmS": "Dilaraskan saiznya",
    "JQLmSq": "Selesai.",
    "JS-Basics-001": "Apakah JavaScript?",
    "JS-DOM-API-007": "Bagaimanakah JavaScript berinteraksi dengan DOM?",
    "JS-DOM-API-Explanation-008": "JavaScript menyediakan API Document Object Model (DOM) untuk memanipulasi HTML dan CSS, membolehkan pembangun menukar kandungan, gaya dan pendengar acara secara dinamik.",
    "JS-DOM-Example-009": "Sebagai contoh, anda boleh memilih elemen dan menukar kandungan teksnya: `document.getElementById('myElement').textContent = 'New Text';`",
    "JS-Data-Types-010": "Apakah jenis data dalam JavaScript?",
    "JS-Data-Types-List-011": "JavaScript menyokong pelbagai jenis data termasuk yang primitif seperti rentetan, nombor, boolean, null, undefined dan simbol, serta jenis kompleks seperti objek dan tatasusunan.",
    "JS-Def-002": "JavaScript (JS) ialah bahasa pengaturcaraan peringkat tinggi yang ditafsirkan yang digunakan secara meluas untuk mencipta aplikasi web, meningkatkan antara muka pengguna dan membina logik sisi pelayan dengan Node.js.",
    "JS-Event-Loop-013": "Apakah gelung acara dalam JavaScript?",
    "JS-Event-Loop-Explanation-014": "Gelung acara ialah bahagian teras model konkurensi JavaScript, yang membenarkan pelaksanaan tak segerak melalui panggilan balik, janji dan async/menunggu.",
    "JS-Event-Loop-Process-015": "Ia menjalankan skrip utama terlebih dahulu, kemudian melaksanakan sebarang fungsi panggil balik apabila peristiwa berkaitannya (seperti input pengguna atau respons rangkaian) berlaku, menguruskannya melalui sistem baris gilir.",
    "JS-Function-Syntax-006": "Fungsi ditakrifkan menggunakan kata kunci `fungsi` diikuti dengan nama fungsi dan parameter yang disertakan dalam kurungan. Badan fungsi dibalut dengan pendakap kerinting: `function greet(name) { console.log(`Hello, ${name}!`); }`",
    "JS-Purpose-003": "Ia pada mulanya dibangunkan oleh Brendan Eich di Netscape pada tahun 1995 dan sejak itu telah berkembang menjadi salah satu bahasa yang paling popular, disokong oleh semua pelayar web dan platform utama seperti Electron dan React Native.",
    "JS-Syntax-004": "Apakah sintaks asas JavaScript?",
    "JS-Type-Checking-012": "Semakan jenis boleh dilakukan menggunakan pembina (`typeof value === 'string'`) atau operator `instanceof` untuk objek yang diwarisi daripada pembina terbina dalam (cth., `value instanceof Array`).",
    "JSON-Advantages-011": "JSON pada umumnya lebih kecil dan lebih cepat untuk dihuraikan daripada XML, menjadikannya sesuai untuk komunikasi pelayan pelanggan di mana lebar jalur dan kelajuan adalah penting.",
    "JSON-Basics-001": "Apakah JSON?",
    "JSON-Beautify-007": "Apakah JSON Beautification?",
    "JSON-Beautify-Def-008": "Pengindahan JSON merujuk kepada proses memformat data JSON ke dalam bentuk yang lebih mudah dibaca manusia dengan lekukan dan pemisah baris yang betul, menjadikannya lebih mudah untuk dianalisis dan nyahpepijat.",
    "JSON-Beautify-Example-009": "Sebelum: '{\\\"key\\\":\\\"value\\\",\\\"array\\\":[1,2,3]}', Selepas: '{\\n \\\"key\\\": \\\"value\\\", \\n \\\"tatasusunan\\\": [\\n 1,\\n 2,\\n 3\\n ]\\n}'",
    "JSON-Def-002": "JSON (JavaScript Object Notation) ialah format pertukaran data berasaskan teks yang ringan dan mudah dibaca dan ditulis oleh manusia serta mudah untuk dihuraikan dan dijana oleh mesin.",
    "JSON-JavaScript-Support-020": "JSON disokong secara asli oleh JavaScript melalui objek global `JSON.parse()` dan `JSON.stringify()`. Mana-mana JSON yang sah juga merupakan objek atau tatasusunan literal JavaScript yang sah, yang membolehkan penukaran lancar antara kedua-dua format.",
    "JSON-JavaScript-Usage-021": "Dalam pembangunan web, JSON biasanya digunakan untuk permintaan AJAX, pemaparan sebelah pelayan dan storan data (cth., storan tempatan atau IndexedDB).",
    "JSON-Linting-022": "Apakah linting JSON dan mengapa ia penting?",
    "JSON-Linting-Benefit-024": "Linters boleh menghalang ralat masa jalan kerana JSON tidak sah, memastikan pertukaran data lancar dan menjimatkan masa penyahpepijatan potensi isu.",
    "JSON-Linting-Explanation-023": "Linting JSON ialah proses menyemak sama ada dokumen JSON mematuhi spesifikasi JSON. Ia membantu mengenal pasti ralat sintaks sebelum cuba menghuraikan data.",
    "JSON-Path-013": "Apakah itu JSON Path?",
    "JSON-Path-Example-015": "$.store.book[0].title memilih tajuk buku pertama dalam objek JSON dengan kedai yang mengandungi tatasusunan buku.",
    "JSON-Path-Explanation-014": "Laluan JSON ialah bahasa pertanyaan yang serupa dengan XPath untuk XML, membolehkan anda mengekstrak data daripada dokumen JSON menggunakan tatatanda seperti laluan.",
    "JSON-Path-Guide": "JSONPath - XPath untuk JSON",
    "JSON-Purpose-003": "Ia digunakan terutamanya untuk menghantar data antara pelayan dan aplikasi web sebagai alternatif kepada XML, dengan sokongan asli dalam JavaScript melalui kaedah `JSON.parse()` dan `JSON.stringify()`.",
    "JSON-Scope-in-JavaScript-019": "Bagaimanakah JSON sesuai dalam JavaScript?",
    "JSON-Security-025": "Apakah beberapa kebimbangan keselamatan apabila bekerja dengan JSON?",
    "JSON-Security-Impact-026": "Risiko keselamatan yang berpotensi termasuk serangan suntikan JSON, di mana data berniat jahat dihantar yang boleh menyebabkan tingkah laku yang tidak diingini apabila dihuraikan/dilaksanakan.",
    "JSON-Security-Prevention-027": "Untuk mengurangkan risiko ini, sentiasa bersihkan input pengguna dan gunakan perpustakaan yang menghuraikan JSON dengan selamat tanpa melaksanakan kandungannya (seperti JSON.parse() terbina dalam JavaScript). Juga, elakkan menggunakan eval() untuk menghuraikan JSON.",
    "JSON-Serialization-016": "Apakah siri JSON dan penyahserikatan?",
    "JSON-Serialization-Def-017": "Pensirilan JSON ialah proses menukar objek JavaScript kepada rentetan JSON, manakala penyahsiran adalah sebaliknya - menukar rentetan JSON kembali menjadi objek JavaScript.",
    "JSON-Serialization-W3Schools": "Siri JSON pada W3Schools",
    "JSON-Syntax-004": "Apakah sintaks asas JSON?",
    "JSON-Syntax-Example-f005": "Objek JSON terdiri daripada pasangan nilai kunci yang disertakan dalam pendakap kerinting {0}. Setiap kunci mestilah rentetan yang disertakan dalam petikan berganda, diikuti dengan titik bertindih, dan kemudian nilainya.",
    "JSON-Syntax-Reference": "Dokumen Web MDN pada JSON",
    "JSON-Value-Types-006": "Nilai boleh berupa rentetan, nombor, boolean, tatasusunan (disertakan dalam kurungan segi empat sama []), objek lain atau nol.",
    "JSON-vs-XML-010": "Bagaimanakah JSON dibandingkan dengan XML?",
    "JSON-vs-XML-Article": "Membandingkan JSON dan XML",
    "JTBRh": "LafTools menyimpan nilai kata laluan ke dalam fail tempatan, tetapi jangan risau, kami menggunakan mekanisme penyulitan kata laluan Sehala, iaitu tiada siapa yang boleh membaca kata laluan versi teks biasa. Untuk menetapkan semula kata laluan, sila ikuti instrumen di bawah untuk menetapkan semula kata laluan anda secara manual.",
    "JYqxz2": "Selamat datang ke LafTools, ini adalah versi orang dalam.",
    "JdqiUE8": "Operasi ini menyahkod data daripada rentetan ASCII (dengan abjad pilihan anda, pratetap disertakan) kembali ke dalam bentuk mentahnya.",
    "JdqidUE8": "Operasi ini menyahkod data daripada rentetan ASCII (dengan abjad pilihan anda, pratetap disertakan) kembali ke dalam bentuk mentahnya.",
    "JiUE8": "Operasi ini menyahkod data daripada rentetan ASCII {0} kembali ke dalam format mentahnya.",
    "K1qJZI": "Selamat datang ke LafTools, Yang Berhormat.",
    "KGS2-": "Setelah anda melengkapkan langkah di atas, anda boleh menggunakan kata laluan baharu anda untuk log masuk ke sistem anda. Jika anda tidak dapat mengakses sistem fail, sila minta pentadbir atau sokongan IT anda untuk mencipta fail tersebut. Jika fail itu sudah wujud, maka padamkannya dan baharui semula.",
    "KIc63": "Fungsi belum disokong",
    "KYh1N": "Semua Nota",
    "KcqrRr": "Rujukan",
    "KcrRr": "Mendapatkan Data Pelaksanaan Kod",
    "KmEUF": "Berikan gambaran ringkas tentang alatan sistem semasa.",
    "Kw4OJr": "Terminal",
    "Kyd9H": "Kod Sumber pada GitHub",
    "L-p-Y": "Salin kandungan arahan shell semasa ke papan keratan",
    "L3zEM": "Tunjukkan Contoh",
    "L42mxa": "Sila masukkan teks sumber anda dalam medan ini.",
    "L49kCq": "Sila berikan dan sahkan kata laluan kunci dalam borang ini untuk melindungi LafTools anda.",
    "L71q_N": "Kata laluan yang anda berikan kosong, sila semak dan cuba lagi.",
    "L9bQku": "Nyahkod {0}",
    "L9qbQku": "Nyahkod {0}",
    "LAc1m": "Muat semula paparan apl.",
    "LFdvM": "Tidak log masuk",
    "LM715": "Mendapatkan semula konfigurasi i18n daripada API pelayan tempatan",
    "LNvUuKmHR": "Aplikasi ini tidak mempunyai kebergantungan atau perpustakaan penting.",
    "LPJrV": "Salin Keputusan",
    "LSohY6eZW": "Rentetan Hex ialah rentetan bait perenambelasan yang dipisahkan oleh pembatas, yang boleh menjadi ruang, koma, koma bertindih atau bertindih.",
    "LU9Jj": "Base85 (juga dipanggil Ascii85) ialah notasi untuk pengekodan data bait sewenang-wenangnya. Ia biasanya lebih cekap bahawa Base64. Operasi ini menyahkod data daripada rentetan ASCII (dengan abjad pilihan anda, pratetap disertakan). Base85 biasanya digunakan dalam format fail Adobe PostScript dan PDF.",
    "LWaeFqd": "Tukar kepada bahasa pilihan anda",
    "Le71_N-": "Kata laluan yang anda berikan tidak sama dengan kata laluan yang disahkan, sila semak dan cuba lagi.",
    "LnJ4H": "Ambil perhatian bahawa akaun tempatan sama sekali tidak sama dengan pengguna berdaftar di tapak web kami, yang pertama ditakrifkan hanya pada PC anda manakala yang kedua boleh digunakan untuk penyegerakan awan.",
    "LqWaFd": "Tetapan sistem",
    "LxaEFHbfa": "Meminimumkan kod SQL, mengurangkan saiz berkas kod SQL anda.",
    "M3qytc": "Kod {0}",
    "M3ytc": "Kod {0}",
    "M4ywN1": "Kalkulator, Kalendar, Jam, Cuaca dan banyak lagi.",
    "M6MrW": "Baik",
    "M7jct": "Masukkan Mod Skrin Penuh",
    "MD2-Advantages-011": "Apakah kelebihan menggunakan MD2?",
    "MD2-AlgorithmDetails-010": "Butiran Algoritma MD2",
    "MD2-Applications-018": "Apakah aplikasi yang telah menggunakan atau masih menggunakan MD2?",
    "MD2-Breakdown-016": "Kelemahan kriptografi telah ditemui dalam MD2 dari semasa ke semasa, dan alternatif yang lebih kukuh seperti SHA-256 dan SHA-3 kini disyorkan untuk semua aplikasi yang memerlukan pencincangan selamat.",
    "MD2-CollisionSecurity-015": "MD2 dianggap lemah terhadap serangan kriptografi moden. Saiz cincangnya (128 bit) adalah kecil mengikut piawaian hari ini, menjadikannya terdedah kepada serangan perlanggaran.",
    "MD2-Def-002": "MD2 (Message-Digest Algorithm 2) ialah fungsi cincang kriptografi yang direka oleh Ronald Rivest pada tahun 1989. Ia menghasilkan nilai cincang 128-bit untuk sebarang mesej input yang diberikan.",
    "MD2-DigitalSignature-Risks-021": "Risiko Menggunakan MD2 untuk Tandatangan Digital",
    "MD2-Disadvantages-014": "Apakah kelemahan dan kebimbangan keselamatan dengan MD2?",
    "MD2-FAQ-001": "Apakah MD2?",
    "MD2-HistoricalUse-020": "Dari segi sejarah, MD2 didapati digunakan dalam semakan integriti fail dan kemas kini perisian, walaupun aplikasi ini sebahagian besarnya telah beralih kepada fungsi cincang yang lebih selamat seperti SHA-256 dan SHA-512.)",
    "MD2-History-004": "Bagaimanakah MD2 dibangunkan dan apakah sejarahnya?",
    "MD2-Implementation-013": "Ia telah dilaksanakan secara meluas dan diseragamkan merentasi pelbagai platform dan bahasa, yang bermaksud bahawa penyepaduan MD2 ke dalam sistem sedia ada boleh menjadi agak mudah.",
    "MD2-InsecurityExamples-017": "Contoh Pecahan Keselamatan MD2",
    "MD2-Operation-007": "Bagaimanakah operasi MD2 berfungsi?",
    "MD2-Origin-005": "MD2 pada mulanya dicipta sebagai penambahbaikan berbanding MD1, menangani beberapa kelemahan yang terdapat dalam algoritma terdahulu. Ia mendapat populariti kerana kesederhanaan dan kelajuan relatifnya pada masa itu.",
    "MD2-PKI-019": "MD2 pernah digunakan dalam Infrastruktur Kunci Awam (PKI) untuk tandatangan digital tetapi sejak itu telah ditamatkan kerana terdedah kepada serangan. Sijil yang ditandatangani dengan MD2 tidak lagi dipercayai oleh kebanyakan sistem.",
    "MD2-Process-008": "MD2 beroperasi dengan memasukkan mesej input kepada gandaan 16 bait dan kemudian memprosesnya melalui satu siri operasi eksklusif-OR, putaran bit dan penambahan. Output akhir ialah nilai hash 128-bit.",
    "MD2-Purpose-003": "Tujuan MD2 adalah untuk memastikan integriti data dengan menghasilkan cap jari digital unik yang boleh digunakan untuk mengesahkan keaslian dan ketulenan data.",
    "MD2-Rounds-009": "Algoritma menggunakan proses empat pusingan dengan operasi khusus yang dilakukan pada pembolehubah keadaan 128-bit. Setiap pusingan mengambil blok mesej empuk dan mengemas kini keadaan sehingga keseluruhan mesej diproses.",
    "MD2-Speed-012": "MD2 dianggap pantas untuk masanya dan masih mempunyai prestasi yang boleh diterima dalam beberapa senario, menjadikannya sesuai untuk persekitaran yang sumber pengiraan terhad.",
    "MD2-Successors-006": "Walau bagaimanapun, ia telah digantikan oleh algoritma yang lebih kuat seperti MD5 dan SHA-1, yang merupakan sebahagian daripada keluarga fungsi cincang yang sama tetapi menawarkan ciri keselamatan yang dipertingkatkan.",
    "MD4-Advantages-011": "Apakah kelebihan menggunakan MD4?",
    "MD4-AlgorithmDetails-010": "Butiran Algoritma MD4",
    "MD4-Applications-018": "Apakah aplikasi yang telah menggunakan atau masih menggunakan MD4?",
    "MD4-Breakdown-016": "Kelemahan reka bentuk algoritma telah membawa kepada serangan praktikal yang membolehkan perlanggaran cincang mudah dan juga serangan praimej separa, menjadikan MD4 tidak sesuai untuk sebarang kes penggunaan kriptografi yang selamat hari ini.",
    "MD4-CollisionSecurity-015": "MD4 mempunyai beberapa kelemahan kriptografi, termasuk kerentanan terhadap serangan perlanggaran. Ini bermakna dua input berbeza boleh menghasilkan output cincang yang sama, menjadikannya tidak selamat untuk aplikasi yang memerlukan rintangan perlanggaran atau integriti mesej yang kuat.",
    "MD4-Def-002": "MD4 (Message-Digest Algorithm 4) ialah fungsi cincang kriptografi yang direka oleh Ronald Rivest pada tahun 1990. Ia menghasilkan nilai cincang 128-bit untuk sebarang mesej input yang diberikan.",
    "MD4-DigitalSignature-Risks-021": "Risiko Menggunakan MD4 untuk Tandatangan Digital",
    "MD4-Disadvantages-014": "Apakah kelemahan dan kebimbangan keselamatan dengan MD4?",
    "MD4-FAQ-001": "Apakah MD4?",
    "MD4-HistoricalUse-019": "Dari segi sejarah, MD4 digunakan dalam tandatangan digital, semakan integriti fail dan kemas kini perisian. Walau bagaimanapun, disebabkan kelemahannya, aplikasi ini sebahagian besarnya telah beralih kepada alternatif yang lebih selamat seperti SHA-256 dan SHA-3.",
    "MD4-History-004": "Bagaimanakah MD4 dibangunkan dan apakah kepentingan sejarahnya?",
    "MD4-Implementation-013": "Ia telah dilaksanakan secara meluas dan diseragamkan merentas pelbagai platform dan bahasa, memberikan kemudahan penyepaduan ke dalam sistem sedia ada, walaupun kelebihan ini diatasi oleh kebimbangan keselamatannya dalam konteks moden.",
    "MD4-InsecurityExamples-017": "Contoh Pecahan Keselamatan MD4",
    "MD4-LegacySystems-020": "MD4 mungkin masih wujud dalam sistem warisan, tetapi penggunaannya tidak digalakkan dalam semua konteks di mana keselamatan menjadi kebimbangan. Piawaian moden tidak lagi mengesyorkan MD4 untuk sebarang tujuan kriptografi.",
    "MD4-Operation-007": "Bagaimanakah operasi MD4 berfungsi?",
    "MD4-Origin-005": "MD4 ialah evolusi MD2 dan MD3, bertujuan untuk memberikan prestasi yang lebih pantas sambil mengekalkan sifat keselamatan. Walau bagaimanapun, ternyata MD4 mempunyai beberapa kelemahan keselamatan.",
    "MD4-Process-008": "MD4 memproses mesej input dengan memasukkannya kepada gandaan 512 bit dan membahagikannya kepada blok 16 perkataan. Algoritma kemudiannya beroperasi pada blok ini menggunakan empat pusingan pemprosesan yang melibatkan operasi bitwise, penambahan modular dan fungsi bukan linear.",
    "MD4-Purpose-003": "Tujuan MD4 adalah untuk memastikan integriti data dengan menghasilkan cap jari digital bersaiz tetap yang boleh digunakan untuk mengesahkan ketulenan dan integriti data asal.",
    "MD4-Rounds-009": "Selepas semua blok diproses, keadaan dalaman yang terhasil diubah menjadi nilai cincang akhir 128-bit.",
    "MD4-Speed-012": "MD4 pada mulanya direka bentuk untuk menjadi lebih pantas daripada pendahulunya, yang menjadikannya popular untuk aplikasi yang memerlukan pencincangan pantas pada masa pengenalannya.",
    "MD4-Successors-006": "Walaupun kelemahannya, MD4 meletakkan asas untuk fungsi cincang berikutnya seperti MD5 dan SHA-1, yang menambah baik reka bentuknya tetapi juga mewarisi beberapa kelemahannya dari semasa ke semasa.",
    "MD5-Advantages-012": "Apakah kelebihan menggunakan MD5?",
    "MD5-AlgorithmDetails-011": "Butiran Algoritma MD5",
    "MD5-Alternatives-019": "Apakah beberapa alternatif kepada MD5 untuk pencincangan selamat?",
    "MD5-Applications-024": "Apakah aplikasi lain yang menggunakan atau telah menggunakan MD5?",
    "MD5-Breakdown-017": "Beberapa kelemahan kriptografi telah ditemui dalam MD5 dari semasa ke semasa, dan penyelidik telah menunjukkan contoh praktikal untuk mencipta perlanggaran, seterusnya menjejaskan integriti dan keselamatannya.",
    "MD5-Collision-016": "MD5 terdedah kepada serangan perlanggaran, bermakna dua input berbeza boleh menghasilkan output cincang yang sama. Ini menjadikannya tidak selamat untuk aplikasi seperti tandatangan digital atau storan kata laluan.",
    "MD5-CollisionExample-007": "Contoh Perlanggaran MD5",
    "MD5-DataIntegrity-026": "Ia juga biasa digunakan untuk mengesahkan integriti data semasa penghantaran dan penyimpanan, seperti apabila menggunakan rsync untuk penyegerakan fail atau checksumming set data yang besar.",
    "MD5-Def-002": "MD5 (Message-Digest Algorithm 5) ialah fungsi cincang kriptografi yang digunakan secara meluas yang mengambil mesej input dan menghasilkan nilai cincang 128-bit saiz tetap.",
    "MD5-DigitalSignature-Risks-027": "Risiko Menggunakan MD5 untuk Tandatangan Digital",
    "MD5-Disadvantages-015": "Apakah kelemahan dan kebimbangan keselamatan dengan MD5?",
    "MD5-FAQ-001": "Apakah MD5?",
    "MD5-FileChecksum-005": "MD5 sering digunakan untuk mengesahkan integriti fail semasa memuat turun perisian atau fail besar. Ia menghasilkan jumlah semak yang boleh dibandingkan dengan yang disediakan oleh sumber untuk memastikan fail yang dimuat turun tidak diusik.",
    "MD5-Future-028": "Adakah MD5 masih relevan hari ini?",
    "MD5-InsecurityExamples-018": "Contoh Pecahan Keselamatan MD5",
    "MD5-Operation-008": "Bagaimanakah operasi MD5 berfungsi?",
    "MD5-PKI-025": "MD5 telah digunakan dalam Infrastruktur Kunci Awam (PKI) untuk mencipta tandatangan digital, walaupun penggunaannya sebahagian besarnya telah ditamatkan kerana kebimbangan keselamatan. Sijil yang ditandatangani dengan MD5 tidak lagi dipercayai oleh kebanyakan sistem moden.",
    "MD5-PasswordHashing-006": "Ia juga digunakan dalam sejarah pencincangan kata laluan tetapi kini dianggap tidak selamat kerana terdedah kepada perlanggaran dan mudah dipecahkan. Sistem moden telah beralih kepada alternatif yang lebih kukuh seperti bcrypt atau Argon2.",
    "MD5-Process-009": "MD5 beroperasi dengan memecahkan mesej input kepada ketulan dan menghantar setiap ketul melalui beberapa pusingan pemprosesan yang melibatkan fungsi logik, aritmetik modular dan operasi bitwise. Hasilnya digabungkan untuk menghasilkan nilai cincang 128-bit akhir.",
    "MD5-Purpose-003": "Tujuannya adalah untuk memastikan integriti data dengan menjana cap jari digital yang unik untuk mana-mana data yang diberikan. Sekiranya sedikit pun dalam data asal berubah, cincangan MD5 akan berbeza sama sekali.",
    "MD5-Relevance-029": "MD5 tidak dianggap selamat untuk tujuan kriptografi lagi, terutamanya untuk aplikasi baharu yang memerlukan rintangan perlanggaran atau integriti mesej yang kuat. Walau bagaimanapun, ia mungkin masih ditemui dalam sistem warisan atau aplikasi bukan kriptografi di mana kelajuan adalah keutamaan berbanding keselamatan.",
    "MD5-Rounds-010": "Algoritma ini terdiri daripada empat peringkat utama yang dilakukan pada keadaan dalaman 128-bit yang dimulakan dengan pemalar. Terdapat 64 pusingan pemprosesan secara keseluruhan, di mana setiap pusingan mengubah keadaan dalaman berdasarkan blok mesej input.",
    "MD5-Speed-013": "MD5 agak pantas, yang menjadikannya popular untuk aplikasi yang memerlukan pencincangan pantas.",
    "MD5-Standardization-014": "Ia telah diseragamkan secara meluas dan dilaksanakan dalam pelbagai bahasa dan platform pengaturcaraan, menjadikannya mudah untuk disepadukan ke dalam sistem dan alatan sedia ada.",
    "MD5-Summary-031": "Secara ringkasnya, apakah perkara penting yang perlu saya ingat tentang MD5?",
    "MD5-Summary-Point1-032": "MD5 ialah fungsi cincang kriptografi yang pantas tetapi tidak selamat yang terdedah kepada serangan perlanggaran.",
    "MD5-Summary-Point2-033": "Kegunaan utamanya adalah untuk memastikan integriti data dan untuk beberapa operasi kriptografi, tetapi sebahagian besarnya telah digantikan dengan alternatif yang lebih kukuh seperti SHA-256 dan BLAKE2.",
    "MD5-Summary-Point3-034": "Walaupun anda mungkin menghadapi MD5 dalam sistem warisan atau senario sensitif bukan keselamatan, adalah penting untuk mengelak daripada menggunakannya untuk sebarang projek baharu yang memerlukan keselamatan kriptografi.",
    "MD5-Transition-030": "Memandangkan algoritma yang lebih baharu dan lebih selamat seperti SHA-256 dan BLAKE2 tersedia secara meluas dan difahami dengan lebih baik, adalah disyorkan untuk beralih daripada MD5 dalam semua konteks di mana keselamatan menjadi kebimbangan.",
    "MD5-Usage-004": "Bagaimanakah MD5 digunakan dalam amalan?",
    "MD6-AlgorithmDetails-010": "Butiran Algoritma MD6",
    "MD6-ComparisonSHA3-020": "Bagaimanakah MD6 dibandingkan dengan SHA-3 (Keccak)?",
    "MD6-Def-002": "MD6 (Message-Digest Algorithm 6) ialah fungsi cincang kriptografi yang direka oleh Ronald Rivest pada tahun 2008. Ia merupakan evolusi keluarga MD, yang menawarkan saiz output berubah-ubah antara 128 hingga 512 bit.",
    "MD6-FAQ-001": "Apakah MD6?",
    "MD6-FutureDevelopments-028": "Adakah terdapat sebarang perkembangan atau penambahbaikan masa hadapan yang dirancang untuk MD6?",
    "MD6-FutureUnknown-029": "Setakat ini, tidak ada sebarang maklumat yang tersedia secara umum tentang pembangunan yang sedang berjalan atau rancangan untuk menambah baik algoritma MD6. Penyelidikan kriptografi terus berkembang, dan algoritma baharu mungkin muncul untuk menangani ancaman atau keperluan yang muncul.",
    "MD6-History-004": "Bagaimanakah MD6 dibangunkan dan apakah yang membawa kepada penciptaannya?",
    "MD6-Operation-007": "Bagaimanakah operasi MD6 berfungsi?",
    "MD6-Origin-005": "MD6 dicipta sebagai tindak balas kepada kelemahan yang terdapat dalam MD5 dan SHA-1, yang digunakan secara meluas pada masa itu. Ia bertujuan untuk menyediakan alternatif yang lebih selamat dengan peningkatan fleksibiliti mengenai saiz output.",
    "MD6-PKI-Alternatives-027": "Untuk PKI dan aplikasi tandatangan digital, piawaian seperti RSA/SHA-256 atau ECDSA dengan varian SHA-2 atau SHA-3 biasanya digunakan. Ini telah melalui analisis yang meluas dan telah mewujudkan kepercayaan dalam komuniti kriptografi.",
    "MD6-PKI-Considerations-026": "Walaupun MD6 bertujuan untuk menyediakan keselamatan yang lebih kukuh daripada fungsi cincang terdahulu seperti MD5, ia tidak diterima pakai secara meluas untuk PKI atau skim tandatangan digital kerana kebaharuan relatifnya dan kekurangan penerimaan komuniti kriptografi yang luas.",
    "MD6-Process-008": "MD6 memproses mesej input melalui satu siri fungsi mampatan yang digunakan dalam struktur seperti pokok. Algoritma boleh beroperasi secara selari, yang menyumbang kepada prestasinya untuk input yang lebih besar.",
    "MD6-Purpose-003": "MD6 bertujuan untuk menyediakan ciri keselamatan yang teguh dan prestasi yang dipertingkatkan berbanding pendahulunya, menjadikannya sesuai untuk pelbagai aplikasi yang memerlukan pencincangan tahan perlanggaran dan semakan integriti mesej.",
    "MD6-Rounds-009": "Setiap nod dalam pepohon MD6 menjalani beberapa pusingan operasi pencampuran yang melibatkan penambahan modular, XOR bitwise dan pilih atur bukan linear. Nilai nod akar akhir mewakili ringkasan cincang bagi mesej input.",
    "MD6-SecurityUpgrade-006": "Reka bentuk MD6 dibina berdasarkan konsep pencincangan berasaskan pepohon, membolehkan ia menawarkan perlindungan yang lebih baik terhadap serangan praimej dan perlanggaran berbanding algoritma MD sebelumnya, di samping menyediakan daya pemprosesan yang lebih tinggi untuk set data yang besar.",
    "MD6-StayingCurrent-030": "Adalah penting untuk sentiasa dikemas kini dengan penemuan penyelidikan dan cadangan terkini daripada pakar kriptografi apabila memilih fungsi cincang untuk sebarang aplikasi, terutamanya apabila landskap keselamatan kriptografi berkembang dari semasa ke semasa.",
    "MD6-UseInPKI-025": "Bolehkah MD6 digunakan untuk Infrastruktur Kunci Awam (PKI) atau tandatangan digital?",
    "MD6-vs-SHA3-Adoption-023": "SHA-3 telah diterima pakai sebagai standard NIST rasmi dan mendapat penggunaan meluas kerana keselamatan dan prestasinya yang teguh. MD6, walaupun secara teorinya selamat, tidak melihat tahap penerimaan atau penyeragaman yang sama.",
    "MD6-vs-SHA3-DiffDesign-021": "MD6 dan SHA-3 kedua-duanya direka bentuk dengan mengambil kira keselamatan, tetapi mereka menggunakan teknik pencincangan yang berbeza. MD6 menggunakan reka bentuk berasaskan pokok untuk keselarian yang lebih baik, manakala SHA-3 adalah berdasarkan pembinaan span.",
    "MD6-vs-SHA3-Flexibility-022": "MD6 menawarkan panjang output berubah-ubah, yang boleh memberi kelebihan untuk aplikasi yang memerlukan saiz cincang tersuai. SHA-3 juga menyokong panjang keluaran berubah-ubah, walaupun varian yang paling biasa, SHAKE, memberikan lebih fleksibiliti dengan output panjang arbitrari.",
    "MDN-DOM-API": "Dokumen Web MDN - Memanipulasi Dokumen",
    "MDN-Event-Loop": "Dokumen Web MDN - Gelung Acara",
    "MDN-JS-Guide": "Dokumen Web MDN - Panduan JavaScript",
    "MDN-JS-Types": "Dokumen Web MDN - Jenis Data dan Struktur Data",
    "MDN-JSON-in-JavaScript": "Dokumen Web MDN - Bekerja dengan JSON",
    "MDN-Minification": "MDN Web Docs - Minification",
    "MDN-XML-Syntax": "Dokumen Web MDN - Sintaks XML",
    "MN2lT": "Panjang Kata Laluan tidak boleh kurang daripada 6",
    "Ma5mv": "Togol keterlihatan tab bar alat",
    "Minify-Basics-001": "Apakah maksud mengecilkan kod atau fail?",
    "Minify-CLI-Usage-009": "Kebanyakan alat ini mempunyai kedua-dua antara muka baris perintah (CLI) dan API yang membolehkan pembangun mengautomasikan proses peminimakan semasa pembangunan dan penggunaan.",
    "Minify-Def-002": "Minifikasi ialah proses mengurangkan saiz kod (HTML, CSS, JavaScript, dsb.) dengan mengalih keluar aksara yang tidak diperlukan seperti ruang putih, ulasan dan pemisah baris tanpa menjejaskan fungsinya.",
    "Minify-Example-007k": "Contohnya, {0} mungkin menjadi {1} selepas pengurangan.",
    "Minify-How-Works-004": "Bagaimanakah pemindahan kod berfungsi?",
    "Minify-Process-005": "Minifiers menggunakan algoritma untuk menganalisis struktur kod sumber, menghapuskan unsur berlebihan dan memendekkan nama pembolehubah jika boleh. Ini menghasilkan saiz fail yang lebih kecil sambil mengekalkan tingkah laku asal kod.",
    "Minify-Purpose-003": "Tujuan utama minifikasi adalah untuk meningkatkan prestasi laman web dan mengurangkan masa muat halaman dengan mengurangkan jumlah data yang perlu dipindahkan antara pelayan dan pelanggan.",
    "Minify-Tools-007": "Apakah beberapa alatan popular untuk mengecilkan kod?",
    "Minify-Tools-List-008": "Alat popular untuk mengecilkan kod termasuk UglifyJS untuk JavaScript, Terser yang merupakan evolusi UglifyJS, HTMLMinifier untuk HTML dan CSSNano untuk CSS. Alat ini selalunya boleh disepadukan ke dalam proses binaan menggunakan pelari tugas seperti Gulp atau Webpack.",
    "Mq9pdpT": "Senaraikan semua sumber yang berkaitan untuk menu berfungsi yang anda pilih.",
    "Mq9ppT": "Lihat status perkhidmatan anda dengan cepat",
    "Mqq9pdpT": "Bantu anda untuk bermula dengan LafTools.",
    "MrgmU": "sahkan",
    "MySQL-Performance-Tuning": "Petua Penalaan Prestasi MySQL",
    "NMLOn": "Salin FilePath",
    "NMLOn1": "Buka Ruang Kerja",
    "NNfJo": "Muatkan Data daripada Fail",
    "Nq1IR": "Tidak dapat Memuatkan VM Sambungan",
    "Nqc0LqwX": "Jika anda rasa terdapat kelemahan dalam proses ini, sila hubungi kami melalui EMail atau GitHub pada bila-bila masa, kami ingin mempertingkatkannya dengan segera.",
    "NrQc8OJfZ": "Memampatkan kod Notasi Objek JavaScript (JSON).",
    "NvOqE3B9Vxd": "Dan di bawah ialah penyelesaian yang mungkin anda boleh rujuk",
    "O94Yx": "pada",
    "OO0qPN": "Contoh Dimuatkan",
    "OQWm4": "Laporkan Pepijat",
    "OSHOI": "Halaman Selamat Datang",
    "OSqZQM": "Kata Laluan Tempatan",
    "OWASP-JSON-Injection": "OWASP - Suntikan JSON",
    "OWASP-SQL-Injection": "Panduan Suntikan SQL OWASP",
    "OeO0PeN": "Okay, contoh dipaparkan dalam editor input.",
    "OeOQY": "TODO",
    "Ol1ZcWomT": "{0} Cantikkan",
    "OpPFe": "Jika anda suka LafTools, sila kongsikannya dengan rakan anda dan berikan kami bintang, terima kasih!",
    "Opcty": "Fail",
    "OqqGx2qg": "Memuatkan sumber statik, sila tunggu...",
    "OrCt5": "Mengubah hala ke meja kerja...",
    "Ot6EP": "Alat Poland",
    "P4ROa": "Wilayah Keluaran",
    "PM_N5": "Sesi - {0}",
    "PUxuU": "Mendapatkan semula data untuk pek bahasa...",
    "PapkF": "Jika anda mempunyai sebarang soalan atau cadangan tentang LafTools, sila beritahu kami. Kami sentiasa mencari cara untuk menambah baik produk kami dan memberikan pengalaman yang terbaik untuk pengguna kami. Anda boleh menghubungi kami di work7z@outlook.com. Terima kasih kerana menggunakan LafTools!",
    "PpCHA": "Kunci Soalan(?)",
    "PqazM-": "Pertama sekali, sila gunakan kawalan borang di bawah untuk menyulitkan kata laluan anda",
    "QL9Sn": "Pada masa ini, nampaknya tiada penerangan tersedia.",
    "QLKzF": "Ia padat dengan ciri-ciri yang memenuhi keperluan pembangun baru dan berpengalaman, menjadikannya alat yang mesti ada dalam mana-mana senjata pengaturcara.",
    "QM2Ob": "Alat Terkini",
    "QM2Oq": "Nota Terbaru",
    "QRAdA": "Inggeris kepada Cina",
    "QZK58Gemi": "Memampatkan kod Bahasa Pertanyaan Berstruktur (SQL).",
    "QhdpH": "Edisi Komuniti",
    "QkJ-TOduip6z_": "LafTools IDE",
    "QzlA3": "Ralat Berlaku",
    "R12bq": "Senaraikan tab yang tidak ditunjukkan",
    "RNBze0": "Alatan",
    "RNeBze0": "Tab Dibuka",
    "RNewBze0": "Konfigurasi Alat",
    "RO4ZP": "Ralat Berlaku",
    "RPVRl": "Nampaknya sambungan ini tidak serasi dengan versi semasa LafTools. Sila pertimbangkan untuk memasang versi terbaharu untuk menyokong sambungan ini, atau sila hubungi kami dengan membangkitkan isu di GitHub.",
    "R_S7_CLAo": "Contoh: Untuk mengekod 'TEST12345' dalam Base32, anda boleh menggunakan perpustakaan seperti base32-encode dalam Node.js, atau fungsi terbina dalam dalam bahasa lain seperti base64.b32encode Python.",
    "RhqzcdD": "Tetapan sistem",
    "RjCO3": "Senarai Ruang Kerja",
    "S4MMV": "Aduh! Kami menemui beberapa isu semasa memuatkan fail.",
    "SAnnQ": "Memuatkan fail {0}",
    "SBsDz": "Persediaan untuk Akaun Pentadbiran Anda.",
    "SDLC-Wikipedia": "Kitaran Hayat Pembangunan Perisian - Wikipedia",
    "SETxuObyB": "Bangkitkan Isu pada GitHub untuk ralat ini untuk membolehkan pasukan LafTools menyiasatnya dengan lebih lanjut.",
    "SGs7B": "Sediakan LafTools Anda dengan Cepat",
    "SHA-256-020": "SHA-256 (Secure Hash Algorithm) ialah alternatif yang digunakan secara meluas yang menawarkan keselamatan yang lebih kukuh daripada MD5. Ia menjana nilai cincang 256-bit yang lebih besar dan merupakan sebahagian daripada keluarga SHA-2.",
    "SHA-2_Info-022": "Maklumat SHA-2",
    "SHA3-NISTStandard-024": "Penyeragaman SHA-3",
    "SMqD13": "Masuk untuk menapis",
    "SPem9": "Medan ini masih belum siap.",
    "SQAw7": "Bahasa Sumber",
    "SQL-Basics-001": "Apakah SQL?",
    "SQL-Beautifier-Example": "Pemformat SQL Dalam Talian",
    "SQL-Beautify-006": "Apakah itu SQL Beautification?",
    "SQL-Beautify-Def-007": "Pengindahan SQL ialah proses pemformatan kod SQL untuk meningkatkan kebolehbacaan dengan menggunakan lekukan, jarak dan konvensyen kes yang konsisten.",
    "SQL-Beautify-Purpose-008": "Sama seperti mencantikkan kod generik, ia membantu pembangun memahami pertanyaan kompleks dengan lebih mudah dan mengekalkan konsistensi merentas skrip atau projek SQL mereka.",
    "SQL-Commands-005": "SQL termasuk beberapa jenis arahan: DDL (Bahasa Definisi Data - CREATE, ALTER, DROP), DML (Bahasa Manipulasi Data - SELECT, INSERT, UPDATE, DELETE) dan DCL (Bahasa Kawalan Data - GRANT, REVOKE).",
    "SQL-Components-004": "Apakah komponen utama SQL?",
    "SQL-Components-Wikipedia": "Komponen SQL di Wikipedia",
    "SQL-Def-002": "SQL (Bahasa Pertanyaan Berstruktur) ialah bahasa pengaturcaraan standard untuk mengurus dan menanya pangkalan data hubungan.",
    "SQL-Indexing-016": "Apakah indeks dalam SQL dan mengapa ia penting?",
    "SQL-Indexing-Benefit-018": "Mencipta indeks pada lajur yang kerap digunakan untuk keadaan klausa WHERE dengan ketara mempercepatkan pertanyaan SELECT tetapi boleh melambatkan operasi INSERT, UPDATE dan DELETE kerana keperluan untuk mengekalkan struktur indeks.",
    "SQL-Indexing-Explanation-017": "Indeks ialah struktur data (cth., B-tree) yang meningkatkan kelajuan operasi pengambilan data dalam jadual dengan membenarkan enjin pangkalan data mencari baris dengan cepat berdasarkan nilai lajur tertentu.",
    "SQL-Indexing-MDN": "MDN Web Docs on Indexes",
    "SQL-Injection-019": "Apakah SQL Injection dan bagaimana ia boleh dicegah?",
    "SQL-Injection-Def-020": "SQL Injection ialah kelemahan keselamatan di mana penyerang boleh memasukkan kod SQL berniat jahat ke dalam medan input untuk memanipulasi atau mengekstrak data daripada pangkalan data.",
    "SQL-Injection-Prevention-021": "Kaedah pencegahan termasuk menggunakan pertanyaan berparameter, pernyataan yang disediakan atau pustaka ORM yang secara automatik melarikan diri daripada input pengguna, serta mengehadkan kebenaran pangkalan data dan menggunakan prinsip keistimewaan yang paling sedikit.",
    "SQL-Joins-011": "Apakah JOIN dalam SQL?",
    "SQL-Joins-Explanation-012": "JOIN digunakan untuk menggabungkan baris daripada dua atau lebih jadual berdasarkan lajur yang berkaitan di antara mereka. Cth., SERTAI DALAM, SERTAI KIRI, SERTAI KANAN dan SERTAI PENUH.",
    "SQL-Joins-Tutorial": "Tutorial Menyertai SQL",
    "SQL-Perf-Tuning-Methods-024": "Teknik lain termasuk membahagikan jadual besar, menggunakan jenis data yang sesuai dan keputusan caching apabila boleh.",
    "SQL-Perf-Tuning-Overview-023": "Mengoptimumkan prestasi pertanyaan SQL melibatkan menganalisis rancangan pelaksanaan, mengindeks dengan sewajarnya, meminimumkan gabungan dan subkueri yang tidak perlu, dan menulis klausa WHERE yang cekap.",
    "SQL-Performance-Tuning-022": "Bagaimanakah cara saya mengoptimumkan prestasi pertanyaan SQL?",
    "SQL-Purpose-003": "Ia digunakan untuk membuat, membaca, mengemas kini, memadam dan menanyakan data dalam jadual serta mengurus struktur pangkalan data dan kebenaran.",
    "SQL-Select-009": "Bagaimanakah saya menulis pernyataan SELECT asas?",
    "SQL-Select-Example-0210": "Pernyataan SELECT mudah mendapatkan semula data daripada jadual. Contohnya: {0}', 'PILIH lajur1, lajur2 DARI my_table;",
    "SQL-Transactions-013": "Apakah transaksi dalam SQL?",
    "SQL-Transactions-Def-014": "Transaksi ialah unit kerja logik yang mengandungi satu atau lebih pernyataan SQL. Ia memastikan bahawa semua operasi di dalamnya berjaya diselesaikan (atomicity), diasingkan daripada transaksi lain, dan tahan lama walaupun dalam kes kegagalan sistem.",
    "SQL-Transactions-Example-015": "Untuk memulakan transaksi, gunakan perintah START TRANSACTION; lakukan perubahan dengan COMMIT atau rollback ke keadaan sebelumnya dengan ROLLBACK.",
    "SQL-Transactions-W3Schools": "Transaksi SQL di W3Schools",
    "SYSq1": "Contoh",
    "SZgXb": "Sediakan Kata Laluan Setempat",
    "SdGcT": "Bahagian lain",
    "Sm9tq": "Sila berikan kata laluan akaun di sini",
    "Sm9tqq": "Sila berikan kata laluan untuk membuka kunci LafTools anda",
    "Spcfdee": "Mod Terang atau Gelap",
    "TBPqy7": "Bahasa",
    "TD7DA": "Bahasa",
    "TIOBE-Index": "Indeks TIOBE - Syarikat Kualiti Perisian",
    "TNoePE": "Awan LafTools",
    "Terser": "Terser - GitHub",
    "Ttrqqet": "Tulis dan Simpan pemikiran anda di sini!",
    "TwFcr": "Bahasa sasaran",
    "TyqvWY3": "Fail Tempatan",
    "U2ZNl": "Ketahui lebih lanjut di Wikipedia",
    "U4qqq9": "Alih keluar tab ini daripada senarai",
    "U5Eiy7ZRZ": "Hantar e-mel kepada pasukan LafTools({0}) untuk melaporkan ralat ini jika ia berkaitan dengan maklumat sensitif.",
    "U7zP2": "Sila berikan nama pengguna akaun di sini",
    "UF_Dp": "Ralat telah berlaku: {0}, masa ditolak ialah {1}",
    "UVvJp-vtF": "{0} Kecilkan",
    "UZ2Ig": "Akaun Tempatan Baharu",
    "UglifyJS": "UglifyJS - GitHub",
    "Ugpng": "Kegemaran",
    "V6U_f": "Syarat Perkhidmatan",
    "V6XEO": "Masukkan nama pengguna atau E-mel",
    "VAZq8r": "Ia membolehkan pembangun melaksanakan pelbagai arahan, seperti menjalankan skrip, memasang pakej dan menavigasi sistem fail, semuanya dari dalam editor.",
    "VEfeqZG": "Nota",
    "VI6VT": "Sejarah",
    "VOsZc": "Laporan Isu",
    "VSZ": "Klik untuk mencetuskan semula",
    "VZtqg6": "Cipta Borang Skrip Baharu",
    "Vaf2y": "Nama tab tidak boleh kosong.",
    "VeY9K": "Syarat Penggunaan",
    "VgG5y": "Klik di sini untuk memuat semula status sambungan anda",
    "Vvt09V2Qo": "Kod Generik",
    "W3Schools-XML-Validation": "W3Schools - Pengesahan XML",
    "WFUWzv_px": "Menghuraikan dan mencetak kod JavaScript yang sah. Juga berfungsi dengan Notasi Objek JavaScript (JSON).",
    "WPrTW": "Laman web rasmi",
    "WXo6D": "Disegarkan semula",
    "WYCVL": "Persediaan Pantas",
    "X4L_Z": "VM sambungan tidak disediakan.",
    "X6Fq4j": "Selepas bertahun-tahun pembangunan dan penghalusan berdedikasi, kami yakin LafTools boleh meningkatkan pengalaman pengaturcaraan anda dengan ketara dengan membawa lebih banyak kemudahan dan kecekapan kepada aliran kerja anda.",
    "XKpI0": "Klik untuk memproses teks anda dalam kawasan input",
    "XLWoR": "Pilih pilihan anda dan teruskan",
    "XML-Advantage-Readable-018": "Sifatnya yang boleh dibaca oleh manusia membolehkan pemeriksaan dan penyahpepijatan yang mudah, dan keupayaan untuk menentukan struktur tersuai menjadikannya fleksibel untuk berbilang kes penggunaan.",
    "XML-Advantage-Standardized-017": "XML ialah piawaian yang diterima pakai secara meluas, menjadikannya serasi dengan pelbagai platform dan sistem, menggalakkan kesalingoperasian dan pertukaran data.",
    "XML-Advantages-012": "XML menyediakan lebih banyak fleksibiliti struktur dan menyokong ruang nama, yang boleh memberi manfaat untuk struktur dokumen kompleks dan kesalingoperasian merentas sistem.",
    "XML-Advantages-016": "Apakah kelebihan menggunakan XML?",
    "XML-Attributes-006": "Elemen boleh mempunyai atribut, yang memberikan maklumat tambahan tentang elemen dalam teg pembukaan, seperti {0}",
    "XML-Basics-001": "Apakah XML?",
    "XML-Def-002": "XML (Bahasa Penanda eXtensible) ialah bahasa penanda yang mentakrifkan satu set peraturan untuk pengekodan dokumen dalam format yang boleh dibaca oleh manusia dan boleh dibaca oleh mesin.",
    "XML-Disadvantage-Size-020": "XML boleh menjadi agak bertele-tele, menghasilkan saiz fail yang lebih besar berbanding alternatif seperti JSON, yang memberi kesan kepada kelajuan penghantaran dan keperluan storan.",
    "XML-Disadvantages-019": "Apakah beberapa kelemahan menggunakan XML?",
    "XML-JSON-Diff-Structure-014": "XML menggunakan verbose, teg hierarki untuk struktur, manakala JSON bergantung pada pasangan nilai kunci dan tatasusunan. Contoh: XML {0} lwn. JSON {1}.",
    "XML-JSON-Diff-Syntax-015": "XML mempunyai sintaks yang lebih ketat dengan teg penutup dan atribut, manakala sintaks JSON lebih ringan dan lebih dekat dengan tatatanda objek JavaScript. JSON biasanya dianggap lebih mudah untuk dihuraikan dan dihantar melalui web.",
    "XML-JSON-Difference-013": "Apakah perbezaan antara XML dan JSON?",
    "XML-Nesting-007": "Bagaimanakah sarang berfungsi dalam XML?",
    "XML-Nesting-Example-009": "Sebagai contoh, `<book><title>Tajuk Buku Saya</title><author>John Doe</author></book>` mewakili buku dengan tajuk dan pengarangnya sebagai elemen bersarang.",
    "XML-Nesting-Explanation-008": "Dalam XML, elemen boleh bersarang di dalam satu sama lain untuk mewakili perhubungan hierarki. Elemen anak diletakkan di antara tag pembuka dan penutup elemen induknya.",
    "XML-Processing-Speed-021": "Menghuraikan dan menjana XML boleh menjadi lebih perlahan kerana sintaksnya yang ketat dan keperluan untuk pengesahan, terutamanya apabila berurusan dengan dokumen yang kompleks.",
    "XML-Purpose-003": "Ia direka bentuk untuk membawa data, bukannya memaparkan data seperti HTML, membolehkannya digunakan sebagai format biasa untuk berkongsi maklumat berstruktur merentas platform dan aplikasi yang berbeza.",
    "XML-Syntax-004": "Apakah sintaks asas XML?",
    "XML-Syntax-Example-005": "Dokumen XML ringkas terdiri daripada elemen dalam struktur seperti pokok. Setiap elemen bermula dengan teg dalam kurungan sudut (<element>) dan berakhir dengan teg penutup (</element>).",
    "XML-Validation-010": "Apakah pengesahan XML, dan bagaimana ia berfungsi?",
    "XML-Validation-Def-011": "Pengesahan XML memastikan bahawa dokumen XML mematuhi set peraturan khusus yang ditakrifkan dalam Definisi Jenis Dokumen (DTD) atau Skema XML (XSD).",
    "XML-Validation-Process-012": "Pengesah menyemak sama ada semua elemen dan atribut yang diperlukan ada, mengesahkan jenis data dan menguatkuasakan sebarang kekangan yang dinyatakan dalam skema sebelum memproses dokumen.",
    "XQxJB": "Ruang Kerja Saya",
    "X_HGx": "LafTools ialah kotak alat serba boleh yang direka untuk memenuhi pelbagai keperluan. Ia adalah sumber terbuka sepenuhnya, memastikan ketelusan dan keselamatan. Walaupun masa jalannya yang ringan, ia menawarkan sokongan platform penuh, termasuk ARMv8, dan sokongan AI asli yang serupa dengan ChatGPT. LafTools sangat terintegrasi dengan UI yang produktif dan dikemas kini secara berterusan dengan alatan baharu. Ia boleh digunakan melalui web dan dengan Docker, serta menyediakan sumber tambahan seperti nota dan manual.",
    "XeXF77": "tetapan",
    "XikdD": "Tolong sekejap, kami hampir sampai!",
    "Y5GAC": "Nama Pengguna anda",
    "Y9mQ2": "Sila berikan nama pengguna akaun di sini",
    "YAAU3q": "Kata Laluan Tempatan",
    "YHCjT": "LafTools menyokong tema terang dan gelap global, ia berguna khususnya dengan pengekod syif malam.",
    "YNwKz": "Bahasa tidak disokong: {0}, akan menggunakan bahasa Inggeris secara lalai.",
    "YOYTp": "Persediaan Pantas",
    "YPPPL": "Togol keterlihatan tab bar alat",
    "YQN9u": "Ralat telah berlaku semasa memuatkan {0}, sila semak butiran di bawah.",
    "Y__Zb1_4Q": "Meminimumkan kod Cascading Style Sheets (CSS), mengalih keluar semua aksara yang tidak diperlukan.",
    "Y_k0z": "Lupa kata laluan?",
    "Ye3TXses": "Untuk mengkonfigurasi sama ada transformasi akan dilaksanakan secara automatik apabila teks input ditukar.",
    "Ylq2X": "Pembetulan kesilapan",
    "YquQqTXq": "Larian Auto?",
    "YrTdq": "Semua",
    "YrVq683": "Mel",
    "YrVqdd683": "Manual",
    "Z2QTU": "Tentang",
    "Z3rhY": "Mesej",
    "Z7ALO": "Beralih ke ruang kerja yang dipilih",
    "Z7OTt": "Fail yang anda pilih terlalu besar, sila pilih fail kurang daripada 30MB.",
    "ZAGva": "Adakah anda pasti akan memadamkan ruang kerja ini?",
    "ZAKaFq": "Akaun Awan Saya",
    "ZW1Dgz": "Tiada Mesej Tersedia",
    "ZXRGC": "Sila lihat ralat: {0}",
    "ZbD3F": "{0}, dibuat oleh pasukan LafTools",
    "Zk7JI": "Ia belum lagi disokong",
    "ZrbduC": "Tutup Semua Tab",
    "ZrbuC": "Tutup Tab",
    "_-JigU2Fg": "Input atau format data yang tidak dijangka telah menyebabkan pengecualian.",
    "_5OqeG": "Nyahtandanya",
    "_LFF3": "Sekiranya anda menghadapi sebarang isu atau mempunyai sebarang cadangan semasa menggunakan LafTools, sila hubungi kami melalui EMail atau GitHub pada bila-bila masa, kami bersedia untuk mempertingkatkannya.",
    "_trez": "Tukar Teks",
    "_trqL": "Mendapatkan semula data untuk sumber sistem...",
    "_z3lR": "Muat semula Kod",
    "a3yqoz": "Parsi",
    "a3z-3k12": "Alat Alamat IP",
    "a4jbpq": "bahasa Czech",
    "a4r9t": "Bolehkah Base45 menyahkod sebarang rentetan berkod Base45 tanpa mengira asalnya?",
    "a4s6x": "Bagaimanakah Base32 berfungsi?",
    "a8b7z": "Oleh itu, padding hanya perlu jika kumpulan terakhir bit yang dikodkan tidak boleh dibahagikan dengan 40 bit (kerana 8 aksara Base32 mewakili 40 bit). Padding akan terdiri daripada sifar hingga enam aksara '=' pada penghujung rentetan yang dikodkan.",
    "aCkOP": "Keluar",
    "aHAfR": "Mengambil data untuk {0}...",
    "aSOpr": "Penjana Model Data",
    "ab9c0d1e": "Operasi utama termasuk pengekodan (menukar binari kepada Base64) dan penyahkodan (menukar Base64 kembali kepada binari).",
    "abc12345": "Base64 ialah skim pengekodan yang mewakili data binari sebagai jujukan aksara ASCII.",
    "abcdef12": "Bagaimanakah Base64 berfungsi?",
    "about_LafTools_toolbox": "Mengenai LafTools",
    "adpgq": "Cipta ruang kerja baharu",
    "ah-C4": "Nota Baharu",
    "aj3nhd": "Jerman",
    "aked6": "Rujukan",
    "aked61": "pengenalan",
    "asElV": "Alih keluar",
    "az4uS2": "Adakah anda pasti untuk log keluar dari sistem ini? Ambil perhatian bahawa anda akan dialihkan ke halaman log masuk.",
    "azpNX": "Selesai.",
    "b0qjSL": "Sila masukkan direktori {1} dan buat fail {2}, letakkan kata laluan anda yang disulitkan sebagai keseluruhan kandungan failnya.",
    "b6sx9b": "Filipina",
    "b8g2k": "Senario penggunaan untuk Base32",
    "bP_6qG": "Petua untuk Terlupa Kata Laluan Anda",
    "bT4R6": "Tab baru",
    "bVlBN": "Cina kepada Inggeris",
    "bcdef01a": "Base64 berfungsi dengan membahagikan data binari kepada kumpulan 6 bit dan memetakan setiap kumpulan kepada aksara tertentu daripada abjad 64 aksara (A-Za-z0-9+/).",
    "bhojei1": "Cina tradisional",
    "bjZyW": "Terjemah",
    "bors14": "bahasa Turki",
    "bp_-b": "Untuk mengurus LafTools sepenuhnya, anda perlu menyediakan pentadbir anda pada permulaan aliran persediaan. Kami telah mengesahkan pengenalan anda dengan token parameter URL, sila yakin bahawa tiada orang lain yang boleh menyediakan kebenaran root anda melainkan dia memperoleh token persediaan.",
    "bqqrij": "bahasa Swahili",
    "bsWpBA73s": "Memampatkan kod JavaScript.",
    "c0eCw": "Terjemah teks anda ke dalam mana-mana bahasa yang anda mahukan.",
    "c0v2p": "Operasi biasa dengan Base32",
    "c1p3b": "Setelah disepadukan, salin templat yang disediakan ke dalam program C++ anda dan gantikan pemegang tempat dengan nilai yang dikodkan sebenar sebelum menjalankan program.",
    "c1p4b": "Setiap nombor perpuluhan kemudian ditukar kepada urutan unik lima aksara Base85. Jika terdapat kurang daripada empat bait yang tinggal pada penghujung, padding mungkin digunakan.",
    "c2tpr": "Perpustakaan Codec Apache Commons menyediakan fungsi pengekodan dan penyahkodan Base32 dalam Java.",
    "c2vw9k": "Walaupun Base45 tidak dilaksanakan secara meluas seperti Base64 atau Base32, perpustakaan sumber terbuka wujud untuk beberapa bahasa.",
    "c5m1b": "Satu lagi varian, Base58Flickr, berbeza sedikit dalam set wataknya. Ia menggantikan '+' dengan ',' dan '/' dengan '-', menyesuaikan diri dengan keperluan URL Flickr.",
    "c5meku": "bahasa sunda",
    "c5p1b": "Padding tidak digunakan; panjang output yang dikodkan bergantung secara langsung pada saiz data input.",
    "c6p4n": "Dalam templat yang disediakan, gantikan pemegang tempat dalam bahagian penyahkod dengan bait yang dikodkan Base85 sebenar (diawalan 'b'), kemudian laksanakan skrip.",
    "c6p9b": "Jika panjang data input tidak boleh dibahagikan dengan 8, padding tidak digunakan; sebaliknya, setiap kumpulan bukan penuh dilayan secara bebas.",
    "c7Uoqqe": "Sebelum menggunakan LafTools, sila berikan dan sahkan kata laluan setempat anda seperti di bawah.",
    "c8me6b": "Skim seperti Base62 tersuai mungkin disesuaikan untuk aplikasi tertentu, tetapi ia biasanya mematuhi prinsip yang sama menggunakan set aksara yang lebih besar daripada Base64 atau Base32.",
    "c9j5k": "Muat turun dan masukkan pengepala 'base32.h' dan pelaksanaannya yang sepadan dalam projek anda.",
    "c9j5v": "Pasangnya melalui Komposer dengan menambahkan 'komposer memerlukan christian-riesen/base32' pada projek anda.",
    "c9q7w": "Mengapa Base45 dicipta?",
    "cMBqyyFae": "Inden dan cantikkan kod Structured Query Language (SQL).",
    "cNQp_": "Sumber",
    "cPS6q": "Semua Alat",
    "cQqwI8r": "Memuatkan status Perkhidmatan Terminal",
    "cU0YAMbxU": "Tunjukkan Teks dalam Bar Sisi",
    "cbaq54321": "Tidak, Base64 bukan teknik pemampatan, ia hanya mengubah perwakilan data bukan saiznya.",
    "cdefg234": "Aksara padding (=) ditambahkan pada penghujung untuk memastikan panjang data yang dikodkan ialah gandaan 4 aksara.",
    "cfYYN": "Temui Lagi",
    "ciZV2": "Base32 ialah notasi untuk pengekodan data bait sewenang-wenang menggunakan set simbol terhad yang boleh digunakan dengan mudah oleh manusia dan diproses oleh komputer. Ia menggunakan set aksara yang lebih kecil daripada Base64, biasanya abjad huruf besar dan nombor 2 hingga 7.",
    "ciZV21": "Base45 ialah notasi untuk pengekodan data bait arbitrari menggunakan set simbol terhad yang boleh digunakan dengan mudah oleh manusia dan diproses oleh komputer. Asas nombor yang tinggi menghasilkan rentetan yang lebih pendek berbanding dengan sistem perpuluhan atau perenambelasan. Base45 dioptimumkan untuk penggunaan dengan kod QR.",
    "ciZV2deq1": "Base58 (serupa dengan Base64) ialah notasi untuk pengekodan data bait sewenang-wenangnya. Ia berbeza daripada Base64 dengan mengalih keluar aksara mudah salah baca (iaitu l, I, 0 dan O) untuk meningkatkan kebolehbacaan manusia. Base58 biasanya digunakan dalam mata wang kripto (Bitcoin, Ripple, dll).",
    "cj1pd": "Operasi Segar Semula",
    "cjzqj9": "Bosnia",
    "cmxzpg": "Malayalam",
    "coM2I": "Gunakan Editor Pintar",
    "crD7I": "Untuk mengkonfigurasi sama ada transformasi harus mengabaikan teks input kosong yang panjangnya sifar.",
    "cuRCb": "Kategori tidak ditemui.",
    "cuRCqb": "Kategori tidak wujud",
    "cxqhqa": "Myanmar (Burma)",
    "d-l2l": "sahkan",
    "d-qPr": "Reka letak tidak diketahui: {0}",
    "d1x7v": "Contoh lain ialah dalam Git, di mana objek cincang kadangkala disimpan dalam format Base32 untuk mengelakkan masalah dengan pengakhiran baris dan sekatan nama fail. Selain itu, HashiCorp Vault menggunakan Base32 untuk terbitan kunci.",
    "d2w4e": "Sama seperti sistem penukaran asas yang lain, Base62 berfungsi dengan menukar bait input kepada integer besar, kemudian menyatakannya sebagai gabungan aksara daripada set 62 aksaranya.",
    "d2w6e": "Muat turun kod sumber dan sertakan fail pengepala base62.h dalam projek anda. Susun/pautkan terhadap fail sumber mengikut arahan projek.",
    "d3w2e": "Base58 berfungsi dengan menukar bait input kepada integer besar, kemudian menyatakan integer itu sebagai gabungan aksara daripada set 58 aksaranya (A-Z, a-z, 1-9).",
    "d5KZH": "Terima kasih kerana menggunakan LafTools!",
    "d5LAU": "Dilesenkan di bawah AGPLv3",
    "d5fmq2": "Itali",
    "d5hit": "Sesi - {0}",
    "d5x1rl": "bahasa Sepanyol",
    "d6g0w": "Coretan ini boleh dilaksanakan dalam mana-mana persekitaran Python, termasuk skrip, sesi interaktif atau dalam aplikasi yang lebih besar.",
    "d6y9k": "Jika tidak ada bait yang mencukupi untuk mengisi kumpulan terakhir, padding tidak digunakan; sebaliknya, bit yang tinggal diproses dan dipetakan kepada aksara yang sepadan.",
    "d7w2e": "Base85 berfungsi dengan membahagikan data input kepada kumpulan empat bait dan menukar setiap kumpulan kepada nombor perpuluhan antara 0 dan 2^32-1.",
    "d8w1b": "Tiada pemasangan tambahan diperlukan kerana ia adalah sebahagian daripada perpustakaan standard. Pastikan versi Python anda cukup terkini untuk memasukkan fungsi ini.",
    "d9w7m": "Tambahan pula, kerana ia hanya menggunakan huruf besar, ia tidak boleh menggunakan semua kemungkinan kombinasi kepekaan huruf besar-besaran sebagai langkah keselamatan tambahan seperti Base64 yang kadangkala lakukan dengan lipatan huruf besar semasa penyahkodan.",
    "dCFIC": "Kod Lebih Cantik",
    "dCFIwC": "Penjana Kod",
    "dGKMx": "Pengeluaran",
    "dGVUB": "Alat Rangkaian",
    "dQwjNbi0y": "Ketahui lebih lanjut tentang Dokumentasi",
    "dV5Eq": "Muat semula senarai ruang kerja",
    "dWbBm": "C# termasuk kelas 'System.Convert' dengan kaedah terbina dalam ToBase64String dan FromBase64String yang membolehkan anda mengekod dan menyahkod data Base64. Rentetan input mula-mula ditukar kepada tatasusunan bait menggunakan pengekodan UTF-8, kemudian dikodkan dan dinyahkodkan dengan sewajarnya.",
    "dk122q": "Urus aliran kerja anda untuk menggabungkan berbilang alatan bersama-sama.",
    "dkarh": "Okie, kotak alat membuka direktori. Jika tiada tetingkap timbul, sila semak sama ada platform anda menyokong fungsi ini, atau direktori berada dalam pelayan.",
    "dkjk12": "ini ujian",
    "dkkq12": "Konfigurasikan alat anda dalam tab ini.",
    "dl4kr": "Lupa kata laluan?",
    "dpRY4": "Kamus",
    "dqTqyvWY": "Menu Laci",
    "dsdpA_eJ": "Laraskan Saiz",
    "dtjdt4": "bahasa Kazakhstan",
    "dxLQq": "Kebenaran Root",
    "dzjTo": "Sila berikan kata laluan akaun di sini",
    "e--gB": "ID sambungan tidak diberikan.",
    "e3WgQaZlb": "Memampatkan {0}",
    "e4Cd8t": "Pangkalan85",
    "e5c7r": "Base32 ialah skema pengekodan binari-ke-teks yang mewakili data dalam rentetan ASCII menggunakan subset 32 ​​aksara. Ia direka bentuk supaya boleh dibaca manusia dan selamat URL.",
    "e5rycw": "Kyrgyz",
    "e8Crq": "Sila isikan medan nama pengguna dan kata laluan di bawah untuk meneruskan.",
    "e8x2v": "Base45 berfungsi dengan membahagikan data input kepada kumpulan 5 bait setiap satu. Ia kemudian menukar setiap kumpulan kepada nombor perpuluhan dan memetakannya kepada aksara yang sepadan daripada set 45 aksaranya.",
    "eN4fM": "Dalam Rust, anda boleh menggunakan peti 'base64' untuk pengekodan dan penyahkodan Base64. Tambahkan 'base64 = \\\"1.x\\\"' pada fail Cargo.toml anda di bawah bahagian [dependencies], jalankan 'cargo build' dan masukkan import yang diperlukan dalam kod anda untuk menggunakan fungsi ini.",
    "eTmq": "Sejarah CodeGen ToolBox",
    "e_8pZ": "Kotak alat serba boleh untuk pembangun untuk meningkatkan produktiviti.",
    "ediql2": "bahasa Hungary",
    "efg45678": "Perbandingan dengan Base32",
    "efghi678": "Varian ini sering digunakan untuk nama fail, URL atau situasi di mana aksara khas mesti dielakkan.",
    "egkqC8t": "Pangkalan58",
    "egkqCd8t": "Pangkalan62",
    "eifoni": "Catalan",
    "eqkqd4W": "Sila berikan nama untuk teg baharu",
    "etV-l": "Salin Fail ke SIT2",
    "eu5mh0": "Belarusia",
    "euaI8": "Buat Akaun Tempatan Baharu",
    "euhy9v": "bahasa Estonia",
    "f0q4w": "Satu senario penggunaan yang popular adalah dalam menjana kunci rahsia untuk Pengesahan Dua Faktor (2FA), di mana perkhidmatan seperti Pengesah Google dan Yubikey menggunakan rahsia yang dikodkan Base32.",
    "f1t2z": "Base62 telah dibangunkan untuk menyediakan alternatif yang lebih pendek dan selamat URL kepada Base64, terutamanya untuk pengecam unik dan URL pendek.",
    "f3ttw8": "Maori",
    "f4t7z": "Base58 pada mulanya dibangunkan untuk Bitcoin untuk mewakili alamat awam dan kunci peribadi tanpa kesamaran.",
    "f5a0s": "Selain itu, Base32 menghasilkan output yang lebih panjang tetapi boleh menjadi lebih sesuai untuk aplikasi tertentu seperti nama fail kerana kekurangan aksara khas yang mungkin bercanggah dengan peraturan sistem fail.",
    "f5bLC": "Dokumentasi",
    "f7akol": "Inggeris",
    "f7t1z": "Tambahkan pustaka pada projek Xcode anda secara manual atau melalui pengurus pakej seperti Swift Package Manager (SPM).",
    "f8n4m": "Kekompakannya membolehkan penggunaan ruang yang lebih cekap dalam kod QR sambil mengekalkan kebolehbacaan dengan pengimbas kod bar standard.",
    "f8wne": "Sertakan pakej dengan menjalankan 'Install-Package BouncyCastle' dalam Package Manager Console atau menambahkannya pada fail .csproj anda.",
    "f9t1z": "Base85 pada mulanya dibangunkan untuk mewakili data binari dengan cekap dalam dokumen PostScript untuk nisbah mampatan yang lebih baik.",
    "f9t2z": "Tambahkan kebergantungan pada projek Maven anda dengan memasukkan `<dependency> <groupId>commons-codec</groupId> <artifactId>commons-codec</artifactId> <version>...</version> </dependency>` dalam anda fail pom.xml dengan nombor versi terkini.",
    "fBP5h": "Nama pengguna",
    "fEr5j": "Cipta Skrip Baharu",
    "fTt2N": "Perl memerlukan modul 'MIME::Base64' untuk pengekodan dan penyahkodan Base64. Pasangnya dengan menjalankan 'cpan install MIME::Base64' jika belum dipasang.",
    "fV_1P": "Log Masuk",
    "fdxluz": "bahasa Romania",
    "ff02c": "Dibatalkan",
    "fghi6789": "Ia digunakan untuk menghantar atau menyimpan fail binari dalam format berasaskan teks, memastikan keserasian merentas pelbagai sistem.",
    "fgj880": "Telugu",
    "fqV_1P": "Buka kunci LafTools Anda",
    "g1h5n": "Bagaimanakah Base45 berfungsi?",
    "g2_aX": "Salin kata laluan yang disulitkan ke dalam fail",
    "g3h5s": "Bagaimanakah Base85 berfungsi?",
    "g4h7s": "Untuk C++, anda boleh menggunakan perpustakaan 'cpp-base62' yang menyediakan fungsi Base62.",
    "g5SK9": "Buka Baru-baru ini",
    "g5ybh": "Tambahkan kebergantungan pada projek anda (Maven: 'org.apache.commons:commons-codec').",
    "g6f0r": "Tiada pemasangan tambahan diperlukan untuk perpustakaan teras Ruby. Gantikan 'TEST12345' dengan nilai yang anda inginkan.",
    "g6f0t": "Jalankan 'go get github.com/mitchellh/go-base32' untuk menambah kebergantungan pada projek anda.",
    "g6v3b": "Walau bagaimanapun, set aksara Base45 yang lebih besar mungkin meningkatkan kemungkinan ralat apabila berurusan dengan aksara bukan abjad angka, yang boleh menjadi isu dalam sesetengah persekitaran atau saluran penghantaran.",
    "g7h5k": "Bagaimanakah Base58 berfungsi?",
    "g8h7s": "Bagaimanakah Base62 berfungsi?",
    "g8r3e": "Kelemahan utama Base32 ialah kecekapan ruang yang agak lemah; ia mengembangkan data input sebanyak lebih kurang 25% lebih daripada Base64. Ini bermakna ia mengambil lebih banyak storan atau lebar jalur untuk jumlah data yang dikodkan yang sama.",
    "gDjbs": "Data Sejarah",
    "gK3dNQ": "Salinan",
    "gQhfS": "Alatan Fail",
    "gT6re": "C++ tidak mempunyai pelaksanaan Base64 asli. Contoh ini menggunakan perpustakaan OpenSSL untuk melaksanakan pengekodan dan penyahkodan Base64. Untuk menggunakan OpenSSL, pasangkannya pada sistem anda dan pautkan ke perpustakaan yang sesuai semasa menyusun atur cara anda.",
    "gU1O2": "Tercetus",
    "generic-NI-UFPTe0": "Cantikkan Kod Generik",
    "generic-code-beautify.desc.2b3c": "Operasi ini memformat kod dalam pelbagai bahasa pengaturcaraan untuk meningkatkan kebolehbacaan dengan menggunakan lekukan yang konsisten, pemisah baris dan mematuhi garis panduan gaya khusus bahasa.",
    "gkC8t": "Pangkalan64",
    "gkdqqC8t": "Pangkalan45",
    "gkqC8t": "Pangkalan32",
    "gms7_9n5v": "Menukar rentetan bait heksadesimal kembali kepada nilai mentahnya.",
    "gnKMZ": "Disegarkan semula.",
    "h4e1b": "Ia juga berguna untuk situasi di mana rentetan abjad angka sensitif huruf besar lebih mudah dikendalikan daripada perenambelasan atau base64, yang mungkin mengandungi aksara bukan abjad angka yang boleh menyebabkan isu dalam konteks tertentu (seperti URL atau nama fail).",
    "h6AeI": "Sambungan soket web ditutup pada {0}",
    "h7rUq": "Dalam Node.js, kelas 'Buffer' terbina dalam boleh mengendalikan pengekodan dan penyahkodan Base64 tanpa memerlukan sebarang perpustakaan luaran. Coretan kod ini mengekod rentetan 'TEST12345' kepada Base64 dan kemudian menyahkodnya kembali kepada rentetan asal.",
    "h9j3m": "Padding dalam Base32",
    "hAH_IjzGN": "Ini adalah versi orang dalam, bahagian ini masih dalam pembangunan.",
    "hGA96yTG4": "Sesetengah ciri tidak disokong dalam platform ini.",
    "hJUMN": "Bahasa sasaran",
    "hMvh1": "Pangkalan Data Sandaran",
    "hRFxV": "Untuk maklumat lanjut, sila layari laman web kami",
    "hX1CWGAhl": "Mengesot dan mempercantikkan kod Bahasa Penanda eXtensible (XML).",
    "hcnt1k": "Macedonia",
    "hhOT3": "Cari mengikut Nama",
    "hij90klm": "Base32 menggunakan abjad yang lebih kecil (A-Z2-7), menghasilkan rentetan yang lebih panjang tetapi lebih boleh dibaca manusia.",
    "htTmvWjsS": "Memampatkan kod Cascading Style Sheets (CSS).",
    "htt1d2": "Esperanto",
    "hu-iz": "Pemasa",
    "huE6U": "Pembolehubah",
    "hyV-d": "Selesai",
    "hyirc0": "bahasa Sweden",
    "i27qmr": "Frisian",
    "i6hMN": "Kod Pengesahan Imej",
    "i7w2m": "Adakah terdapat perpustakaan Base45 terbina dalam dalam bahasa pengaturcaraan popular?",
    "i88tb": "Eksport Hasil ke Fail",
    "i8q8tb": "Konfigurasikan Aliran Kerja untuk Input",
    "i9o7k": "Kelebihan Base32 berbanding Base64",
    "iNQvo": "Tunjukkan contoh untuk bermula.",
    "iNqF1T": "Urus Akaun Awan",
    "iOEjZ": "Tiada Kod Tersedia",
    "iQL2c": "Kami masih meneroka rangkaian penuh fungsi untuk butang ini - jika anda mempunyai sebarang maklum balas atau cadangan tentang cara kami boleh memperbaikinya, sila maklumkan kepada kami!",
    "i_lang_": "Pek Bahasa",
    "ib135dq": "Mesej Status anda akan dipaparkan di sini",
    "iknTS": "Pengurus Kata Laluan",
    "init_env": "Memuatkan Sumber Sistem",
    "ip2g1": "disalin",
    "ipOSQE": "Edisi Pro",
    "it8ths": "Indonesia",
    "ixyP0": "Memproses tindakan masa nyata secara automatik",
    "j1b5k": "Operasi paling biasa yang melibatkan Base32 termasuk pengekodan data binari ke dalam rentetan Base32 dan menyahkod rentetan Base32 kembali ke dalam format binari asalnya.",
    "j4s6r": "Bagaimanakah saya boleh mengekod/menyahkod dengan Base62 dalam JavaScript?",
    "j5s7r": "Bagaimanakah saya boleh mengekod/menyahkod dengan Base85 dalam JavaScript?",
    "j6s3r": "Bagaimanakah saya boleh mengekod/menyahkod dengan Base58 dalam JavaScript?",
    "j7k2t": "Untuk mengekod data dengan Base45, anda memerlukan perpustakaan atau fungsi yang melaksanakan algoritma Base45.",
    "j8s6r": "Untuk Kotlin, anda boleh menggunakan perpustakaan 'barcode-core' yang merangkumi fungsi Base45.",
    "j9s5r": "Untuk C#, gunakan perpustakaan 'WarrenStranger.Base62' untuk mengendalikan pengekodan dan penyahkodan Base62.",
    "jJuNz": "Bahasa Sumber",
    "jO5eP": "okey",
    "jPNCb": "Dicuba semula.",
    "jQXdi": "Mod Cahaya",
    "jR1zX": "Makmal AI",
    "jRzgS": "Rangka kerja Yayasan Swift termasuk kaedah terbina dalam untuk pengekodan dan penyahkodan Base64. Tiada perpustakaan luaran diperlukan; hanya import 'Yayasan' untuk menggunakan ciri ini.",
    "jZvLJ": "PHP dilengkapi dengan fungsi terbina dalam 'base64_encode()' dan 'base64_decode()' untuk mengendalikan operasi Base64. Fungsi ini tersedia dan tidak memerlukan persediaan atau pemasangan tambahan.",
    "jaj7M": "Hak cipta terpelihara.",
    "jb392": "Nama",
    "jfpqt": "Nota Navigator",
    "jgDoEq": "Tiada Data Soalan Lazim",
    "jhDoE": "Mendapatkan semula Data Soalan Lazim",
    "jlxvpk": "Korea",
    "json-beautify.desc.0912": "Operasi ini memformat data JSON untuk meningkatkan kebolehbacaan dengan menambahkan lekukan yang betul, pemisah baris dan kekunci pengisihan secara konsisten.",
    "json-beautify.name.0912": "Format SQL",
    "json-beautify.text.93kq": "Cantikkan Data JSON",
    "k17PG": "Sambungan soket web ditutup.",
    "k1m4e": "Walau bagaimanapun, ia tidak menawarkan kecekapan ruang yang agak sama seperti Base64 atau Base32 kerana ia menggunakan lebih sedikit aksara dalam abjadnya.",
    "k2SVY": "dimatikan",
    "k2em5e": "Ini menghasilkan rentetan output yang lebih pendek untuk jumlah data input yang sama, yang boleh memberi manfaat dalam senario yang meminimumkan saiz adalah kritikal.",
    "k2ku5p": "bahasa Czech",
    "k3m2e": "Salin templat yang disediakan ke dalam fail Go baharu, gantikan pemegang tempat dengan nilai dikodkan sebenar, kemudian jalankan fail menggunakan `go run yourfile.go`",
    "k41a5": "LafTools",
    "k4s5rx": "Bahasa Slovenia",
    "k7d9f": "Pustaka 'base32' terbina dalam Ruby menyediakan kaedah untuk pengekodan dan penyahkodan Base32.",
    "k7d9r": "Pakej 'go-base32' menyediakan keupayaan pengekodan dan penyahkodan Base32 dalam Go.",
    "k7g0n": "Dalam Base32, setiap 5 bit data input dipetakan kepada salah satu daripada 32 aksara daripada set 'ABCDEFGHIJKLMNOPQRSTUVWXYZ234567='.",
    "k9em5e": "Ini menjadikannya sesuai untuk senario di mana pengecam mesra URL yang ringkas diperlukan tanpa mengorbankan kebolehbacaan.",
    "k9jtr": "Pakej npm 'base32-encoding' digunakan untuk pengekodan dan penyahkodan Base32 dalam Node.js.",
    "kLH79": "E-mel",
    "kOi5A": "Cetak Halaman",
    "kPD22": "Kamus",
    "kPJ-A4": "Segarkan semula",
    "kZd9G": "Ruby mempunyai perpustakaan 'base64' terbina dalam yang menyediakan kaedah untuk pengekodan dan penyahkodan Base64. Sertakan pustaka dengan 'require \\\"base64\\\"' dalam skrip anda.",
    "kcHxr": "Sila berikan nama pengguna akaun pentadbir di sini",
    "kjks1": "Mendapatkan semula konfigurasi i18n daripada API pelayan tempatan",
    "kqv5ht": "Yiddish",
    "krxSK": "Penolong AI",
    "ks12d": "Keselamatan siber",
    "kv4wag": "Belanda",
    "l1p9z": "Apakah itu Base32?",
    "l3akoa": "Amharic",
    "l6Djb": "Pilih salah satu pilihan sebagai tema pilihan anda:",
    "lIn3_": "Nama Pengguna Pentadbir",
    "lQFII": "Cetuskan semula permulaan",
    "lRHDQ": "Keluar dari Mod Skrin Penuh",
    "lUh5c": "Penjana",
    "lkuulh": "Perancis",
    "lp0qmd0": "Tandai sebagai kegemaran",
    "lpKAz": "tetapan",
    "lpzg83": "bahasa Samoa",
    "lzGS2": "Butiran Sambungan",
    "m0106": "Penukar",
    "m0107": "Penjana",
    "m0108": "Pemformat",
    "m6d8b": "Setiap nilai 5-bit diwakili oleh satu aksara, membolehkan pengekodan dan penyahkodan yang cekap untuk sistem yang lebih suka bekerja dengan oktet (unit 8-bit).",
    "m6t1b": "Pustaka 'base32' oleh Daniel R. Collins menyediakan fungsi pengekodan dan penyahkodan Base32 dalam C++.",
    "m7WZw": "Soket Web Sistem Rosak",
    "m8rTc1": "Setelah pengurus skrip shell dilaksanakan, anda boleh menggunakannya untuk mengurus arahan shell anda.",
    "m9k1z": "Walau bagaimanapun, jika data yang dinyahkodkan mengandungi semantik aplikasi tertentu (cth., format kod QR tertentu), pemprosesan tambahan mungkin diperlukan selepas penyahkodan.",
    "mBgF1": "Tindakan Tetikus",
    "mSFei": "Kod Sumber pada GitHub",
    "mWXeh": "ID ruang kerja: {0}",
    "mabHq": "Cari Fail Lama",
    "mbzCv": "Ralat telah berlaku: {0}, masa ditolak ialah {1}",
    "md2.desc.1039": "Operasi ini mencincang data menjadi cincang {0}.",
    "md2.text.192d3": "Hasilkan {0} Cincang",
    "md2aO2NaJITm": "Inden dan cantikkan kod Cascading Style Sheets (CSS), menjadikannya lebih mudah dibaca dan difahami.",
    "md4.desc.1039": "Operasi ini mencincang data menjadi cincang {0}.",
    "md4.text.192d3": "Hasilkan {0} Cincang",
    "md5-cpp-install-openssl-0002": "Pasang OpenSSL pada sistem anda dan pautkan dengan perpustakaan 'libssl' dan 'libcrypto' semasa membina aplikasi C++ anda.",
    "md5-cpp-openssl-0001": "C++ menggunakan perpustakaan OpenSSL untuk menjana cincang MD5. Anda perlu memasang OpenSSL dan memautkannya dalam projek anda.",
    "md5-cpp-use-openssl-0003": "Coretan mencipta fungsi 'getMD5' yang mengambil rentetan input, mengira cincangan MD5nya menggunakan API MD5 OpenSSL dan mengembalikan cincangan itu sebagai rentetan perenambelasan. Tampalkan kod ini ke dalam program C++ anda dan panggil fungsi 'getMD5' dengan input yang anda inginkan.",
    "md5-csharp-built-in-0001": "Dalam C#, kelas 'System.Security.Cryptography.MD5' digunakan untuk menjana cincang MD5.",
    "md5-csharp-no-install-0002": "Tiada pemasangan perpustakaan luaran diperlukan kerana ia adalah sebahagian daripada .NET Framework/Core.",
    "md5-csharp-use-0003": "Coretan ini mencipta tika MD5, menukar rentetan input kepada bait, mengira cincang dan akhirnya mengekod cincang dalam format Base64. Letakkan kod ini dalam titik masuk aplikasi C# anda dan jalankannya untuk mendapatkan cincangan MD5 yang dikodkan Base64.",
    "md5-java-built-in-0001": "Java menggunakan kelas 'java.security.MessageDigest' untuk menjana cincang MD5.",
    "md5-java-imports-0002": "Anda perlu mengimport 'java.security.MessageDigest' dan 'java.util.Base64' untuk pencincangan dan pengekodan hasilnya.",
    "md5-java-use-0003": "Coretan mendapat contoh algoritma ringkasan MD5, mengemas kininya dengan bait rentetan input, dan kemudian mengekodkan cincangan yang terhasil ke dalam rentetan Base64. Salin kod ini ke dalam kelas Java dan laksanakan kaedah utamanya untuk mendapatkan cincangan MD5 yang dikodkan Base64.",
    "md5-nodejs-built-in-0001": "Dalam Node.js, modul 'crypto' terbina dalam digunakan untuk menjana cincang MD5.",
    "md5-nodejs-no-install-0002": "Tiada pemasangan perpustakaan luaran diperlukan kerana 'crypto' diprapasang dengan Node.js.",
    "md5-nodejs-use-0003": "Coretan mencipta objek cincang menggunakan `createHash('md5')`, mengemas kininya dengan rentetan input dan kemudian menukar ringkasan kepada format perenambelasan melalui `.digest('hex')`. Tampalkan kod ini ke dalam skrip Node.js anda dan laksanakannya untuk mendapatkan cincangan MD5 bagi nilai input.",
    "md5-php-built-in-0001": "PHP mempunyai fungsi terbina dalam 'md5()' untuk menjana cincang MD5.",
    "md5-php-no-install-0002": "Tiada pemasangan perpustakaan luaran diperlukan kerana 'md5()' diprapasang dalam PHP.",
    "md5-php-use-0003": "Contoh mudah ini mentakrifkan fungsi 'getMD5' yang memanggil fungsi PHP 'md5()' pada rentetan input yang disediakan. Salin kod ini ke dalam fail PHP, simpannya dengan sambungan .php dan jalankannya dalam pelayan web atau melalui baris arahan untuk melihat cincangan MD5 bagi nilai input.",
    "md5-python-built-in-0001": "Python menggunakan perpustakaan 'hashlib' terbina dalam untuk menjana cincang MD5.",
    "md5-python-no-install-0002": "Tiada pemasangan tambahan diperlukan kerana 'hashlib' disertakan dengan Python.",
    "md5-python-use-0003": "Templat yang disediakan mengekod rentetan input kepada bait sebelum mencipta objek cincang MD5. Kaedah '.hexdigest()' kemudian dipanggil pada objek cincang untuk mendapatkan cincang MD5 dalam bentuk perenambelasan. Salin kod ini ke dalam skrip Python dan jalankannya untuk mendapatkan cincangan MD5.",
    "md5.desc.rxsHq": "Operasi ini mencincang data menjadi cincang {0}.",
    "md5.textiDjMIo": "Hasilkan {0} Cincang",
    "md6.desc.1039": "Operasi ini mencincang data menjadi cincang {0}.",
    "md6.text.192d3": "Hasilkan {0} Cincang",
    "meeMC1Uk7.text.93kq": "Kecilkan {0}",
    "mihc3": "Selesai operasi ini",
    "mjHoR": "Selain itu, secara teknikalnya, tiada siapa yang boleh membaca token ini jika tidak dia telah menyerang dan mengawal komputer anda.",
    "mnb19i": "Jerman",
    "mno34567": "Kelebihan Base64",
    "mnoijklm": "Adakah terdapat pengekodan BaseXX lain?",
    "mslw4o": "bahasa Yunani",
    "mwn7iv": "Zulu",
    "myxedr": "Mongolia",
    "n0pqrstu": "Contoh penggunaan Base64",
    "n1jA9": "sahkan",
    "n24tes": "Portugis (Brazil)",
    "n3e7r": "Sejarah Pangkalan32",
    "n94an4": "Poland",
    "n98EW": "Tukar teks kawasan input dan kawasan output.",
    "nSeIq8-": "Paling penting, ia adalah percuma dan sumber terbuka. Anda boleh menggunakannya untuk tujuan peribadi atau komersial anda.",
    "nTvw4": "Untuk melindungi dan menyimpan data dan tetapan anda secara berasingan, anda boleh menggunakan akaun setempat anda untuk mencapainya. Selain itu, LafTools akan menyokong widget mesej segera di kalangan pengguna pada masa hadapan.",
    "nmb1wx": "Yoruba",
    "nodBw": "Operasi ini mengekod data mentah ke dalam rentetan ASCII {0}.",
    "nopqrs01": "Walaupun Base64 mengoptimumkan kekompakan, Base32 dipilih apabila meminimumkan ralat input, seperti kemasukan manual, adalah penting.",
    "nrix6l": "Chichewa",
    "nxJC7": "Tindakan lalai yang akan dilaksanakan apabila pengubah dilakukan.",
    "o1umzi": "Perancis",
    "o52xW": "Eksport",
    "o8xyzu": "Luxembourgish",
    "oBz8D": "Memuatkan",
    "oNLxH": "Nama pengguna",
    "oNg3f": "Laman web rasmi",
    "ocxsw3": "Irish",
    "of_ox": "Secara keseluruhannya, LafTools ialah penyelesaian sehenti untuk semua keperluan anda.",
    "oj23X": "Pulihkan Pangkalan Data",
    "ojCWEFdVe": "Memampatkan kod JavaScript, mengalih keluar semua aksara yang tidak diperlukan.",
    "ooiFU": "Mulakan semula Perkhidmatan Java",
    "oqHqVq": "Disusun mengikut",
    "oqHqqV": "Jumlah: {0} Perintah",
    "oqHqqVq": "Masa Salin",
    "oqjbcj": "Lao",
    "os8h6u": "Danish",
    "p5e9n": "Tambahkan pustaka sebagai kebergantungan dalam skrip binaan Gradle anda. Sebagai contoh, dalam fail build.gradle peringkat apl, tambahkan `implementation 'com.bottlerocketstudios:barcode-core:...'` dengan nombor versi terkini.",
    "p6e3n": "Pasang pakej melalui NuGet dengan menjalankan `Install-Package WarrenStranger.Base62` dalam Package Manager Console atau tambahkannya melalui NuGet Package Manager.",
    "p8Exxc1s": "Terdapat pelbagai alatan yang memanfaatkan teknologi AI untuk melaksanakan tugas dengan lebih cekap dalam Makmal AI.",
    "p8eq9n": "Anda boleh menggunakan perpustakaan seperti 'base85' atau 'ascii85' untuk pengekodan dan penyahkodan Base85 dalam JavaScript.",
    "p9e1n": "Anda boleh menggunakan perpustakaan seperti 'base-x' atau 'base62' untuk pengekodan dan penyahkodan Base62 dalam JavaScript.",
    "p9s5t": "Base32 telah dibangunkan oleh Douglas Crockford, yang terkenal dengan sumbangannya kepada JavaScript, pada tahun 2001. Ia dicipta sebagai alternatif yang lebih dipercayai kepada pengekodan sedia ada seperti Base64, terutamanya untuk situasi yang memerlukan perwakilan berasaskan teks bagi data binari.",
    "pANmj": "Teg boleh ditakrifkan berdasarkan jenis pelayan, penggunaan skrip atau mana-mana kriteria lain yang anda suka.",
    "pA_deJ": "Eksport ke Papan Klip",
    "pA_feeJ": "Sambung semula Terminal",
    "pA_qweJ": "Kosongkan Penampan",
    "pDBSWq": "tiada kandungan tersedia untuk panel kanan",
    "pEk1kk": "LafTools mempersembahkan fungsi yang berguna untuk anda di sini.",
    "pEk1qkk": "Senaraikan semua tab yang dibuka",
    "pHZDB": "Tindakan Masa Nyata",
    "pJoOz": "Buka fail",
    "pKHRT": "Pergi ke Alat",
    "pKqHRq": "Cari Nota",
    "pL6qH": "Selesai.",
    "pZ4d616m-": "Cantikkan {0}",
    "ph5jH": "Mengendalikan bahagian ini",
    "piih4x": "bahasa Tajik",
    "pmAee": "Baca maklumat lanjut tentang alat ini.",
    "pmnp4b": "Ukraine",
    "ppmz8e": "Kreol Haiti",
    "pq5e9n": "Anda boleh menggunakan perpustakaan seperti 'bs58' untuk melaksanakan pengekodan dan penyahkodan Base58 dalam JavaScript.",
    "pqrs890t": "Keserasian Universal: Base64 diiktiraf secara meluas dan disokong dalam semua bahasa pengaturcaraan utama.",
    "pqs7y3": "Sila pertimbangkan untuk mendaftarkan halaman web ini sebagai PWA untuk mendapatkan sokongan penuh peta kunci.",
    "psA_eJ": "Eksport sebagai Fail",
    "psZoP": "Letakkan fail di sini untuk memprosesnya",
    "psqqpq_o": "Okey, hasilnya telah disalin ke papan keratan anda selama {0} kali.",
    "pzn2IpkDo": "Inden dan cetakan cantik kod Notasi Objek JavaScript (JSON).<br><br>Teg: json viewer, prettify, syntax highlighting",
    "q12beqwR": "Tiada Alat Tersedia",
    "q29t31": "Poland",
    "q2n3r": "Hari ini, ia digunakan dalam pelbagai aplikasi di mana kecekapan ruang dan kebolehbacaan adalah penting, seperti dokumen PDF dan protokol rangkaian tertentu.",
    "q2n9r": "Setelah ditambahkan, salin templat yang disediakan ke dalam fail Swift. Ambil perhatian bahawa dalam contoh ini, kami menggunakan senario hipotetikal di mana anda mempunyai perwakilan base64 rentetan Base45; gantikannya dengan nilai yang dikodkan sebenar sebelum menjalankan kod.",
    "q2w5m": "Tujuan menggunakan Base32?",
    "q2x8k": "Penggunaannya telah berkembang kepada mata wang kripto dan senario lain di mana rentetan yang boleh dibaca manusia dan tahan ralat dikehendaki.",
    "q5h8n": "Kelebihan utama ialah mengurangkan panjang rentetan untuk jumlah data yang dikodkan yang sama, menjadikannya sesuai untuk aplikasi di mana kecekapan ruang adalah kritikal.",
    "q6n1r": "Selepas memasang pustaka, salin kod templat ke dalam kelas Java dan gantikan pemegang tempat dengan nilai berkod Base85 sebenar sebelum menjalankan kod.",
    "q7n3r": "Ia juga mengelakkan aksara samar-samar seperti 'O' dan '0', 'I' dan 'l', yang boleh membawa kepada ralat transkripsi manusia.",
    "q9iuti": "bahasa Wales",
    "qDrbEr": "Nama pengguna yang anda berikan kosong, sila semak dan cuba lagi.",
    "qF4uS2": "Cipta Ruang Kerja",
    "qF4uS23": "Tingkap Baru",
    "qHoktx": "Terima kasih!",
    "qN1LdZ2": "Terakhir Diubah Suai",
    "qQmBr": "Terjemahan Teks",
    "qTqyvWdY": "Belum habis lagi",
    "qWemXE4": "1 Jan, 2024",
    "qWw3eTH": "Bahagian ini membantu untuk mengekalkan fail pada cakera tempatan atau cakera awan anda.",
    "qdeFXx": "Pada masa ini, halaman yang anda cari ini masih belum dilaksanakan sepenuhnya.",
    "qpDBSW": "tiada panel tersedia",
    "qpDBSWe1": "tiada panel tersedia",
    "qqK_x_": "Log Masuk",
    "qqqwYoz": "Tolong",
    "qqwYoz": "Tab",
    "qqwYqwe": "Ruang kerja",
    "qrstuvwx": "Ya, selain daripada Base64 dan Base32, terdapat juga Base16 (Heksadesimal), Base58, dan Base85, setiap satu direka untuk senario yang berbeza.",
    "qtpmvP": "Sahkan Kata Laluan Setempat",
    "qubSJ": "VM sambungan bukan ID. (RUJ: IQnMH).",
    "qv1p5n": "Contohnya, dalam Java, anda boleh menggunakan perpustakaan 'org.iso.base45' untuk mengekod data anda.",
    "qzshys": "bahasa Urdu",
    "r1GLS": "Tag",
    "r2n7v": "Kelebihan utama ialah peningkatan kebolehbacaan kerana mengecualikan aksara yang kelihatan serupa, mengurangkan ralat semasa kemasukan manual.",
    "r4n6v": "Tambahkan kebergantungan pada projek anda dengan menjalankan `go get github.com/xyproto/base62`. Ini akan memuat turun dan memasang pakej.",
    "r6nq2v": "Kelebihan utama Base62 ialah peningkatan kecekapan ruang disebabkan set aksara yang lebih besar daripada Base32 tetapi tanpa aksara bukan abjad angka yang ditemui dalam Base64.",
    "r8c6z": "Gantikan 'TEST12345' dengan rentetan anda sendiri dan laksanakan kelas ini sebagai program Java untuk melihat hasilnya.",
    "r8y2w": "Pustaka PHP 'Base32' digunakan di sini untuk pengekodan dan penyahkodan Base32.",
    "r9a3t": "Base45 ialah skim pengekodan berasaskan teks yang mengekod data binari ke dalam aksara ASCII.",
    "r9qn8v": "Kelebihan utama Base85 ialah kecekapan ruang yang dipertingkat kerana set aksara yang lebih besar (85 berbanding 64 dalam Base64 atau 32 dalam Base32).",
    "rE6fUsSGl": "Inden dan cantikkan kod Structured Query Language (SQL).",
    "rK6cx": "{0}, direka dan dibangunkan oleh pasukan LafTools",
    "rLXJN": "Dalam Kotlin, kelas 'android.util.Base64' terbina dalam Android boleh digunakan untuk pengekodan dan penyahkodan Base64. Contoh ini menganggap persekitaran Android; untuk projek Kotlin bukan Android, pertimbangkan untuk menggunakan 'java.util.Base64'.",
    "rQkas": "Selamat datang ke LafTools",
    "rR1vd": "Input Daripada Fail",
    "rT34qnO": "Masukkan teks untuk diproses. Hasilnya akan dipaparkan dalam editor output.",
    "rVqlu": "Nyahkod {0}",
    "rYSpwq": "Algoritma MD2 (Message-Digest 2) ialah fungsi cincang kriptografi yang dibangunkan oleh Ronald Rivest pada tahun 1989. Algoritma ini dioptimumkan untuk komputer 8-bit. Walaupun MD2 tidak lagi dianggap selamat, walaupun pada 2014, ia masih digunakan di khalayak ramai. infrastruktur utama sebagai sebahagian daripada sijil yang dihasilkan dengan MD2 dan RSA. Algoritma ringkasan mesej terdiri, secara lalai, sebanyak 18 pusingan.",
    "r_n6h": "Mod Terang atau Gelap",
    "rf0mql3": "Tema Terang atau Gelap",
    "rpG0G": "Kami menghargai maklum balas anda dan ingin mendengar pendapat anda tentang cara kami boleh menambah baik produk kami - jangan teragak-agak untuk berkongsi maklum balas anda dengan kami!",
    "rub76Z8zx": "Percubaan untuk mencetak bahasa gaya C yang cantik seperti C, C++, C#, Java, PHP, JavaScript dll. Ini tidak akan berfungsi dengan sempurna dan kod yang terhasil mungkin tidak berfungsi lagi. Operasi ini direka bentuk semata-mata untuk menjadikan kod yang dikelirukan atau diperkecilkan lebih mudah dibaca dan difahami. Perkara yang tidak akan berfungsi dengan betul: Untuk pemformatan gelung, pemformatan gelung Do-While, Lekukan Suis/Kes, Pengendali anjakan bit tertentu",
    "run_text": "Sebelum memasuki meja kerja anda, kami ingin pramuat sumber sistem yang diperlukan pada mulanya. Sila tunggu sebentar, ia akan disiapkan tidak lama lagi, yang butirannya boleh dilihat seperti di bawah.",
    "rycJy": "LafTools ialah kotak alat serba boleh yang direka khusus untuk pengaturcara. Ia mewakili versi kedua Kotak Alat CodeGen, kini dengan masa jalan yang lebih ringan ditulis dalam Golang dan JavaScript.",
    "ryhkqb": "bahasa Bulgaria",
    "s-fxP80Dd": "LafTools IDE",
    "s0vrf9": "bahasa Ibrani",
    "s1b3m": "Tidak seperti Base64 atau Base32, ia mengecualikan aksara '0', 'O', 'I' dan 'l' yang mudah dikelirukan, menjadikannya sesuai untuk URL dan kod QR.",
    "s3e6r": "Bagaimanakah saya boleh mengekod data menggunakan Base45?",
    "s4OeX": "Log masuk sistem berjaya",
    "s5b8m": "Gantikan 'TEST12345' dengan data anda sendiri dan laksanakan skrip ini dalam persekitaran PHP untuk melaksanakan operasi Base32.",
    "s5e8r": "Gantikan 'TEST12345' dengan data sebenar anda dan jalankan coretan ini dalam konteks aplikasi Swift untuk melaksanakan operasi Base32.",
    "s5t0n": "Padding dalam Base32 melibatkan penambahan aksara '=' untuk memastikan bahagian akhir data yang dikodkan masih mengandungi gandaan 8 bit. Walau bagaimanapun, tidak seperti Base64, padding Base32 adalah minimum kerana setiap aksara Base32 sudah mengekod 5 bit.",
    "s7e9r": "Tiada perpustakaan luaran diperlukan. Hanya gantikan 'b'TEST12345'' dengan objek seperti bait sebenar anda untuk mengekod/menyahkod.",
    "sBxHr": "Scala menggunakan kelas 'java.util.Base64' terbina dalam Java untuk operasi Base64. Pastikan anda menjalankan platform JVM dengan Java 8 atau lebih tinggi.",
    "sHoxxW": "Sejarah",
    "sKx5t": "Kelas 'java.util.Base64' terbina dalam Java, tersedia sejak Java 8, menyediakan kaedah untuk pengekodan dan penyahkodan Base64. Rentetan input ditukar kepada bait menggunakan pengekodan UTF-8, kemudian dikodkan dan dinyahkodkan mengikut keperluan.",
    "sO0MOe": "Setiap kali anda berada dalam tetingkap lebih daripada 5 saat, ia akan ditunjukkan di sini.",
    "sR8yc": "tutup",
    "sc49my": "Sindhi",
    "sdfk1": "Tatal tab ke kiri",
    "sdfk13": "Tatal tab ke kanan",
    "sglMS": "Cipta Masa",
    "sk123": "Belum selesai",
    "slqcWD": "Bahagian logik ini belum lagi disokong, sila tunggu.",
    "sojBI": "Penukaran",
    "spCqEa": "TODO",
    "spdh98": "Cina ringkas",
    "ssDaOq": "Baru menggunakan LafTools?",
    "ssm80i": "Basque",
    "svqh06": "Azerbaijan",
    "sys_updates": "Kemas Kini Sistem Terkini",
    "t63Qw": "Tolak",
    "t6wczq": "Xhosa",
    "t7m4g": "Peti 'base32' digunakan untuk pengekodan dan penyahkodan Base32 dalam Rust.",
    "t84q1z": "bahasa Armenia",
    "t8c6xc": "Somalia",
    "t8z1v": "Apabila tidak ada bit yang mencukupi pada penghujung untuk mengisi kumpulan 5-bit penuh, aksara padding '=' ditambah. Sebagai contoh, bait memerlukan dua aksara Base32, dan urutan 3-bait memerlukan empat aksara Base32.",
    "t9m3g": "CryptoSwift ialah pakej Swift popular yang merangkumi fungsi pengekodan dan penyahkodan Base32.",
    "tBIX-d": "Windows",
    "tEiv_": "Mendapatkan Butiran Sambungan",
    "tIy3Q": "Terhadap ralat",
    "tIyq3Q": "Terhadap ralat",
    "tR8pY": "Go menyediakan pakej perpustakaan standard 'pengekodan/base64' dengan fungsi untuk pengekodan dan penyahkodan Base64. Tiada kebergantungan luar diperlukan; hanya import pakej ini ke dalam program Go anda dan panggil fungsi yang sesuai.",
    "tWe1yF": "Tiada arahan shell tersedia.",
    "tY3p1": "Maklumat lanjut",
    "tiaiB": "Batal",
    "tn7duf": "bahasa Croatia",
    "trywithclassicalwebui": "Cuba dengan UI Web Klasik",
    "ttAre": "Masukkan kata laluan teks biasa anda di sini",
    "tuv23456": "Varian selamat URL Base64",
    "twamg": "AI Assistant, Memperkasa Kreativiti Anda",
    "tyhgpr": "bahasa jawa",
    "u1i2b": "Apakah kelebihan menggunakan Base85 berbanding Base64 atau Base32?",
    "u2l8s": "Apakah itu Base45?",
    "u3i8b": "Apakah kelebihan menggunakan Base62 berbanding Base64 atau Base32?",
    "u3j9p": "Base32 sering digunakan apabila anda memerlukan perwakilan teks padat data binari yang boleh ditaip atau dicetak tanpa kehilangan maklumat, seperti dalam semakan integriti fail, geocaching dan penjanaan kata laluan selamat.",
    "u7i9b": "Untuk Go, gunakan pakej 'base62' yang tersedia di GitHub.",
    "u7vwx8yz": "Operasi Common Base64",
    "u8i5b": "Apakah kelebihan menggunakan Base58 berbanding Base64 atau Base32?",
    "u9g6t": "Untuk JavaScript, anda perlu memasang pakej 'base85' untuk pengekodan dan penyahkodan Base85.",
    "uCEe8": "Penukaran Masa Nyata",
    "uFcDQ": "Memulakan data status...",
    "uV5Bi": "Tidak Dapat Memuatkan Sambungan",
    "uVseB": "Tekan {0} untuk menunjukkan senarai kunci panas",
    "uW7eZ": "Dalam C, tiada pelaksanaan Base64 asli. Contoh ini menggunakan perpustakaan OpenSSL untuk pengekodan dan penyahkodan Base64. Untuk menggunakan coretan kod ini, pasang OpenSSL pada sistem anda dan pautkan ke perpustakaan yang sesuai apabila menyusun atur cara anda menggunakan arahan yang serupa dengan 'gcc -o base64_example base64_example.c -lssl -lcrypto'.",
    "ucDLv": "Anda telah menyalin rekod ini selama {0} kali",
    "ui5pZ": "Penghurai Perintah",
    "ulah0q": "Jepun",
    "unc9E": "Teks Rawak",
    "usr_defined": "Keutamaan Sistem",
    "uvwxyza1": "Tiada Kehilangan Data: Memandangkan ia merupakan proses boleh balik, pengekodan Base64 tidak mengakibatkan kehilangan maklumat.",
    "uwqGE": "Pergi ke Alat",
    "v3k5r": "Set aksara merangkumi semua huruf besar dan huruf kecil (A-Z, a-z) dan digit (0-9), memberikan perwakilan yang lebih padat berbanding Base64 atau Base32.",
    "v4k6r": "Ia mengekod data ke dalam bentuk yang lebih padat berbanding Base64 atau Base32 dengan menggunakan set aksara yang lebih besar.",
    "v4n9t": "Base58 ialah skim pengekodan yang mewakili data binari sebagai jujukan aksara alfanumerik.",
    "v5k3r": "Setelah dipasang, gantikan pemegang tempat dalam bahagian penyahkod dengan rentetan berkod Base85 sebenar dan jalankan skrip. Perpustakaan mengendalikan penukaran antara rentetan Penampan dan Base85.",
    "v6qkl": "Pakej BouncyCastle NuGet menyediakan pengekodan dan penyahkodan Base32 dalam C#.",
    "v7q3db": "Thai",
    "v9b7t": "Gantikan 'TEST12345' dengan rentetan anda sendiri dan jalankan aplikasi konsol ini untuk melaksanakan operasi pengekodan dan penyahkodan Base32.",
    "vOjNC": "Masukkan kata laluan atau kunci selamat",
    "vTsQU": "Sila berikan kod jemputan daripada pentadbir anda",
    "vU17B": "Tidak dapat menghantar permintaan",
    "vWqac": "Sebelum memasuki meja kerja anda, kami ingin pramuat sumber sistem yang diperlukan pada mulanya. Sila tunggu sebentar, ia akan disiapkan tidak lama lagi, yang butirannya boleh dilihat seperti di bawah.",
    "vaP0vq": "Sediakan kata laluan setempat dengan jayanya.",
    "vci8rd": "Belanda",
    "vh9j4": "Input",
    "vo1prl": "bahasa Sepanyol",
    "vr93oi": "bahasa Finland",
    "vrfjnf": "Itali",
    "vwx1yza2": "Contohnya ialah pengekodan fail imej untuk membenamkannya dalam teg <img> HTML:",
    "w1ANqKoBf": "Sembunyikan Teks dalam Bar Sisi",
    "w1x4k": "Ya, beberapa varian wujud, termasuk Ascii85 (digunakan dalam PostScript dan PDF), Z85 (ZeroMQ) dan UUencode (format lama). Setiap satu mempunyai set watak dan peraturan yang sedikit berbeza.",
    "w2x9qk": "Walaupun Base62 sendiri tidak mempunyai variasi yang ketara, sesetengah pelaksanaan mungkin berbeza sedikit dalam pilihan set aksara mereka, seperti tidak termasuk '+' atau '/' yang biasa digunakan dalam Base64.",
    "w3x7k": "Ya, beberapa varian popular termasuk Base58Check, yang menambahkan checksum untuk pengesanan ralat, yang biasa digunakan dalam Bitcoin.",
    "w6otqn": "Korsika",
    "w92j07": "bahasa Rusia",
    "w9qudj": "Punjabi",
    "wAxtg": "Pada mulanya, kami menjana UUID sebagai token yang dibenarkan untuk anda melakukan persediaan ini. Daripada apa yang LafTools terima, token yang anda berikan ialah {0}, ia telah disahkan oleh LafTools dengan jayanya dan seterusnya anda boleh terus menyediakan borang ini.",
    "wI1eh": "Seterusnya",
    "wQYoz": "Fail",
    "wQdYoz": "Sunting",
    "wQdqwYoz": "Lihat",
    "wcl1K": "Penggunaan",
    "wgkk6y": "bahasa Malta",
    "wj3VS": "Operasi ini menyahkod data daripada rentetan ASCII {0} kembali ke dalam format mentahnya.",
    "wsWcXd": "Pemberitahuan",
    "wxyzabcd": "Terdapat versi Base64 yang selamat untuk URL yang menggantikan '+' dengan '-' dan '/' dengan '_', serta mengenepikan padding '=', menjadikannya sesuai untuk URL web.",
    "x009": "Untuk mengakses dokumentasi penggunaan kami",
    "x2c5e": "Python mempunyai modul 'base85' terbina dalam yang menyokong pengekodan dan penyahkodan Base85.",
    "x2z6r": "Apakah itu Base58?",
    "x5alzu": "Kurdish (Kurmanji)",
    "x5tHV": "Gambaran keseluruhan sistem",
    "x5z1b": "Base45 dibangunkan terutamanya untuk penggunaan kod QR dalam konteks sijil COVID digital.",
    "x6v2w": "Tiada perpustakaan Base32 standard dalam C, jadi kami menggunakan perpustakaan 'libbase32' hipotesis di sini.",
    "x7n1m": "Base62 ialah skema pengekodan yang mewakili data binari sebagai jujukan 62 aksara alfanumerik.",
    "x8mdg": "Modul 'base64' terbina dalam Python menyediakan pengekodan dan penyahkodan Base32 melalui fungsi 'b32encode' dan 'b32decode'.",
    "x9g7e": "Muat turun kod sumber daripada GitHub (https://github.com/dankamongmen/libbase32) atau pasangkannya sebagai pakej jika tersedia untuk platform anda.",
    "x9n1b": "Base85 ialah skema pengekodan yang mewakili data binari menggunakan set 85 aksara ASCII yang boleh dicetak.",
    "xMBv0": "Memuatkan sumber berkaitan...",
    "xOJqG1": "Soalan Lazim",
    "xPHqP": "Penerangan belum ditakrifkan.",
    "xQ_ls": "Sandaran Redis",
    "xbz0B": "Tutup Semua Tab",
    "xbz0B2": "Tutup Tab",
    "xdqwe": "Selamat datang untuk menggunakan LafTools!",
    "xeP4zV": "Lihat item TODO anda dengan cepat",
    "xeP4zVd": "Cepat cari perbendaharaan kata bahasa Inggeris.",
    "xlqtA": "Maklum balas",
    "xml-bdeautify.desc.2a5f9": "Kecilkan Kod XML",
    "xml-beautify.desc.2a5f9": "Operasi ini memformat data XML untuk meningkatkan kebolehbacaan dengan menambahkan lekukan yang betul, pemisah baris dan memastikan struktur yang terbentuk dengan baik.",
    "xs22XLF": "Tiada data tersedia untuk ID item ini, sila pertimbangkan untuk memilih item lain.",
    "y3b6n": "Ya, selagi rentetan yang dikodkan dijana mengikut spesifikasi Base45, mana-mana penyahkod yang mematuhi mesti boleh menyahkodnya.",
    "y3m7k": "Untuk Java, gunakan pustaka 'commons-codec' yang merangkumi sokongan untuk pengekodan dan penyahkodan Base85.",
    "y3m9k": "Mengapa Base62 dicipta?",
    "y3qjdd": "Kata laluan tempatan anda telah berjaya disahkan.",
    "y5nne": "Kod ini boleh dijalankan terus dalam persekitaran Node.js atau sebagai sebahagian daripada projek yang lebih besar di mana anda memerlukan fungsi Base32.",
    "y6m8k": "Mengapa Base85 dicipta?",
    "y6t1n": "Kelemahan Base32",
    "y8Ir5": "Bahagian ini digunakan untuk memulakan akaun pentadbir anda, namun, buat masa ini, tiada apa yang perlu dibuat atau dilaraskan di sini kerana ia telah disediakan sebelum ini oleh pentadbir anda, sila abaikan bahagian ini dan teruskan dengan langkah kekal anda.",
    "y8b1m": "Gantikan 'TEST12345' dengan data anda sendiri dan pastikan fungsi perpustakaan dilaksanakan dengan betul dan dipautkan untuk menyusun dan melaksanakan program ini untuk operasi Base32.",
    "y9m1n": "Mengapa Base58 dicipta?",
    "y9m3k": "Untuk Swift, anda boleh menggunakan perpustakaan 'Base45' yang tersedia di GitHub.",
    "y9z2e": "Gantikan 'TEST12345' dengan kepingan bait sebenar anda dan jalankan program Go ini untuk mengekod dan menyahkod menggunakan pengekodan standard Base32.",
    "y9z2t": "Jalankan skrip ini dalam persekitaran Ruby seperti IRB atau simpan sebagai fail .rb dan jalankan dengan 'ruby filename.rb'.",
    "yMZW-GEgf": "Format XML",
    "ySVf-": "Cuba semula Permintaan ini",
    "yTsqFO": "Algoritma MD4 (Message-Digest 4) ialah fungsi cincang kriptografi yang dibangunkan oleh Ronald Rivest pada tahun 1990. Panjang ringkasan ialah 128 bit. Algoritma telah mempengaruhi reka bentuk kemudian, seperti algoritma MD5, SHA-1 dan RIPEMD. Keselamatan MD4 telah terjejas teruk.",
    "yVprb": "Bahagian ini masih dalam pembangunan.",
    "y_2Q1": "Encode dan Decode",
    "y_2Q2": "Kripto simetri",
    "y_2Q3": "Kripto Asymmetric",
    "y_2Q4": "Algoritma Kebangsaan China",
    "y_2Q5": "Pengesahan Web",
    "y_2Q5dqw": "Pencocokan Teks",
    "y_9YM": "Output akan dipaparkan di sini.",
    "y_9YqM": "Memuatkan sumber statik...",
    "y_BN6": "Algoritma Digest",
    "ya0cwu": "Melayu",
    "yc7dqiu": "Cina ringkas",
    "yfYeg": "Templat Teks",
    "yiRso": "Nota Awan",
    "ykganl": "Danish",
    "yqiRso": "Nota Tempatan",
    "yqrxl4": "bahasa Serbia",
    "yt7kX2fPQ": "Terperangkap Pengecualian Yang Tidak Dijangka",
    "yznU9": "Data Pokok Kosong",
    "z-o28we": "Panel Proses",
    "z0j2nf": "Hindi",
    "z1m2t": "Contoh penggunaan: `const dikodkan = bs58.encode('data-anda'); const dinyahkod = bs58.dekod(dikodkan);`",
    "z1n5qr": "Contohnya termasuk pakej base45 npm untuk JavaScript dan dotnet-base45 untuk .NET.",
    "z1oFn": "Melarikan diri dan tidak melarikan diri",
    "z2jzej": "Marathi",
    "z2m7t": "Contoh penggunaan: `const base62 = require('base62'); const dikodkan = base62.encode('data-anda'); const dinyahkod = base62.decode(dikodkan);`",
    "z2t7m": "Apakah itu Base85?",
    "z2x8c": "Base32 mempunyai lebih sedikit kekaburan visual kerana ia hanya menggunakan huruf besar dan digit, menjadikannya lebih mudah untuk membaca dan menyalin dengan tangan atau melalui telefon berbanding Base64 yang merangkumi '+', '/' dan huruf kecil.",
    "z3m1t": "Selepas menambah kebergantungan dan menyegerakkan projek, salin templat yang disediakan ke dalam kelas Kotlin, menggantikan ruang letak dengan nilai yang dikodkan sebenar sebelum menjalankan kod.",
    "z4t9b": "Apakah itu Base62?",
    "z5b7m": "Ia menggunakan abjad yang lebih besar (0-9, A-Z, a-z, -, ., $, /, +, %, dan *) berbanding Base64 atau Base32, menghasilkan rentetan dikodkan yang lebih pendek untuk data input yang sama.",
    "z5bvb": "Pasangnya dengan menjalankan 'npm install base32-encoding'. Gantikan 'TEST12345' dengan data input yang anda inginkan dalam coretan kod.",
    "z5m6t": "Contoh penggunaan: `const base85 = require('base85'); const dikodkan = base85.encode('data-anda'); const dinyahkod = base85.decode(dikodkan);`",
    "z6m1c": "Variasi kemudian seperti z-base-32 telah diperkenalkan untuk meningkatkan kebolehgunaan, menggantikan beberapa aksara yang kurang diingati dengan yang lain, tetapi spesifikasi asal Crockford masih digunakan secara meluas hari ini.",
    "z79b1a": "bahasa arab",
    "z7n1m": "Pasangnya menggunakan npm dengan menjalankan `npm install base85` atau `yarn add base85`.",
    "z7t1p": "Adakah terdapat sebarang varian khusus Base62?",
    "z8em2t": "Selepas pemasangan, salin templat yang disediakan ke dalam aplikasi konsol C# dan gantikan pemegang tempat dengan nilai yang dikodkan sebenar sebelum menjalankan program.",
    "z8m2t": "Apakah kelebihan menggunakan Base45 berbanding Base64 atau Base32?",
    "z8n6k": "Gantikan 'TEST12345' dengan rentetan yang anda inginkan, susun dan jalankan program ini untuk melihat hasil pengekodan dan penyahkodan Base32.",
    "z8qm2t": "Perpustakaan menyediakan kelas pengekod dan penyahkod untuk operasi Base45. Salin kod templat ke dalam aplikasi konsol C# dan laksanakannya selepas memasang pakej.",
    "z8qqm2t": "Selepas pemasangan, salin templat yang disediakan ke dalam aplikasi konsol C# dan gantikan pemegang tempat dengan nilai yang dikodkan sebenar sebelum menjalankan program.",
    "z9b6n": "Tambahkan kebergantungan pada projek Xcode anda melalui Pengurus Pakej Swift ('https://github.com/krzyzanowskim/CryptoSwift').",
    "z9kVv": "Python mempunyai modul 'base64' terbina dalam yang menyediakan kaedah untuk pengekodan dan penyahkodan Base64. Rentetan input mula-mula ditukar kepada bait menggunakan pengekodan UTF-8 sebelum dikodkan kepada Base64, dan kemudian dinyahkod semula kepada bentuk asalnya.",
    "z9t2p": "Adakah terdapat sebarang varian khusus Base58?",
    "z9t7p": "Adakah terdapat sebarang varian khusus Base85?",
    "zN2ES": "Ruang kerja",
    "zaSKh": "Segarkan semula",
    "zc3Hf": "Kata laluan",
    "zjDJk": "Sila berikan laluan direktori ruang kerja",
    "zkqUFa": "{0} belum dikonfigurasikan",
    "zkv375": "bahasa Khmer",
    "zmDWx": "Hubungi Kami",
    "znVRwq": "Fail",
    "zpyd34": "Inggeris",
    "zqiIoqXw": "Menjalankan pengiraan...",
    "zwd4v": "Butiran Sambungan",
    "zwgYx": "Nilai kata laluan yang disulitkan akan dipaparkan di sini.",
    "zyx98765": "Bolehkah Base64 digunakan untuk pemampatan?",
    "zzcepr": "Cebuano"
}