{
    "": "Mesaj: {0}",
    "-8l11": "Kopyalandı",
    "-DqwwR": "Operasyon Tamamlandı.",
    "-GJ_72": "Seçilen {0} çalışma alanına geçildi",
    "-Jx4J": "Yerel Hesap",
    "-Rj3y": "Temalar",
    "-XZnW": "Geri",
    "-Yo129I": "Metin Araçları",
    "-nL_B5PoN": "{0}'ı sıkıştırır",
    "01do0y": "Kannadaca",
    "04SSf": "Parolanızı mı unuttunuz?",
    "07naT": "Hata: {0}",
    "07ui6": "Daha fazla bilgi",
    "0Ceqru": "Base64, insanlar tarafından rahatlıkla kullanılabilen ve bilgisayarlar tarafından işlenebilen sınırlı bir sembol kümesi kullanarak rastgele bayt verilerini kodlamaya yönelik bir gösterimdir.",
    "0MO3jj": "MD5 (Message-Digest 5) yaygın olarak kullanılan bir karma işlevidir. Çeşitli güvenlik uygulamalarında kullanılmıştır ve ayrıca dosyaların bütünlüğünü kontrol etmek için de yaygın olarak kullanılır. Ancak MD5 çarpışmaya dayanıklı değildir ve SSL/TLS sertifikaları veya bu özelliğe dayanan dijital imzalar gibi uygulamalar için uygun değildir.",
    "0PgZ_": "Tercüme",
    "0YKce": "İkili Kodlu Ondalık (BCD) dizeyi ondalık sayıya dönüştürür.",
    "0gvcN": "Genel bakış sayfasına hoş geldiniz, halen geliştirilme aşamasındadır.",
    "0pfdz7": "Özbekçe",
    "123e4567": "Base64 nedir?",
    "13pmE": "Bizi destekle",
    "1507oa": "Bengalce",
    "1JOFP": "Çalışma Alanımı Aç",
    "1NTgQ": "Çalışma Alanını Aç",
    "1Npez": "Lütfen yolu belirtin",
    "1Tuab": "Kopyalandı",
    "1X8x7": "Örnek",
    "1Xe82x7": "{0} Küçült",
    "1Xe8wx7": "Altıgen Dize",
    "1Xe8x7": "{0} Güzelleştir",
    "1Xe8x7qe": "BCD",
    "1YmJc": "Tercih ettiğiniz dil olarak seçeneklerden birini seçin:",
    "1a2b3c4d": "Base64'ü neden kullanmalısınız?",
    "1a3Sc": "Yüklemeyi İptal Et",
    "1bd": "İş akışı",
    "1e3e5n": "Hausa",
    "1h6jH": "Uyarı, çıktı, uzunluğu sıfır olan boş bir değerdir!",
    "1j62a": "Bunu başka zaman yap",
    "1jj0ri": "Japonca",
    "1k_44": "Bu işlem, bir ASCII Base64 dizesindeki verilerin kodunu çözerek ham formatına geri döndürür.",
    "1th2nw": "Sinhala",
    "1yIQu": "İşleminizi yeniden işlemeyi deneyebilir veya hatayı gidermek için aşağıdaki düğmeyi tıklayabilirsiniz.",
    "20nmcv": "Latince",
    "22XLF": "Henüz bitmedi",
    "23fgh456": "Base64'ün Tarihçesi",
    "24vLI": "Oluşturuldu",
    "27j7sy": "Şona",
    "2D9a6": "Parolanızı mı unuttunuz?",
    "2D9qdk6": "Yeterince Güvenli mi?",
    "2IF6A": "Görünüşe göre sahte depolama alanında bir sorunla karşılaşılıyor",
    "2JyFN": "Sonucu Panoya Kopyala",
    "2Ocbey": "Sürüm",
    "2RhAT": "Görünüşe göre sahte alma işleminde bir sorunla karşılaşılıyor",
    "2Ruh6": "Yeni Yerel Hesap Oluştur",
    "2S5ap": "Tam Ekran Modunu Değiştir",
    "2Y1mR": "Metni Temizle",
    "2bcde3fg": "Base64'ün dezavantajları",
    "2bqHk": "Dosyadan yükle",
    "2e4fb7": "İbo",
    "2giYv": "Test Şifresi: {0}",
    "2khdsv": "Peştuca",
    "2lehqwp": "Vietnam",
    "2lhcqwp": "Türkçe",
    "2lhqqwp": "Endonezya dili",
    "2lhqqwqp": "Malayca",
    "2lhqwwp": "Tay dili",
    "2qdin8": "Lütfen doğrulama kodunu giriniz",
    "2tib5m": "İsveççe",
    "2ybu7j": "Norveççe",
    "30eo2v": "Gujarati dili",
    "32D9a6": "Bir hesap oluşturun",
    "33RXi": "İstek, yetersiz parametreler nedeniyle reddedildi.",
    "346qid": "Rusça",
    "34wxyz56": "Base64'ü JavaScript'te nasıl kodlayabilirim/kodunu çözebilirim?",
    "39dsCt": "Varsa uygulama hizmetlerinden en son bildirimi alırsınız.",
    "3ii2tt": "İskoç Galcesi",
    "3umnB": "Bilinmeyen jeton",
    "441oja": "Gürcüce",
    "44Ntqw-": "Operasyonu yürütmek.",
    "46bksi": "Litvanyalı",
    "4K_vhq": "Bu sekmeyi çoğalt",
    "4PIqD": "Kod incelemesi",
    "4UYIJ": "Henüz tamamlanmadı.",
    "4cGA_": "Sistem tercihleri ​​için veriler alınıyor...",
    "4hijk5lm": "Boyut Artışı: Kodlanmış veriler, orijinal ikili verilerden yaklaşık %33 daha büyüktür.",
    "4kKe4": "Şifreniz",
    "4tqb4x": "Macarca",
    "4vdfwf": "TAMAM",
    "4wlih": "İstek, yetersiz parametreler nedeniyle reddedildi.",
    "52OiQ": "{0} kez kopyalandı",
    "54cwb": "Sistem Websocket API'si bir hatayla karşılaştı: {0}",
    "56ibcj": "Vietnam",
    "58HQX": "Değerini bilmiyorsanız, daha fazla ayrıntı için lütfen yöneticinizle iletişime geçin; bu bilgiyi onun ayarlarında bulabilirsiniz.",
    "5BOhl": "Davet Kodu",
    "5Ih2u": "Araçlar Gezgini",
    "5NCPT": "Karanlık Mod",
    "5NJeGsu1": "E-Posta ile gelen kutunuzu kolayca düzenleyebilir, mesaj oluşturup gönderebilir ve yazışmalarınızı takip edebilirsiniz. Şu ana kadar sadece kullanıcılar ve ekibimiz arasında bir iletişim aracı olarak kullanılmaktadır.",
    "5NJeddqGsu1": "Bu bölüm bilgisayar materyallerini, wiki makalelerini, kullanım kılavuzlarını ve daha fazlasını içerir.",
    "5NJedqddqGsu1": "Bu bölüm kendi projelerinizi oluşturmak için kullanılabilecek bilgisayar kaynaklarını içerir.",
    "5Perd": "Üzgünüz, 'Akıllı Düzenleyiciyi Kullan' işlevi henüz kullanılamıyor. Halen uygulamaya koymaya çalışıyoruz. Sabrınız için teşekkürler.",
    "5ZBYR": "Geri",
    "5dF7o": "Yenile",
    "5e6f7g8h": "Base64, ikili verilerin e-posta veya JSON gibi metin tabanlı protokoller aracılığıyla iletilmesi veya yalnızca metnin izin verildiği yerlere yerleştirilmesi gerektiğinde kullanılır.",
    "5eXVS": "Komut Dosyası İçeriği",
    "5ggegx": "Koreli",
    "5lW8qp": "Bu araç için bir örnek göster",
    "5q-Zxqa": "Komut Dosyası Yöneticisi",
    "5qPOJL": "LafTools'u desteklemek için GitHub'daki depomuza yıldız vermeyi veya aylık abonelik yoluyla profesyonel sürümümüze yükseltmeyi düşünün. Yardımınızdan büyük mutluluk duyacağız ve toplanan fonlarla LafTools'un daha da iyi olacağına söz veriyoruz.",
    "5qV5Sf": "Bu kaydı listeden kaldır",
    "5rg5mt": "Madagaskarca",
    "5srFq": "LafAraçlar",
    "5v8jl7": "Hmong",
    "6AumW": "Varsayılan aksiyon",
    "6ClPV": "Yaratmak",
    "6MrfIfGc6": "Kodu Küçült",
    "6UICxHzVR.name": "{0}'ı güzelleştir",
    "6cOPZ": "İkili Kodlu Ondalık (BCD), her ondalık basamağın genellikle dört veya sekiz olmak üzere sabit sayıda bit ile temsil edildiği, ondalık sayıların ikili kodlaması sınıfıdır. Bazen bir işaret için özel bit desenleri kullanılır",
    "6hsnqWe": "LafTools ücretsiz ve açık kaynak olmasına rağmen bakımı hala önemli miktarda zaman ve enerji gerektirir. Özellikle belirli bulut API'lerinin ödemesini yapmak için fona ihtiyacımız var. LafTools'u takdir ediyorsanız lütfen bizi desteklemeyi düşünün.",
    "6j13s3": "İzlandaca",
    "6nopqrst": "Şifreleme Yok: Base64 bir şifreleme yöntemi değildir; kodu kolayca çözülür ve hiçbir güvenlik sağlamaz.",
    "6qT9d-N": "Dizüstü bilgisayar için LafTools yalnızca kabuk komutları yöneticisi sağlamakla kalmıyor, aynı zamanda yakın gelecekte MarkDown, Latex, {0} vb. gibi güçlü not araçlarını da ekleyecek.",
    "6ulj8i": "Nepalce",
    "6wdtJ4vmg.name.0912": "{0}'ı küçült",
    "6yOXx": "Bilinmeyen isim",
    "71x7x": "GitHub'daki Kaynak Kodu",
    "78abcdef": "JavaScript, Base64 kodlama ve kod çözme için sırasıyla btoa() ve atob() gibi yerleşik işlevler sunar.",
    "78ijk9lm": "Base64 ilk olarak RFC 1421'de (1993) tanımlanmış ve daha sonra RFC 4648'de (2006) standartlaştırılmıştır.",
    "7MOO1": "Kayıt olmak",
    "7dm0d8": "Geleneksel çince",
    "7g5w22": "Norveççe",
    "7k56u3": "Galiçyaca",
    "7q40W": "Yönetici başlatılamıyor",
    "7u4vzu": "Slovak",
    "7x3f6": "Sekme - 1",
    "82r0C": "YAPILACAKLAR listenizi yönetin ve işlerinizi daha verimli bir şekilde halledin.",
    "83dNp": "Uzantı Kimliği Yüklenemiyor. (REF: 1dl1f)",
    "8LdRj": "Genel Bakış",
    "8LdRjq": "Hesapla",
    "8LdevRj": "Hizmet",
    "8M1wY": "Yerel Terminal",
    "8OqB7hN1s": "Bu sayfa, LafTools için daha yüksek düzeyde bir soyutlama olan LafTools için bir IDE UI stili sağlar.",
    "8eeL1Kk": "Hakkında",
    "8mn_qa": "Veriler terminal hizmetlerinden alınıyor...",
    "8qzWJu": "Üzgünüz, şu anda henüz küçük ekranlı cihazları desteklemiyoruz, lütfen bu sayfayı ziyaret etmek için PC'yi kullanın.",
    "97um9v": "Hawaii dili",
    "98KcL": "Ondalık sayıyı İkili Kodlu Ondalık Sayıya (BCD) dönüştürür.",
    "9Xv8-": "Not Olarak Kaydet",
    "9_qaj": "Bu Formdan Çık",
    "9e4fcl": "Tamilce",
    "9eZHM": "Hata! Görünüşe göre bazı uyarılar veya hatalarla karşılaşıyoruz.",
    "9gqo8x": "Letonca",
    "9i0j1k2l": "Ayrıca küçük resimleri doğrudan HTML veya CSS'ye veri URL'leri olarak gömmek için de kullanılır.",
    "9m85mf": "Sesotho",
    "9qy1xn": "Portekizce",
    "9tbbkt": "Fince",
    "9zCSc": "Kullanılabilir çalışma alanı yok",
    "A69UZ": "Değişkenler",
    "AVUvu": "Base62, insanlar tarafından rahatlıkla kullanılabilen ve bilgisayarlar tarafından işlenebilen sınırlı bir sembol kümesi kullanarak rastgele bayt verilerini kodlamaya yönelik bir gösterimdir. Yüksek sayı tabanı, ondalık veya onaltılık sisteme göre daha kısa dizelerle sonuçlanır.",
    "AW9N8": "Giriş Bölgesi",
    "AfPC0": "Düz metin şifreniz",
    "Ahrjc": "Dizin mevcut değil, oluşturmak istiyor musunuz?",
    "AkXgF": "Devam Ediyor: %{0}",
    "Apx8D": "Şifrenizi Manuel Olarak Nasıl Sıfırlayabilirsiniz?",
    "B-GCloBBt": "Genişletilebilir İşaretleme Dili (XML) kodunu sıkıştırır.",
    "B0s0z": "Bu sayfanın amacı:",
    "BCySSDEKL": "Mevcut yazılım sürümünüzle uyumluluk sorunu olabilir.",
    "BGd7P9": "Bu işlem ham verileri bir ASCII Base64 dizesine kodlar.",
    "BGd7dP9": "Bu işlem ham verileri bir ASCII {0} dizisine kodlar.",
    "BGdd7dP9": "Bu işlem ham verileri bir ASCII {0} dizisine kodlar.",
    "BLAKE2-021": "BLAKE2, yüksek güvenlik seviyelerini korurken SHA-2'ye kıyasla daha yüksek hızlar sağlayan başka bir modern alternatiftir. BLAKE2b ve BLAKE2s dahil olmak üzere birden fazla varyant sunar.",
    "BLAKE2_Info-023": "BLAKE2 Bilgisi",
    "BShq3M": "Sorunlar",
    "Bd9h-": "Favori koleksiyonuma ekle",
    "BuihG": "Sistem ayarları",
    "C3L9MmdDU7": "El Kitabı",
    "CASef": "Tamam, operasyon tetiklendi.",
    "CEv8B": "Bu kaydı kaldıracağınızdan emin misiniz? Cevabınız evet ise bu düğmeye tekrar tıklayın.",
    "CFg8B": "Boyut 0 ile 512 arasında olmalıdır",
    "CP-Advantage-Career-014": "Programlamayı öğrenmek, çeşitli sektörlerde kariyer fırsatlarının kapısını açar ve yenilikçi çözümler geliştirmenize, görevleri otomatikleştirmenize ve karmaşık sistemleri anlamanıza olanak tanır.",
    "CP-Advantages-013": "Bilgisayar programlamayı öğrenmenin avantajları nelerdir?",
    "CP-Basics-001": "Bilgisayar programlama nedir?",
    "CP-Def-002": "Bilgisayar programlama, bilgisayarlara belirli görevleri nasıl gerçekleştirecekleri konusunda talimat vermek için bir programlama dilinde talimatlar veya kod yazmayı içerir.",
    "CP-History-004": "Bilgisayar programlamanın tarihçesi nedir?",
    "CP-History-Origin-005": "İlk programlanabilir makinelerin tarihi, Ada Lovelace'in 19. yüzyılda Charles Babbage'nin Analitik Motoru üzerindeki çalışmasına kadar uzanıyor. Ancak modern programlama, 1940'larda ilk genel amaçlı elektronik bilgisayar olan ENIAC'ın icadıyla başladı.",
    "CP-Lang-Choice-009": "Dil seçimi proje gereksinimleri, topluluk desteği, öğrenme kolaylığı ve performans ihtiyaçları gibi faktörlere bağlıdır.",
    "CP-Language-Evolution-006": "O zamandan bu yana programlama dilleri, makine kodundan montaja, ardından FORTRAN, COBOL, C gibi üst düzey dillere ve şimdi de Python, JavaScript ve Rust gibi modern dillere dönüştü.",
    "CP-Languages-007": "Bazı popüler programlama dilleri nelerdir?",
    "CP-Languages-List-008": "Popüler programlama dilleri arasında Java, Python, JavaScript, C++, C#, Swift, Go, PHP, Ruby ve Kotlin bulunur. Her birinin kendine has güçlü yönleri ve kullanım durumları vardır; örneğin veri bilimi için Python, web geliştirme için JavaScript ve sistem programlama için C++.",
    "CP-Process-010": "Bilgisayar programlama süreci nedir?",
    "CP-Process-Explanation-011": "Programlama genellikle planlamayı (sorunu tanımlama ve çözümü tasarlama), kodlamayı (seçilen dilde kaynak kodu yazma), test etmeyi (hata ayıklama ve işlevselliği doğrulama) ve bakımı (programın zaman içinde güncellenmesi ve iyileştirilmesi) içerir.",
    "CP-Purpose-003": "Programcılar algoritmalar yaratır, sorunları çözer ve süreçleri otomatikleştirebilen, verileri değiştirebilen ve kullanıcılarla veya diğer sistemlerle etkileşime girebilen yazılım uygulamaları geliştirir.",
    "CP-SDLC-012": "Bu genellikle gereksinim analizi, tasarım, dağıtım ve kullanıcı kabul testi gibi ek aşamaları içeren bir Yazılım Geliştirme Yaşam Döngüsü (SDLC) içerisinde yapılandırılır.",
    "CP-Skillset-015": "Ayrıca mantıksal düşünmeyi, problem çözme becerilerini ve yeni teknolojilere uyum sağlama yeteneğini geliştirerek dijital çağda insanı daha çok yönlü hale getirir.",
    "CSS-Advantages-010": "CSS kullanmanın avantajları nelerdir?",
    "CSS-Advantages-Customization-012": "Diğer bir avantaj da birden fazla sayfanın görünümünü ve hissini aynı anda özelleştirebilme yeteneğidir; bu da site genelindeki stilleri güncellerken zamandan ve emekten tasarruf sağlar.",
    "CSS-Advantages-Separation-011": "Avantajlardan biri, web sitelerinin sürdürülebilirliğini ve ölçeklenebilirliğini artıran içerik ve sunum arasındaki kaygıların ayrılmasıdır.",
    "CSS-Animations-Transitions-019": "CSS Animasyonları ve Geçişleri, JavaScript gerektirmeden akıcı görsel efektler sağlar.",
    "CSS-Def-002": "CSS (Basamaklı Stil Sayfaları), HTML veya XML ile yazılmış bir belgenin sunumunu tanımlamak için kullanılan bir stil sayfası dilidir.",
    "CSS-Disadvantages-013": "CSS'nin bazı dezavantajları nelerdir?",
    "CSS-Disadvantages-Browser-Compat-015": "Farklı tarayıcılar CSS kurallarını farklı şekilde yorumlayabileceğinden diğer bir sorun da tarayıcılar arası uyumluluktur. Bu, geliştiricilerin tarayıcılar arasında tutarlı işleme için satıcı öneklerini veya özellik algılama tekniklerini kullanmasını gerektirir.",
    "CSS-Disadvantages-Cascade-014": "Zorluklardan biri, bazen beklenmedik kalıtım ve özgüllük sorunlarına yol açabilen stillerin basamaklı doğasını yönetmektir.",
    "CSS-Evolution-006": "O zamandan bu yana, CSS2 (1998), CSS2.1 (2007), CSS3 (devam eden geliştirme) yoluyla gelişti ve seçiciler, animasyonlar, duyarlı tasarım ve daha fazlası gibi özellikler eklendi.",
    "CSS-Future-020": "CSS teknolojisinin geleceği ne olacak?",
    "CSS-Future-Houdini-022": "Örneğin Houdini, tarayıcının oluşturma sürecini özelleştirmek için düşük seviyeli API'ler sunmayı amaçlıyor ve geliştiricilere stil ve düzen üzerinde benzeri görülmemiş bir kontrol sağlıyor.",
    "CSS-Future-Progress-021": "CSS Çalışma Grubu, CSS Değişkenleri (Özel Özellikler), Houdini ve Konteyner Sorguları gibi yeni modüller üzerinde çalışmaya devam ediyor.",
    "CSS-Hist-Origin-005": "CSS ilk olarak Ekim 1994'te Håkon Wium Lie tarafından önerildi ve Aralık 1996'da CSS1 ile resmi bir W3C Tavsiyesi haline geldi.",
    "CSS-History-004": "CSS'nin tarihçesi nedir?",
    "CSS-History-W3C": "W3C CSS Önerileri Zaman Çizelgesi",
    "CSS-Key-Features-016": "CSS'deki bazı temel özellikler nelerdir?",
    "CSS-Layouts-018": "Flexbox ve Grid düzen sistemleri, duyarlı ve esnek sayfa düzenleri oluşturmak için güçlü araçlar sağlar.",
    "CSS-MDN-Animations": "CSS Animasyonları için MDN Kılavuzu",
    "CSS-MDN-Flexbox": "Flexbox'a MDN Kılavuzu",
    "CSS-MDN-Grid": "CSS Izgarasına MDN Kılavuzu",
    "CSS-MDN-Houdini": "MDN Houdini'ye Giriş",
    "CSS-Purpose-003": "Geliştiricilerin içeriği sunumdan ayırmasına, düzen, renkler ve yazı tipleri gibi stilleri tanımlamasına, web sayfalarını farklı cihazlar ve ekranlar arasında görsel olarak çekici ve tutarlı hale getirmesine olanak tanır.",
    "CSS-Selectors-017": "Seçiciler, türlerine, sınıflarına, kimliklerine, niteliklerine ve daha fazlasına göre belirli HTML öğelerinin hedeflenmesine olanak tanır.",
    "CSS-Tech-History-001": "CSS nedir?",
    "CSS-Usage-007": "Web projelerimde CSS'yi nasıl kullanırım?",
    "CSS-Usage-Basics-008": "CSS'yi kullanmak için stillerinizi içeren ayrı bir dosya (örneğin, style.css) oluşturursunuz, ardından bunu <head> bölümündeki <link> öğesini kullanarak HTML dosyanıza bağlarsınız.",
    "CSS-Usage-Inline-009": "Alternatif olarak, 'style' özelliğini kullanarak satır içi stilleri doğrudan HTML öğelerine ekleyebilir veya CSS'yi <head> bölümünün içindeki <style> etiketine gömebilirsiniz.",
    "CSS-Vendor-Prefixes": "Satıcı Öneklerine İlişkin MDN Kılavuzu",
    "CSS-W3C-Selectors": "W3C Seçiciler Seviye 4 Spesifikasyonu",
    "CSS-WG-Future-Modules": "W3C CSS Mevcut Çalışması",
    "CSSNano": "cssnano - GitHub",
    "CVUl0": "LafAraçlar",
    "CfZAX": "Dosya {0} Seçildi, onu çekirdek hizmete yüklüyoruz.",
    "CidOqAZ": "LafTools'un yaratıcısı olarak bizi desteklemeye istekli olmanızdan çok etkilendim. Ekibimizde LafTools'u sürekli olarak geliştirmek için çok çalışan iyi insanlar var.",
    "Cide2w": "Eyleminizi gerçekleştirirken herhangi bir sorun olup olmadığını görmek için.",
    "DIQFq": "Lütfen URL parametresinin doğru şekilde sağlanıp sağlanmadığını kontrol edin; bu formu doldurma izniniz yok gibi görünüyor. Varsayılan olarak, hizmet yeni başlatıldığında çıktısında aşağıdaki mesajı görebileceksiniz.",
    "DIweGq": "LafTools'unuzu Güvenceye Alın",
    "DSEtLTxUU": "Zaman hayatınızın para birimidir, onu akıllıca harcayın.",
    "DTTPW": "Durumu sıfırla",
    "DVoKw": "Bu Sistemden Çıkış Yapın",
    "DadYp": "Gerçek Zamanlı Geri Dönme",
    "Diff-XML-JSON-Article": "XML ve JSON Arasındaki Fark",
    "DqFI5": "Düzeyler 0'dan büyük olmalıdır",
    "DrXAq": "LafTools'u kullanmaya hoş geldiniz!",
    "DrbEr": "Girdiğiniz şifre boş, lütfen kontrol edip tekrar deneyin.",
    "DtlAc": "Sistem Kaynakları Yükleniyor",
    "Dxlw0": "Tamamlamak",
    "E62ej": "Kabuk Komutlarını Filtrele",
    "E6F9B": "İş akışına ekleyin",
    "EEQkeW": "MD6 (Message-Digest 6) algoritması bir kriptografik karma işlevidir. Çok uzun girdiler için karmaların muazzam paralel hesaplanmasına izin vermek için Merkle ağacı benzeri bir yapı kullanır.",
    "EO6Qv5dCA": "JSON kodunu küçültür, JSON kodunuzun paket boyutunu azaltır.",
    "ERK7E": "LafTools'u kullanırken herhangi bir sorunla karşılaşırsanız veya herhangi bir öneriniz varsa, lütfen istediğiniz zaman EMail veya GitHub aracılığıyla bizimle iletişime geçmekten çekinmeyin; bunu acilen geliştirmeye hazırız.",
    "EgBXL": "Etiketleri seçin veya sağlayın.",
    "Ewvgo": "Henüz başlamadı.",
    "ExqvX": "Kısayol Tuşları Listesi",
    "Eyq856": "Henüz işimiz bitmedi; kendimizi en yeni ve en iyi özellikleri sunmaya adadık ve mümkün olan en iyi deneyimi yaşamanızı sağlamak için güncellemeler yayınlamaya devam edeceğiz.",
    "F-OUm": "LafTools için Hızlı Kurulum",
    "F0CCF": "Kısayol Tuşları Listesi",
    "F4uS2": "Yeni dosya",
    "FBVyc": "Lütfen doğrulama kodunu tekrar girin",
    "FDlRI": "Bu yeni sekmeye bir ad verin ve onaylamak için tıklayın.",
    "FLsbFsOZq": "IDE",
    "FOyHW": "Her Yerde Ara",
    "FQzhg": "Boş Girişi Yoksay",
    "FYRoL": "Basamaklı Stil Sayfaları (CSS) kodunu girintiler ve güzelleştirir.",
    "FhVWl": "Şifrenizi Şifreleyin",
    "FjYbR": "Çıktı",
    "Fv-zz": "Sonucu Kopyala",
    "Fy217": "Bu Aracı Yapılandır",
    "Fzp3t": "Lütfen bu alana değer girin",
    "G3MJN": "Çıktı Panelini Göster",
    "G9QVo": "Sekmeleri Yönet",
    "GR7jK": "Tip",
    "Ggob_": "İptal etmek",
    "H-Ae75": "Lütfen yerel şifrenizi doğrulayın.",
    "H-qA75": "Lütfen yerel şifreyi girin.",
    "H8fQ4": "Açık veya Koyu Moda Geç",
    "HEAhr": "Çeviriden sonra sonuç burada görünecektir.",
    "HIc3c": "Tamamlanmış",
    "HNDat": "Değişiklik yapmak için lütfen \"{0}\" düğmesini tıklayın. Aksi takdirde değişikliklerinizi uygulamak için \"{1}\" düğmesini tıklayın. Bu araç kutusuyla iyi vakit geçirmenizi dilerim!",
    "HTMLMinifier": "HTMLMinifier - GitHub",
    "HistOfProg-Wikipedia": "Programlama Dilleri Tarihi - Vikipedi",
    "HjvV3": "Diskteki dosyalarını silmeyeceğiz, sadece bu kaydı listeden kaldıracağız.",
    "HyIC_": "Eğik Çizgi Tuşu (/)",
    "HyIC_d": "Eğik Çizgi Tuşu (/)",
    "I8FLi": "Şimdi yöneticinizi ayarlamanın zamanı geldi; lütfen şifreyi olabildiğince karmaşık ayarlayın, böylece bu kaba saldırganların kafasını karıştırabilirsiniz.",
    "IAC0A": "Arama araçları",
    "ICefi": "İptal edildi",
    "IKqqATS": "Geçerli Sayfa Verilerini Yenile",
    "IWUH5": "Örneği Göster",
    "IaSyO": "İptal etmek",
    "IfsdGO": "Favoriler",
    "ImUmf": "Yeni",
    "IxAJswoSh": "Geçerli JavaScript kodunu ayrıştırır ve güzel bir şekilde yazdırır. Ayrıca JavaScript Nesne Gösterimi (JSON) ile de çalışır.",
    "J-3KA": "Lütfen bu komut dosyası için daha yararlı olabilecek bir ad girin.",
    "J164i": "Örneğin. Dosyaları uzak sunucuya kopyalayın",
    "J2xoL": "Lütfen şu hataya bakın: {0}",
    "JA_Bp": "Lütfen ilk önce yeni etiket için bir ad girin.",
    "JQEVK": "Kod",
    "JQLmS": "Boyutu ayarlandı",
    "JQLmSq": "Tamamlanmış.",
    "JS-Basics-001": "JavaScript nedir?",
    "JS-DOM-API-007": "JavaScript DOM ile nasıl etkileşime giriyor?",
    "JS-DOM-API-Explanation-008": "JavaScript, HTML ve CSS'yi yönetmek için bir Belge Nesne Modeli (DOM) API'si sağlayarak geliştiricilerin içeriği, stili ve olay dinleyicilerini dinamik olarak değiştirmesine olanak tanır.",
    "JS-DOM-Example-009": "Örneğin, bir öğe seçip metin içeriğini değiştirebilirsiniz: `document.getElementById('myElement').textContent = 'Yeni Metin';`",
    "JS-Data-Types-010": "JavaScript'teki veri türleri nelerdir?",
    "JS-Data-Types-List-011": "JavaScript, dize, sayı, boolean, null, tanımsız ve sembol gibi ilkel veri türlerinin yanı sıra nesne ve dizi gibi karmaşık türler de dahil olmak üzere çeşitli veri türlerini destekler.",
    "JS-Def-002": "JavaScript (JS), Node.js ile web uygulamaları oluşturmak, kullanıcı arayüzlerini geliştirmek ve sunucu tarafı mantığı oluşturmak için yaygın olarak kullanılan, üst düzey, yorumlanmış bir programlama dilidir.",
    "JS-Event-Loop-013": "JavaScript'teki olay döngüsü nedir?",
    "JS-Event-Loop-Explanation-014": "Olay döngüsü, JavaScript'in eşzamanlılık modelinin temel bir parçasıdır; geri aramalar, vaatler ve eşzamansız/bekleme yoluyla eşzamansız yürütmeye olanak tanır.",
    "JS-Event-Loop-Process-015": "Önce ana betiği çalıştırır, ardından ilgili olaylar (kullanıcı girişi veya ağ yanıtları gibi) meydana geldiğinde geri çağırma işlevlerini yürütür ve bunları bir kuyruk sistemi aracılığıyla yönetir.",
    "JS-Function-Syntax-006": "Fonksiyonlar, 'function' anahtar sözcüğü ve ardından parantez içine alınmış fonksiyon adı ve parametreler kullanılarak tanımlanır. İşlev gövdesi küme parantezleri içine alınmıştır: `function greet(name) { console.log(`Merhaba, ${name}!`); }'",
    "JS-Purpose-003": "İlk olarak 1995 yılında Netscape'ten Brendan Eich tarafından geliştirildi ve o zamandan beri Electron ve React Native gibi tüm önemli web tarayıcıları ve platformları tarafından desteklenen en popüler dillerden biri haline geldi.",
    "JS-Syntax-004": "JavaScript'in temel sözdizimi nedir?",
    "JS-Type-Checking-012": "Tür kontrolü, yapıcılar (`typeof value === 'string'`) veya yerleşik yapıcılardan miras alınan nesneler için `instanceof` operatörü (örneğin, `value Instanceof Array`) kullanılarak yapılabilir.",
    "JSON-Advantages-011": "JSON genellikle XML'den daha küçük ve ayrıştırılması daha hızlıdır; bu da onu bant genişliği ve hızın çok önemli olduğu istemci-sunucu iletişimi için ideal kılar.",
    "JSON-Basics-001": "JSON nedir?",
    "JSON-Beautify-007": "JSON Güzelleştirme nedir?",
    "JSON-Beautify-Def-008": "JSON güzelleştirme, JSON verilerinin uygun girintiler ve satır sonları ile insanlar tarafından daha okunabilir bir biçimde biçimlendirilmesi sürecini ifade eder, bu da analiz etmeyi ve hata ayıklamayı kolaylaştırır.",
    "JSON-Beautify-Example-009": "Önce: '{\\\"anahtar\\\":\\\"değer\\\",\\\"dizi\\\":[1,2,3]}', Sonra: '{\\n \\\"anahtar\\\": \\\"değer\\\", \\n \\\"dizi\\\": [\\n 1,\\n 2,\\n 3\\n ]\\n}'",
    "JSON-Def-002": "JSON (JavaScript Object Notation), insanların okuması ve yazması, makinelerin ise ayrıştırması ve oluşturması kolay, hafif, metin tabanlı bir veri değişim formatıdır.",
    "JSON-JavaScript-Support-020": "JSON, \"JSON.parse()\" ve \"JSON.stringify()\" global nesneleri aracılığıyla yerel olarak JavaScript tarafından desteklenir. Geçerli herhangi bir JSON aynı zamanda geçerli bir JavaScript değişmez nesnesi veya dizisidir ve bu, iki biçim arasında kesintisiz dönüşüme olanak tanır.",
    "JSON-JavaScript-Usage-021": "Web geliştirmede JSON, AJAX istekleri, sunucu tarafı oluşturma ve veri depolama (ör. yerel depolama veya IndexedDB) için yaygın olarak kullanılır.",
    "JSON-Linting-022": "JSON linting nedir ve neden önemlidir?",
    "JSON-Linting-Benefit-024": "Linter, geçersiz JSON nedeniyle çalışma zamanı hatalarını önleyebilir, sorunsuz veri alışverişi sağlar ve olası sorunların hata ayıklamasında zamandan tasarruf sağlar.",
    "JSON-Linting-Explanation-023": "JSON linting, bir JSON belgesinin JSON spesifikasyonuna uyup uymadığını kontrol etme işlemidir. Verileri ayrıştırmaya çalışmadan önce sözdizimi hatalarının belirlenmesine yardımcı olur.",
    "JSON-Path-013": "JSON Yolu Nedir?",
    "JSON-Path-Example-015": "$.store.book[0].title, kitaplar dizisini içeren bir mağazaya sahip bir JSON nesnesindeki ilk kitabın başlığını seçer.",
    "JSON-Path-Explanation-014": "JSON Path, XML için XPath'a benzer bir sorgu dilidir ve yol benzeri bir gösterim kullanarak JSON belgelerinden veri çıkarmanıza olanak tanır.",
    "JSON-Path-Guide": "JSONPath - JSON için XPath",
    "JSON-Purpose-003": "Öncelikle, XML'e alternatif olarak bir sunucu ile web uygulaması arasında veri aktarımı yapmak için kullanılır ve JavaScript'te \"JSON.parse()\" ve \"JSON.stringify()\" yöntemleri aracılığıyla yerel destek sağlar.",
    "JSON-Scope-in-JavaScript-019": "JSON, JavaScript'e nasıl uyar?",
    "JSON-Security-025": "JSON ile çalışırken bazı güvenlik endişeleri nelerdir?",
    "JSON-Security-Impact-026": "Potansiyel güvenlik riskleri arasında, ayrıştırılırken/yürütülürken istenmeyen davranışlara neden olabilecek kötü amaçlı verilerin gönderildiği JSON enjeksiyon saldırıları yer alır.",
    "JSON-Security-Prevention-027": "Bu riskleri azaltmak için her zaman kullanıcı girişini temizleyin ve JSON içeriğini yürütmeden güvenli bir şekilde ayrıştıran kitaplıkları kullanın (JavaScript'in yerleşik JSON.parse() işlevi gibi). Ayrıca JSON'u ayrıştırmak için eval() işlevini kullanmaktan kaçının.",
    "JSON-Serialization-016": "JSON serileştirme ve seri durumdan çıkarma nedir?",
    "JSON-Serialization-Def-017": "JSON serileştirme, bir JavaScript nesnesini bir JSON dizesine dönüştürme işlemidir; seri durumdan çıkarma ise bunun tersidir; JSON dizesini tekrar bir JavaScript nesnesine dönüştürür.",
    "JSON-Serialization-W3Schools": "W3Schools'ta JSON Serileştirmesi",
    "JSON-Syntax-004": "JSON'un temel sözdizimi nedir?",
    "JSON-Syntax-Example-f005": "Bir JSON nesnesi, küme parantezleri {0} içine alınmış anahtar/değer çiftlerinden oluşur. Her anahtar, çift tırnak içine alınmış bir dize, ardından iki nokta üst üste ve ardından değeri olmalıdır.",
    "JSON-Syntax-Reference": "JSON'da MDN Web Dokümanları",
    "JSON-Value-Types-006": "Değerler dizeler, sayılar, boolean'lar, diziler (köşeli parantez [] içine alınmış), diğer nesneler veya null olabilir.",
    "JSON-vs-XML-010": "JSON XML'le nasıl karşılaştırılır?",
    "JSON-vs-XML-Article": "JSON ve XML'i karşılaştırma",
    "JYqxz2": "LafTools'a hoş geldiniz, bu içeriden öğrenilen bir sürümdür.",
    "JdqiUE8": "Bu işlem, bir ASCII dizesindeki verileri (seçtiğiniz bir alfabeyle, ön ayarlar dahil) ham biçimine geri çözer.",
    "JdqidUE8": "Bu işlem, bir ASCII dizesindeki verileri (seçtiğiniz bir alfabeyle, ön ayarlar dahil) ham biçimine geri çözer.",
    "JiUE8": "Bu işlem, bir ASCII {0} dizesindeki verilerin kodunu çözerek ham biçimine geri döndürür.",
    "K1qJZI": "LafTools'a hoş geldiniz Ekselansları.",
    "KIc63": "İşlev henüz desteklenmiyor",
    "KYh1N": "Tüm Notlar",
    "KcqrRr": "Referans",
    "KcrRr": "Kod Uygulama Verilerini Alma",
    "KmEUF": "Mevcut sistem araçlarına hızlı bir genel bakış sağlayın.",
    "Kw4OJr": "terminal",
    "Kyd9H": "GitHub'daki Kaynak Kodu",
    "L-p-Y": "Geçerli kabuk komutunun içeriğini panoya kopyalayın",
    "L3zEM": "Örneği Göster",
    "L42mxa": "Lütfen kaynak metninizi bu alana girin.",
    "L49kCq": "LafTools'unuzu güvence altına almak için lütfen bu formda kilit şifresini sağlayın ve onaylayın.",
    "L71q_N": "Girdiğiniz şifre boş, lütfen kontrol edip tekrar deneyin.",
    "L9bQku": "{0} kodunu çöz",
    "L9qbQku": "{0} kodunu çöz",
    "LAc1m": "Uygulama görünümü yenilendi.",
    "LFdvM": "Giriş yapmadınız",
    "LM715": "Yerel sunucu API'sinden i18n yapılandırmasını alma",
    "LNvUuKmHR": "Uygulamada temel bağımlılıklar veya kitaplıklar eksik.",
    "LPJrV": "Sonucu Kopyala",
    "LSohY6eZW": "Hex String, boşluk, virgül, noktalı virgül veya iki nokta üst üste olabilen bir sınırlayıcıyla ayrılmış onaltılık baytlardan oluşan bir dizedir.",
    "LU9Jj": "Base85 (Ascii85 olarak da bilinir), rastgele bayt verilerini kodlamak için kullanılan bir gösterimdir. Base64'ün kullanılması genellikle daha verimlidir. Bu işlem, bir ASCII dizesindeki verilerin kodunu çözer (seçtiğiniz bir alfabeyle, ön ayarlar dahil). Base85, Adobe'nin PostScript ve PDF dosya formatlarında yaygın olarak kullanılır.",
    "LWaeFqd": "Tercih ettiğiniz dile geçin",
    "Le71_N-": "Girdiğiniz şifre onaylanan şifreyle aynı değil, lütfen kontrol edip tekrar deneyin.",
    "LnJ4H": "Yerel hesabın web sitemizdeki kayıtlı kullanıcıyla tamamen aynı olmadığını, ilkinin yalnızca PC'nizde tanımlandığını, ikincisinin ise bulut senkronizasyonu için kullanılabileceğini unutmayın.",
    "LqWaFd": "Sistem ayarları",
    "LxaEFHbfa": "SQL kodunu küçültür, SQL kodunuzun paket boyutunu azaltır.",
    "M3qytc": "{0}'ı kodlayın",
    "M3ytc": "{0}'ı kodlayın",
    "M4ywN1": "Hesap Makinesi, Takvim, Saat, Hava Durumu ve daha fazlası.",
    "M6MrW": "İyi",
    "M7jct": "Tam Ekran Moduna Girin",
    "MD2-Advantages-011": "MD2 kullanmanın avantajları nelerdir?",
    "MD2-AlgorithmDetails-010": "MD2 Algoritması Ayrıntıları",
    "MD2-Applications-018": "Hangi uygulamalar MD2'yi kullandı veya hala kullanıyor?",
    "MD2-Breakdown-016": "Zamanla MD2'de kriptografik zayıflıklar keşfedildi ve artık güvenli karma gerektiren tüm uygulamalar için SHA-256 ve SHA-3 gibi daha güçlü alternatifler öneriliyor.",
    "MD2-CollisionSecurity-015": "MD2'nin modern kriptografik saldırılara karşı zayıf olduğu düşünülmektedir. Hash boyutunun (128 bit) günümüz standartlarına göre küçük olması onu çarpışma saldırılarına karşı savunmasız hale getiriyor.",
    "MD2-Def-002": "MD2 (Message-Digest Algorithm 2), 1989 yılında Ronald Rivest tarafından tasarlanan bir kriptografik karma işlevidir. Verilen herhangi bir giriş mesajı için 128 bitlik bir karma değeri üretir.",
    "MD2-DigitalSignature-Risks-021": "Dijital İmzalar için MD2 Kullanmanın Riskleri",
    "MD2-Disadvantages-014": "MD2'nin dezavantajları ve güvenlik kaygıları nelerdir?",
    "MD2-FAQ-001": "MD2 nedir?",
    "MD2-HistoricalUse-020": "Tarihsel olarak MD2, dosya bütünlüğü kontrollerinde ve yazılım güncellemelerinde kullanım alanı bulmuştur, ancak bu uygulamalar büyük ölçüde SHA-256 ve SHA-512 gibi daha güvenli karma işlevlerine geçiş yapmıştır.)",
    "MD2-History-004": "MD2 nasıl geliştirildi ve tarihçesi nedir?",
    "MD2-Implementation-013": "Çeşitli platformlarda ve dillerde geniş çapta uygulanmış ve standartlaştırılmıştır; bu, MD2'nin mevcut sistemlere entegre edilmesinin nispeten basit olabileceği anlamına gelir.",
    "MD2-InsecurityExamples-017": "MD2 Güvenlik Arızası Örnekleri",
    "MD2-Operation-007": "MD2 işlemi nasıl çalışır?",
    "MD2-Origin-005": "MD2 başlangıçta MD1'e göre bir iyileştirme olarak oluşturuldu ve önceki algoritmada bulunan bazı zayıflıkları giderdi. O dönemde göreceli basitliği ve hızı nedeniyle popülerlik kazandı.",
    "MD2-PKI-019": "MD2, bir zamanlar dijital imzalar için Açık Anahtar Altyapısında (PKI) kullanılmıştı ancak saldırılara karşı savunmasızlığı nedeniyle o zamandan beri kullanımdan kaldırıldı. MD2 ile imzalanan sertifikalara artık çoğu sistem güvenmiyor.",
    "MD2-Process-008": "MD2, giriş mesajını 16 baytın katlarına kadar doldurarak çalışır ve ardından onu bir dizi özel VEYA işlemi, bit döndürme ve ekleme yoluyla işler. Nihai çıktı 128 bitlik bir karma değeridir.",
    "MD2-Purpose-003": "MD2'nin amacı, verilerin orijinalliğini ve gerçekliğini doğrulamak için kullanılabilecek benzersiz bir dijital parmak izi oluşturarak veri bütünlüğünü sağlamaktır.",
    "MD2-Rounds-009": "Algoritma, 128 bitlik bir durum değişkeni üzerinde gerçekleştirilen belirli işlemlerle dört turlu bir işlem kullanır. Her tur, doldurulmuş mesajın bloklarını alır ve mesajın tamamı işlenene kadar durumu günceller.",
    "MD2-Speed-012": "MD2, zamanına göre hızlı kabul ediliyordu ve bazı senaryolarda hala kabul edilebilir bir performansa sahip, bu da onu hesaplama kaynaklarının sınırlı olduğu ortamlar için uygun kılıyor.",
    "MD2-Successors-006": "Bununla birlikte, aynı karma işlevleri ailesinin bir parçası olan ancak gelişmiş güvenlik özellikleri sunan MD5 ve SHA-1 gibi daha güçlü algoritmalar onun yerini almıştır.",
    "MD4-Advantages-011": "MD4 kullanmanın avantajları nelerdir?",
    "MD4-AlgorithmDetails-010": "MD4 Algoritmasının Detayları",
    "MD4-Applications-018": "Hangi uygulamalar MD4'ü kullandı veya hala kullanıyor?",
    "MD4-Breakdown-016": "Algoritmanın tasarım kusurları, kolay karma çarpışmalara ve hatta kısmi ön görüntü saldırılarına izin veren pratik saldırılara yol açarak MD4'ü günümüzün herhangi bir güvenli kriptografik kullanım durumu için uygunsuz hale getirdi.",
    "MD4-CollisionSecurity-015": "MD4'ün çarpışma saldırılarına yatkınlık da dahil olmak üzere çeşitli kriptografik zayıflıkları vardır. Bu, iki farklı girişin aynı karma çıktıyı üretebileceği anlamına gelir; bu da çarpışma direnci veya güçlü mesaj bütünlüğü gerektiren uygulamalar için onu güvensiz hale getirir.",
    "MD4-Def-002": "MD4 (Message-Digest Algorithm 4), 1990 yılında Ronald Rivest tarafından tasarlanan bir kriptografik karma işlevidir. Verilen herhangi bir giriş mesajı için 128 bitlik bir karma değeri üretir.",
    "MD4-DigitalSignature-Risks-021": "Dijital İmzalar için MD4 Kullanmanın Riskleri",
    "MD4-Disadvantages-014": "MD4'ün dezavantajları ve güvenlik kaygıları nelerdir?",
    "MD4-FAQ-001": "MD4 nedir?",
    "MD4-HistoricalUse-019": "Tarihsel olarak MD4, dijital imzalarda, dosya bütünlüğü kontrollerinde ve yazılım güncellemelerinde kullanıldı. Ancak güvenlik açıkları nedeniyle bu uygulamalar büyük ölçüde SHA-256 ve SHA-3 gibi daha güvenli alternatiflere geçiş yaptı.",
    "MD4-History-004": "MD4 nasıl geliştirildi ve tarihsel önemi nedir?",
    "MD4-Implementation-013": "Çeşitli platformlarda ve dillerde geniş çapta uygulanmış ve standartlaştırılmıştır; mevcut sistemlere entegrasyon kolaylığı sağlar, ancak modern bağlamlardaki güvenlik kaygıları bu avantaja ağır basmaktadır.",
    "MD4-InsecurityExamples-017": "MD4 Güvenlik Arızası Örnekleri",
    "MD4-LegacySystems-020": "MD4 eski sistemlerde hala mevcut olabilir ancak güvenliğin önemli olduğu tüm bağlamlarda kullanımı önerilmez. Modern standartlar artık herhangi bir şifreleme amacıyla MD4'ü önermemektedir.",
    "MD4-Operation-007": "MD4 operasyonu nasıl çalışır?",
    "MD4-Origin-005": "MD4, güvenlik özelliklerini korurken daha hızlı performans sağlamayı amaçlayan MD2 ve MD3'ün gelişmiş haliydi. Ancak MD4'ün birçok güvenlik zaafına sahip olduğu ortaya çıktı.",
    "MD4-Process-008": "MD4, giriş mesajını 512 bitin katlarına doldurarak ve 16 kelimelik bloklara bölerek işler. Algoritma daha sonra bit düzeyinde işlemleri, modüler eklemeleri ve doğrusal olmayan işlevleri içeren dört işlem turu kullanarak bu bloklar üzerinde çalışır.",
    "MD4-Purpose-003": "MD4'ün amacı, orijinal verilerin gerçekliğini ve bütünlüğünü doğrulamak için kullanılabilecek sabit boyutlu bir dijital parmak izi oluşturarak veri bütünlüğünü sağlamaktır.",
    "MD4-Rounds-009": "Tüm bloklar işlendikten sonra ortaya çıkan dahili durum, son 128 bitlik karma değerine dönüştürülür.",
    "MD4-Speed-012": "MD4 başlangıçta öncüllerinden daha hızlı olacak şekilde tasarlandı ve bu da onu piyasaya sürüldüğü sırada hızlı karma gerektiren uygulamalar için popüler hale getirdi.",
    "MD4-Successors-006": "MD4, kusurlarına rağmen, MD5 ve SHA-1 gibi sonraki hash fonksiyonlarının temelini attı; bu, tasarımını geliştirdi ancak aynı zamanda zaman içinde bazı güvenlik açıklarını da devraldı.",
    "MD5-Advantages-012": "MD5 kullanmanın avantajları nelerdir?",
    "MD5-AlgorithmDetails-011": "MD5 Algoritmasının Detayları",
    "MD5-Alternatives-019": "Güvenli karma için MD5'e bazı alternatifler nelerdir?",
    "MD5-Applications-024": "Başka hangi uygulamalar MD5 kullanıyor veya kullanmış?",
    "MD5-Breakdown-017": "Zamanla MD5'te çeşitli kriptografik zayıflıklar keşfedildi ve araştırmacılar, bütünlüğünden ve güvenliğinden daha fazla ödün vererek çarpışma yaratmanın pratik örneklerini gösterdiler.",
    "MD5-Collision-016": "MD5 çarpışma saldırılarına karşı savunmasızdır; bu, iki farklı girişin aynı karma çıktıyı üretebileceği anlamına gelir. Bu, dijital imzalar veya parola saklama gibi uygulamalar için onu güvensiz hale getirir.",
    "MD5-CollisionExample-007": "MD5 Çarpışma Örneği",
    "MD5-DataIntegrity-026": "Ayrıca, dosya senkronizasyonu için rsync kullanıldığında veya büyük veri kümelerinin sağlama toplamı yapılırken olduğu gibi, iletim ve depolama sırasında verilerin bütünlüğünü doğrulamak için de yaygın olarak kullanıldı.",
    "MD5-Def-002": "MD5 (Message-Digest Algorithm 5), bir giriş mesajı alan ve sabit boyutlu 128 bitlik bir karma değeri üreten, yaygın olarak kullanılan bir kriptografik karma işlevidir.",
    "MD5-DigitalSignature-Risks-027": "Dijital İmzalar için MD5 Kullanmanın Riskleri",
    "MD5-Disadvantages-015": "MD5'in dezavantajları ve güvenlik kaygıları nelerdir?",
    "MD5-FAQ-001": "MD5 nedir?",
    "MD5-FileChecksum-005": "MD5 genellikle yazılım veya büyük dosyalar indirilirken dosya bütünlüğünü doğrulamak için kullanılır. İndirilen dosyanın tahrif edilmediğinden emin olmak için kaynak tarafından sağlananla karşılaştırılabilecek bir sağlama toplamı oluşturur.",
    "MD5-Future-028": "MD5 bugün hala geçerli mi?",
    "MD5-InsecurityExamples-018": "MD5 Güvenlik Arızası Örnekleri",
    "MD5-Operation-008": "MD5 operasyonu nasıl çalışır?",
    "MD5-PKI-025": "MD5, dijital imza oluşturmak için Açık Anahtar Altyapısında (PKI) kullanıldı, ancak güvenlik endişeleri nedeniyle kullanımı büyük ölçüde kullanımdan kaldırıldı. MD5 ile imzalanan sertifikalara artık çoğu modern sistem tarafından güvenilmemektedir.",
    "MD5-PasswordHashing-006": "Aynı zamanda tarihsel olarak şifre karma işleminde de kullanılmıştı ancak çarpışmalara karşı savunmasızlığı ve kırılma kolaylığı nedeniyle artık güvensiz olarak kabul ediliyor. Modern sistemler bcrypt veya Argon2 gibi daha güçlü alternatiflere yöneldi.",
    "MD5-Process-009": "MD5, giriş mesajını parçalara ayırarak ve her parçayı mantıksal işlevler, modüler aritmetik ve bitsel işlemleri içeren birkaç işlem turundan geçirerek çalışır. Sonuç, son 128 bit karma değerini üretmek için birleştirilir.",
    "MD5-Purpose-003": "Amacı, herhangi bir veri için benzersiz bir dijital parmak izi oluşturarak veri bütünlüğünü sağlamaktır. Orijinal verideki tek bir bit bile değişse MD5 hash'i tamamen farklı olacaktır.",
    "MD5-Relevance-029": "MD5, özellikle çarpışma direnci veya güçlü mesaj bütünlüğü gerektiren yeni uygulamalar için, kriptografik amaçlar açısından artık güvenli sayılmamaktadır. Ancak yine de hızın güvenlikten öncelikli olduğu eski sistemlerde veya kriptografik olmayan uygulamalarda bulunabilir.",
    "MD5-Rounds-010": "Algoritma, sabitlerle başlatılan 128 bitlik bir dahili durum üzerinde gerçekleştirilen dört ana aşamadan oluşur. Toplamda 64 işlem turu vardır ve her tur, giriş mesajı bloklarına dayalı olarak dahili durumu dönüştürür.",
    "MD5-Speed-013": "MD5 nispeten hızlıdır, bu da onu hızlı karma işleminin gerekli olduğu uygulamalar için popüler hale getirmiştir.",
    "MD5-Standardization-014": "Çeşitli programlama dilleri ve platformlarında geniş çapta standartlaştırılmış ve uygulanmıştır, bu da mevcut sistem ve araçlara entegrasyonunu kolaylaştırmaktadır.",
    "MD5-Summary-031": "Özet olarak MD5 hakkında hangi önemli noktaları hatırlamalıyım?",
    "MD5-Summary-Point1-032": "MD5, çarpışma saldırılarına duyarlı, hızlı ancak güvenli olmayan bir kriptografik karma işlevidir.",
    "MD5-Summary-Point2-033": "Başlıca kullanım alanları veri bütünlüğünü sağlamak ve bazı kriptografik işlemler içindi ancak yerini büyük ölçüde SHA-256 ve BLAKE2 gibi daha güçlü alternatifler aldı.",
    "MD5-Summary-Point3-034": "Eski sistemlerde veya güvenliğe duyarlı olmayan senaryolarda MD5 ile karşılaşabilirsiniz ancak kriptografik güvenlik gerektiren yeni projelerde MD5'i kullanmaktan kaçınmak çok önemlidir.",
    "MD5-Transition-030": "SHA-256 ve BLAKE2 gibi daha yeni, daha güvenli algoritmalar yaygınlaştıkça ve daha iyi anlaşıldıkça, güvenliğin endişe verici olduğu tüm bağlamlarda MD5'ten uzaklaşmanız önerilir.",
    "MD5-Usage-004": "MD5 pratikte nasıl kullanılır?",
    "MD6-AlgorithmDetails-010": "MD6 Algoritmasının Detayları",
    "MD6-ComparisonSHA3-020": "MD6, SHA-3 (Keccak) ile nasıl karşılaştırılır?",
    "MD6-Def-002": "MD6 (Message-Digest Algorithm 6), 2008 yılında Ronald Rivest tarafından tasarlanan bir kriptografik karma işlevidir. 128 ila 512 bit arasında değişen değişken çıktı boyutları sunan, MD ailesinin bir evrimidir.",
    "MD6-FAQ-001": "MD6 nedir?",
    "MD6-FutureDevelopments-028": "MD6 için gelecekte planlanan herhangi bir gelişme veya iyileştirme var mı?",
    "MD6-FutureUnknown-029": "Şu an itibariyle, devam eden geliştirmeler veya MD6 algoritmasının iyileştirilmesine yönelik planlar hakkında kamuya açık herhangi bir bilgi bulunmuyor. Kriptografik araştırmalar gelişmeye devam ediyor ve ortaya çıkan tehditleri veya gereksinimleri karşılamak için yeni algoritmalar ortaya çıkabilir.",
    "MD6-History-004": "MD6 nasıl geliştirildi ve yaratılmasına ne yol açtı?",
    "MD6-Operation-007": "MD6 işlemi nasıl çalışır?",
    "MD6-Origin-005": "MD6, o dönemde yaygın olarak kullanılan MD5 ve SHA-1'de bulunan güvenlik açıklarına yanıt olarak oluşturuldu. Çıktı boyutu konusunda artan esneklikle daha güvenli bir alternatif sunmayı amaçladı.",
    "MD6-PKI-Alternatives-027": "PKI ve dijital imza uygulamaları için bunun yerine RSA/SHA-256 veya SHA-2 veya SHA-3 varyantlı ECDSA gibi standartlar yaygın olarak kullanılmaktadır. Bunlar kapsamlı analizlerden geçmiş ve kriptografi topluluğu içinde güven oluşturmuştur.",
    "MD6-PKI-Considerations-026": "MD6'nın, MD5 gibi önceki karma işlevlerinden daha güçlü bir güvenlik sağlaması amaçlanmış olsa da, göreceli yeniliği ve geniş kriptografik topluluk kabulü eksikliği nedeniyle PKI veya dijital imza şemaları için geniş çapta benimsenmemiştir.",
    "MD6-Process-008": "MD6, giriş mesajlarını ağaç benzeri bir yapıda uygulanan bir dizi sıkıştırma işlevi aracılığıyla işler. Algoritma paralel olarak çalışabilir, bu da daha büyük girdiler için performansına katkıda bulunur.",
    "MD6-Purpose-003": "MD6, öncüllerine kıyasla sağlam güvenlik özellikleri ve gelişmiş performans sunmayı amaçlayarak, çarpışmaya dayanıklı karma ve mesaj bütünlüğü kontrolleri gerektiren çeşitli uygulamalar için uygun hale getiriyor.",
    "MD6-Rounds-009": "MD6 ağacındaki her düğüm, modüler ekleme, bit düzeyinde XOR ve doğrusal olmayan permütasyonları içeren birden fazla karıştırma işlemi turundan geçer. Nihai kök düğüm değeri, giriş mesajının karma özetini temsil eder.",
    "MD6-SecurityUpgrade-006": "MD6'nın tasarımı, ağaç tabanlı karma kavramı üzerine inşa edilmiştir; bu, onun önceki MD algoritmalarına göre ön görüntü ve çarpışma saldırılarına karşı daha iyi koruma sağlamasına ve aynı zamanda büyük veri kümeleri için daha yüksek verim sağlamasına olanak tanır.",
    "MD6-StayingCurrent-030": "Herhangi bir uygulama için karma işlevi seçerken, özellikle kriptografik güvenliğin ortamı zaman içinde geliştikçe, en son araştırma bulguları ve kriptografi uzmanlarının önerileriyle güncel kalmak çok önemlidir.",
    "MD6-UseInPKI-025": "MD6, Açık Anahtar Altyapısı (PKI) veya dijital imzalar için kullanılabilir mi?",
    "MD6-vs-SHA3-Adoption-023": "SHA-3, resmi bir NIST standardı olarak benimsenmiş ve sağlam güvenliği ve performansı nedeniyle yaygın kullanım kazanmıştır. MD6, teorik olarak güvenli olmasına rağmen aynı düzeyde benimsenme veya standardizasyon görmedi.",
    "MD6-vs-SHA3-DiffDesign-021": "MD6 ve SHA-3'ün her ikisi de güvenlik göz önünde bulundurularak tasarlanmıştır ancak farklı karma teknikleri kullanırlar. MD6 gelişmiş paralellik için ağaç tabanlı bir tasarım kullanırken, SHA-3 sünger yapısını temel alır.",
    "MD6-vs-SHA3-Flexibility-022": "MD6, özel karma boyutları gerektiren uygulamalar için avantajlı olabilecek değişken çıkış uzunlukları sunar. SHA-3 ayrıca değişken çıkış uzunluklarını da destekler; ancak en yaygın çeşidi olan SHAKE, isteğe bağlı uzunluktaki çıkışlarla daha da fazla esneklik sağlar.",
    "MDN-DOM-API": "MDN Web Dokümanları - Belgeleri Düzenleme",
    "MDN-Event-Loop": "MDN Web Belgeleri - Olay Döngüsü",
    "MDN-JS-Guide": "MDN Web Dokümanları - JavaScript Kılavuzu",
    "MDN-JS-Types": "MDN Web Dokümanları - Veri Türleri ve Veri Yapıları",
    "MDN-JSON-in-JavaScript": "MDN Web Dokümanları - JSON ile Çalışmak",
    "MDN-Minification": "MDN Web Belgeleri - Küçültme",
    "MDN-XML-Syntax": "MDN Web Belgeleri - XML ​​Söz Dizimi",
    "MN2lT": "Şifrenin uzunluğu 6'dan az olamaz",
    "Ma5mv": "Araç çubuğu sekmelerinin görünürlüğünü değiştirin",
    "Minify-Basics-001": "Kodu veya dosyaları küçültmenin anlamı nedir?",
    "Minify-CLI-Usage-009": "Bu araçların çoğu, geliştiricilerin geliştirme ve dağıtım sırasında küçültme sürecini otomatikleştirmesine olanak tanıyan hem komut satırı arayüzlerine (CLI) hem de API'lere sahiptir.",
    "Minify-Def-002": "Küçültme, kodun (HTML, CSS, JavaScript vb.) boyutunun, işlevselliğini etkilemeden boşluk, yorum, satır sonu gibi gereksiz karakterleri kaldırarak küçültme işlemidir.",
    "Minify-Example-007k": "Örneğin, {0}, küçültme sonrasında {1} haline gelebilir.",
    "Minify-How-Works-004": "Kod küçültme nasıl çalışır?",
    "Minify-Process-005": "Küçültücüler, kaynak kodunun yapısını analiz etmek, gereksiz öğeleri ortadan kaldırmak ve mümkün olduğunda değişken adlarını kısaltmak için algoritmalar kullanır. Bu, kodun orijinal davranışını korurken dosya boyutunun daha küçük olmasına neden olur.",
    "Minify-Purpose-003": "Küçültme işleminin temel amacı, sunucu ile istemci arasında aktarılması gereken veri miktarını azaltarak web sitesi performansını artırmak ve sayfa yükleme sürelerini azaltmaktır.",
    "Minify-Tools-007": "Kodu küçültmek için bazı popüler araçlar nelerdir?",
    "Minify-Tools-List-008": "Kodu küçültmeye yönelik popüler araçlar arasında JavaScript için UglifyJS, UglifyJS'nin gelişmiş hali olan Terser, HTML için HTMLMinifier ve CSS için CSSNano yer alır. Bu araçlar genellikle Gulp veya Webpack gibi görev çalıştırıcıları kullanılarak oluşturma süreçlerine entegre edilebilir.",
    "Mq9pdpT": "Seçtiğiniz işlevsel menüyle ilgili tüm kaynakları listeleyin.",
    "Mq9ppT": "Hizmetlerinizin durumunu hızlı bir şekilde görüntüleyin",
    "Mqq9pdpT": "LafTools'u kullanmaya başlamanıza yardımcı olur.",
    "MrgmU": "Onaylamak",
    "MySQL-Performance-Tuning": "MySQL Performans Ayarlama İpuçları",
    "NMLOn": "FilePath'i kopyala",
    "NMLOn1": "Çalışma Alanını Aç",
    "NNfJo": "Dosyadan Veri Yükle",
    "Nq1IR": "Uzantı VM'si Yüklenemiyor",
    "Nqc0LqwX": "Bu süreçte bir güvenlik açığı olduğunu düşünüyorsanız lütfen istediğiniz zaman EMail veya GitHub aracılığıyla bizimle iletişime geçmekten çekinmeyin, bunu acilen geliştirmek istiyoruz.",
    "NrQc8OJfZ": "JavaScript Nesne Gösterimi (JSON) kodunu sıkıştırır.",
    "NvOqE3B9Vxd": "Aşağıda başvurabileceğiniz olası çözümler bulunmaktadır",
    "O94Yx": "Açık",
    "OO0qPN": "Örnek Yüklendi",
    "OQWm4": "Hata Bildir",
    "OSHOI": "Sayfaya hoşgeldiniz",
    "OSqZQM": "Yerel Şifre",
    "OWASP-JSON-Injection": "OWASP - JSON Enjeksiyonu",
    "OWASP-SQL-Injection": "OWASP SQL Enjeksiyon Kılavuzu",
    "OeO0PeN": "Tamam, örnek giriş düzenleyicisinde görüntüleniyor.",
    "OeOQY": "YAPMAK",
    "Ol1ZcWomT": "{0} Güzelleştir",
    "OpPFe": "LafTools'u beğendiyseniz lütfen arkadaşlarınızla paylaşın ve bize bir yıldız verin, teşekkürler!",
    "Opcty": "Dosyalar",
    "OqqGx2qg": "Statik kaynaklar yükleniyor, lütfen bekleyin...",
    "OrCt5": "Çalışma tezgahına yönlendiriliyorum...",
    "Ot6EP": "Lehçe Araçları",
    "P4ROa": "Çıkış Bölgesi",
    "PM_N5": "Oturum - {0}",
    "PUxuU": "Dil paketleri için veriler alınıyor...",
    "PapkF": "LafTools hakkında herhangi bir sorunuz veya öneriniz varsa lütfen bize bildirmekten çekinmeyin. Her zaman ürünümüzü geliştirmenin ve kullanıcılarımıza mümkün olan en iyi deneyimi sunmanın yollarını arıyoruz. Work7z@outlook.com adresinden bizimle iletişime geçebilirsiniz. LafTools'u kullandığınız için teşekkür ederiz!",
    "PpCHA": "Soru Anahtarı(?)",
    "QL9Sn": "Şu anda bir açıklama mevcut görünmüyor.",
    "QLKzF": "Hem acemi hem de deneyimli geliştiricilerin ihtiyaçlarını karşılayan özelliklerle doludur ve bu da onu her programcının cephaneliğinde bulunması gereken bir araç haline getirir.",
    "QM2Ob": "En Yeni Araçlar",
    "QM2Oq": "Son Notlar",
    "QRAdA": "ingilizceden Çinceye",
    "QZK58Gemi": "Yapılandırılmış Sorgu Dili (SQL) kodunu sıkıştırır.",
    "QhdpH": "Topluluk Sürümü",
    "QkJ-TOduip6z_": "LafTools IDE",
    "QzlA3": "Bir hata oluştu",
    "R12bq": "Gösterilmeyen sekmeleri listeleyin",
    "RNBze0": "Aletler",
    "RNeBze0": "Açılan Sekmeler",
    "RNewBze0": "Araç Yapılandırması",
    "RO4ZP": "Bir hata oluştu",
    "RPVRl": "Bu uzantının LafTools'un mevcut sürümüyle uyumlu olmadığı anlaşılıyor. Lütfen bu uzantıyı desteklemek için en son sürümü yüklemeyi düşünün veya GitHub'da bir sorunu dile getirerek bizimle iletişime geçmekten çekinmeyin.",
    "R_S7_CLAo": "Örnek: Base32'de 'TEST12345'i kodlamak için Node.js'deki base32-encode gibi kitaplıkları veya Python'un base64.b32encode'u gibi diğer dillerdeki yerleşik işlevleri kullanabilirsiniz.",
    "RhqzcdD": "Sistem ayarları",
    "RjCO3": "Çalışma Alanı Listesi",
    "S4MMV": "Hata! Dosyayı yüklerken bazı sorunlar bulduk.",
    "SAnnQ": "{0} dosyası yükleniyor",
    "SBsDz": "Yönetici Hesabınız için Kurulum.",
    "SDLC-Wikipedia": "Yazılım Geliştirme Yaşam Döngüsü - Vikipedi",
    "SETxuObyB": "LafTools ekibinin sorunu daha ayrıntılı olarak araştırmasına olanak sağlamak için bu hatayla ilgili GitHub'da bir Sorun bildirin.",
    "SGs7B": "LafTools'unuzu Hızla Kurun",
    "SHA-256-020": "SHA-256 (Güvenli Hash Algoritması), MD5'ten daha güçlü güvenlik sunan, yaygın olarak kullanılan bir alternatiftir. Daha büyük bir 256 bit karma değeri üretir ve SHA-2 ailesinin bir parçasıdır.",
    "SHA-2_Info-022": "SHA-2 Bilgisi",
    "SHA3-NISTStandard-024": "SHA-3 Standardizasyonu",
    "SMqD13": "Filtrelemek için girin",
    "SPem9": "Bu alan henüz hazır değil.",
    "SQAw7": "Kaynak dil",
    "SQL-Basics-001": "SQL nedir?",
    "SQL-Beautifier-Example": "Çevrimiçi SQL Formatlayıcı",
    "SQL-Beautify-006": "SQL Güzelleştirme nedir?",
    "SQL-Beautify-Def-007": "SQL güzelleştirme, tutarlı girinti, aralık ve büyük/küçük harf kuralları uygulayarak okunabilirliği artırmak için SQL kodunu biçimlendirme işlemidir.",
    "SQL-Beautify-Purpose-008": "Tıpkı genel kod güzelleştiriciler gibi, geliştiricilerin karmaşık sorguları daha kolay anlamalarına ve SQL komut dosyaları veya projelerinde tutarlılığı korumalarına yardımcı olur.",
    "SQL-Commands-005": "SQL çeşitli komut türlerini içerir: DDL (Veri Tanımlama Dili - CREATE, ALTER, DROP), DML (Veri İşleme Dili - SELECT, INSERT, UPDATE, DELETE) ve DCL (Veri Kontrol Dili - GRANT, REVOKE).",
    "SQL-Components-004": "SQL'in ana bileşenleri nelerdir?",
    "SQL-Components-Wikipedia": "Wikipedia'da SQL Bileşenleri",
    "SQL-Def-002": "SQL (Yapısal Sorgulama Dili), ilişkisel veritabanlarını yönetmek ve sorgulamak için kullanılan standart bir programlama dilidir.",
    "SQL-Indexing-016": "SQL'deki indeksler nelerdir ve neden önemlidir?",
    "SQL-Indexing-Benefit-018": "WHERE yan tümcesi koşulları için sık kullanılan sütunlarda dizin oluşturmak, SELECT sorgularını önemli ölçüde hızlandırır ancak dizin yapısını koruma ihtiyacı nedeniyle INSERT, UPDATE ve DELETE işlemlerini yavaşlatabilir.",
    "SQL-Indexing-Explanation-017": "Dizinler, veritabanı motorunun belirli sütun değerlerine göre satırları hızlı bir şekilde bulmasına olanak tanıyarak bir tablodaki veri alma işlemlerinin hızını artıran veri yapılarıdır (örneğin B ağaçları).",
    "SQL-Indexing-MDN": "Dizinlerdeki MDN Web Belgeleri",
    "SQL-Injection-019": "SQL Enjeksiyon nedir ve nasıl önlenebilir?",
    "SQL-Injection-Def-020": "SQL Enjeksiyonu, bir saldırganın veritabanındaki verileri değiştirmek veya çıkarmak için giriş alanlarına kötü amaçlı SQL kodu yerleştirebildiği bir güvenlik açığıdır.",
    "SQL-Injection-Prevention-021": "Önleme yöntemleri arasında parametreleştirilmiş sorguların, hazırlanmış ifadelerin veya kullanıcı girişinden otomatik olarak kaçan ORM kitaplıklarının kullanılmasının yanı sıra veritabanı izinlerinin sınırlandırılması ve en az ayrıcalık ilkelerinin uygulanması yer alır.",
    "SQL-Joins-011": "SQL'de JOIN'ler nedir?",
    "SQL-Joins-Explanation-012": "JOIN'ler, iki veya daha fazla tablodaki satırları, aralarındaki ilgili sütuna göre birleştirmek için kullanılır. Örneğin, INNER JOIN, LEFT JOIN, RIGHT JOIN ve FULL JOIN.",
    "SQL-Joins-Tutorial": "SQL Eğitime Katılıyor",
    "SQL-Perf-Tuning-Methods-024": "Diğer teknikler arasında büyük tabloların bölümlenmesi, uygun veri türlerinin kullanılması ve mümkün olduğunda sonuçların önbelleğe alınması yer alır.",
    "SQL-Perf-Tuning-Overview-023": "SQL sorgu performansını optimize etmek, yürütme planlarını analiz etmeyi, uygun şekilde indekslemeyi, gereksiz birleştirmeleri ve alt sorguları en aza indirmeyi ve etkili WHERE cümlecikleri yazmayı içerir.",
    "SQL-Performance-Tuning-022": "SQL sorgu performansını nasıl optimize edebilirim?",
    "SQL-Purpose-003": "Tablolardaki verileri oluşturmak, okumak, güncellemek, silmek ve sorgulamanın yanı sıra veritabanı yapısını ve izinlerini yönetmek için kullanılır.",
    "SQL-Select-009": "Temel bir SELECT ifadesini nasıl yazarım?",
    "SQL-Select-Example-0210": "Basit bir SELECT ifadesi bir tablodan veri alır. Örneğin: {0}', 'Tablomdan sütun1, sütun2'yi SEÇİN;",
    "SQL-Transactions-013": "SQL'de işlemler nelerdir?",
    "SQL-Transactions-Def-014": "İşlem, bir veya daha fazla SQL ifadesi içeren mantıksal bir iş birimidir. Bünyesindeki tüm işlemlerin başarılı bir şekilde tamamlanmasını (atomisite), diğer işlemlerden izole edilmesini ve sistem arızası durumunda dahi dayanıklı olmasını sağlar.",
    "SQL-Transactions-Example-015": "Bir işlemi başlatmak için İŞLEMİ BAŞLAT komutunu kullanın; COMMIT ile değişiklikleri gerçekleştirin veya ROLLBACK ile önceki duruma geri dönün.",
    "SQL-Transactions-W3Schools": "W3Schools'ta SQL İşlemleri",
    "SYSq1": "Örnek",
    "SZgXb": "Yerel Parolayı Ayarlayın",
    "SdGcT": "Diğer bölüm",
    "Sm9tq": "Lütfen hesap şifrenizi buraya girin",
    "Sm9tqq": "Lütfen LafTools'unuzun kilidini açmak için şifre girin",
    "Spcfdee": "Açık veya Koyu Mod",
    "TBPqy7": "Dil",
    "TD7DA": "Diller",
    "TIOBE-Index": "TIOBE Endeksi - Yazılım Kalitesi Şirketi",
    "TNoePE": "LafTools Bulutu",
    "Terser": "Terser - GitHub",
    "Ttrqqet": "Düşüncelerinizi buraya yazın ve kaydedin!",
    "TwFcr": "Hedef dil",
    "TyqvWY3": "Yerel dosya",
    "U2ZNl": "Wikipedia'da daha fazla bilgi edinin",
    "U4qqq9": "Bu sekmeyi listeden kaldır",
    "U5Eiy7ZRZ": "Hassas bilgilerle ilgiliyse bu hatayı bildirmek için LafTools ekibine({0}) bir e-posta gönderin.",
    "U7zP2": "Lütfen hesap kullanıcı adını buraya girin",
    "UF_Dp": "Bir Hata oluştu: {0}, reddedilen zaman: {1}",
    "UVvJp-vtF": "{0} Küçült",
    "UZ2Ig": "Yeni Yerel Hesap",
    "UglifyJS": "UglifyJS - GitHub",
    "Ugpng": "Favori",
    "V6U_f": "Kullanım Şartları",
    "V6XEO": "Kullanıcı adını veya E-posta adresini girin",
    "VAZq8r": "Geliştiricilerin, komut dosyalarını çalıştırma, paketleri yükleme ve dosya sisteminde gezinme gibi çeşitli komutları düzenleyicinin içinden yürütmesine olanak tanır.",
    "VEfeqZG": "Notlar",
    "VI6VT": "Tarih",
    "VOsZc": "Rapor bildir",
    "VSZ": "Yeniden tetiklemek için tıklayın",
    "VZtqg6": "Yeni Komut Dosyası Formu Oluştur",
    "Vaf2y": "Sekme adı boş olamaz.",
    "VeY9K": "Kullanım Şartları",
    "VgG5y": "Uzantınızın durumunu yenilemek için burayı tıklayın",
    "Vvt09V2Qo": "Genel Kod",
    "W3Schools-XML-Validation": "W3Schools - XML ​​Doğrulaması",
    "WFUWzv_px": "Geçerli JavaScript kodunu ayrıştırır ve güzel bir şekilde yazdırır. Ayrıca JavaScript Nesne Gösterimi (JSON) ile de çalışır.",
    "WPrTW": "Resmi internet sitesi",
    "WXo6D": "Yenilendi",
    "WYCVL": "Hızlı ayar",
    "X4L_Z": "Uzantı VM'si sağlanmadı.",
    "X6Fq4j": "Yıllar süren özel geliştirme ve iyileştirmelerden sonra, LafTools'un iş akışınıza daha fazla kolaylık ve verimlilik getirerek programlama deneyiminizi önemli ölçüde geliştirebileceğinden eminiz.",
    "XKpI0": "Metninizi giriş bölgesinde işlemek için tıklayın",
    "XLWoR": "Tercih ettiğinizi seçin ve devam edin",
    "XML-Advantage-Readable-018": "İnsan tarafından okunabilir yapısı, kolay inceleme ve hata ayıklamaya olanak tanır ve özel yapıları tanımlama yeteneği, onu birden fazla kullanım durumu için esnek hale getirir.",
    "XML-Advantage-Standardized-017": "XML, çeşitli platformlar ve sistemlerle uyumlu olmasını sağlayan, birlikte çalışabilirliği ve veri alışverişini teşvik eden, yaygın olarak benimsenen bir standarttır.",
    "XML-Advantages-012": "XML daha fazla yapı esnekliği sağlar ve ad alanlarını destekler; bu da karmaşık belge yapıları ve sistemler arasında birlikte çalışabilirlik açısından faydalı olabilir.",
    "XML-Advantages-016": "XML kullanmanın avantajları nelerdir?",
    "XML-Attributes-006": "Öğeler, açılış etiketi içindeki öğe hakkında ek bilgi sağlayan {0} gibi niteliklere sahip olabilir.",
    "XML-Basics-001": "XML nedir?",
    "XML-Def-002": "XML (eXtensible Markup Language), belgeleri hem insan tarafından hem de makine tarafından okunabilen bir biçimde kodlamak için bir dizi kural tanımlayan bir biçimlendirme dilidir.",
    "XML-Disadvantage-Size-020": "XML nispeten ayrıntılı olabilir, bu da JSON gibi alternatiflere kıyasla daha büyük dosya boyutlarına neden olur ve bu da aktarım hızını ve depolama gereksinimlerini etkiler.",
    "XML-Disadvantages-019": "XML kullanmanın bazı dezavantajları nelerdir?",
    "XML-JSON-Diff-Structure-014": "XML, yapı için ayrıntılı, hiyerarşik etiketler kullanırken JSON, anahtar/değer çiftlerine ve dizilerine dayanır. Örnek: XML {0} ve JSON {1}.",
    "XML-JSON-Diff-Syntax-015": "XML, kapanış etiketleri ve nitelikleriyle daha katı bir sözdizimine sahipken, JSON'un sözdizimi daha hafiftir ve JavaScript nesne gösterimine daha yakındır. JSON'un genellikle web üzerinden ayrıştırılması ve iletilmesi daha kolay kabul edilir.",
    "XML-JSON-Difference-013": "XML ve JSON arasındaki fark nedir?",
    "XML-Nesting-007": "XML'de iç içe yerleştirme nasıl çalışır?",
    "XML-Nesting-Example-009": "Örneğin, `<book><title>Kitabımın Başlığı</title><author>John Doe</author></book>`, başlığı ve yazarının iç içe geçmiş öğeler olduğu bir kitabı temsil eder.",
    "XML-Nesting-Explanation-008": "XML'de öğeler hiyerarşik ilişkileri temsil edecek şekilde birbirinin içine yerleştirilebilir. Alt öğeler ana öğelerin açılış ve kapanış etiketleri arasına yerleştirilir.",
    "XML-Processing-Speed-021": "XML'in ayrıştırılması ve oluşturulması, özellikle karmaşık belgelerle uğraşırken katı söz dizimi ve doğrulama ihtiyacı nedeniyle daha yavaş olabilir.",
    "XML-Purpose-003": "HTML gibi verileri görüntülemek yerine veri taşımak üzere tasarlanmıştır ve farklı platformlar ve uygulamalar arasında yapılandırılmış bilgilerin paylaşılması için ortak bir format olarak kullanılmasına olanak tanır.",
    "XML-Syntax-004": "XML'in temel sözdizimi nedir?",
    "XML-Syntax-Example-005": "Basit bir XML belgesi ağaç benzeri bir yapıdaki öğelerden oluşur. Her öğe köşeli parantez içindeki bir etiketle (<element>) başlar ve bir kapatma etiketiyle (</element>) biter.",
    "XML-Validation-010": "XML doğrulama nedir ve nasıl çalışır?",
    "XML-Validation-Def-011": "XML doğrulaması, bir XML belgesinin Belge Türü Tanımında (DTD) veya XML Şemasında (XSD) tanımlanan belirli bir kural kümesine uymasını sağlar.",
    "XML-Validation-Process-012": "Doğrulayıcılar, gerekli tüm öğelerin ve niteliklerin mevcut olup olmadığını kontrol eder, veri türlerini doğrular ve belgeyi işlemeden önce şemada belirtilen kısıtlamaları uygular.",
    "XQxJB": "Çalışma Alanlarım",
    "X_HGx": "LafTools, çeşitli ihtiyaçları karşılamak üzere tasarlanmış çok yönlü bir araç kutusudur. Tamamen açık kaynaklı olup şeffaflık ve güvenlik sağlar. Hafif çalışma süresine rağmen ARMv8 de dahil olmak üzere tam platform desteği ve ChatGPT'ye benzer yerel AI desteği sunar. LafTools, üretken bir kullanıcı arayüzü ile son derece entegre edilmiştir ve yeni araçlarla sürekli olarak güncellenmektedir. Web üzerinden ve Docker ile birlikte kullanılabilir ve notlar ve kılavuzlar gibi ek kaynaklar sağlar.",
    "XeXF77": "Ayarlar",
    "XikdD": "Bir dakika lütfen, neredeyse geldik!",
    "Y5GAC": "Kullanıcı adınızı",
    "Y9mQ2": "Lütfen hesap kullanıcı adını buraya girin",
    "YAAU3q": "Yerel Şifre",
    "YHCjT": "LafTools küresel açık ve koyu temayı destekler; özellikle gece vardiyası kodlayıcıları için kullanışlıdır.",
    "YNwKz": "Desteklenmeyen dil: {0}, varsayılan olarak İngilizce kullanılacaktır.",
    "YOYTp": "Hızlı ayar",
    "YPPPL": "Araç çubuğu sekmelerinin görünürlüğünü değiştirin",
    "YQN9u": "{0} yüklenirken bir hata oluştu, lütfen aşağıdaki ayrıntıları kontrol edin.",
    "Y__Zb1_4Q": "Gereksiz tüm karakterleri kaldırarak Basamaklı Stil Sayfaları (CSS) kodunu küçültür.",
    "Y_k0z": "Parolanızı mı unuttunuz?",
    "Ye3TXses": "Giriş metni değiştirildiğinde dönüşümün otomatik olarak yürütülüp yürütülmeyeceğini yapılandırmak için.",
    "Ylq2X": "Hata düzeltme",
    "YquQqTXq": "Otomatik Çalıştır?",
    "YrTdq": "Tüm",
    "YrVq683": "Posta",
    "YrVqdd683": "Kılavuzlar",
    "Z2QTU": "Hakkında",
    "Z3rhY": "İleti",
    "Z7ALO": "Seçilen çalışma alanına geçildi",
    "Z7OTt": "Seçtiğiniz dosya çok büyük, lütfen 30 MB'tan küçük bir dosya seçin.",
    "ZAGva": "Bu çalışma alanını sildiğinizden emin misiniz?",
    "ZAKaFq": "Bulut Hesabım",
    "ZXRGC": "Lütfen şu hataya bakın: {0}",
    "ZbD3F": "{0}, LafTools ekibi tarafından hazırlandı",
    "Zk7JI": "Henüz desteklenmiyor",
    "ZrbduC": "Tüm Sekmeleri Kapat",
    "ZrbuC": "Sekmeyi Kapat",
    "_-JigU2Fg": "Beklenmeyen bir giriş veya veri biçimi istisnaya neden oldu.",
    "_5OqeG": "İşaretini kaldır",
    "_LFF3": "LafTools'u kullanırken herhangi bir sorunla karşılaşırsanız veya herhangi bir öneriniz varsa, lütfen istediğiniz zaman EMail veya GitHub aracılığıyla bizimle iletişime geçmekten çekinmeyin; bunu geliştirmeye hazırız.",
    "_trez": "Metni Değiştir",
    "_trqL": "Sistem kaynakları için veriler alınıyor...",
    "_z3lR": "Kodu Yenile",
    "a3yqoz": "Farsça",
    "a3z-3k12": "IP Adresi Araçları",
    "a4jbpq": "Çek",
    "a4r9t": "Base45, kaynağına bakılmaksızın Base45 kodlu herhangi bir dizenin kodunu çözebilir mi?",
    "a4s6x": "Base32 nasıl çalışır?",
    "a8b7z": "Bu nedenle, doldurma yalnızca kodlanan son bit grubu 40 bit ile bölünemiyorsa gereklidir (çünkü 8 Base32 karakteri 40 biti temsil eder). Dolgu, kodlanmış dizenin sonunda sıfır ila altı '=' karakterinden oluşacaktır.",
    "aCkOP": "çıkış",
    "aHAfR": "{0} için veriler getiriliyor...",
    "aSOpr": "Veri Modeli Oluşturucu",
    "ab9c0d1e": "Birincil işlemler arasında kodlama (ikiliyi Base64'e dönüştürme) ve kod çözme (Base64'ü tekrar ikiliye dönüştürme) bulunur.",
    "abc12345": "Base64, ikili verileri ASCII karakter dizisi olarak temsil eden bir kodlama şemasıdır.",
    "abcdef12": "Base64 nasıl çalışır?",
    "about_LafTools_toolbox": "LafTools Hakkında",
    "adpgq": "Yeni çalışma alanı oluştur",
    "ah-C4": "Yeni Not",
    "aj3nhd": "Almanca",
    "aked6": "Referanslar",
    "aked61": "giriiş",
    "asElV": "Kaldırmak",
    "az4uS2": "Bu sistemden çıkış yaptığınızdan emin misiniz? Giriş sayfasına yönlendirileceğinizi unutmayın.",
    "azpNX": "Tamamlanmış.",
    "b6sx9b": "Filipinli",
    "b8g2k": "Base32 için kullanım senaryoları",
    "bP_6qG": "Şifrenizi Unutmak İçin İpuçları",
    "bT4R6": "Yeni sekme",
    "bVlBN": "Çince'den İngilizce'ye",
    "bcdef01a": "Base64, ikili verileri 6 bitlik gruplara bölerek ve her grubu 64 karakterlik bir alfabeden (A-Za-z0-9+/) belirli bir karakterle eşleştirerek çalışır.",
    "bhojei1": "Geleneksel çince",
    "bjZyW": "Çevirmek",
    "bors14": "Türkçe",
    "bp_-b": "LafTools'u tam olarak yönetmek için kurulum akışının başında yöneticinizi ayarlamanız gerekir. Kimliğinizi URL parametre belirteciyle doğruladık; kurulum belirtecini almadan başka hiç kimsenin kök izninizi ayarlayamayacağından emin olun.",
    "bqqrij": "Svahili",
    "bsWpBA73s": "JavaScript kodunu sıkıştırır.",
    "c0eCw": "Metninizi istediğiniz dile çevirin.",
    "c0v2p": "Base32 ile ortak işlemler",
    "c1p3b": "Entegre edildikten sonra, sağlanan şablonu C++ programınıza kopyalayın ve programı çalıştırmadan önce yer tutucuyu gerçek kodlanmış değerle değiştirin.",
    "c1p4b": "Her ondalık sayı daha sonra beş Base85 karakterden oluşan benzersiz bir diziye dönüştürülür. Sonunda dört bayttan az kaldıysa dolgu uygulanabilir.",
    "c2tpr": "Apache Commons Codec kitaplığı, Java'da Base32 kodlama ve kod çözme işlevselliği sağlar.",
    "c2vw9k": "Base45, Base64 veya Base32 kadar yaygın olarak uygulanmasa da birçok dil için açık kaynak kitaplıklar mevcuttur.",
    "c5m1b": "Başka bir varyant olan Base58Flickr, karakter setinde biraz farklılık gösterir. Flickr'ın URL ihtiyaçlarına uyum sağlamak için '+' yerine ',' ve '/' yerine '-' koyar.",
    "c5meku": "Sundan dili",
    "c5p1b": "Dolgu kullanılmaz; kodlanmış çıkışın uzunluğu doğrudan giriş verilerinin boyutuna bağlıdır.",
    "c6p4n": "Sağlanan şablonda, kod çözme kısmındaki yer tutucuyu gerçek Base85 kodlu baytlarla ('b' önekiyle) değiştirin, ardından betiği çalıştırın.",
    "c6p9b": "Giriş verilerinin uzunluğu 8'e bölünemiyorsa dolgu kullanılmaz; bunun yerine, tam olmayan her grup bağımsız olarak ele alınır.",
    "c7Uoqqe": "LafTools'u kullanmadan önce lütfen yerel şifrenizi aşağıdaki gibi girip onaylayın.",
    "c8me6b": "Özel Base62 benzeri şemalar belirli uygulamalara göre uyarlanabilir, ancak genellikle Base64 veya Base32'den daha büyük bir karakter seti kullanma prensibine uyarlar.",
    "c9j5k": "'base32.h' başlığını ve ilgili uygulamasını indirip projenize ekleyin.",
    "c9j5v": "Projenize 'besteci gerektirir christian-riesen/base32' ifadesini ekleyerek Composer aracılığıyla yükleyin.",
    "c9q7w": "Base45 neden oluşturuldu?",
    "cMBqyyFae": "Yapılandırılmış Sorgu Dili (SQL) kodunu girintiler ve güzelleştirir.",
    "cNQp_": "Kaynaklar",
    "cOYuMrncv": "Bilinmeyen Çeviri hatası",
    "cPS6q": "Tüm Araçlar",
    "cQqwI8r": "Terminal Hizmetinin durumu yükleniyor",
    "cU0YAMbxU": "Kenar Çubuğunda Metni Göster",
    "cbaq54321": "Hayır, Base64 bir sıkıştırma tekniği değildir; verinin boyutunu değil yalnızca temsilini değiştirir.",
    "cdefg234": "Kodlanmış veri uzunluğunun 4 karakterin katı olmasını sağlamak için sonuna dolgu karakterleri (=) eklenir.",
    "cfYYN": "Daha fazlasını keşfet",
    "ciZV2": "Base32, insanlar tarafından rahatlıkla kullanılabilen ve bilgisayarlar tarafından işlenebilen sınırlı bir sembol kümesi kullanarak rastgele bayt verilerini kodlamaya yönelik bir gösterimdir. Base64'ten daha küçük bir karakter kümesi kullanır; genellikle büyük harfler ve 2'den 7'ye kadar sayılar.",
    "ciZV21": "Base45, insanlar tarafından rahatlıkla kullanılabilen ve bilgisayarlar tarafından işlenebilen sınırlı bir sembol seti kullanarak rastgele bayt verilerini kodlamaya yönelik bir gösterimdir. Yüksek sayı tabanı, ondalık veya onaltılık sisteme göre daha kısa dizelerle sonuçlanır. Base45, QR kodlarıyla kullanım için optimize edilmiştir.",
    "ciZV2deq1": "Base58 (Base64'e benzer), rastgele bayt verilerini kodlamak için kullanılan bir gösterimdir. İnsanların okunabilirliğini artırmak için kolayca yanlış okunan karakterleri (örn. l, I, 0 ve O) kaldırarak Base64'ten farklıdır. Base58, kripto para birimlerinde (Bitcoin, Ripple vb.) yaygın olarak kullanılır.",
    "cj1pd": "Yenileme İşlemi",
    "cjzqj9": "Boşnakça",
    "cmxzpg": "Malayalamca",
    "coM2I": "Akıllı Düzenleyici'yi kullanın",
    "crD7I": "Dönüşümün, uzunluğu sıfır olan boş giriş metnini yok sayıp saymayacağını yapılandırmak için.",
    "cuRCqb": "Kategori mevcut değil",
    "cxqhqa": "Myanmar (Birmanya)",
    "d-l2l": "Onaylamak",
    "d-qPr": "Bilinmeyen düzen: {0}",
    "d1x7v": "Başka bir örnek, satır sonları ve dosya adı kısıtlamalarıyla ilgili sorunları önlemek için karma nesnelerin bazen Base32 biçiminde depolandığı Git'tedir. Ayrıca HashiCorp Vault, anahtar türetme için Base32'yi kullanır.",
    "d2w4e": "Diğer temel dönüştürme sistemlerine benzer şekilde Base62, giriş baytlarını büyük bir tam sayıya dönüştürerek ve ardından bunu 62 karakterlik setteki karakterlerin bir kombinasyonu olarak ifade ederek çalışır.",
    "d2w6e": "Kaynak kodunu indirin ve base62.h başlık dosyasını projenize ekleyin. Projenin talimatlarına göre kaynak dosyalara göre derleyin/bağlantı kurun.",
    "d3w2e": "Base58, giriş baytlarını büyük bir tam sayıya dönüştürerek ve ardından bu tam sayıyı 58 karakterlik setteki (A-Z, a-z, 1-9) karakterlerin birleşimi olarak ifade ederek çalışır.",
    "d5KZH": "LafTools'u kullandığınız için teşekkür ederiz!",
    "d5LAU": "AGPLv3 kapsamında lisanslanmıştır",
    "d5fmq2": "İtalyan",
    "d5hit": "Oturum - {0}",
    "d5x1rl": "İspanyol",
    "d6g0w": "Bu kod parçası, komut dosyaları, etkileşimli oturumlar da dahil olmak üzere herhangi bir Python ortamında veya daha büyük bir uygulama içinde çalıştırılabilir.",
    "d6y9k": "Son grubu doldurmaya yetecek kadar bayt yoksa dolgu kullanılmaz; bunun yerine geri kalan bitler işlenir ve karşılık gelen karakter(ler)le eşlenir.",
    "d7w2e": "Base85, giriş verilerini dört baytlık gruplara bölerek ve her grubu 0 ile 2^32-1 arasında bir ondalık sayıya dönüştürerek çalışır.",
    "d8w1b": "Standart kütüphanenin bir parçası olduğundan ek kuruluma gerek yoktur. Python sürümünüzün bu işlevi içerecek kadar yeni olduğundan emin olun.",
    "d9w7m": "Ayrıca, yalnızca büyük harfler kullandığından, Base64'ün bazen kod çözme sırasında büyük/küçük harf katlamada yaptığı gibi ek bir güvenlik önlemi olarak büyük/küçük harf duyarlılığının tüm olası kombinasyonlarını kullanamaz.",
    "dCFIC": "Kod Daha Güzel",
    "dCFIwC": "Kod Oluşturucu",
    "dGKMx": "Çıktı",
    "dGVUB": "Ağ Araçları",
    "dQwjNbi0y": "Dokümantasyon hakkında daha fazla bilgi edinin",
    "dV5Eq": "Çalışma alanı listesini yenile",
    "dWbBm": "C#, Base64 verilerini kodlamanıza ve kodunu çözmenize olanak tanıyan yerleşik ToBase64String ve FromBase64String yöntemlerine sahip 'System.Convert' sınıfını içerir. Giriş dizesi ilk önce UTF-8 kodlaması kullanılarak bir bayt dizisine dönüştürülür, ardından buna göre kodlanır ve kodu çözülür.",
    "dk122q": "Birden fazla aracı bir araya getirmek için iş akışlarınızı yönetin.",
    "dkarh": "Tamam, araç kutusu dizini açtı. Açılan pencere yoksa lütfen platformunuzun bu işlevi destekleyip desteklemediğini veya dizinin sunucuda olup olmadığını kontrol edin.",
    "dkjk12": "bu test",
    "dkkq12": "Aracınızı bu sekmede yapılandırın.",
    "dl4kr": "Parolanızı mı unuttunuz?",
    "dpRY4": "Sözlük",
    "dqTqyvWY": "Çekmece Menüsü",
    "dsdpA_eJ": "Boyutu Ayarla",
    "dtjdt4": "Kazak",
    "dxLQq": "Kök İzni",
    "dzjTo": "Lütfen hesap şifrenizi buraya girin",
    "e--gB": "Uzantı kimliği sağlanmadı.",
    "e3WgQaZlb": "{0}'ı sıkıştırır",
    "e4Cd8t": "Temel85",
    "e5c7r": "Base32, 32 karakterlik bir alt kümeyi kullanarak bir ASCII dizesindeki verileri temsil eden ikiliden metne kodlama şemasıdır. İnsanların okuyabileceği ve URL açısından güvenli olacak şekilde tasarlanmıştır.",
    "e5rycw": "Kırgız",
    "e8Crq": "Devam etmek için lütfen aşağıdaki kullanıcı adı ve şifre alanını doldurun.",
    "e8x2v": "Base45, giriş verilerini her biri 5 baytlık gruplara bölerek çalışır. Daha sonra her grubu bir ondalık sayıya dönüştürür ve onu 45 karakterlik kümeden karşılık gelen bir karakterle eşleştirir.",
    "eN4fM": "Rust'ta Base64 kodlama ve kod çözme için 'base64' kasasını kullanabilirsiniz. [Bağımlılıklar] bölümünün altındaki Cargo.toml dosyanıza 'base64 = \\\"1.x\\\"' ekleyin, 'cargo build'i çalıştırın ve bu işlevleri kullanmak için kodunuza gerekli içe aktarmaları ekleyin.",
    "eTmq": "CodeGen ToolBox'un Tarihçesi",
    "e_8pZ": "Geliştiricilerin üretkenliği artırmasına yönelik çok yönlü bir araç kutusu.",
    "ediql2": "Macarca",
    "efg45678": "Base32 ile Karşılaştırma",
    "efghi678": "Bu değişken genellikle dosya adları, URL'ler veya özel karakterlerden kaçınılması gereken durumlar için kullanılır.",
    "egkqC8t": "Temel58",
    "egkqCd8t": "Base62",
    "eifoni": "Katalanca",
    "eqkqd4W": "Lütfen yeni etiket için bir ad girin",
    "etV-l": "Dosyaları SIT2'ye Kopyala",
    "eu5mh0": "Belarusça",
    "euaI8": "Yeni Yerel Hesap Oluştur",
    "euhy9v": "Estonyalı",
    "f0q4w": "Popüler kullanım senaryolarından biri, Google Authenticator ve Yubikey gibi hizmetlerin Base32 kodlu sırları kullandığı İki Faktörlü Kimlik Doğrulama (2FA) için gizli anahtarlar oluşturmaktır.",
    "f1t2z": "Base62, özellikle benzersiz tanımlayıcılar ve kısa URL'ler için Base64'e daha kısa, URL açısından güvenli bir alternatif sağlamak üzere geliştirildi.",
    "f3ttw8": "Maori dili",
    "f4t7z": "Base58 başlangıçta Bitcoin'in genel adresleri ve özel anahtarları belirsizlik olmadan temsil etmesi için geliştirildi.",
    "f5a0s": "Ek olarak, Base32 daha uzun çıktılar üretir ancak dosya sistemi kurallarıyla çelişebilecek özel karakterler içermemesi nedeniyle dosya adları gibi belirli uygulamalar için daha uygun olabilir.",
    "f5bLC": "Dokümantasyon",
    "f7akol": "İngilizce",
    "f7t1z": "Kitaplığı Xcode projenize manuel olarak veya Swift Paket Yöneticisi (SPM) gibi bir paket yöneticisi aracılığıyla ekleyin.",
    "f8n4m": "Kompaktlığı, standart barkod tarayıcılarla okunabilirliği korurken, QR kodlarında alanın daha verimli kullanılmasına olanak tanır.",
    "f8wne": "Paket Yönetici Konsolu'nda 'Install-Package BouncyCastle'ı çalıştırarak veya .csproj dosyanıza ekleyerek paketi dahil edin.",
    "f9t1z": "Base85 başlangıçta daha iyi sıkıştırma oranları için PostScript belgelerindeki ikili verileri verimli bir şekilde temsil etmek üzere geliştirildi.",
    "f9t2z": "Maven projenize `<dependency> <groupId>commons-codec</groupId> <artifactId>commons-codec</artifactId> <version>...</version> </dependency>` ekleyerek bağımlılığı ekleyin. En son sürüm numarasına sahip pom.xml dosyası.",
    "fBP5h": "Kullanıcı adı",
    "fEr5j": "Yeni Komut Dosyası Oluştur",
    "fTt2N": "Perl, Base64 kodlama ve kod çözme için 'MIME::Base64' modülünü gerektirir. Henüz yüklü değilse 'cpan install MIME::Base64' komutunu çalıştırarak yükleyin.",
    "fV_1P": "Kayıt olmak",
    "fdxluz": "Romen",
    "ff02c": "İptal edildi",
    "fghi6789": "Çeşitli sistemler arasında uyumluluk sağlayarak ikili dosyaları metin tabanlı formatlarda iletmek veya depolamak için kullanılır.",
    "fgj880": "Telugu dili",
    "fqV_1P": "LafTools'unuzun Kilidini Açın",
    "g1h5n": "Base45 nasıl çalışır?",
    "g2_aX": "Şifrelenmiş şifreyi dosyaya kopyala",
    "g3h5s": "Base85 nasıl çalışır?",
    "g4h7s": "C++ için Base62 işlevselliği sağlayan 'cpp-base62' kitaplığını kullanabilirsiniz.",
    "g5SK9": "Son Kullanılanları Aç",
    "g5ybh": "Bağımlılığı projenize ekleyin (Maven: 'org.Apache.commons:commons-codec').",
    "g6f0r": "Ruby'nin çekirdek kütüphaneleri için ek kuruluma gerek yoktur. 'TEST12345'i istediğiniz değerle değiştirmeniz yeterlidir.",
    "g6f0t": "Bağımlılığı projenize eklemek için 'go get github.com/mitchellh/go-base32' komutunu çalıştırın.",
    "g6v3b": "Ancak Base45'in daha büyük karakter seti, alfasayısal olmayan karakterlerle çalışırken hata olasılığını artırabilir; bu, bazı ortamlarda veya iletim kanallarında sorun olabilir.",
    "g7h5k": "Base58 nasıl çalışır?",
    "g8h7s": "Base62 nasıl çalışır?",
    "g8r3e": "Base32'nin ana dezavantajı nispeten zayıf alan verimliliğidir; giriş verilerini Base64'e göre yaklaşık %25 daha fazla genişletir. Bu, aynı miktarda kodlanmış veri için daha fazla depolama veya bant genişliği kapladığı anlamına gelir.",
    "gDjbs": "Tarihsel veri",
    "gK3dNQ": "Kopyala",
    "gQhfS": "Dosya araçları",
    "gT6re": "C++'ın yerel bir Base64 uygulaması yoktur. Bu örnek, Base64 kodlama ve kod çözme işlemini gerçekleştirmek için OpenSSL kitaplığını kullanır. OpenSSL'yi kullanmak için sisteminize kurun ve programınızı derlerken uygun kitaplıklara bağlantı verin.",
    "gU1O2": "Tetiklenmiş",
    "generic-NI-UFPTe0": "Genel Kodu Güzelleştirin",
    "generic-code-beautify.desc.2b3c": "Bu işlem, tutarlı girintileme, satır sonları uygulayarak ve dile özgü stil yönergelerine bağlı kalarak okunabilirliği artırmak için kodu çeşitli programlama dillerinde biçimlendirir.",
    "gkC8t": "Base64",
    "gkdqqC8t": "Temel45",
    "gkqC8t": "Base32",
    "gms7_9n5v": "Onaltılık bayt dizesini ham değerine geri dönüştürür.",
    "gnKMZ": "Yenilendi.",
    "h4e1b": "Ayrıca, büyük/küçük harfe duyarlı alfasayısal dizelerin, belirli bağlamlarda (URL'ler veya dosya adları gibi) sorunlara neden olabilecek alfasayısal olmayan karakterler içerebilen onaltılık veya base64 dizelerinden daha kolay işlendiği durumlar için de kullanışlıdır.",
    "h6AeI": "Websocket bağlantısı şu saatte kapatıldı: {0}",
    "h7rUq": "Node.js'de yerleşik 'Buffer' sınıfı, herhangi bir harici kütüphane gerektirmeden Base64 kodlama ve kod çözme işlemlerini gerçekleştirebilir. Bu kod parçacığı, 'TEST12345' dizesini Base64'e kodlar ve ardından kodunu çözerek orijinal dizeye geri döndürür.",
    "h9j3m": "Base32'de dolgu",
    "hAH_IjzGN": "Bu içeriden öğrenilen bir versiyondur, bu bölüm hala geliştirilme aşamasındadır.",
    "hGA96yTG4": "Bazı özellikler bu platformda desteklenmemektedir.",
    "hJUMN": "Hedef dil",
    "hMvh1": "Yedek veritabanı",
    "hRFxV": "Daha fazla bilgi için lütfen web sitemizi ziyaret edin",
    "hX1CWGAhl": "Genişletilebilir İşaretleme Dili (XML) kodunu girintiler ve güzelleştirir.",
    "hcnt1k": "Makedonca",
    "hhOT3": "Ada Göre Ara",
    "hij90klm": "Base32 daha küçük bir alfabe (A-Z2-7) kullanır, bu da daha uzun ancak insan tarafından daha okunabilir dizelerle sonuçlanır.",
    "htTmvWjsS": "Basamaklı Stil Sayfaları (CSS) kodunu sıkıştırır.",
    "htt1d2": "Esperanto",
    "hu-iz": "Zamanlayıcı",
    "huE6U": "Değişken",
    "hyV-d": "Tamamlamak",
    "hyirc0": "İsveççe",
    "i27qmr": "Frizce",
    "i6hMN": "Resim Doğrulama Kodu",
    "i7w2m": "Popüler programlama dillerinde yerleşik Base45 kütüphaneleri var mı?",
    "i88tb": "Sonucu Dosyaya Aktar",
    "i8q8tb": "Giriş için WorkFlow'u Yapılandırma",
    "i9o7k": "Base32'nin Base64'e göre avantajları",
    "iNQvo": "Başlamak için bir örnek gösterin.",
    "iNqF1T": "Bulut Hesabını Yönet",
    "iOEjZ": "Kullanılabilir Kod Yok",
    "iQL2c": "Hala bu düğmenin tüm işlevlerini araştırıyoruz; onu nasıl geliştirebileceğimize dair herhangi bir geri bildiriminiz veya öneriniz varsa lütfen bize bildirin!",
    "i_lang_": "Dil Paketleri",
    "iknTS": "Şifre Yöneticisi",
    "init_env": "Sistem Kaynakları Yükleniyor",
    "ip2g1": "Kopyalandı",
    "ipOSQE": "Profesyonel Sürüm",
    "it8ths": "Endonezya dili",
    "ixyP0": "Gerçek zamanlı eylemi otomatik olarak işleme",
    "j1b5k": "Base32'yi içeren en yaygın işlemler arasında ikili verilerin bir Base32 dizesine kodlanması ve bir Base32 dizisinin kodunun orijinal ikili formatına geri çözülmesi yer alır.",
    "j4s6r": "Base62'yi JavaScript'te nasıl kodlayabilirim/kod çözebilirim?",
    "j5s7r": "Base85'i JavaScript'te nasıl kodlayabilirim/kod çözebilirim?",
    "j6s3r": "Base58'i JavaScript'te nasıl kodlayabilirim/kod çözebilirim?",
    "j7k2t": "Verileri Base45 ile kodlamak için Base45 algoritmasını uygulayan bir kitaplığa veya işleve ihtiyacınız vardır.",
    "j8s6r": "Kotlin için Base45 işlevselliğini içeren 'barcode-core' kütüphanesini kullanabilirsiniz.",
    "j9s5r": "C# için Base62 kodlama ve kod çözme işlemlerini gerçekleştirmek üzere 'WarrenStranger.Base62' kitaplığını kullanın.",
    "jJuNz": "Kaynak dil",
    "jO5eP": "TAMAM",
    "jPNCb": "Yeniden denendi.",
    "jQXdi": "Işık Modu",
    "jR1zX": "Yapay Zeka Laboratuvarı",
    "jRzgS": "Swift'in Foundation çerçevesi, Base64 kodlama ve kod çözme için yerleşik yöntemler içerir. Harici kütüphanelere gerek yoktur; bu özellikleri kullanmak için 'Temel'i içe aktarmanız yeterlidir.",
    "jZvLJ": "PHP, Base64 işlemlerini gerçekleştirmek için 'base64_encode()' ve 'base64_decode()' yerleşik işlevleriyle birlikte gelir. Bu işlevler kolayca kullanılabilir ve ek kurulum veya kurulum gerektirmez.",
    "jaj7M": "Her hakkı saklıdır.",
    "jb392": "İsim",
    "jfpqt": "Not Gezgini",
    "jgDoEq": "SSS Verisi Yok",
    "jhDoE": "SSS Verilerini Alma",
    "jlxvpk": "Koreli",
    "json-beautify.desc.0912": "Bu işlem, tutarlı bir şekilde uygun girintiler, satır sonları ve sıralama anahtarları ekleyerek okunabilirliği artırmak için JSON verilerini formatlar.",
    "json-beautify.name.0912": "SQL'i biçimlendir",
    "json-beautify.text.93kq": "JSON Verilerini Güzelleştirin",
    "k17PG": "Websoket bağlantısı kapatıldı.",
    "k1m4e": "Ancak alfabesinde daha az karakter kullandığı için Base64 veya Base32 ile aynı alan verimliliğini sunmuyor.",
    "k2SVY": "kapalı",
    "k2em5e": "Bu, aynı miktarda giriş verisi için daha kısa çıkış dizeleriyle sonuçlanır; bu da boyutun en aza indirilmesinin kritik olduğu senaryolarda faydalı olabilir.",
    "k2ku5p": "Çek",
    "k3m2e": "Sağlanan şablonu yeni bir Go dosyasına kopyalayın, yer tutucuyu gerçek kodlanmış değerle değiştirin ve ardından \"go run yourfile.go\"yu kullanarak dosyayı çalıştırın.",
    "k41a5": "LafAraçlar",
    "k4s5rx": "Slovence",
    "k7d9f": "Ruby'nin yerleşik 'base32' kitaplığı, Base32 kodlama ve kod çözme için yöntemler sağlar.",
    "k7d9r": "'go-base32' paketi, Go'da Base32 kodlama ve kod çözme yetenekleri sağlar.",
    "k7g0n": "Base32'de, her 5 bitlik giriş verisi 'ABCDEFGHIJKLMNOPQRSTUVWXYZ234567=' kümesindeki 32 karakterden biriyle eşlenir.",
    "k9em5e": "Bu, okunabilirlikten ödün vermeden kısa, URL dostu bir tanımlayıcının gerekli olduğu senaryolar için idealdir.",
    "k9jtr": "Node.js'de Base32 kodlama ve kod çözme için 'base32-encoding' npm paketi kullanılır.",
    "kLH79": "E-posta",
    "kOi5A": "Sayfayı yazdır",
    "kPD22": "Sözlük",
    "kPJ-A4": "Yenile",
    "kZd9G": "Ruby, Base64 kodlama ve kod çözme yöntemleri sağlayan yerleşik bir 'base64' kitaplığına sahiptir. Komut dosyanıza 'require \\\"base64\\\"' içeren kütüphaneyi ekleyin.",
    "kcHxr": "Lütfen yönetici hesabı kullanıcı adını buraya girin",
    "kjks1": "Yerel sunucu API'sinden i18n yapılandırmasını alma",
    "kqv5ht": "Yidiş",
    "krxSK": "Yapay Zeka Asistanı",
    "ks12d": "Siber güvenlik",
    "kv4wag": "Flemenkçe",
    "l1p9z": "Base32 nedir?",
    "l3akoa": "Amharca",
    "l6Djb": "Tercih ettiğiniz tema olarak seçeneklerden birini seçin:",
    "lIn3_": "Yönetici Kullanıcı Adı",
    "lQFII": "Başlatmayı yeniden tetikleyin",
    "lRHDQ": "Tam Ekran Modundan Çık",
    "lUh5c": "Jeneratör",
    "lkuulh": "Fransızca",
    "lp0qmd0": "Favori olarak işaretle",
    "lpKAz": "Ayarlar",
    "lpzg83": "Samoalı",
    "lzGS2": "Uzantı Detayı",
    "m0106": "Dönüştürücü",
    "m0107": "jeneratör",
    "m0108": "Biçimlendirici",
    "m6d8b": "Her 5 bitlik değer, tek bir karakterle temsil edilir ve sekizlilerle (8 bitlik birimler) çalışmayı tercih eden sistemler için verimli kodlama ve kod çözme olanağı sağlar.",
    "m6t1b": "Daniel R. Collins'in 'base32' kitaplığı, C++'da Base32 kodlama ve kod çözme işlevselliği sağlar.",
    "m7WZw": "Sistem Web Soketi Bozuk",
    "m8rTc1": "Kabuk komut dosyaları yöneticisi uygulandıktan sonra, bunu kabuk komutlarınızı yönetmek için kullanabilirsiniz.",
    "m9k1z": "Bununla birlikte, kodu çözülen veriler belirli uygulama anlamlarını içeriyorsa (örneğin, belirli QR kodu formatları), kod çözme sonrasında ek işlemler gerekli olabilir.",
    "mBgF1": "Fare Eylemi",
    "mSFei": "GitHub'daki Kaynak Kodu",
    "mWXeh": "Çalışma Alanı Kimliği: {0}",
    "mabHq": "Eski Dosyaları Bul",
    "mbzCv": "Bir Hata oluştu: {0}, reddedilen zaman: {1}",
    "md2.desc.1039": "Bu işlem, verileri bir {0} karmasına dönüştürür.",
    "md2.text.192d3": "{0} Karma Oluştur",
    "md2aO2NaJITm": "Basamaklı Stil Sayfaları (CSS) kodunu girintiler ve güzelleştirerek okunmasını ve anlaşılmasını kolaylaştırır.",
    "md4.desc.1039": "Bu işlem, verileri bir {0} karmasına dönüştürür.",
    "md4.text.192d3": "{0} Karma Oluştur",
    "md5-cpp-install-openssl-0002": "OpenSSL'yi sisteminize yükleyin ve C++ uygulamanızı oluştururken 'libssl' ve 'libcrypto' kitaplıklarına bağlantı verin.",
    "md5-cpp-openssl-0001": "C++, MD5 karmalarını oluşturmak için OpenSSL kitaplığını kullanır. OpenSSL'i kurmanız ve projenizde buna karşı bağlantı kurmanız gerekir.",
    "md5-cpp-use-openssl-0003": "Parçacık, bir giriş dizesi alan, OpenSSL'in MD5 API'sini kullanarak MD5 karma değerini hesaplayan ve karma değerini onaltılık bir dize olarak döndüren bir 'getMD5' işlevi oluşturur. Bu kodu C++ programınıza yapıştırın ve istediğiniz girişle 'getMD5' işlevini çağırın.",
    "md5-csharp-built-in-0001": "C#'ta, MD5 karmalarını oluşturmak için 'System.Security.Cryptography.MD5' sınıfı kullanılır.",
    "md5-csharp-no-install-0002": ".NET Framework/Core'un bir parçası olduğundan harici kitaplık kurulumuna gerek yoktur.",
    "md5-csharp-use-0003": "Bu kod parçası bir MD5 örneği oluşturur, giriş dizesini bayta dönüştürür, karma değerini hesaplar ve son olarak karma değerini Base64 biçiminde kodlar. Bu kodu C# uygulamanızın giriş noktasına yerleştirin ve Base64 kodlu MD5 karmasını elde etmek için çalıştırın.",
    "md5-java-built-in-0001": "Java, MD5 karmalarını oluşturmak için 'java.security.MessageDigest' sınıfını kullanır.",
    "md5-java-imports-0002": "Sonucu karma oluşturmak ve kodlamak için 'java.security.MessageDigest' ve 'java.util.Base64' dosyalarını içe aktarmanız gerekir.",
    "md5-java-use-0003": "Parçacık, MD5 özet algoritmasının bir örneğini alır, onu giriş dizesinin baytlarıyla günceller ve ardından elde edilen karmayı bir Base64 dizesine kodlar. Bu kodu bir Java sınıfına kopyalayın ve Base64 kodlu MD5 karmasını elde etmek için ana yöntemini çalıştırın.",
    "md5-nodejs-built-in-0001": "Node.js'de, MD5 karmalarını oluşturmak için yerleşik 'kripto' modülü kullanılır.",
    "md5-nodejs-no-install-0002": "'Cryto', Node.js ile önceden yüklenmiş olarak geldiğinden harici kitaplık kurulumu gerekmez.",
    "md5-nodejs-use-0003": "Parçacık, `createHash('md5')` kullanarak bir karma nesnesi oluşturur, onu giriş dizesiyle günceller ve ardından `.digest('hex')` yoluyla özeti onaltılık biçime dönüştürür. Bu kodu Node.js betiğinize yapıştırın ve giriş değerinin MD5 karmasını almak için çalıştırın.",
    "md5-php-built-in-0001": "PHP'de MD5 karmaları oluşturmak için yerleşik bir 'md5()' işlevi vardır.",
    "md5-php-no-install-0002": "'md5()' PHP'de önceden kurulu olarak geldiğinden harici kütüphane kurulumuna gerek yoktur.",
    "md5-php-use-0003": "Bu basit örnek, sağlanan giriş dizesinde PHP 'md5()' işlevini çağıran bir 'getMD5' işlevini tanımlar. Bu kodu bir PHP dosyasına kopyalayın, .php uzantısıyla kaydedin ve giriş değerinin MD5 karmasını görmek için bir web sunucusunda veya komut satırı aracılığıyla çalıştırın.",
    "md5-python-built-in-0001": "Python, MD5 karmalarını oluşturmak için yerleşik 'hashlib' kitaplığını kullanır.",
    "md5-python-no-install-0002": "'Hashlib' Python ile standart olarak geldiğinden ek kurulum gerekmez.",
    "md5-python-use-0003": "Sağlanan şablon, bir MD5 karma nesnesi oluşturmadan önce giriş dizesini bayt olarak kodlar. Daha sonra MD5 karma değerini onaltılık biçimde almak için karma nesnesinde '.hexdigest()' yöntemi çağrılır. Bu kodu bir Python betiğine kopyalayın ve MD5 karmasını elde etmek için çalıştırın.",
    "md5.desc.rxsHq": "Bu işlem, verileri bir {0} karmasına dönüştürür.",
    "md5.textiDjMIo": "{0} Karma Oluştur",
    "md6.desc.1039": "Bu işlem, verileri bir {0} karmasına dönüştürür.",
    "md6.text.192d3": "{0} Karma Oluştur",
    "meeMC1Uk7.text.93kq": "{0}'ı küçült",
    "mihc3": "Bu işlemi tamamladı",
    "mjHoR": "Ayrıca teknik olarak hiç kimse bu jetonu okuyamaz, aksi halde bilgisayarınıza saldırıp kontrol etmiş demektir.",
    "mnb19i": "Almanca",
    "mno34567": "Base64'ün Avantajları",
    "mnoijklm": "Başka BaseXX kodlamaları var mı?",
    "mslw4o": "Yunan",
    "mwn7iv": "Zuluca",
    "myxedr": "Moğolca",
    "n0pqrstu": "Base64'ün örnek kullanımı",
    "n1jA9": "Onaylamak",
    "n24tes": "Portekiz Brezilyası)",
    "n3e7r": "Base32'nin Tarihçesi",
    "n94an4": "Lehçe",
    "n98EW": "Giriş bölgesi ve çıkış bölgesinin metnini değiştirin.",
    "nSeIq8-": "En önemlisi ücretsiz ve açık kaynaktır. Kişisel veya ticari amacınız için kullanabilirsiniz.",
    "nTvw4": "Verilerinizi ve ayarlarınızı korumak ve ayrı olarak kaydetmek için yerel hesabınızı kullanabilirsiniz. Ayrıca LafTools gelecekte kullanıcılar arasında anlık mesaj widget'larını da destekleyecektir.",
    "nmb1wx": "Yoruba",
    "nodBw": "Bu işlem ham verileri bir ASCII {0} dizisine kodlar.",
    "nopqrs01": "Base64 kompaktlık için optimize ederken, manuel giriş gibi giriş hatalarının en aza indirilmesi kritik öneme sahip olduğunda Base32 seçilir.",
    "nrix6l": "Çiçeva",
    "nxJC7": "Transformatör gerçekleştirildiğinde yürütülecek varsayılan eylem.",
    "o1umzi": "Fransızca",
    "o52xW": "İhracat",
    "o8xyzu": "Lüksemburgca",
    "oBz8D": "Yükleniyor",
    "oNLxH": "Kullanıcı adı",
    "oNg3f": "Resmi internet sitesi",
    "ocxsw3": "İrlandalı",
    "of_ox": "Sonuç olarak, LafTools tüm ihtiyaçlarınız için tek elden çözümdür.",
    "oj23X": "Veritabanını Geri Yükle",
    "ojCWEFdVe": "Gereksiz tüm karakterleri kaldırarak JavaScript kodunu sıkıştırır.",
    "ooiFU": "Java Hizmetini yeniden başlatın",
    "oqHqVq": "Göre sırala",
    "oqHqqV": "Toplam: {0} Komut",
    "oqHqqVq": "Kopyalama Zamanları",
    "oqjbcj": "Lao",
    "os8h6u": "Danimarka",
    "p5e9n": "Kütüphaneyi Gradle derleme betiğinize bağımlılık olarak ekleyin. Örneğin, uygulama düzeyindeki build.gradle dosyasına, en son sürüm numarasıyla birlikte `implementation 'com.bottlerockettudios:barcode-core:...'' ekleyin.",
    "p6e3n": "Paketi, Paket Yönetici Konsolu'nda 'Install-Package WarrenStranger.Base62'yi çalıştırarak NuGet aracılığıyla yükleyin veya NuGet Paket Yöneticisi aracılığıyla ekleyin.",
    "p8Exxc1s": "Yapay Zeka Laboratuvarında görevleri daha verimli bir şekilde gerçekleştirmek için yapay zeka teknolojilerinden yararlanan çeşitli araçlar vardır.",
    "p8eq9n": "JavaScript'te Base85 kodlama ve kod çözme için 'base85' veya 'ascii85' gibi kütüphaneleri kullanabilirsiniz.",
    "p9e1n": "JavaScript'te Base62 kodlama ve kod çözme için 'base-x' veya 'base62' gibi kitaplıkları kullanabilirsiniz.",
    "p9s5t": "Base32, JavaScript'e yaptığı katkılarla tanınan Douglas Crockford tarafından 2001 yılında geliştirildi. Özellikle ikili verilerin metin tabanlı temsillerini gerektiren durumlar için Base64 gibi mevcut kodlamalara daha güvenilir bir alternatif olarak oluşturuldu.",
    "pANmj": "Etiketler sunucu türlerine, komut dosyası kullanımlarına veya tercih ettiğiniz diğer kriterlere göre tanımlanabilir.",
    "pA_deJ": "Panoya Aktar",
    "pA_feeJ": "Terminali Yeniden Bağlayın",
    "pA_qweJ": "Tamponu Temizle",
    "pDBSWq": "sağ panel için mevcut içerik yok",
    "pEk1kk": "LafTools burada sizin için faydalı işlevler sunuyor.",
    "pEk1qkk": "Açılan tüm sekmeleri listele",
    "pHZDB": "Gerçek Zamanlı Eylem",
    "pJoOz": "Açık dosya",
    "pKHRT": "Araçlara Git",
    "pKqHRq": "Notlarda Ara",
    "pL6qH": "Tamamlanmış.",
    "pZ4d616m-": "{0}'ı güzelleştir",
    "ph5jH": "Bu kısmı işlemek",
    "piih4x": "Tacikçe",
    "pmAee": "Bu araç hakkında daha fazla bilgi edinin.",
    "pmnp4b": "Ukrayna",
    "ppmz8e": "Haiti Kreyolu",
    "pq5e9n": "JavaScript'te Base58 kodlama ve kod çözme işlemini gerçekleştirmek için 'bs58' gibi kitaplıkları kullanabilirsiniz.",
    "pqrs890t": "Evrensel Uyumluluk: Base64, tüm önemli programlama dillerinde yaygın olarak tanınmakta ve desteklenmektedir.",
    "pqs7y3": "Tam tuş haritası desteğine sahip olmak için lütfen bu web sayfasını PWA olarak kaydetmeyi düşünün.",
    "psA_eJ": "Dosya Olarak Dışa Aktar",
    "psZoP": "Dosyaları işlemek için buraya bırakın",
    "psqqpq_o": "Tamam, sonuç panonuza {0} kez kopyalandı.",
    "pzn2IpkDo": "JavaScript Nesne Gösterimi (JSON) kodunu girintiler ve güzel bir şekilde yazdırır.<br><br>Etiketler: json görüntüleyici, güzelleştirme, sözdizimi vurgulama",
    "q12beqwR": "Kullanılabilir Araç Yok",
    "q29t31": "Lehçe",
    "q2n3r": "Bugün, PDF belgeleri ve belirli ağ protokolleri gibi alan verimliliği ve okunabilirliğin önemli olduğu çeşitli uygulamalarda kullanılmaktadır.",
    "q2n9r": "Eklendikten sonra sağlanan şablonu bir Swift dosyasına kopyalayın. Bu örnekte Base45 dizesinin base64 temsiline sahip olduğunuz varsayımsal bir senaryo kullandığımızı unutmayın; kodu çalıştırmadan önce bunu gerçek kodlanmış değerle değiştirin.",
    "q2w5m": "Base32'yi kullanmanın amacı?",
    "q2x8k": "Kullanımı, insan tarafından okunabilen, hataya dayanıklı dizelerin istendiği diğer kripto para birimlerine ve senaryolara kadar genişledi.",
    "q5h8n": "Ana avantajı, aynı miktarda kodlanmış veri için dize uzunluğunun azaltılmasıdır, bu da onu alan verimliliğinin kritik olduğu uygulamalar için uygun hale getirir.",
    "q6n1r": "Kitaplığı yükledikten sonra şablon kodunu bir Java sınıfına kopyalayın ve kodu çalıştırmadan önce yer tutucuyu gerçek Base85 kodlu değerle değiştirin.",
    "q7n3r": "Aynı zamanda 'O' ve '0', 'I' ve 'l' gibi insan transkripsiyon hatalarına yol açabilecek belirsiz karakterleri de önler.",
    "q9iuti": "Galce",
    "qDrbEr": "Girdiğiniz kullanıcı adı boş, lütfen kontrol edip tekrar deneyin.",
    "qF4uS2": "Çalışma Alanı Oluştur",
    "qF4uS23": "Yeni Pencere",
    "qHoktx": "Teşekkür ederim!",
    "qN1LdZ2": "Son düzenleme",
    "qQmBr": "Metin Çevirisi",
    "qTqyvWdY": "Henüz bitmedi",
    "qWemXE4": "1 Ocak 2024",
    "qWw3eTH": "Bu bölüm, yerel diskinizdeki veya bulut diskinizdeki dosyaların korunmasına yardımcı olur.",
    "qdeFXx": "Şu anda aradığınız bu sayfa henüz tam olarak uygulanmadı.",
    "qpDBSW": "kullanılabilir panel yok",
    "qpDBSWe1": "kullanılabilir panel yok",
    "qqK_x_": "Kayıt olmak",
    "qqqwYoz": "Yardım",
    "qqwYoz": "Sekmeler",
    "qqwYqwe": "Çalışma alanları",
    "qrstuvwx": "Evet, Base64 ve Base32'nin yanı sıra her biri farklı senaryolara göre tasarlanmış Base16 (Hexadecimal), Base58 ve Base85 de mevcut.",
    "qtpmvP": "Yerel Parolayı Doğrulayın",
    "qubSJ": "Uzantı VM'si kimlik değildir. (REF: IQnMH).",
    "qv1p5n": "Örneğin Java'da verilerinizi kodlamak için 'org.iso.base45' kitaplığını kullanabilirsiniz.",
    "qzshys": "Urduca",
    "r1GLS": "Etiketler",
    "r2n7v": "Ana avantajı, benzer görünen karakterlerin hariç tutulması ve manuel giriş sırasındaki hataların azaltılması nedeniyle okunabilirliğin artmasıdır.",
    "r4n6v": "'go get github.com/xyproto/base62' komutunu çalıştırarak projenize bağımlılığı ekleyin. Bu paketi indirip yükleyecektir.",
    "r6nq2v": "Base62'nin birincil avantajı, Base32'den daha büyük karakter seti nedeniyle artan alan verimliliğidir ancak Base64'te alfasayısal olmayan karakterler bulunmaz.",
    "r8c6z": "'TEST12345'i kendi dizenizle değiştirin ve sonuçları görmek için bu sınıfı bir Java programı olarak çalıştırın.",
    "r8y2w": "'Base32' PHP kütüphanesi burada Base32 kodlama ve kod çözme için kullanılır.",
    "r9a3t": "Base45, ikili verileri ASCII karakterlerine kodlayan metin tabanlı bir kodlama şemasıdır.",
    "r9qn8v": "Base85'in ana avantajı, daha büyük karakter seti (Base64'te 85'e karşı 64 veya Base32'de 32) nedeniyle geliştirilmiş alan verimliliğidir.",
    "rE6fUsSGl": "Yapılandırılmış Sorgu Dili (SQL) kodunu girintiler ve güzelleştirir.",
    "rK6cx": "{0}, LafTools ekibi tarafından tasarlanıp geliştirildi",
    "rLXJN": "Kotlin'de Base64 kodlama ve kod çözme için Android'in yerleşik 'android.util.Base64' sınıfı kullanılabilir. Bu örnekte bir Android ortamı varsayılmaktadır; Android olmayan Kotlin projeleri için 'java.util.Base64' kullanmayı düşünün.",
    "rQkas": "LafTools'a hoş geldiniz",
    "rR1vd": "Dosyadan Giriş",
    "rT34qnO": "İşlenecek metni girin. Sonuç çıktı düzenleyicisinde görüntülenecektir.",
    "rVqlu": "{0} kodunu çöz",
    "rYSpwq": "MD2 (Message-Digest 2) algoritması, 1989 yılında Ronald Rivest tarafından geliştirilen bir kriptografik karma işlevidir. Algoritma 8 bit bilgisayarlar için optimize edilmiştir. MD2 artık güvenli olarak kabul edilmese de 2014 yılı itibarıyla bile halka açık olarak kullanılmaya devam etmektedir. MD2 ve RSA ile oluşturulan sertifikaların bir parçası olarak temel altyapılar. Mesaj özeti algoritması varsayılan olarak 18 turdan oluşur.",
    "r_n6h": "Açık veya Koyu Mod",
    "rf0mql3": "Açık veya Koyu Tema",
    "rpG0G": "Geri bildiriminize değer veriyoruz ve ürünümüzü nasıl geliştirebileceğimize dair düşüncelerinizi duymaktan memnuniyet duyarız; lütfen geri bildiriminizi bizimle paylaşmaktan çekinmeyin!",
    "rub76Z8zx": "C, C++, C#, Java, PHP, JavaScript vb. gibi C tarzı dilleri güzel bir şekilde yazdırmaya çalışır. Bu mükemmel bir iş çıkarmaz ve ortaya çıkan kod artık çalışmayabilir. Bu işlem tamamen gizlenmiş veya küçültülmüş kodun okunmasını ve anlaşılmasını daha kolay hale getirmek için tasarlanmıştır. Düzgün çalışmayacak şeyler: Döngü biçimlendirmesi için, Do-While döngü biçimlendirmesi, Switch/Case girintisi, Bazı bit kaydırma operatörleri",
    "run_text": "Tezgahınıza girmeden önce öncelikle gerekli sistem kaynaklarını önceden yüklemek istiyoruz. Lütfen bir süre bekleyiniz, kısa sürede tamamlanacaktır. Detayları aşağıdaki gibidir.",
    "rycJy": "LafTools, programcılar için özel olarak tasarlanmış çok yönlü bir araç kutusudur. CodeGen Araç Kutusunun ikinci versiyonunu temsil ediyor ve artık Golang ve JavaScript ile yazılmış daha hafif bir çalışma zamanı sunuyor.",
    "ryhkqb": "Bulgarca",
    "s-fxP80Dd": "LafTools IDE",
    "s0vrf9": "İbranice",
    "s1b3m": "Base64 veya Base32'den farklı olarak, kolayca karıştırılan '0', 'O', 'I' ve 'l' karakterlerini hariç tutar, bu da onu URL'ler ve QR kodları için uygun hale getirir.",
    "s3e6r": "Base45'i kullanarak verileri nasıl kodlayabilirim?",
    "s4OeX": "Sisteme başarıyla giriş yapın",
    "s5b8m": "'TEST12345'i kendi verilerinizle değiştirin ve Base32 işlemlerini gerçekleştirmek için bu betiği bir PHP ortamında çalıştırın.",
    "s5e8r": "'TEST12345'i gerçek verilerinizle değiştirin ve Base32 işlemlerini gerçekleştirmek için bu pasajı Swift uygulama bağlamında çalıştırın.",
    "s5t0n": "Base32'deki dolgu, kodlanmış verilerin son yığınının hala 8 bitin katlarını içerdiğinden emin olmak için '=' karakterlerinin eklenmesini içerir. Ancak Base64'ten farklı olarak Base32 dolgusu minimum düzeydedir çünkü her Base32 karakteri zaten 5 bit kodlamaktadır.",
    "s7e9r": "Harici kütüphanelere ihtiyaç yoktur. Kodlamak/kodunu çözmek için 'b'TEST12345''i gerçek bayt benzeri nesnenizle değiştirmeniz yeterlidir.",
    "sBxHr": "Scala, Base64 işlemleri için Java'nın yerleşik 'java.util.Base64' sınıfını kullanır. Java 8 veya üzeri bir JVM platformunda çalıştığınızdan emin olun.",
    "sHoxxW": "Tarih",
    "sKx5t": "Java'nın Java 8'den beri mevcut olan yerleşik 'Java.util.Base64' sınıfı, Base64 kodlama ve kod çözme için yöntemler sağlar. Giriş dizesi, UTF-8 kodlaması kullanılarak bayta dönüştürülür, ardından gerektiği şekilde kodlanır ve kodu çözülür.",
    "sO0MOe": "Bir pencerede 5 saniyeden fazla kaldığınızda burada gösterilir.",
    "sR8yc": "Kapalı",
    "sc49my": "Sindhi",
    "sdfk1": "Sekmeleri sola kaydır",
    "sdfk13": "Sekmeleri sağa kaydır",
    "sglMS": "Zaman yarat",
    "sk123": "Henüz bitmedi",
    "slqcWD": "Bu mantık kısmı henüz desteklenmiyor, lütfen takipte kalın.",
    "sojBI": "Dönüştürmek",
    "spCqEa": "YAPMAK",
    "spdh98": "Basitleştirilmiş Çince",
    "ssDaOq": "LafTools'ta yeni misiniz?",
    "ssm80i": "Bask",
    "svqh06": "Azerice",
    "sys_updates": "En Son Sistem Güncellemeleri",
    "t63Qw": "Azletmek",
    "t6wczq": "Xhosa",
    "t7m4g": "'base32' sandığı, Rust'ta Base32 kodlama ve kod çözme için kullanılır.",
    "t84q1z": "Ermeni",
    "t8c6xc": "Somalili",
    "t8z1v": "Sonunda 5 bitlik bir grubu doldurmaya yetecek kadar bit kalmadığında, dolgu karakterleri '=' eklenir. Örneğin, bir bayt için iki Base32 karakteri gerekir ve 3 baytlık bir dizi için dört Base32 karakteri gerekir.",
    "t9m3g": "CryptoSwift, Base32 kodlama ve kod çözme işlevini içeren popüler bir Swift paketidir.",
    "tBIX-d": "pencereler",
    "tEiv_": "Uzantı Ayrıntısını Alma",
    "tIy3Q": "Bir hatayla karşılaşıldı",
    "tIyq3Q": "Bir hatayla karşılaşıldı",
    "tR8pY": "Go, Base64 kodlama ve kod çözme işlevlerine sahip standart bir 'encoding/base64' kitaplık paketi sağlar. Hiçbir dış bağımlılığa gerek yoktur; bu paketi Go programınıza aktarmanız ve uygun işlevleri çağırmanız yeterlidir.",
    "tWe1yF": "Kullanılabilir kabuk komutu yok.",
    "tY3p1": "Daha fazla bilgi",
    "tiaiB": "İptal etmek",
    "tn7duf": "Hırvat",
    "trywithclassicalwebui": "Klasik Web Kullanıcı Arayüzü ile deneyin",
    "ttAre": "Düz metin şifrenizi buraya girin",
    "tuv23456": "Base64 URL güvenli varyantı",
    "twamg": "Yapay Zeka Asistanı, Yaratıcılığınızı Güçlendiriyor",
    "tyhgpr": "Cava",
    "u1i2b": "Base85'i Base64 veya Base32'ye göre kullanmanın avantajları nelerdir?",
    "u2l8s": "Base45 nedir?",
    "u3i8b": "Base62 kullanmanın Base64 veya Base32'ye göre avantajları nelerdir?",
    "u3j9p": "Base32 genellikle dosya bütünlüğü kontrolleri, geocaching ve güvenli şifre oluşturma gibi durumlarda bilgi kaybı olmadan yazılabilen veya yazdırılabilen ikili verilerin kompakt bir metinsel temsiline ihtiyaç duyduğunuzda kullanılır.",
    "u7i9b": "Go için GitHub'da bulunan 'base62' paketini kullanın.",
    "u7vwx8yz": "Ortak Base64 işlemleri",
    "u8i5b": "Base58'i Base64 veya Base32'ye göre kullanmanın avantajları nelerdir?",
    "u9g6t": "JavaScript'te Base85 kodlama ve kod çözme için 'base85' paketini yüklemeniz gerekir.",
    "uCEe8": "Gerçek Zamanlı Dönüşüm",
    "uFcDQ": "Durum verileri başlatılıyor...",
    "uV5Bi": "Uzantı Yüklenemiyor",
    "uVseB": "Kısayol tuşu listesini göstermek için {0} tuşuna basın",
    "uW7eZ": "C'de yerel Base64 uygulaması yoktur. Bu örnek, Base64 kodlama ve kod çözme için OpenSSL kitaplığını kullanır. Bu kod pasajını kullanmak için sisteminize OpenSSL yükleyin ve programınızı derlerken 'gcc -o base64_example base64_example.c -lssl -lcrypto' benzeri bir komut kullanarak uygun kitaplıklara bağlantı verin.",
    "ucDLv": "Bu kaydı {0} kez kopyaladınız",
    "ui5pZ": "Komut Ayrıştırıcı",
    "ulah0q": "Japonca",
    "unc9E": "Rastgele Metin",
    "usr_defined": "Sistem Tercihleri",
    "uvwxyza1": "Veri Kaybı Yok: Base64 kodlaması geri dönüşümlü bir işlem olduğundan herhangi bir bilgi kaybına neden olmaz.",
    "uwqGE": "Araçlara Git",
    "v3k5r": "Karakter seti tüm büyük ve küçük harfleri (A-Z, a-z) ve rakamları (0-9) içerir ve Base64 veya Base32'ye kıyasla daha kompakt bir gösterim sağlar.",
    "v4k6r": "Daha büyük bir karakter seti kullanarak verileri Base64 veya Base32'ye göre daha kompakt bir biçimde kodlar.",
    "v4n9t": "Base58, ikili verileri alfasayısal karakter dizisi olarak temsil eden bir kodlama şemasıdır.",
    "v5k3r": "Kurulduktan sonra kod çözme bölümündeki yer tutucuyu gerçek Base85 kodlu dizeyle değiştirin ve komut dosyasını çalıştırın. Kütüphane, Tamponlar ve Base85 dizeleri arasındaki dönüşümü yönetir.",
    "v6qkl": "BouncyCastle NuGet paketi, C# dilinde Base32 kodlama ve kod çözme sağlar.",
    "v7q3db": "Tay dili",
    "v9b7t": "'TEST12345'i kendi dizenizle değiştirin ve Base32 kodlama ve kod çözme işlemlerini gerçekleştirmek için bu konsol uygulamasını çalıştırın.",
    "vOjNC": "Şifreyi veya güvenli anahtarı girin",
    "vTsQU": "Lütfen yöneticinizden aldığınız davetiye kodunu sağlayın",
    "vU17B": "İstek gönderilemiyor",
    "vWqac": "Tezgahınıza girmeden önce öncelikle gerekli sistem kaynaklarını önceden yüklemek istiyoruz. Lütfen bir süre bekleyiniz, kısa sürede tamamlanacaktır. Detayları aşağıdaki gibidir.",
    "vaP0vq": "Yerel şifreyi başarıyla ayarlayın.",
    "vci8rd": "Flemenkçe",
    "vh9j4": "Giriş",
    "vo1prl": "İspanyol",
    "vr93oi": "Fince",
    "vrfjnf": "İtalyan",
    "vwx1yza2": "Bir örnek, bir görüntü dosyasını bir HTML <img> etiketine gömmek için kodlamaktır:",
    "w1ANqKoBf": "Kenar Çubuğundaki Metni Gizle",
    "w1x4k": "Evet, Ascii85 (PostScript ve PDF'de kullanılır), Z85 (ZeroMQ) ve UUencode (eski bir format) dahil olmak üzere çeşitli varyantlar mevcuttur. Her birinin biraz farklı karakter seti ve kuralları vardır.",
    "w2x9qk": "Base62'nin kendisi önemli bir değişkene sahip olmasa da, Base64'te yaygın olarak kullanılan '+' veya '/' hariç olmak üzere bazı uygulamalar, karakter seti seçimlerinde biraz farklılık gösterebilir.",
    "w3x7k": "Evet, bazı popüler varyantlar arasında, Bitcoin'de yaygın olarak kullanılan, hata tespiti için bir sağlama toplamı ekleyen Base58Check bulunmaktadır.",
    "w6otqn": "Korsikalı",
    "w92j07": "Rusça",
    "w9qudj": "Pencap",
    "wAxtg": "Başlangıçta, bu kurulumu yapabilmeniz için yetkili jeton olarak bir UUID oluşturduk. LafTools'un aldığı bilgilere göre sağladığınız jeton {0}, LafTools tarafından başarıyla doğrulandı ve sonuç olarak bu formu kurmaya devam edebilirsiniz.",
    "wI1eh": "Sonraki",
    "wQYoz": "Dosya",
    "wQdYoz": "Düzenlemek",
    "wQdqwYoz": "Görüş",
    "wcl1K": "Kullanım",
    "wgkk6y": "Malta dili",
    "wj3VS": "Bu işlem, bir ASCII {0} dizesindeki verilerin kodunu çözerek ham biçimine geri döndürür.",
    "wsWcXd": "Bildirimler",
    "wxyzabcd": "Base64'ün, '+' yerine '-' ve '/' yerine '_' koyan ve '=' dolgusunu atlayarak onu web URL'leri için uygun hale getiren URL güvenli bir sürümü vardır.",
    "x009": "Kullanım belgelerimize erişmek için",
    "x2c5e": "Python, Base85 kodlama ve kod çözmeyi destekleyen yerleşik bir 'base85' modülüne sahiptir.",
    "x2z6r": "Base58 nedir?",
    "x5alzu": "Kürtçe (Kurmanci)",
    "x5tHV": "sistem görünümü",
    "x5z1b": "Base45, öncelikli olarak dijital COVİD sertifikaları kapsamında QR kod kullanımı için geliştirildi.",
    "x6v2w": "C'de standart bir Base32 kitaplığı yoktur, dolayısıyla burada varsayımsal bir 'libbase32' kitaplığı kullanıyoruz.",
    "x7n1m": "Base62, ikili verileri 62 alfanümerik karakter dizisi olarak temsil eden bir kodlama şemasıdır.",
    "x8mdg": "Python'un yerleşik 'base64' modülü, 'b32encode' ve 'b32decode' işlevleri aracılığıyla Base32 kodlama ve kod çözme sağlar.",
    "x9g7e": "Kaynak kodunu GitHub'dan (https://github.com/dankamongmen/libbase32) indirin veya platformunuz için mevcutsa paket olarak yükleyin.",
    "x9n1b": "Base85, 85 yazdırılabilir ASCII karakter kümesini kullanarak ikili verileri temsil eden bir kodlama şemasıdır.",
    "xMBv0": "İlgili kaynaklar yükleniyor...",
    "xOJqG1": "Sıkça Sorulan Sorular",
    "xPHqP": "Açıklama henüz tanımlanmadı.",
    "xQ_ls": "Redis'i Yedekle",
    "xbz0B": "Tüm Sekmeleri Kapat",
    "xbz0B2": "Sekmeyi Kapat",
    "xdqwe": "LafTools'u kullanmaya hoş geldiniz!",
    "xeP4zV": "TODO öğelerinizi hızlı bir şekilde görüntüleyin",
    "xeP4zVd": "İngilizce bir kelime hazinesine hızlı bir şekilde bakın.",
    "xlqtA": "Geri bildirim",
    "xml-bdeautify.desc.2a5f9": "XML Kodunu Küçült",
    "xml-beautify.desc.2a5f9": "Bu işlem, uygun girintiler ve satır sonları ekleyerek ve iyi biçimlendirilmiş bir yapı sağlayarak okunabilirliği artırmak için XML verilerini formatlar.",
    "xs22XLF": "Bu öğe kimliği için kullanılabilir veri yok. Lütfen diğer öğeleri seçmeyi düşünün.",
    "y3b6n": "Evet, kodlanmış dize Base45 spesifikasyonuna göre oluşturulduğu sürece herhangi bir uyumlu kod çözücünün kodu çözebilmesi gerekir.",
    "y3m7k": "Java için Base85 kodlama ve kod çözme desteğini içeren 'commons-codec' kitaplığını kullanın.",
    "y3m9k": "Base62 neden oluşturuldu?",
    "y3qjdd": "Yerel şifreniz başarıyla doğrulandı.",
    "y5nne": "Bu kod doğrudan Node.js ortamında veya Base32 işlevselliğine ihtiyaç duyduğunuz daha büyük bir projenin parçası olarak çalıştırılabilir.",
    "y6m8k": "Base85 neden oluşturuldu?",
    "y6t1n": "Base32'nin dezavantajları",
    "y8Ir5": "Bu bölüm yönetici hesabınızı başlatmak için kullanılır ancak yöneticiniz tarafından önceden ayarlandığı için şimdilik burada oluşturulması veya ayarlanması gereken hiçbir şey yoktur, lütfen bu bölümü boş bırakın ve kalan adımlarınıza devam edin.",
    "y8b1m": "'TEST12345'i kendi verilerinizle değiştirin ve kitaplık işlevlerinin doğru bir şekilde uygulandığından ve Base32 işlemleri için bu programı derlemek ve yürütmek üzere bağlandığından emin olun.",
    "y9m1n": "Base58 neden oluşturuldu?",
    "y9m3k": "Swift için GitHub'da bulunan 'Base45' kütüphanesini kullanabilirsiniz.",
    "y9z2e": "'TEST12345'i gerçek bayt diliminizle değiştirin ve Base32 standart kodlamayı kullanarak kodlamak ve kod çözmek için bu Go programını çalıştırın.",
    "y9z2t": "Bu betiği IRB gibi bir Ruby ortamında yürütün veya bir .rb dosyası olarak kaydedin ve 'Ruby dosyaadı.rb' ile çalıştırın.",
    "yMZW-GEgf": "XML'i biçimlendir",
    "ySVf-": "Bu İsteği yeniden deneyin",
    "yTsqFO": "MD4 (Message-Digest 4) algoritması, 1990 yılında Ronald Rivest tarafından geliştirilen bir kriptografik karma işlevidir. Özet uzunluğu 128 bittir. Algoritma, MD5, SHA-1 ve RIPEMD algoritmaları gibi daha sonraki tasarımları etkilemiştir. MD4'ün güvenliği ciddi şekilde tehlikeye girmiştir.",
    "yVprb": "Bu kısım halen geliştirilme aşamasındadır.",
    "y_2Q1": "Kodlama ve Kod Çözme",
    "y_2Q2": "Simetrik Kripto",
    "y_2Q3": "Asimetrik Kripto",
    "y_2Q4": "Çin Ulusal Algoritmaları",
    "y_2Q5": "Web Kimlik Doğrulaması",
    "y_2Q5dqw": "Metin Eşleştirici",
    "y_9YM": "Çıktı burada görüntülenecektir.",
    "y_9YqM": "Statik kaynaklar yükleniyor...",
    "y_BN6": "Özet Algoritması",
    "ya0cwu": "Malayca",
    "yc7dqiu": "Basitleştirilmiş Çince",
    "yfYeg": "Metin Şablonu",
    "yiRso": "Bulut Notları",
    "ykganl": "Danimarka",
    "yqiRso": "Yerel Notlar",
    "yqrxl4": "Sırpça",
    "yt7kX2fPQ": "Beklenmeyen Bir İstisna Yakalandı",
    "yznU9": "Ağaç Verilerini Boşalt",
    "z-o28we": "Süreç Paneli",
    "z0j2nf": "Hintçe",
    "z1m2t": "Örnek kullanım: `const encoded = bs58.encode('your-data'); const kodu çözülmüş = bs58.decode(kodlanmış);`",
    "z1n5qr": "Örnekler arasında JavaScript için base45 npm paketi ve .NET için dotnet-base45 yer alır.",
    "z1oFn": "Kaçış ve Kaçış",
    "z2jzej": "Marathi",
    "z2m7t": "Örnek kullanım: `const base62 = require('base62'); const kodlanmış = base62.encode('verileriniz'); const kodu çözülmüş = base62.decode(kodlanmış);`",
    "z2t7m": "Base85 nedir?",
    "z2x8c": "Base32, '+', '/' ve küçük harfleri içeren Base64'e kıyasla yalnızca büyük harfler ve rakamlar kullandığından, elle veya telefonla okumayı ve yazıya dökmeyi daha kolay hale getirdiği için daha az görsel belirsizliğe sahiptir.",
    "z3m1t": "Bağımlılığı ekledikten ve projeyi senkronize ettikten sonra, sağlanan şablonu bir Kotlin sınıfına kopyalayın ve kodu çalıştırmadan önce yer tutucuyu gerçek kodlanmış değerle değiştirin.",
    "z4t9b": "Base62 nedir?",
    "z5b7m": "Base64 veya Base32'ye kıyasla daha büyük bir alfabe (0-9, A-Z, a-z, -, ., $, /, +, % ve *) kullanır, bu da aynı giriş verileri için daha kısa kodlanmış dizelerle sonuçlanır.",
    "z5bvb": "'Npm install base32-encoding' komutunu çalıştırarak yükleyin. Kod pasajında ​​'TEST12345'i istediğiniz giriş verileriyle değiştirin.",
    "z5m6t": "Örnek kullanım: `const base85 = require('base85'); const kodlanmış = base85.encode('verileriniz'); const kodu çözülmüş = base85.decode(kodlanmış);`",
    "z6m1c": "Kullanılabilirliği artırmak ve daha az akılda kalan bazı karakterleri diğerleriyle değiştirmek için z-base-32 gibi daha sonraki varyasyonlar tanıtıldı, ancak Crockford'un orijinal spesifikasyonu bugün yaygın olarak kullanılmaya devam ediyor.",
    "z79b1a": "Arapça",
    "z7n1m": "'npm install base85' veya 'yarn add base85' çalıştırarak npm kullanarak yükleyin.",
    "z7t1p": "Base62'nin belirli varyantları var mı?",
    "z8em2t": "Kurulumdan sonra, sağlanan şablonu bir C# konsol uygulamasına kopyalayın ve programı çalıştırmadan önce yer tutucuyu gerçek kodlanmış değerle değiştirin.",
    "z8m2t": "Base45 kullanmanın Base64 veya Base32'ye göre avantajları nelerdir?",
    "z8n6k": "'TEST12345'i istediğiniz dizeyle değiştirin, Base32 kodlama ve kod çözme sonuçlarını görmek için bu programı derleyin ve çalıştırın.",
    "z8qm2t": "Kütüphane, Base45 işlemleri için kodlayıcı ve kod çözücü sınıfları sağlar. Şablon kodunu bir C# konsol uygulamasına kopyalayın ve paketi yükledikten sonra çalıştırın.",
    "z8qqm2t": "Kurulumdan sonra, sağlanan şablonu bir C# konsol uygulamasına kopyalayın ve programı çalıştırmadan önce yer tutucuyu gerçek kodlanmış değerle değiştirin.",
    "z9b6n": "Bağımlılığı Swift Paket Yöneticisi ('https://github.com/krzyzanowskim/CryptoSwift') aracılığıyla Xcode projenize ekleyin.",
    "z9kVv": "Python, Base64 kodlama ve kod çözme yöntemleri sağlayan yerleşik bir 'base64' modülüne sahiptir. Giriş dizesi, Base64'e kodlanmadan önce UTF-8 kodlaması kullanılarak bayta dönüştürülür ve ardından orijinal biçimine geri döndürülür.",
    "z9t2p": "Base58'in belirli çeşitleri var mı?",
    "z9t7p": "Base85'in belirli çeşitleri var mı?",
    "zN2ES": "Çalışma alanları",
    "zaSKh": "Yenile",
    "zc3Hf": "Şifre",
    "zjDJk": "Lütfen çalışma alanı dizin yolunu belirtin",
    "zkqUFa": "{0} henüz yapılandırılmadı",
    "zkv375": "Kmer",
    "zmDWx": "Bize Ulaşın",
    "znVRwq": "Dosyalar",
    "zpyd34": "İngilizce",
    "zqiIoqXw": "Hesaplamalar yürütülüyor...",
    "zwd4v": "Uzantı Detayı",
    "zyx98765": "Base64 sıkıştırma için kullanılabilir mi?",
    "zzcepr": "Cebuano"
}