{
    "4BZFkrKZz": "Nová generace všestranného toolboxu určeného pro programátory",
    "4hth-woPf": "Plná podpora GPT",
    "5B9rXHCzi": "Nedávno refaktorujeme architekturu LafTools založenou na next.js, níže uvedené kroky se mohou podle potřeby změnit.",
    "71DMQ0cOr": "Refaktoring",
    "AKCG4Sy8U": "Žádná přístupnost offline.",
    "AOKa_f9CC": "Začínáme",
    "Ed4z058Cr": "FOSS navždy",
    "HIAvRJazO": "Dostupné Docker Images a Portable Edition",
    "Jh-LM4MG": "Lehký běhový čas",
    "JjpQy-eIq": "Úvod",
    "KFg*5OvU*": "Chcete-li spustit službu Go v terminálu, můžete provést následující příkaz:",
    "LM-o4Yk6h": "Žádný produktivní styl uživatelského rozhraní.",
    "OjKP47hFt": "Náhled",
    "PLhTRM7EV": "Pokud používáte operační systém Windows, ujistěte se, že jsou všechny příkazy prováděny v git-bash, další informace naleznete v [PŘÍSPĚVEK](./docs/CONTRIBUTION.md). Kromě toho se doporučuje nepoužívat žádné mezery nebo neanglické znaky v cestě k souboru, kde je tento projekt umístěn.",
    "RV6qQL8ox": "Spustit službu Go (refaktoring)",
    "RXAzQfM2L": "Plná podpora platformy (včetně ARMv8)",
    "SSjHemio0": "Náhled Insider verze LafTools",
    "U6zkVUPTq": "Pokud je odpověď na kteroukoli z výše uvedených otázek ano, měli byste zvážit vyzkoušení naší sady nástrojů. Nabízí následující funkce:",
    "Yay3_x9EV": "Chcete-li ladit službu Go, nakonfigurovali jsme ji ve VSCode, stačí postupovat podle následujících kroků:",
    "YqgCZdzaS": "Setkali jste se někdy při používání těchto online nástrojů s níže uvedenými problémy?",
    "bIE-DVqmU": "LafTools je stále ve vývoji, jeho uživatelské rozhraní, závislosti nebo předpoklady se mohou podle potřeby měnit.",
    "ciP9qXH1I": "Většinu nástrojů, které poskytujeme, lze skutečně snadno najít na internetu, jako je kodek, formátovač, překlad, QR kód atd... Není to však nejpohodlnější a nejefektivnější přístup k používání těchto nástrojů.",
    "dcOe3EU4U": "Pro zjednodušení řekněme, že jste toto úložiště naklonovali buď do `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` ve Windows nebo `/Users/jerry/projects/laftools-repo` na Linux/MacOS, pak byste měli deklarovat env a nastavit konfiguraci níže ve vašem souboru **~/.bashrc**, nebo je jednoduše spustit před spuštěním jakéhokoli příkazu.",
    "iIq02l4vX": "Možná se divíte, proč jsme se rozhodli vyvinout tuto sadu nástrojů, protože na internetu lze použít mnoho nástrojů.",
    "iQxHIHZIL": "Žádné globální temné téma.",
    "iz4ROzL3": "Vysoce integrovaný s produktivním uživatelským rozhraním",
    "k-s63C6zr": "Náhled",
    "lmVW9z9oh": "Nastavení prostředí systému",
    "mpQMZfbv6": "Rozčilující reklamy.",
    "rR22PTMZc": "Problém s únikem dat.",
    "w5PSqC7jG": "Špatný výkon sítě.",
    "yVPMfvWhi": "Extra pomocníci jako poznámky, manuály atd..."
}