{
    "-n\\_-_sIlP": "Kyllä, se on avoimen lähdekoodin ohjelmisto, ja voit käyttää sitä lisenssiehtojen mukaisesti. Huomaa kuitenkin, että avoimen lähdekoodin oleminen ei välttämättä tarkoita, että se on täysin ilmainen. Vaikka useimpia työkaluja voidaan käyttää ilmaiseksi, joistakin voi aiheutua API-käyttöön ja palvelinkuluihin liittyviä kuluja.",
    "0Guf1oGfh": "Se on vain Windowsille, se sulkee kaikki päätteet ja aiemmat prosessit.",
    "3cXzYtfK": "Tämän projektin nimi on saanut inspiraationsa Chet Atkinsin klassisesta kantrilaulusta '{0}' vuodelta 1987, jolla on myös erityinen paikka kirjoittajan sydämessä.",
    "4BZFkrKZz": "Monipuolisen työkalupakin seuraavan sukupolven ohjelmoijille",
    "4hth-woPf": "Täysi GPT-kuten tuki",
    "5B9rXHCzi": "Olemme äskettäin muokkaamassa LafToolsin arkkitehtuuria next.js:n perusteella, alla olevia vaiheita voidaan muuttaa tarpeen mukaan.",
    "65xgSMWmS": "AMOITUS",
    "6yjO-9dyy": "Miksi oletusportti on 39899",
    "71DMQ0cOr": "Refaktorointi",
    "8Yv_neS0T": "suorita verkkopalvelu terminaalissa 1",
    "AKCG4Sy8U": "Ei offline-käyttöä.",
    "AOKa_f9CC": "Päästä alkuun",
    "Ed4z058Cr": "FOSS Ikuisesti",
    "Fuacz5atn": "Käynnistä FrontEnd-moduuli (siirretty web2:een)",
    "GRsw21x8A": "Ammattiohjelmoijana voit osallistua tähän projektiin ja luoda vetopyynnön tälle projektille, jolloin voit saada ilmaisen premium-jäsenyyden kolmeksi kuukaudeksi.",
    "Gez25D19n": "Esikatselu",
    "HIAvRJazO": "Saatavilla Docker-kuvat ja Portable Edition",
    "I-Zaii3HZ": "Mitä nimeä vaivaa?",
    "Jh-LM4MG": "Kevyt käyttöaika",
    "JjpQy-eIq": "Johdanto",
    "JseUpWpV6": "Mutta LafToolsin kirjoittajana en halua kertoa tarinaa toistaiseksi, haha.",
    "KFgTmafOWE4U": "Suorittaaksesi Go-palvelun terminaalissa, voit suorittaa alla olevan komennon:",
    "LM-o4Yk6h": "Ei tuottavaa käyttöliittymätyyliä.",
    "O3eQBXxwY": "Kun Go-palvelu on käynnissä, sinun pitäisi nähdä linkki tulostettuna terminaaliin. Aloita kehittäminen kopioimalla tämä URL-osoite ja liittämällä se selaimeesi.",
    "OjKP47hFt": "Esikatselu",
    "PLhTRM7EV": "Jos käytät Windows-käyttöjärjestelmää, varmista, että kaikki komennot suoritetaan git-bashissa. Lisätietoja on kohdassa [CONTRIBUTION](./docs/CONTRIBUTION.md). Tämän lisäksi on suositeltavaa välttää välilyöntien tai muiden kuin englanninkielisten merkkien käyttöä tiedostopolussa, jossa tämä projekti sijaitsee.",
    "QYPc87A2j": "Rakentaa",
    "QzssXokGC": "Kiitokset",
    "R1RzDLneG": "Tämä projekti on suojattu GNU Affero General Public License -lisenssillä, katso lisätietoja LICENSE-tiedostosta.",
    "RV6qQL8ox": "Käynnistä Go-palvelu (refaktorointi)",
    "RXAzQfM2L": "Täysi alustatuki (mukaan lukien ARMv8)",
    "SSjHemio0": "Esikatsele LafToolsin sisäpiiriversiota",
    "U6zkVUPTq": "Jos vastaus johonkin yllä olevista on kyllä, sinun kannattaa kokeilla työkalupakkiamme. Se tarjoaa seuraavat ominaisuudet:",
    "Wyi852ml4": "FAQ",
    "XHqxsRy9v": "Suorita CSS-prosessori terminaalissa 2",
    "Y-TXjTruC": "Tämä sivu on luotu sisäisesti LafToolsista.",
    "YCteaVxTx": "asenna projektideps",
    "Yay3_x9EV": "Go-palvelun virheenkorjausta varten olemme määrittäneet sen VSCodessa, voit seurata alla olevia ohjeita:",
    "YqgCZdzaS": "Oletko koskaan törmännyt alla oleviin ongelmiin käyttäessäsi näitä verkkotyökaluja?",
    "ZdiGcIi8j": "Erityisesti **:n suorituskyky",
    "b3c7e3r77": "Toivottavasti LafTools tekee päivittäisistä tehtävistäsi helpompaa, vähentää ylitöiden tarvetta ja auttaa sinua ylläpitämään tervettä työ- ja perhe-elämän tasapainoa, anna meidän vain levätä elämässä!",
    "bIE-DVqmU": "LafTools on edelleen kehitteillä, sen käyttöliittymä, riippuvuudet tai edellytykset voivat muuttua tarpeen mukaan.",
    "ciP9qXH1I": "Useimmat tarjoamamme työkalut, kuten koodekki, muotoilija, käännös, QR-koodi jne., ovat todellakin helposti löydettävissä Internetistä... Se ei kuitenkaan ole mukavin ja tehokkain tapa käyttää näitä työkaluja.",
    "dcOe3EU4U": "Oletetaan yksinkertaisuuden vuoksi, että olet kloonannut tämän arkiston joko `C:\\\\Users\\jerry\\\\project\\\\laftools-repo`:ksi Windowsissa tai `/Users/jerry/projects/laftools-repo`. Linux/MacOS, sinun tulee ilmoittaa env ja määrittää asetukset alla tiedostossasi **~/.bashrc** tai yksinkertaisesti suorittaa ne ennen minkään komennon suorittamista.",
    "dwWA-7VQ3": "Odota, itse asiassa on olemassa toinen vaihtoehto pelkän laskun maksamisen sijaan.",
    "eI8YT-N_a": "Arvostamme lahjakkaita taiteilijoita, jotka toimittivat alla kauniita kuvakkeita:",
    "eNQDoICED": "Esimerkki",
    "fp-FSQcA-": "suorittaa ylimääräisiä töitä terminaalissa 3",
    "hO_WdaThV": "Huomaa, että voit käyttää &-symbolia taustasuoritukseen, jos et halua vaihtoehtoisesti suorittaa näitä komentoja erillisissä pääte-esiintymissä.",
    "i2fk8l8pB": "Alla on muita materiaaleja, joita voit katsoa, ​​jos haluat saada lisätietoja tästä projektista:",
    "iIq02l4vX": "Saatat ihmetellä, miksi olemme päättäneet kehittää tätä työkalupakkia, koska Internetissä voidaan käyttää lukuisia työkaluja.",
    "iQxHIHZIL": "Ei globaalia tummaa teemaa.",
    "iz4ROzL3": "Erittäin integroitu tuottavaan käyttöliittymään",
    "leVsK": "Tämä on projekti {0}, pidän kohteesta {1}",
    "lmVW9z9oh": "Määritä järjestelmäympäristö",
    "lzYX0DiPc": "2. helmikuuta 2023",
    "m3wnIDvAF": "Inspiraatiota",
    "mfVQaqTiZ": "Aloita kehittäminen",
    "mpQMZfbv6": "Järkyttävät mainokset.",
    "oM2NCFSQ1": "Tämä projekti ei olisi ollut mahdollinen ilman mahtavia avoimen lähdekoodin projekteja, joista haluan henkilökohtaisesti ilmaista syvimmän kiitokseni:",
    "rR22PTMZc": "Tietovuotoongelma.",
    "sR8yc": "kiinni",
    "t5DDvnfna": "Tämä projekti on saanut inspiraationsa pääasiassa seuraavista muusikoista:",
    "tYuR4PCbV": "Vaikka pyrimme tarjoamaan mahdollisimman monia palveluita ilmaiseksi, jotkin ominaisuudet vaativat maksun. Tämä johtuu siitä, että joudumme maksamaan palvelimista, ylläpidosta ja muista toiminnallisista kustannuksista, jotka ovat välttämättömiä, jotta palvelumme toimivat sujuvasti ja luotettavasti. Maksamalla premium-palveluista voimme kattaa nämä kustannukset ja jatkaa laadukkaiden ja kestävien palvelujen tarjoamista. Arvostamme ymmärrystäsi ja tukeasi.",
    "uavuXKo4x": "Kiinan kehittäjille",
    "uh8JUYWzH": "asenna vaadittu globaali kirjasto",
    "vWi9Y_HJ6": "Varmasti on muitakin avoimen lähdekoodin projekteja, jotka ovat hyötyneet ja helpottaneet tätä projektia, joita en tässä osiossa pystynyt erittelemään; Ilman näitä projekteja ja lahjakkuuksien kehittäjien ponnisteluja LafTools ei olisi ollut mahdollinen.",
    "vn8G5weVs": "Se on maaginen luku, joka koostuu 3 + 98 + 99.",
    "w5PSqC7jG": "Huono verkon suorituskyky.",
    "wWRCQygDC": "Kirjoita {0}",
    "wieewa7cq": "Muut materiaalit",
    "yVPMfvWhi": "Ylimääräisiä apuvälineitä, kuten muistiinpanoja, käsikirjoja jne..."
}