{
    "0Guf1oGfh": "C'est pour Windows uniquement, cela fermera tous les terminaux et processus précédents.",
    "3fcXzYtfK": "Le nom de ce projet est inspiré de « Laffin' At Life », une chanson country classique de 1987 de Chet Atkins qui occupe également une place particulière dans le cœur de l'auteur.",
    "4BZFkrKZz": "La nouvelle génération d'une boîte à outils polyvalente conçue pour les programmeurs",
    "4hth-woPf": "Prise en charge complète de type GPT",
    "5B9rXHCzi": "Récemment, nous refactorisons l'architecture de LafTools basée sur next.js, les étapes ci-dessous peuvent être modifiées selon les besoins.",
    "65xgSMWmS": "CONTRIBUTION",
    "71DMQ0cOr": "Refactorisation",
    "8Yv_neS0T": "exécuter le service Web sur le terminal 1",
    "AKCG4Sy8U": "Aucune accessibilité hors ligne.",
    "AOKa_f9CC": "Commencer",
    "Dh60DyO0O": "Aperçu (anglais)",
    "Ed4z058Cr": "Logiciel libre pour toujours",
    "Fuacz5atn": "Lancer le module FrontEnd (déplacé vers web2)",
    "HIAvRJazO": "Images Docker disponibles et édition portable",
    "I-Zaii3HZ": "C'est quoi ce nom ?",
    "Jh-LM4MG": "Durée d'exécution légère",
    "JjpQy-eIq": "Introduction",
    "KFgTmafOWE4U": "Pour exécuter le service Go dans le terminal, vous pouvez exécuter la commande ci-dessous :",
    "LM-o4Yk6h": "Aucun style d'interface utilisateur productif.",
    "O3eQBXxwY": "Une fois le service Go exécuté, vous devriez pouvoir voir un lien imprimé dans le terminal. Maintenant, copiez cette URL et collez-la dans votre navigateur pour commencer le développement, c'est parti !",
    "OjKP47hFt": "Aperçu",
    "PLhTRM7EV": "Si vous utilisez le système d'exploitation Windows, assurez-vous que toutes les commandes sont exécutées dans git-bash. Pour en savoir plus, veuillez vous référer à [CONTRIBUTION](./docs/CONTRIBUTION.md). En dehors de cela, il est recommandé d’éviter d’utiliser des espaces ou des caractères non anglais dans le chemin du fichier où se trouve ce projet.",
    "QYPc87A2j": "Construire",
    "QzssXokGC": "Remerciements",
    "R1RzDLneG": "Ce projet est protégé sous la licence publique générale GNU Affero, veuillez consulter le fichier LICENSE pour plus de détails.",
    "RV6qQL8ox": "Lancer le service Go (refactorisation)",
    "RXAzQfM2L": "Prise en charge complète de la plateforme (y compris ARMv8)",
    "SSjHemio0": "Aperçu de la version Insider de LafTools",
    "U6zkVUPTq": "Si la réponse à l’une des questions ci-dessus est oui, vous devriez alors envisager d’essayer notre boîte à outils. Il offre les fonctionnalités suivantes :",
    "Wyi852ml4": "FAQ",
    "XHqxsRy9v": "exécuter le processeur CSS sur le terminal 2",
    "YCteaVxTx": "installer les départements du projet",
    "Yay3_x9EV": "Pour déboguer le service Go, nous l'avons configuré dans VSCode, vous pouvez simplement suivre les étapes ci-dessous :",
    "YqgCZdzaS": "Avez-vous déjà rencontré les problèmes ci-dessous lors de l'utilisation de ces outils en ligne ?",
    "b3c7e3r77": "Espérons que LafTools facilitera vos tâches quotidiennes, en réduisant le besoin d'heures supplémentaires et en vous aidant à maintenir un équilibre sain entre vie professionnelle et vie privée. Laissez-nous simplement profiter de la vie !",
    "bIE-DVqmU": "LafTools est encore en développement, son interface utilisateur, ses dépendances ou ses prérequis peuvent être modifiés selon les besoins.",
    "ciP9qXH1I": "En effet, la plupart des outils que nous avons fournis peuvent être facilement trouvés sur Internet, comme le codec, le formateur, la traduction, le QR Code, etc… Cependant, ce n'est pas l'approche la plus confortable et la plus efficace pour utiliser ces outils.",
    "dcOe3EU4U": "Par souci de simplicité, disons que vous avez cloné ce référentiel soit dans `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` sous Windows, soit dans `/Users/jerry/projects/laftools-repo` sur Linux/MacOS, vous devez alors déclarer env et définir la configuration ci-dessous dans votre fichier **~/.bashrc**, ou simplement les exécuter avant d'exécuter une commande.",
    "eI8YT-N_a": "Nous apprécierions les artistes talentueux qui fournissaient ci-dessous de belles icônes :",
    "eNQDoICED": "Exemple",
    "fp-FSQcA-": "exécuter des tâches supplémentaires sur le terminal 3",
    "hO_WdaThV": "Notez que vous pouvez utiliser le symbole « & » pour l'exécution en arrière-plan si vous ne souhaitez pas exécuter ces commandes dans des instances de terminal distinctes.",
    "i0bt7fhna": "Les outils pour Laffin' At Life",
    "i2fk8l8pB": "Vous trouverez ci-dessous d'autres documents que vous pouvez consulter si vous souhaitez en savoir plus sur ce projet :",
    "iIq02l4vX": "Vous vous demandez peut-être pourquoi nous sommes déterminés à développer cette boîte à outils alors qu'il existe de nombreux outils utilisables sur Internet.",
    "iQxHIHZIL": "Pas de thème sombre global.",
    "iz4ROzL3": "Hautement intégré avec une interface utilisateur productive",
    "leVsK": "C'est un projet {0}, j'aime {1}",
    "lmVW9z9oh": "Configuration de l'environnement système",
    "lzYX0DiPc": "2 février 2023",
    "mfVQaqTiZ": "Commencer à développer",
    "mpQMZfbv6": "Des publicités bouleversantes.",
    "oM2NCFSQ1": "Ce projet n'aurait pas été possible sans de superbes projets open source auxquels je voudrais personnellement exprimer ma plus profonde gratitude :",
    "rR22PTMZc": "Problème de fuite de données.",
    "uavuXKo4x": "Pour les développeurs chinois",
    "uh8JUYWzH": "installer la bibliothèque globale requise",
    "vWi9Y_HJ6": "Bien sûr, il existe d'autres projets open source qui ont bénéficié et facilité ce projet, que je n'ai pas pu détailler dans cette partie ; Sans ces projets et les efforts de ces développeurs de talents, LafTools n'aurait pas été possible.",
    "w5PSqC7jG": "Mauvaises performances du réseau.",
    "wWRCQygDC": "Saisissez {0}",
    "wieewa7cq": "Autres matériaux",
    "yVPMfvWhi": "Aides supplémentaires telles que des notes, des manuels, etc..."
}