{
    "4BZFkrKZz": "A programozók számára tervezett sokoldalú eszköztár következő generációja",
    "4hth-woPf": "Teljes GPT-szerű támogatás",
    "5B9rXHCzi": "A közelmúltban a LafTools next.js-en alapuló architektúráját átdolgoztuk, az alábbi lépések szükség szerint változhatnak.",
    "71DMQ0cOr": "Refaktorálás",
    "AKCG4Sy8U": "Nincs offline kisegítő lehetőség.",
    "AOKa_f9CC": "Elkezdeni",
    "Ed4z058Cr": "FOSS Forever",
    "HIAvRJazO": "Elérhető Docker képek és Portable Edition",
    "Jh-LM4MG": "Könnyű futásidő",
    "JjpQy-eIq": "Bevezetés",
    "KFg*5OvU*": "A Go szolgáltatás terminálban való futtatásához hajtsa végre az alábbi parancsot:",
    "LM-o4Yk6h": "Nincs produktív felhasználói felület stílus.",
    "OjKP47hFt": "Előnézet",
    "PLhTRM7EV": "Ha Windows operációs rendszert használ, győződjön meg arról, hogy az összes parancsot a git-bash-ben hajtja végre. További információ: [CONTRIBUTION](./docs/CONTRIBUTION.md). Ezen kívül ajánlatos kerülni a szóközök vagy nem angol karakterek használatát a fájl elérési útjában, ahol a projekt található.",
    "RV6qQL8ox": "Go szolgáltatás indítása (újrafaktorálás)",
    "RXAzQfM2L": "Teljes platform támogatás (beleértve az ARMv8-at is)",
    "SSjHemio0": "Tekintse meg a LafTools Insider verzióját",
    "U6zkVUPTq": "Ha a fentiek bármelyikére igen a válasz, akkor fontolja meg eszköztárunk kipróbálását. A következő funkciókat kínálja:",
    "Yay3_x9EV": "A Go szolgáltatás hibakereséséhez a VSCode-ban konfiguráltuk, csak kövesse az alábbi lépéseket:",
    "YqgCZdzaS": "Találkozott már az alábbi problémákkal az online eszközök használata közben?",
    "bIE-DVqmU": "A LafTools még fejlesztés alatt áll, felhasználói felülete, függőségei vagy előfeltételei szükség szerint módosulhatnak.",
    "ciP9qXH1I": "Valójában a legtöbb általunk biztosított eszköz könnyen megtalálható az interneten, például kodek, formázó, fordítás, QR-kód stb. Ezeknek az eszközöknek azonban nem ez a legkényelmesebb és leghatékonyabb módja.",
    "dcOe3EU4U": "Az egyszerűség kedvéért tegyük fel, hogy klónozta ezt a tárolót a `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` mappába Windows rendszeren vagy a `/Users/jerry/projects/laftools-repo` mappába. Linux/MacOS, akkor deklarálja az env-t, és állítsa be a konfigurációt alább a **~/.bashrc** fájlban, vagy egyszerűen futtassa őket, mielőtt bármilyen parancsot futtatna.",
    "iIq02l4vX": "Felmerülhet benned a kérdés, miért vagyunk eltökéltek ennek az eszköztárnak a fejlesztése mellett, mivel az interneten számos eszköz használható.",
    "iQxHIHZIL": "Nincs globális sötét téma.",
    "iz4ROzL3": "Erősen integrált a produktív felhasználói felülettel",
    "k-s63C6zr": "Előnézet",
    "lmVW9z9oh": "Rendszerkörnyezet beállítása",
    "mpQMZfbv6": "Felkavaró reklámok.",
    "rR22PTMZc": "Adatszivárgási probléma.",
    "w5PSqC7jG": "Gyenge hálózati teljesítmény.",
    "yVPMfvWhi": "Extra segítők, mint jegyzetek, kézikönyvek stb..."
}