{
    "-n\\_-_sIlP": "Igen, ez egy nyílt forráskódú szoftver, és a licenc feltételeit betartva használhatja. Azonban kérjük, vegye figyelembe, hogy a nyílt forráskód nem feltétlenül jelenti azt, hogy teljesen ingyenes. Míg a legtöbb eszköz ingyenesen használható, némelyik API-használattal és szerverköltségekkel kapcsolatos költségekkel járhat.",
    "0Guf1oGfh": "Csak Windowshoz készült, bezárja az összes terminált és korábbi folyamatokat.",
    "3cXzYtfK": "A projekt nevét Chet Atkins 1987-es klasszikus countrydala, a „{0}” ihlette, amely szintén különleges helyet foglal el a szerző szívében.",
    "4BZFkrKZz": "A programozók számára tervezett sokoldalú eszköztár következő generációja",
    "4hth-woPf": "Teljes GPT-szerű támogatás",
    "5B9rXHCzi": "A közelmúltban a LafTools next.js-en alapuló architektúráját átdolgoztuk, az alábbi lépések szükség szerint változhatnak.",
    "65xgSMWmS": "HOZZÁJÁRULÁS",
    "6yjO-9dyy": "Miért az alapértelmezett port a 39899?",
    "71DMQ0cOr": "Refaktorálás",
    "8Yv_neS0T": "futtassa a webszolgáltatást az 1-es terminálon",
    "AKCG4Sy8U": "Nincs offline kisegítő lehetőség.",
    "AOKa_f9CC": "Elkezdeni",
    "Ed4z058Cr": "FOSS Forever",
    "Fuacz5atn": "FrontEnd Module indítása (áthelyezve a web2-be)",
    "GRsw21x8A": "Professzionális programozóként hozzájárulhat ehhez a projekthez, és lehívási kérelmet készíthet ehhez a projekthez, majd három hónapig ingyenes prémium tagságot szerezhet.",
    "Gez25D19n": "Előnézet",
    "HIAvRJazO": "Elérhető Docker képek és Portable Edition",
    "I-Zaii3HZ": "Mi van a névvel?",
    "Jh-LM4MG": "Könnyű futásidő",
    "JjpQy-eIq": "Bevezetés",
    "JseUpWpV6": "De mint a LafTools szerzője, most inkább nem mesélem el a történetet, haha.",
    "KFgTmafOWE4U": "A Go szolgáltatás terminálban való futtatásához hajtsa végre az alábbi parancsot:",
    "LM-o4Yk6h": "Nincs produktív felhasználói felület stílus.",
    "O3eQBXxwY": "Ha a Go szolgáltatás fut, látnia kell a terminálban kinyomtatott hivatkozást. Most másolja ki ezt az URL-t, és illessze be böngészőjébe a fejlesztés megkezdéséhez, gyerünk!",
    "OjKP47hFt": "Előnézet",
    "PLhTRM7EV": "Ha Windows operációs rendszert használ, győződjön meg arról, hogy az összes parancsot a git-bash-ben hajtja végre. További információ: [CONTRIBUTION](./docs/CONTRIBUTION.md). Ezen kívül ajánlatos kerülni a szóközök vagy nem angol karakterek használatát a fájl elérési útjában, ahol a projekt található.",
    "QYPc87A2j": "Épít",
    "QzssXokGC": "Köszönetnyilvánítás",
    "R1RzDLneG": "Ezt a projektet a GNU Affero General Public License védi, további részletekért tekintse meg a LICENC fájlt.",
    "RV6qQL8ox": "Go szolgáltatás indítása (újrafaktorálás)",
    "RXAzQfM2L": "Teljes platform támogatás (beleértve az ARMv8-at is)",
    "SSjHemio0": "Tekintse meg a LafTools Insider verzióját",
    "U6zkVUPTq": "Ha a fentiek bármelyikére igen a válasz, akkor fontolja meg eszköztárunk kipróbálását. A következő funkciókat kínálja:",
    "Wyi852ml4": "GYIK",
    "XHqxsRy9v": "futtassa a CSS processzort a 2-es terminálon",
    "Y-TXjTruC": "Ezt az oldalt a LafTools belsőleg hozta létre.",
    "YCteaVxTx": "projekt deps telepítése",
    "Yay3_x9EV": "A Go szolgáltatás hibakereséséhez a VSCode-ban konfiguráltuk, csak kövesse az alábbi lépéseket:",
    "YqgCZdzaS": "Találkozott már az alábbi problémákkal az online eszközök használata közben?",
    "ZdiGcIi8j": "Pontosabban a ** teljesítménye",
    "b3c7e3r77": "Remélhetőleg a LafTools megkönnyíti mindennapi feladatait, csökkenti a túlórák szükségességét, és segít fenntartani a munka és a magánélet egészséges egyensúlyát, hadd lazuljunk az életen!",
    "bIE-DVqmU": "A LafTools még fejlesztés alatt áll, felhasználói felülete, függőségei vagy előfeltételei szükség szerint módosulhatnak.",
    "ciP9qXH1I": "Valójában a legtöbb általunk biztosított eszköz könnyen megtalálható az interneten, például kodek, formázó, fordítás, QR-kód stb. Ezeknek az eszközöknek azonban nem ez a legkényelmesebb és leghatékonyabb módja.",
    "dcOe3EU4U": "Az egyszerűség kedvéért tegyük fel, hogy klónozta ezt a tárolót a `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` mappába Windows rendszeren vagy a `/Users/jerry/projects/laftools-repo` mappába. Linux/MacOS, akkor deklarálja az env-t, és állítsa be a konfigurációt alább a **~/.bashrc** fájlban, vagy egyszerűen futtassa őket, mielőtt bármilyen parancsot futtatna.",
    "dwWA-7VQ3": "Várj, valójában van egy másik lehetőség a számla fizetése helyett.",
    "eI8YT-N_a": "Nagyra értékelnénk azokat a tehetséges művészeket, akik az alábbi gyönyörű ikonokat mutatták be:",
    "eNQDoICED": "Példa",
    "fp-FSQcA-": "többletfeladatok futtatása a 3-as terminálon",
    "hO_WdaThV": "Ne feledje, hogy használhatja az '&' szimbólumot a háttérben történő végrehajtáshoz, ha nem kívánja ezeket a parancsokat különálló terminálpéldányokban futtatni.",
    "i2fk8l8pB": "Az alábbiakban további anyagok találhatók, amelyeket megtekinthet, ha többet szeretne megtudni erről a projektről:",
    "iIq02l4vX": "Felmerülhet benned a kérdés, miért vagyunk eltökéltek ennek az eszköztárnak a fejlesztése mellett, mivel az interneten számos eszköz használható.",
    "iQxHIHZIL": "Nincs globális sötét téma.",
    "iz4ROzL3": "Erősen integrált a produktív felhasználói felülettel",
    "leVsK": "Ez egy {0} projekt, tetszik a {1}",
    "lmVW9z9oh": "Rendszerkörnyezet beállítása",
    "lzYX0DiPc": "2023. február 2",
    "m3wnIDvAF": "Ihlet",
    "mfVQaqTiZ": "Kezdje el a fejlesztést",
    "mpQMZfbv6": "Felkavaró reklámok.",
    "oM2NCFSQ1": "Ez a projekt nem jöhetett volna létre fantasztikus nyílt forráskódú projektek nélkül, amelyekért személyesen szeretném kifejezni legmélyebb hálámat:",
    "rR22PTMZc": "Adatszivárgási probléma.",
    "sR8yc": "Bezárás",
    "t5DDvnfna": "Ezt a projektet elsősorban a következő zenészek inspirálták:",
    "tYuR4PCbV": "Bár arra törekszünk, hogy a lehető legtöbb szolgáltatást ingyenesen biztosítsuk, bizonyos funkciókért fizetni kell. Ennek az az oka, hogy a szerverekkel, a karbantartással és más olyan üzemeltetési költségekkel kell számolnunk, amelyek elengedhetetlenek szolgáltatásaink zavartalan és megbízható működéséhez. A prémium szolgáltatások díjazásával fedezni tudjuk ezeket a költségeket, és továbbra is magas színvonalú, fenntartható szolgáltatásokat kínálunk. Köszönjük megértését és támogatását.",
    "uavuXKo4x": "Kínai fejlesztőknek",
    "uh8JUYWzH": "telepítse a szükséges globális könyvtárat",
    "vWi9Y_HJ6": "Az biztos, hogy vannak más nyílt forráskódú projektek is, amelyek hasznot húztak ennek a projektnek, és ezeket ebben a részben nem tudtam részletezni; E projektek és a tehetségfejlesztők erőfeszítései nélkül a LafTools nem jöhetett volna létre.",
    "vn8G5weVs": "Ez egy varázslatos szám, amely 3 + 98 + 99-ből áll.",
    "w5PSqC7jG": "Gyenge hálózati teljesítmény.",
    "wWRCQygDC": "Írja be a következőt: {0}",
    "wieewa7cq": "Más anyagok",
    "yVPMfvWhi": "Extra segítők, mint jegyzetek, kézikönyvek stb..."
}