{
    "-n\\_-_sIlP": "Ya, ini adalah perangkat lunak sumber terbuka, dan Anda dapat menggunakannya dengan mengikuti ketentuan lisensi. Namun perlu diingat bahwa menjadi sumber terbuka tidak berarti sepenuhnya gratis. Meskipun sebagian besar alat dapat digunakan secara gratis, beberapa alat mungkin dikenakan biaya terkait penggunaan API dan biaya server.",
    "0Guf1oGfh": "Ini hanya untuk Windows, ini akan menutup semua terminal dan proses sebelumnya.",
    "3cXzYtfK": "Nama proyek ini terinspirasi dari {0}, lagu country klasik tahun 1987 karya Chet Atkins yang juga mendapat tempat spesial di hati penulisnya.",
    "4BZFkrKZz": "Kotak peralatan serbaguna generasi berikutnya yang dirancang untuk pemrogram",
    "4hth-woPf": "Dukungan penuh mirip GPT",
    "5B9rXHCzi": "Baru-baru ini, kami melakukan refactoring arsitektur LafTools berdasarkan next.js, langkah-langkah di bawah ini dapat diubah sesuai kebutuhan.",
    "65xgSMWmS": "KONTRIBUSI",
    "6yjO-9dyy": "Mengapa port defaultnya adalah 39899",
    "71DMQ0cOr": "Pemfaktoran ulang",
    "8Yv_neS0T": "jalankan layanan web di terminal 1",
    "AKCG4Sy8U": "Tidak Ada Aksesibilitas Offline.",
    "AOKa_f9CC": "Mulai",
    "Ed4z058Cr": "FOSS Selamanya",
    "Fuacz5atn": "Luncurkan Modul FrontEnd (Dipindahkan ke web2)",
    "GRsw21x8A": "Sebagai programmer profesional, Anda dapat berkontribusi pada proyek ini dan membuat permintaan tarik untuk proyek ini, lalu Anda dapat memperoleh keanggotaan premium gratis selama tiga bulan.",
    "Gez25D19n": "Pratinjau",
    "HIAvRJazO": "Tersedia Gambar Docker dan Edisi Portabel",
    "I-Zaii3HZ": "Ada apa dengan namanya?",
    "Jh-LM4MG": "Waktu Proses Ringan",
    "JjpQy-eIq": "Perkenalan",
    "JseUpWpV6": "Tapi sebagai penulis LafTools, saya memilih untuk tidak menceritakan kisahnya dulu, haha.",
    "KFgTmafOWE4U": "Untuk menjalankan layanan Go di terminal, Anda dapat menjalankan perintah di bawah ini:",
    "LM-o4Yk6h": "Tidak ada gaya UI Produktif.",
    "O3eQBXxwY": "Setelah layanan Go berjalan, Anda akan melihat tautan tercetak di terminal. Sekarang, salin URL ini dan tempel ke browser Anda untuk mulai mengembangkan, ayo!",
    "OjKP47hFt": "Pratinjau",
    "PLhTRM7EV": "Jika Anda menggunakan OS Windows, pastikan semua perintah dijalankan di git-bash, pelajari lebih lanjut silakan lihat [KONTRIBUSI](./docs/CONTRIBUTION.md). Selain itu, disarankan untuk menghindari penggunaan spasi atau karakter non-Inggris di jalur file tempat proyek ini berada.",
    "QYPc87A2j": "Membangun",
    "QzssXokGC": "Ucapan Terima Kasih",
    "R1RzDLneG": "Proyek ini dilindungi di bawah Lisensi Publik Umum GNU Affero, silakan lihat file LISENSI untuk lebih jelasnya.",
    "RV6qQL8ox": "Luncurkan Layanan Go (Refactoring)",
    "RXAzQfM2L": "Dukungan platform penuh (termasuk ARMv8)",
    "SSjHemio0": "Pratinjau LafTools Versi Insider",
    "U6zkVUPTq": "Jika jawaban di atas adalah ya, Anda harus mempertimbangkan untuk mencoba kotak peralatan kami. Ini menawarkan fitur-fitur berikut:",
    "Wyi852ml4": "Pertanyaan Umum",
    "XHqxsRy9v": "jalankan prosesor CSS di terminal 2",
    "Y-TXjTruC": "Halaman ini dihasilkan dari LafTools secara internal.",
    "YCteaVxTx": "instal deps proyek",
    "Yay3_x9EV": "Untuk men-debug layanan Go, kami telah mengkonfigurasinya di VSCode, Anda cukup mengikuti langkah-langkah di bawah ini:",
    "YqgCZdzaS": "Pernahkah Anda menemui masalah di bawah ini saat menggunakan alat online tersebut?",
    "ZdiGcIi8j": "Secara khusus, kinerja **",
    "b3c7e3r77": "Semoga LafTools dapat mempermudah tugas sehari-hari Anda, mengurangi kebutuhan lembur dan membantu Anda menjaga keseimbangan kehidupan kerja yang sehat, mari kita bermalas-malasan dalam hidup!",
    "bIE-DVqmU": "LafTools masih dalam pengembangan, UI, dependensi, atau prasyaratnya dapat diubah sesuai kebutuhan.",
    "ciP9qXH1I": "Memang benar, sebagian besar alat yang kami sediakan dapat dengan mudah ditemukan di Internet, seperti codec, pemformat, terjemahan, Kode QR, dll… Namun, penggunaan alat-alat ini bukanlah pendekatan yang paling nyaman dan efisien.",
    "dcOe3EU4U": "Demi kesederhanaan, katakanlah Anda telah mengkloning repositori ini ke `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` di Windows atau `/Users/jerry/projects/laftools-repo` di Linux/MacOS, maka Anda harus mendeklarasikan env dan mengatur config di bawah ini di file Anda **~/.bashrc**, atau cukup jalankan sebelum menjalankan perintah apa pun.",
    "dwWA-7VQ3": "Tunggu, sebenarnya ada pilihan lain selain hanya membayar tagihan.",
    "eI8YT-N_a": "Kami sangat menghargai seniman berbakat yang menyediakan ikon-ikon indah di bawah ini:",
    "eNQDoICED": "Contoh",
    "fp-FSQcA-": "menjalankan pekerjaan tambahan di terminal 3",
    "hO_WdaThV": "Perhatikan bahwa Anda dapat menggunakan simbol '&' untuk eksekusi latar belakang jika Anda tidak ingin menjalankan perintah ini di terminal terpisah.",
    "i2fk8l8pB": "Di bawah ini adalah materi lebih lanjut yang dapat Anda lihat jika Anda ingin mempelajari lebih detail tentang proyek ini:",
    "iIq02l4vX": "Anda mungkin bertanya-tanya mengapa kami bertekad untuk mengembangkan kotak peralatan ini karena ada banyak alat yang dapat digunakan di Internet.",
    "iQxHIHZIL": "Tidak Ada Tema Gelap Global.",
    "iz4ROzL3": "Sangat terintegrasi dengan UI produktif",
    "leVsK": "Ini adalah proyek {0}, saya suka {1}",
    "lmVW9z9oh": "Pengaturan Lingkungan Sistem",
    "lzYX0DiPc": "2 Februari 2023",
    "m3wnIDvAF": "Inspirasi",
    "mfVQaqTiZ": "Mulai Berkembang",
    "mpQMZfbv6": "Iklan yang Mengecewakan.",
    "oM2NCFSQ1": "Proyek ini tidak akan mungkin terwujud tanpa proyek open source yang luar biasa. Saya secara pribadi ingin mengucapkan terima kasih yang sebesar-besarnya kepada:",
    "rR22PTMZc": "Masalah Kebocoran Data.",
    "sR8yc": "Menutup",
    "t5DDvnfna": "Proyek ini terutama terinspirasi oleh musisi berikut:",
    "tYuR4PCbV": "Meskipun kami berusaha untuk menyediakan sebanyak mungkin layanan secara gratis, beberapa fitur memang memerlukan pembayaran. Hal ini karena kami mengeluarkan biaya untuk server, pemeliharaan, dan aspek operasional lainnya yang penting untuk menjaga layanan kami berjalan lancar dan andal. Dengan mengenakan biaya untuk layanan premium, kami dapat menutupi biaya tersebut dan terus menawarkan layanan berkualitas tinggi dan berkelanjutan. Kami menghargai pengertian dan dukungan Anda.",
    "uavuXKo4x": "Untuk Pengembang Tiongkok",
    "uh8JUYWzH": "instal perpustakaan global yang diperlukan",
    "vWi9Y_HJ6": "Yang pasti, ada proyek open source lain yang memberikan manfaat dan memfasilitasi proyek ini, yang tidak dapat saya jelaskan secara rinci di bagian ini; Tanpa proyek-proyek ini dan upaya para pengembang bakat ini, LafTools tidak akan mungkin terwujud.",
    "vn8G5weVs": "Itu adalah angka ajaib yang terdiri dari 3 + 98 + 99.",
    "w5PSqC7jG": "Kinerja Jaringan Buruk.",
    "wWRCQygDC": "Masukkan {0}",
    "wieewa7cq": "Bahan Lainnya",
    "yVPMfvWhi": "Pembantu tambahan seperti catatan, manual, dll..."
}