{
    "4BZFkrKZz": "Kotak peralatan serbaguna generasi berikutnya yang dirancang untuk pemrogram",
    "4hth-woPf": "Dukungan penuh mirip GPT",
    "5B9rXHCzi": "Baru-baru ini, kami melakukan refactoring arsitektur LafTools berdasarkan next.js, langkah-langkah di bawah ini dapat diubah sesuai kebutuhan.",
    "71DMQ0cOr": "Pemfaktoran ulang",
    "AKCG4Sy8U": "Tidak Ada Aksesibilitas Offline.",
    "AOKa_f9CC": "Mulai",
    "Ed4z058Cr": "FOSS Selamanya",
    "HIAvRJazO": "Tersedia Gambar Docker dan Edisi Portabel",
    "Jh-LM4MG": "Waktu Proses Ringan",
    "JjpQy-eIq": "Perkenalan",
    "KFg*5OvU*": "Untuk menjalankan layanan Go di terminal, Anda dapat menjalankan perintah di bawah ini:",
    "LM-o4Yk6h": "Tidak ada gaya UI Produktif.",
    "OjKP47hFt": "Pratinjau",
    "PLhTRM7EV": "Jika Anda menggunakan OS Windows, pastikan semua perintah dijalankan di git-bash, pelajari lebih lanjut silakan lihat [KONTRIBUSI](./docs/CONTRIBUTION.md). Selain itu, disarankan untuk menghindari penggunaan spasi atau karakter non-Inggris di jalur file tempat proyek ini berada.",
    "RV6qQL8ox": "Luncurkan Layanan Go (Refactoring)",
    "RXAzQfM2L": "Dukungan platform penuh (termasuk ARMv8)",
    "SSjHemio0": "Pratinjau LafTools Versi Insider",
    "U6zkVUPTq": "Jika jawaban di atas adalah ya, Anda harus mempertimbangkan untuk mencoba kotak peralatan kami. Ini menawarkan fitur-fitur berikut:",
    "Yay3_x9EV": "Untuk men-debug layanan Go, kami telah mengkonfigurasinya di VSCode, Anda cukup mengikuti langkah-langkah di bawah ini:",
    "YqgCZdzaS": "Pernahkah Anda menemui masalah di bawah ini saat menggunakan alat online tersebut?",
    "bIE-DVqmU": "LafTools masih dalam pengembangan, UI, dependensi, atau prasyaratnya dapat diubah sesuai kebutuhan.",
    "ciP9qXH1I": "Memang benar, sebagian besar alat yang kami sediakan dapat dengan mudah ditemukan di Internet, seperti codec, pemformat, terjemahan, Kode QR, dll… Namun, penggunaan alat-alat ini bukanlah pendekatan yang paling nyaman dan efisien.",
    "dcOe3EU4U": "Demi kesederhanaan, katakanlah Anda telah mengkloning repositori ini ke `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` di Windows atau `/Users/jerry/projects/laftools-repo` di Linux/MacOS, maka Anda harus mendeklarasikan env dan mengatur config di bawah ini di file Anda **~/.bashrc**, atau cukup jalankan sebelum menjalankan perintah apa pun.",
    "iIq02l4vX": "Anda mungkin bertanya-tanya mengapa kami bertekad untuk mengembangkan kotak peralatan ini karena ada banyak alat yang dapat digunakan di Internet.",
    "iQxHIHZIL": "Tidak Ada Tema Gelap Global.",
    "iz4ROzL3": "Sangat terintegrasi dengan UI produktif",
    "k-s63C6zr": "Pratinjau",
    "lmVW9z9oh": "Pengaturan Lingkungan Sistem",
    "mpQMZfbv6": "Iklan yang Mengecewakan.",
    "rR22PTMZc": "Masalah Kebocoran Data.",
    "w5PSqC7jG": "Kinerja Jaringan Buruk.",
    "yVPMfvWhi": "Pembantu tambahan seperti catatan, manual, dll..."
}