{
    "-n\\_-_sIlP": "Sì, è un software open source e puoi utilizzarlo seguendo i termini della licenza. Tuttavia, tieni presente che essere open source non significa necessariamente che sia completamente gratuito. Sebbene la maggior parte degli strumenti possa essere utilizzata gratuitamente, alcuni potrebbero comportare costi relativi all'utilizzo dell'API e ai costi del server.",
    "0Guf1oGfh": "È solo per Windows, chiuderà tutti i terminali e i processi precedenti.",
    "3cXzYtfK": "Il nome di questo progetto è ispirato a '{0}', una classica canzone country del 1987 di Chet Atkins che occupa anche un posto speciale nel cuore dell'autore.",
    "4BZFkrKZz": "La prossima generazione di un toolbox versatile progettato per i programmatori",
    "4hth-woPf": "Supporto completo simile a GPT",
    "5B9rXHCzi": "Recentemente, stiamo eseguendo il refactoring dell'architettura di LafTools basata su next.js, i passaggi seguenti potrebbero essere modificati in base alle necessità.",
    "65xgSMWmS": "CONTRIBUTO",
    "6yjO-9dyy": "Perché la porta predefinita è 39899",
    "71DMQ0cOr": "Refactoring",
    "8Yv_neS0T": "eseguire il servizio Web sul terminale 1",
    "AKCG4Sy8U": "Nessuna accessibilità offline.",
    "AOKa_f9CC": "Iniziare",
    "Ed4z058Cr": "FOSS per sempre",
    "Fuacz5atn": "Avvia il modulo FrontEnd (spostato in web2)",
    "GRsw21x8A": "Come programmatore professionista, puoi contribuire a questo progetto e creare una richiesta pull per questo progetto, quindi potresti ottenere un abbonamento premium gratuito per tre mesi.",
    "Gez25D19n": "Anteprima",
    "HIAvRJazO": "Immagini Docker disponibili ed edizione portatile",
    "I-Zaii3HZ": "Cosa significa il nome?",
    "Jh-LM4MG": "Autonomia leggera",
    "JjpQy-eIq": "introduzione",
    "JseUpWpV6": "Ma come autore di LafTools, preferisco non raccontare la storia per ora, ahah.",
    "KFgTmafOWE4U": "Per eseguire il servizio Go nel terminale, puoi eseguire il comando seguente:",
    "LM-o4Yk6h": "Nessuno stile dell'interfaccia utente produttivo.",
    "O3eQBXxwY": "Una volta che il servizio Go è in esecuzione, dovresti essere in grado di vedere un collegamento stampato nel terminale. Ora copia questo URL e incollalo nel tuo browser per iniziare a sviluppare, andiamo!",
    "OjKP47hFt": "Anteprima",
    "PLhTRM7EV": "Se utilizzi il sistema operativo Windows, assicurati che tutti i comandi siano eseguiti in git-bash, per ulteriori informazioni fai riferimento a [CONTRIBUTION](./docs/CONTRIBUTION.md). Oltre a ciò, si consiglia di evitare di utilizzare spazi bianchi o caratteri non inglesi nel percorso del file in cui si trova questo progetto.",
    "QYPc87A2j": "Costruire",
    "QzssXokGC": "Ringraziamenti",
    "R1RzDLneG": "Questo progetto è protetto dalla GNU Affero General Public License, per maggiori dettagli consultare il file LICENSE.",
    "RV6qQL8ox": "Avvia il servizio Go (Refactoring)",
    "RXAzQfM2L": "Supporto completo della piattaforma (incluso ARMv8)",
    "SSjHemio0": "Anteprima della versione Insider di LafTools",
    "U6zkVUPTq": "Se la risposta a una qualsiasi delle domande precedenti è sì, allora dovresti considerare di provare la nostra cassetta degli attrezzi. Offre le seguenti funzionalità:",
    "Wyi852ml4": "FAQ",
    "XHqxsRy9v": "eseguire il processore CSS sul terminale 2",
    "Y-TXjTruC": "Questa pagina è generata internamente da LafTools.",
    "YCteaVxTx": "installa le dipendenze del progetto",
    "Yay3_x9EV": "Per eseguire il debug del servizio Go, lo abbiamo configurato in VSCode, puoi semplicemente seguire i passaggi seguenti:",
    "YqgCZdzaS": "Hai mai riscontrato i seguenti problemi durante l'utilizzo di questi strumenti online?",
    "ZdiGcIi8j": "Nello specifico, l'andamento di **",
    "b3c7e3r77": "Speriamo che LafTools semplifichi le tue attività quotidiane, riducendo la necessità di straordinari e aiutandoti a mantenere un sano equilibrio tra lavoro e vita privata, lasciaci semplicemente ridere della vita!",
    "bIE-DVqmU": "LafTools è ancora in fase di sviluppo, la sua interfaccia utente, le dipendenze o i prerequisiti potrebbero essere modificati in base alle necessità.",
    "ciP9qXH1I": "In effetti, la maggior parte degli strumenti che abbiamo fornito possono essere facilmente reperiti su Internet, come codec, formattatore, traduzione, codice QR, ecc… Tuttavia, non è l'approccio più comodo ed efficiente per utilizzare questi strumenti.",
    "dcOe3EU4U": "Per semplicità, supponiamo che tu abbia clonato questo repository in `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` su Windows o `/Users/jerry/projects/laftools-repo` su Linux/MacOS, dovresti dichiarare env e impostare la configurazione di seguito nel tuo file **~/.bashrc**, o semplicemente eseguirli prima di eseguire qualsiasi comando.",
    "dwWA-7VQ3": "Aspetta, in realtà c'è un'altra opzione invece di pagare semplicemente il conto.",
    "eI8YT-N_a": "Apprezzeremmo gli artisti di talento che fornissero di seguito bellissime icone:",
    "eNQDoICED": "Esempio",
    "fp-FSQcA-": "eseguire lavori extra sul terminale 3",
    "hO_WdaThV": "Tieni presente che puoi utilizzare il simbolo \"&\" per l'esecuzione in background se non desideri eseguire in alternativa questi comandi in istanze di terminale separate.",
    "i2fk8l8pB": "Di seguito sono riportati ulteriori materiali a cui puoi dare un'occhiata se desideri saperne di più dettagli su questo progetto:",
    "iIq02l4vX": "Potresti chiederti perché siamo determinati a sviluppare questo toolbox poiché esistono numerosi strumenti che possono essere utilizzati su Internet.",
    "iQxHIHZIL": "Nessun tema oscuro globale.",
    "iz4ROzL3": "Altamente integrato con un'interfaccia utente produttiva",
    "leVsK": "Questo è un progetto {0}, mi piace {1}",
    "lmVW9z9oh": "Imposta l'ambiente di sistema",
    "lzYX0DiPc": "2 febbraio 2023",
    "m3wnIDvAF": "Ispirazione",
    "mfVQaqTiZ": "Inizia a sviluppare",
    "mpQMZfbv6": "Pubblicità sconvolgenti.",
    "oM2NCFSQ1": "Questo progetto non sarebbe stato possibile senza fantastici progetti open source ai quali vorrei esprimere personalmente la mia più profonda gratitudine:",
    "rR22PTMZc": "Problema di perdita di dati.",
    "sR8yc": "Vicino",
    "t5DDvnfna": "Questo progetto è ispirato principalmente dai seguenti musicisti:",
    "tYuR4PCbV": "Anche se ci impegniamo a fornire il maggior numero possibile di servizi gratuitamente, alcune funzionalità richiedono un pagamento. Questo perché sosteniamo costi per server, manutenzione e altri aspetti operativi che sono essenziali per mantenere i nostri servizi funzionanti in modo fluido e affidabile. Facendo pagare i servizi premium, possiamo coprire questi costi e continuare a offrire servizi sostenibili e di alta qualità. Apprezziamo la tua comprensione e il tuo supporto.",
    "uavuXKo4x": "Per gli sviluppatori cinesi",
    "uh8JUYWzH": "installare la libreria globale richiesta",
    "vWi9Y_HJ6": "Sicuramente ci sono altri progetti open source che hanno beneficiato e facilitato questo progetto, che non ho potuto dettagliare in questa parte; Senza questi progetti e gli sforzi di questi talentuosi sviluppatori, LafTools non sarebbe stato possibile.",
    "vn8G5weVs": "È un numero magico composto da 3 + 98 + 99.",
    "w5PSqC7jG": "Scarse prestazioni di rete.",
    "wWRCQygDC": "Inserisci {0}",
    "wieewa7cq": "Altri materiali",
    "yVPMfvWhi": "Supporti extra come appunti, manuali, ecc..."
}