{
    "-n\\_-_sIlP": "Ya, ia adalah perisian sumber terbuka, dan anda boleh menggunakannya mengikut syarat lesen. Walau bagaimanapun, sila ambil perhatian bahawa menjadi sumber terbuka tidak semestinya bermakna ia percuma sepenuhnya. Walaupun kebanyakan alat boleh digunakan secara percuma, sesetengah alat mungkin dikenakan caj yang berkaitan dengan penggunaan API dan kos pelayan.",
    "0Guf1oGfh": "Ia untuk Windows Sahaja, ia akan menutup semua terminal dan proses sebelumnya.",
    "3cXzYtfK": "Nama projek ini diilhamkan oleh {0}, lagu desa klasik dari tahun 1987 oleh Chet Atkins yang turut mendapat tempat istimewa di hati pengarang.",
    "4BZFkrKZz": "Generasi seterusnya kotak alat serba boleh yang direka untuk pengaturcara",
    "4hth-woPf": "Sokongan penuh GPT serupa",
    "5B9rXHCzi": "Baru-baru ini, kami memfaktorkan semula seni bina LafTools berdasarkan next.js, langkah di bawah mungkin berubah mengikut keperluan.",
    "65xgSMWmS": "SUMBANGAN",
    "6yjO-9dyy": "Mengapa port lalai ialah 39899",
    "71DMQ0cOr": "Pemfaktoran semula",
    "8Yv_neS0T": "jalankan perkhidmatan web pada terminal 1",
    "AKCG4Sy8U": "Tiada Kebolehcapaian Luar Talian.",
    "AOKa_f9CC": "Bermula",
    "Ed4z058Cr": "FOSS Selamanya",
    "Fuacz5atn": "Lancarkan Modul FrontEnd (Berpindah ke web2)",
    "GRsw21x8A": "Sebagai pengaturcara profesional, anda boleh menyumbang kepada projek ini dan membuat permintaan tarik untuk projek ini, kemudian anda boleh mendapatkan keahlian premium percuma selama tiga bulan.",
    "Gez25D19n": "Pratonton",
    "HIAvRJazO": "Imej Docker dan Edisi Mudah Alih Tersedia",
    "I-Zaii3HZ": "Ada apa dengan nama?",
    "Jh-LM4MG": "Masa Jalanan Ringan",
    "JjpQy-eIq": "pengenalan",
    "JseUpWpV6": "Tetapi sebagai penulis LafTools, saya lebih suka untuk tidak bercerita buat masa ini, haha.",
    "KFgTmafOWE4U": "Untuk menjalankan perkhidmatan Go dalam terminal, anda boleh melaksanakan arahan di bawah:",
    "LM-o4Yk6h": "Tiada gaya UI Produktif.",
    "O3eQBXxwY": "Setelah perkhidmatan Go berjalan, anda sepatutnya dapat melihat pautan yang dicetak dalam terminal. Sekarang, salin URL ini dan tampalkannya ke dalam penyemak imbas anda untuk mula membangunkan, jom!",
    "OjKP47hFt": "Pratonton",
    "PLhTRM7EV": "Jika anda menggunakan OS Windows, sila pastikan semua arahan dilaksanakan dalam git-bash, ketahui lebih lanjut sila rujuk [CONTRIBUTION](./docs/CONTRIBUTION.md). Selain daripada ini, adalah disyorkan untuk mengelak daripada menggunakan sebarang ruang putih atau aksara bukan bahasa Inggeris dalam laluan fail di mana projek ini terletak.",
    "QYPc87A2j": "bina",
    "QzssXokGC": "Ucapan terima kasih",
    "R1RzDLneG": "Projek ini dilindungi di bawah GNU Affero General Public License, sila lihat fail LICENSE untuk butiran lanjut.",
    "RV6qQL8ox": "Lancarkan Perkhidmatan Go (Pemfaktoran Semula)",
    "RXAzQfM2L": "Sokongan platform penuh (termasuk ARMv8)",
    "SSjHemio0": "Pratonton Versi Insider LafTools",
    "U6zkVUPTq": "Jika jawapan kepada mana-mana di atas adalah ya, maka anda harus mempertimbangkan untuk mencuba kotak alat kami. Ia menawarkan ciri-ciri berikut:",
    "Wyi852ml4": "Soalan Lazim",
    "XHqxsRy9v": "jalankan pemproses CSS pada terminal 2",
    "Y-TXjTruC": "Halaman ini dihasilkan daripada LafTools secara dalaman.",
    "YCteaVxTx": "pasang deps projek",
    "Yay3_x9EV": "Untuk menyahpepijat perkhidmatan Go, kami telah mengkonfigurasinya dalam VSCode, anda hanya boleh mengikuti langkah-langkah di bawah:",
    "YqgCZdzaS": "Pernahkah anda menemui isu di bawah semasa menggunakan alatan dalam talian tersebut?",
    "ZdiGcIi8j": "Secara khusus, prestasi **",
    "b3c7e3r77": "Mudah-mudahan LafTools akan memudahkan tugas harian anda, mengurangkan keperluan untuk kerja lebih masa dan membantu anda mengekalkan keseimbangan kerja-kehidupan yang sihat, biarlah kami berdiam diri sahaja!",
    "bIE-DVqmU": "LafTools masih dalam pembangunan, UI, kebergantungan atau prasyaratnya mungkin berubah mengikut keperluan.",
    "ciP9qXH1I": "Sememangnya, kebanyakan alatan yang kami sediakan boleh didapati dengan mudah di Internet, seperti codec, pemformat, terjemahan, Kod QR, dll... Walau bagaimanapun, ia bukanlah pendekatan yang paling selesa dan cekap untuk menggunakan alatan ini.",
    "dcOe3EU4U": "Demi kesederhanaan, katakan anda telah mengklonkan repositori ini sama ada `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` pada Windows atau `/Users/jerry/projects/laftools-repo` pada Linux/MacOS, maka anda harus mengisytiharkan env dan tetapkan konfigurasi di bawah dalam fail anda **~/.bashrc**, atau hanya laksanakannya sebelum menjalankan sebarang arahan.",
    "dwWA-7VQ3": "Tunggu, sebenarnya ada pilihan lain dan bukannya hanya membayar bil.",
    "eI8YT-N_a": "Kami akan menghargai artis berbakat yang menyediakan ikon cantik di bawah:",
    "eNQDoICED": "Contoh",
    "fp-FSQcA-": "jalankan kerja tambahan pada terminal 3",
    "hO_WdaThV": "Ambil perhatian bahawa anda boleh menggunakan simbol '&' untuk pelaksanaan latar belakang jika anda tidak mahu menjalankan arahan ini secara alternatif dalam keadaan terminal yang berasingan.",
    "i2fk8l8pB": "Di bawah ialah bahan lanjut yang boleh anda lihat jika anda ingin mengetahui lebih terperinci tentang projek ini:",
    "iIq02l4vX": "Anda mungkin tertanya-tanya mengapa kami bertekad untuk membangunkan kotak alat ini kerana terdapat banyak alat yang boleh digunakan di Internet.",
    "iQxHIHZIL": "Tiada Tema Gelap Global.",
    "iz4ROzL3": "Sangat bersepadu dengan UI yang produktif",
    "leVsK": "Ini ialah projek {0}, saya suka {1}",
    "lmVW9z9oh": "Persediaan Persekitaran Sistem",
    "lzYX0DiPc": "2 Februari 2023",
    "m3wnIDvAF": "Inspirasi",
    "mfVQaqTiZ": "Mula Membangun",
    "mpQMZfbv6": "Iklan Yang Menjengkelkan.",
    "oM2NCFSQ1": "Projek ini tidak akan dapat dilaksanakan tanpa projek sumber terbuka yang hebat yang saya ingin mengucapkan terima kasih yang tidak terhingga kepada:",
    "rR22PTMZc": "Isu Kebocoran Data.",
    "sR8yc": "tutup",
    "t5DDvnfna": "Projek ini diilhamkan terutamanya oleh pemuzik berikut:",
    "tYuR4PCbV": "Walaupun kami berusaha untuk menyediakan sebanyak mungkin perkhidmatan secara percuma, sesetengah ciri memerlukan pembayaran. Ini kerana kami menanggung kos untuk pelayan, penyelenggaraan dan aspek operasi lain yang penting untuk memastikan perkhidmatan kami berjalan lancar dan boleh dipercayai. Dengan mengenakan bayaran untuk perkhidmatan premium, kami boleh menampung kos ini dan terus menawarkan perkhidmatan yang berkualiti tinggi dan mampan. Kami menghargai pemahaman dan sokongan anda.",
    "uavuXKo4x": "Untuk Pemaju China",
    "uh8JUYWzH": "pasang perpustakaan global yang diperlukan",
    "vWi9Y_HJ6": "Yang pasti, terdapat projek sumber terbuka lain yang telah memberi manfaat dan memudahkan projek ini, yang tidak dapat saya perincikan dalam bahagian ini; Tanpa projek-projek ini dan usaha pembangun bakat ini, LafTools tidak mungkin dapat dilaksanakan.",
    "vn8G5weVs": "Ia adalah nombor ajaib yang terdiri daripada 3 + 98 + 99.",
    "w5PSqC7jG": "Prestasi Rangkaian Lemah.",
    "wWRCQygDC": "Masukkan {0}",
    "wieewa7cq": "Bahan Lain",
    "yVPMfvWhi": "Pembantu tambahan seperti nota, manual, dll..."
}