{
    "4BZFkrKZz": "Generasi seterusnya kotak alat serba boleh yang direka untuk pengaturcara",
    "4hth-woPf": "Sokongan penuh GPT serupa",
    "5B9rXHCzi": "Baru-baru ini, kami memfaktorkan semula seni bina LafTools berdasarkan next.js, langkah di bawah mungkin berubah mengikut keperluan.",
    "71DMQ0cOr": "Pemfaktoran semula",
    "AKCG4Sy8U": "Tiada Kebolehcapaian Luar Talian.",
    "AOKa_f9CC": "Bermula",
    "Ed4z058Cr": "FOSS Selamanya",
    "HIAvRJazO": "Imej Docker dan Edisi Mudah Alih Tersedia",
    "Jh-LM4MG": "Masa Jalanan Ringan",
    "JjpQy-eIq": "pengenalan",
    "KFg*5OvU*": "Untuk menjalankan perkhidmatan Go dalam terminal, anda boleh melaksanakan arahan di bawah:",
    "LM-o4Yk6h": "Tiada gaya UI Produktif.",
    "OjKP47hFt": "Pratonton",
    "PLhTRM7EV": "Jika anda menggunakan OS Windows, sila pastikan semua arahan dilaksanakan dalam git-bash, ketahui lebih lanjut sila rujuk [CONTRIBUTION](./docs/CONTRIBUTION.md). Selain daripada ini, adalah disyorkan untuk mengelak daripada menggunakan sebarang ruang putih atau aksara bukan bahasa Inggeris dalam laluan fail di mana projek ini terletak.",
    "RV6qQL8ox": "Lancarkan Perkhidmatan Go (Pemfaktoran Semula)",
    "RXAzQfM2L": "Sokongan platform penuh (termasuk ARMv8)",
    "SSjHemio0": "Pratonton Versi Insider LafTools",
    "U6zkVUPTq": "Jika jawapan kepada mana-mana di atas adalah ya, maka anda harus mempertimbangkan untuk mencuba kotak alat kami. Ia menawarkan ciri-ciri berikut:",
    "Yay3_x9EV": "Untuk menyahpepijat perkhidmatan Go, kami telah mengkonfigurasinya dalam VSCode, anda hanya boleh mengikuti langkah-langkah di bawah:",
    "YqgCZdzaS": "Pernahkah anda menemui isu di bawah semasa menggunakan alatan dalam talian tersebut?",
    "bIE-DVqmU": "LafTools masih dalam pembangunan, UI, kebergantungan atau prasyaratnya mungkin berubah mengikut keperluan.",
    "ciP9qXH1I": "Sememangnya, kebanyakan alatan yang kami sediakan boleh didapati dengan mudah di Internet, seperti codec, pemformat, terjemahan, Kod QR, dll... Walau bagaimanapun, ia bukanlah pendekatan yang paling selesa dan cekap untuk menggunakan alatan ini.",
    "dcOe3EU4U": "Demi kesederhanaan, katakan anda telah mengklonkan repositori ini sama ada `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` pada Windows atau `/Users/jerry/projects/laftools-repo` pada Linux/MacOS, maka anda harus mengisytiharkan env dan tetapkan konfigurasi di bawah dalam fail anda **~/.bashrc**, atau hanya laksanakannya sebelum menjalankan sebarang arahan.",
    "iIq02l4vX": "Anda mungkin tertanya-tanya mengapa kami bertekad untuk membangunkan kotak alat ini kerana terdapat banyak alat yang boleh digunakan di Internet.",
    "iQxHIHZIL": "Tiada Tema Gelap Global.",
    "iz4ROzL3": "Sangat bersepadu dengan UI yang produktif",
    "k-s63C6zr": "Pratonton",
    "lmVW9z9oh": "Persediaan Persekitaran Sistem",
    "mpQMZfbv6": "Iklan Yang Menjengkelkan.",
    "rR22PTMZc": "Isu Kebocoran Data.",
    "w5PSqC7jG": "Prestasi Rangkaian Lemah.",
    "yVPMfvWhi": "Pembantu tambahan seperti nota, manual, dll..."
}