{
    "0Guf1oGfh": "Det er kun for Windows, det vil lukke alle terminaler og tidligere prosesser.",
    "3fcXzYtfK": "Navnet på dette prosjektet er inspirert av 'Laffin' At Life', en klassisk countrysang fra 1987 av Chet Atkins som også har en spesiell plass i forfatterens hjerte.",
    "4BZFkrKZz": "Den neste generasjonen av en allsidig verktøykasse designet for programmerere",
    "4hth-woPf": "Full GPT-lignende støtte",
    "5B9rXHCzi": "Nylig refaktoriserer vi arkitekturen til LafTools basert på next.js, trinnene nedenfor kan endres etter behov.",
    "65xgSMWmS": "BIDRAG",
    "71DMQ0cOr": "Refaktorering",
    "8Yv_neS0T": "kjøre webtjeneste på terminal 1",
    "AKCG4Sy8U": "Ingen frakoblet tilgjengelighet.",
    "AOKa_f9CC": "Starter",
    "Dh60DyO0O": "Forhåndsvisning (engelsk)",
    "Ed4z058Cr": "FOSS for alltid",
    "Fuacz5atn": "Start FrontEnd-modulen (flyttet til web2)",
    "HIAvRJazO": "Tilgjengelige Docker Images og Portable Edition",
    "I-Zaii3HZ": "Hva er det med navnet?",
    "Jh-LM4MG": "Lett kjøretid",
    "JjpQy-eIq": "Introduksjon",
    "KFgTmafOWE4U": "For å kjøre Go-tjeneste i terminal, kan du utføre kommandoen nedenfor:",
    "LM-o4Yk6h": "Ingen produktiv UI-stil.",
    "O3eQBXxwY": "Når Go-tjenesten kjører, skal du kunne se en lenke skrevet ut i terminalen. Nå, kopier denne URL-en og lim den inn i nettleseren din for å begynne å utvikle, la oss gå!",
    "OjKP47hFt": "Forhåndsvisning",
    "PLhTRM7EV": "Hvis du bruker Windows OS, vennligst sørg for at alle kommandoer utføres i git-bash, les mer, se [BIDRAG](./docs/CONTRIBUTION.md). Bortsett fra dette, anbefales det å unngå å bruke mellomrom eller ikke-engelske tegn i filbanen der dette prosjektet er plassert.",
    "QYPc87A2j": "Bygge",
    "QzssXokGC": "Anerkjennelser",
    "R1RzDLneG": "Dette prosjektet er beskyttet under GNU Affero General Public License, vennligst se LICENSE-filen for flere detaljer.",
    "RV6qQL8ox": "Start Go Service (Refactoring)",
    "RXAzQfM2L": "Full plattformstøtte (inkludert ARMv8)",
    "SSjHemio0": "Forhåndsvis Insider-versjonen av LafTools",
    "U6zkVUPTq": "Hvis svaret på noen av de ovennevnte er ja, bør du vurdere å prøve verktøykassen vår. Den tilbyr følgende funksjoner:",
    "Wyi852ml4": "FAQ",
    "XHqxsRy9v": "kjør CSS-prosessor på terminal 2",
    "YCteaVxTx": "installere prosjektdeps",
    "Yay3_x9EV": "For å feilsøke Go-tjenesten har vi konfigurert den i VSCode, du kan bare følge trinnene nedenfor:",
    "YqgCZdzaS": "Har du noen gang møtt problemene nedenfor mens du brukte disse nettverktøyene?",
    "b3c7e3r77": "Forhåpentligvis vil LafTools gjøre de daglige oppgavene dine enklere, redusere behovet for overtid og hjelpe deg med å opprettholde en sunn balanse mellom arbeid og privatliv.",
    "bIE-DVqmU": "LafTools er fortsatt under utvikling, brukergrensesnittet, avhengighetene eller forutsetningene kan endres etter behov.",
    "ciP9qXH1I": "De fleste verktøyene vi har levert kan faktisk enkelt finnes på Internett, for eksempel kodek, formatering, oversettelse, QR-kode, osv... Det er imidlertid ikke den mest komfortable og effektive tilnærmingen til å bruke disse verktøyene.",
    "dcOe3EU4U": "For enkelhets skyld, la oss si at du har klonet dette depotet til enten `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` på Windows eller `/Users/jerry/projects/laftools-repo` på Linux/MacOS, så bør du deklarere env og sette config nedenfor i filen **~/.bashrc**, eller bare kjøre dem før du kjører en kommando.",
    "eI8YT-N_a": "Vi vil sette pris på talentartister som har gitt under vakre ikoner:",
    "eNQDoICED": "Eksempel",
    "fp-FSQcA-": "kjøre ekstrajobber på terminal 3",
    "hO_WdaThV": "Merk at du kan bruke '&'-symbolet for bakgrunnskjøring hvis du ikke ønsker å kjøre disse kommandoene alternativt i separate terminalforekomster.",
    "i0bt7fhna": "Verktøyene for Laffin' At Life",
    "i2fk8l8pB": "Nedenfor er ytterligere materialer som du kan ta en titt på hvis du ønsker å lære mer detaljer om dette prosjektet:",
    "iIq02l4vX": "Du lurer kanskje på hvorfor vi er fast bestemt på å utvikle denne verktøykassen, siden det er mange verktøy som kan brukes på Internett.",
    "iQxHIHZIL": "Ikke noe globalt mørkt tema.",
    "iz4ROzL3": "Svært integrert med produktivt brukergrensesnitt",
    "leVsK": "Dette er et {0}-prosjekt, jeg liker {1}",
    "lmVW9z9oh": "Sett opp systemmiljø",
    "lzYX0DiPc": "2. februar 2023",
    "mfVQaqTiZ": "Begynn å utvikle",
    "mpQMZfbv6": "Opprørende annonser.",
    "oM2NCFSQ1": "Dette prosjektet ville ikke vært mulig uten fantastiske åpen kildekode-prosjekter som jeg personlig vil uttrykke min dypeste takknemlighet til:",
    "rR22PTMZc": "Problem med datalekkasje.",
    "uavuXKo4x": "For Kina-utviklere",
    "uh8JUYWzH": "installer det nødvendige globale biblioteket",
    "vWi9Y_HJ6": "Sikkert er det andre åpen kildekode-prosjekter som har vært til nytte og tilrettelagt for dette prosjektet, som jeg ikke kunne beskrive i denne delen; Uten disse prosjektene og disse talentutviklernes innsats hadde ikke LafTools vært mulig.",
    "w5PSqC7jG": "Dårlig nettverksytelse.",
    "wWRCQygDC": "Skriv inn {0}",
    "wieewa7cq": "Andre materialer",
    "yVPMfvWhi": "Ekstra hjelpere som notater, manualer osv..."
}