{
    "4BZFkrKZz": "Kolejna generacja wszechstronnego zestawu narzędzi przeznaczonego dla programistów",
    "4hth-woPf": "Pełna obsługa podobna do GPT",
    "5B9rXHCzi": "Ostatnio refaktoryzujemy architekturę LafTools w oparciu o next.js, poniższe kroki mogą ulec zmianie w razie potrzeby.",
    "71DMQ0cOr": "Refaktoryzacja",
    "AKCG4Sy8U": "Brak dostępności offline.",
    "AOKa_f9CC": "Pierwsze kroki",
    "Ed4z058Cr": "FOSS na zawsze",
    "HIAvRJazO": "Dostępne obrazy platformy Docker i wersja przenośna",
    "Jh-LM4MG": "Lekki czas działania",
    "JjpQy-eIq": "Wstęp",
    "KFg*5OvU*": "Aby uruchomić usługę Go w terminalu, możesz wykonać poniższe polecenie:",
    "LM-o4Yk6h": "Brak produktywnego stylu interfejsu użytkownika.",
    "OjKP47hFt": "Zapowiedź",
    "PLhTRM7EV": "Jeśli używasz systemu operacyjnego Windows, upewnij się, że wszystkie polecenia są wykonywane w git-bash. Więcej informacji znajdziesz w [WKŁAD](./docs/CONTRIBUTION.md). Poza tym zaleca się unikanie używania spacji lub znaków innych niż angielskie w ścieżce pliku, w którym znajduje się ten projekt.",
    "RV6qQL8ox": "Uruchom usługę Go (refaktoryzacja)",
    "RXAzQfM2L": "Pełna obsługa platformy (w tym ARMv8)",
    "SSjHemio0": "Wyświetl podgląd wersji Insider LafTools",
    "U6zkVUPTq": "Jeśli odpowiedź na którekolwiek z powyższych pytań brzmi „tak”, powinieneś rozważyć wypróbowanie naszego zestawu narzędzi. Oferuje następujące funkcje:",
    "Yay3_x9EV": "Aby debugować usługę Go, skonfigurowaliśmy ją w VSCode, możesz po prostu wykonać poniższe kroki:",
    "YqgCZdzaS": "Czy kiedykolwiek spotkałeś się z poniższymi problemami podczas korzystania z tych narzędzi online?",
    "bIE-DVqmU": "LafTools jest wciąż w fazie rozwoju, jego interfejs użytkownika, zależności lub wymagania wstępne mogą ulec zmianie w razie potrzeby.",
    "ciP9qXH1I": "Rzeczywiście, większość narzędzi, które udostępniliśmy, można łatwo znaleźć w Internecie, takich jak kodek, formater, tłumaczenie, kod QR itp. Jednak korzystanie z tych narzędzi nie jest najwygodniejszym i najskuteczniejszym podejściem.",
    "dcOe3EU4U": "Dla uproszczenia załóżmy, że sklonowałeś to repozytorium do `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` w systemie Windows lub `/Users/jerry/projects/laftools-repo` w systemie Windows Linux/MacOS, powinieneś zadeklarować env i ustawić konfigurację poniżej w swoim pliku **~/.bashrc** lub po prostu wykonać je przed uruchomieniem dowolnego polecenia.",
    "iIq02l4vX": "Możesz się zastanawiać, dlaczego jesteśmy zdeterminowani opracować ten zestaw narzędzi, skoro w Internecie można korzystać z wielu narzędzi.",
    "iQxHIHZIL": "Brak globalnego ciemnego motywu.",
    "iz4ROzL3": "Wysoce zintegrowany z produktywnym interfejsem użytkownika",
    "k-s63C6zr": "Zapowiedź",
    "lmVW9z9oh": "Skonfiguruj środowisko systemowe",
    "mpQMZfbv6": "Denerwujące reklamy.",
    "rR22PTMZc": "Problem wycieku danych.",
    "w5PSqC7jG": "Słaba wydajność sieci.",
    "yVPMfvWhi": "Dodatkowe pomoce, takie jak notatki, podręczniki itp."
}