{
    "-n\\_-_sIlP": "Tak, jest to oprogramowanie typu open source i można z niego korzystać zgodnie z warunkami licencji. Należy jednak pamiętać, że bycie oprogramowaniem typu open source nie musi oznaczać, że jest całkowicie bezpłatne. Chociaż z większości narzędzi można korzystać bezpłatnie, z niektórych mogą wiązać się opłaty związane z korzystaniem z interfejsu API i kosztami serwera.",
    "0Guf1oGfh": "Jest przeznaczony tylko dla systemu Windows. Zamknie wszystkie terminale i poprzednie procesy.",
    "3cXzYtfK": "Nazwa tego projektu inspirowana jest „{0}”, klasyczną piosenką country z 1987 roku autorstwa Cheta Atkinsa, która również zajmuje szczególne miejsce w sercu autora.",
    "4BZFkrKZz": "Kolejna generacja wszechstronnego zestawu narzędzi przeznaczonego dla programistów",
    "4hth-woPf": "Pełna obsługa podobna do GPT",
    "5B9rXHCzi": "Ostatnio refaktoryzujemy architekturę LafTools w oparciu o next.js, poniższe kroki mogą ulec zmianie w razie potrzeby.",
    "65xgSMWmS": "SKŁADKA",
    "6yjO-9dyy": "Dlaczego domyślny port to 39899",
    "71DMQ0cOr": "Refaktoryzacja",
    "8Yv_neS0T": "uruchom usługę internetową na terminalu 1",
    "AKCG4Sy8U": "Brak dostępności offline.",
    "AOKa_f9CC": "Pierwsze kroki",
    "Ed4z058Cr": "FOSS na zawsze",
    "Fuacz5atn": "Uruchom moduł FrontEnd (przeniesiony do web2)",
    "GRsw21x8A": "Jako profesjonalny programista możesz przyczynić się do tego projektu i utworzyć żądanie ściągnięcia dla tego projektu, a następnie możesz uzyskać bezpłatne członkostwo premium na trzy miesiące.",
    "Gez25D19n": "Zapowiedź",
    "HIAvRJazO": "Dostępne obrazy platformy Docker i wersja przenośna",
    "I-Zaii3HZ": "O co chodzi z nazwą?",
    "Jh-LM4MG": "Lekki czas działania",
    "JjpQy-eIq": "Wstęp",
    "JseUpWpV6": "Ale jako autor LafTools wolę na razie nie opowiadać tej historii, haha.",
    "KFgTmafOWE4U": "Aby uruchomić usługę Go w terminalu, możesz wykonać poniższe polecenie:",
    "LM-o4Yk6h": "Brak produktywnego stylu interfejsu użytkownika.",
    "O3eQBXxwY": "Po uruchomieniu usługi Go powinieneś zobaczyć link wydrukowany w terminalu. Teraz skopiuj ten adres URL i wklej go do przeglądarki, aby rozpocząć programowanie, chodźmy!",
    "OjKP47hFt": "Zapowiedź",
    "PLhTRM7EV": "Jeśli używasz systemu operacyjnego Windows, upewnij się, że wszystkie polecenia są wykonywane w git-bash. Więcej informacji znajdziesz w [WKŁAD](./docs/CONTRIBUTION.md). Poza tym zaleca się unikanie używania spacji lub znaków innych niż angielskie w ścieżce pliku, w którym znajduje się ten projekt.",
    "QYPc87A2j": "Zbudować",
    "QzssXokGC": "Podziękowanie",
    "R1RzDLneG": "Ten projekt jest chroniony na podstawie Powszechnej Licencji Publicznej GNU Affero. Więcej szczegółów znajdziesz w pliku LICENCJA.",
    "RV6qQL8ox": "Uruchom usługę Go (refaktoryzacja)",
    "RXAzQfM2L": "Pełna obsługa platformy (w tym ARMv8)",
    "SSjHemio0": "Wyświetl podgląd wersji Insider LafTools",
    "U6zkVUPTq": "Jeśli odpowiedź na którekolwiek z powyższych pytań brzmi „tak”, powinieneś rozważyć wypróbowanie naszego zestawu narzędzi. Oferuje następujące funkcje:",
    "Wyi852ml4": "Często zadawane pytania",
    "XHqxsRy9v": "uruchom procesor CSS na terminalu 2",
    "Y-TXjTruC": "Ta strona jest generowana wewnętrznie przez LafTools.",
    "YCteaVxTx": "zainstaluj deps projektu",
    "Yay3_x9EV": "Aby debugować usługę Go, skonfigurowaliśmy ją w VSCode, możesz po prostu wykonać poniższe kroki:",
    "YqgCZdzaS": "Czy kiedykolwiek spotkałeś się z poniższymi problemami podczas korzystania z tych narzędzi online?",
    "ZdiGcIi8j": "W szczególności wydajność **",
    "b3c7e3r77": "Mamy nadzieję, że LafTools ułatwi Ci codzienne zadania, zmniejszy potrzebę nadgodzin i pomoże Ci zachować zdrową równowagę między życiem zawodowym a prywatnym. Pozwól nam po prostu bawić się życiem!",
    "bIE-DVqmU": "LafTools jest wciąż w fazie rozwoju, jego interfejs użytkownika, zależności lub wymagania wstępne mogą ulec zmianie w razie potrzeby.",
    "ciP9qXH1I": "Rzeczywiście, większość narzędzi, które udostępniliśmy, można łatwo znaleźć w Internecie, takich jak kodek, formater, tłumaczenie, kod QR itp. Jednak korzystanie z tych narzędzi nie jest najwygodniejszym i najskuteczniejszym podejściem.",
    "dcOe3EU4U": "Dla uproszczenia załóżmy, że sklonowałeś to repozytorium do `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` w systemie Windows lub `/Users/jerry/projects/laftools-repo` w systemie Windows Linux/MacOS, powinieneś zadeklarować env i ustawić konfigurację poniżej w swoim pliku **~/.bashrc** lub po prostu wykonać je przed uruchomieniem dowolnego polecenia.",
    "dwWA-7VQ3": "Czekaj, właściwie istnieje inna opcja zamiast po prostu płacić rachunek.",
    "eI8YT-N_a": "Bylibyśmy wdzięczni utalentowanym artystom, którzy dostarczyli poniżej piękne ikony:",
    "eNQDoICED": "Przykład",
    "fp-FSQcA-": "uruchom dodatkowe zadania na terminalu 3",
    "hO_WdaThV": "Pamiętaj, że możesz użyć symbolu „&” do wykonania w tle, jeśli nie chcesz alternatywnie uruchamiać tych poleceń w oddzielnych instancjach terminala.",
    "i2fk8l8pB": "Poniżej znajdują się dalsze materiały, z którymi możesz się zapoznać, jeśli chcesz poznać więcej szczegółów na temat tego projektu:",
    "iIq02l4vX": "Możesz się zastanawiać, dlaczego jesteśmy zdeterminowani opracować ten zestaw narzędzi, skoro w Internecie można korzystać z wielu narzędzi.",
    "iQxHIHZIL": "Brak globalnego ciemnego motywu.",
    "iz4ROzL3": "Wysoce zintegrowany z produktywnym interfejsem użytkownika",
    "leVsK": "To jest projekt {0}, podoba mi się {1}",
    "lmVW9z9oh": "Skonfiguruj środowisko systemowe",
    "lzYX0DiPc": "2 lutego 2023 r",
    "m3wnIDvAF": "Inspiracja",
    "mfVQaqTiZ": "Zacznij się rozwijać",
    "mpQMZfbv6": "Denerwujące reklamy.",
    "oM2NCFSQ1": "Ten projekt nie byłby możliwy bez świetnych projektów open source, którym chciałbym osobiście wyrazić moją najgłębszą wdzięczność:",
    "rR22PTMZc": "Problem wycieku danych.",
    "sR8yc": "Zamknąć",
    "t5DDvnfna": "Projekt ten inspirowany jest przede wszystkim następującymi muzykami:",
    "tYuR4PCbV": "Chociaż staramy się świadczyć jak najwięcej usług bezpłatnie, niektóre funkcje wymagają płatności. Dzieje się tak dlatego, że ponosimy koszty serwerów, konserwacji i innych aspektów operacyjnych, które są niezbędne do zapewnienia sprawnego i niezawodnego działania naszych usług. Pobierając opłaty za usługi premium, możemy pokryć te koszty i nadal oferować wysokiej jakości, zrównoważone usługi. Dziękujemy za zrozumienie i wsparcie.",
    "uavuXKo4x": "Dla chińskich programistów",
    "uh8JUYWzH": "zainstaluj wymaganą bibliotekę globalną",
    "vWi9Y_HJ6": "Z pewnością istnieją inne projekty open source, które przyniosły korzyści i ułatwiły ten projekt, których nie mogłem szczegółowo opisać w tej części; Bez tych projektów i wysiłków twórców talentów LafTools nie byłoby możliwe.",
    "vn8G5weVs": "To magiczna liczba składająca się z 3 + 98 + 99.",
    "w5PSqC7jG": "Słaba wydajność sieci.",
    "wWRCQygDC": "Wpisz {0}",
    "wieewa7cq": "Inne materiały",
    "yVPMfvWhi": "Dodatkowe pomoce, takie jak notatki, podręczniki itp."
}