{
    "4BZFkrKZz": "A próxima geração de uma caixa de ferramentas versátil projetada para programadores",
    "4hth-woPf": "Suporte completo semelhante ao GPT",
    "5B9rXHCzi": "Recentemente, estamos refatorando a arquitetura do LafTools com base em next.js. As etapas abaixo podem ser alteradas conforme necessário.",
    "71DMQ0cOr": "Reestruturação",
    "AKCG4Sy8U": "Sem acessibilidade off-line.",
    "AOKa_f9CC": "Começando",
    "Ed4z058Cr": "Software Livre para Sempre",
    "HIAvRJazO": "Imagens Docker disponíveis e edição portátil",
    "Jh-LM4MG": "Tempo de execução leve",
    "JjpQy-eIq": "Introdução",
    "KFg*5OvU*": "Para executar o serviço Go no terminal, você pode executar o comando abaixo:",
    "LM-o4Yk6h": "Nenhum estilo de UI produtiva.",
    "OjKP47hFt": "Visualização",
    "PLhTRM7EV": "Se você estiver usando o sistema operacional Windows, certifique-se de que todos os comandos sejam executados no git-bash. Para saber mais, consulte [CONTRIBUTION](./docs/CONTRIBUTION.md). Além disso, é recomendável evitar o uso de espaços em branco ou caracteres que não sejam do inglês no caminho do arquivo onde este projeto está localizado.",
    "RV6qQL8ox": "Iniciar serviço Go (refatoração)",
    "RXAzQfM2L": "Suporte completo à plataforma (incluindo ARMv8)",
    "SSjHemio0": "Visualize a versão interna do LafTools",
    "U6zkVUPTq": "Se a resposta a alguma das perguntas acima for sim, você deve considerar experimentar nossa caixa de ferramentas. Ele oferece os seguintes recursos:",
    "Yay3_x9EV": "Para depurar o serviço Go, nós o configuramos no VSCode, basta seguir os passos abaixo:",
    "YqgCZdzaS": "Você já encontrou os problemas abaixo ao usar essas ferramentas online?",
    "bIE-DVqmU": "LafTools ainda está em desenvolvimento, sua UI, dependências ou pré-requisitos podem ser alterados conforme necessário.",
    "ciP9qXH1I": "Na verdade, a maioria das ferramentas que disponibilizamos podem ser facilmente encontradas na Internet, como codec, formatador, tradução, QR Code, etc… No entanto, não é a abordagem mais confortável e eficiente para utilizar estas ferramentas.",
    "dcOe3EU4U": "Para simplificar, digamos que você clonou este repositório para `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` no Windows ou `/Users/jerry/projects/laftools-repo` no Linux/MacOS, então você deve declarar env e definir a configuração abaixo em seu arquivo **~/.bashrc**, ou simplesmente executá-los antes de executar qualquer comando.",
    "iIq02l4vX": "Você pode se perguntar por que estamos determinados a desenvolver esta caixa de ferramentas, já que existem inúmeras ferramentas que podem ser usadas na Internet.",
    "iQxHIHZIL": "Nenhum tema escuro global.",
    "iz4ROzL3": "Altamente integrado com UI produtiva",
    "k-s63C6zr": "Visualização",
    "lmVW9z9oh": "Configurar ambiente do sistema",
    "mpQMZfbv6": "Anúncios perturbadores.",
    "rR22PTMZc": "Problema de vazamento de dados.",
    "w5PSqC7jG": "Mau desempenho da rede.",
    "yVPMfvWhi": "Ajudantes extras, como notas, manuais, etc."
}