{
    "-n\\_-_sIlP": "Да, это программное обеспечение с открытым исходным кодом, и вы можете использовать его в соответствии с условиями лицензии. Однако обратите внимание, что открытый исходный код не обязательно означает, что он полностью бесплатен. Хотя большинство инструментов можно использовать бесплатно, за некоторые может взиматься плата, связанная с использованием API и затратами на сервер.",
    "0Guf1oGfh": "Это только для Windows, оно закроет все терминалы и предыдущие процессы.",
    "3cXzYtfK": "Название этого проекта навеяно «{0}», классической кантри-песней Чета Аткинса 1987 года, которая также занимает особое место в сердце автора.",
    "4BZFkrKZz": "Следующее поколение универсального набора инструментов, предназначенного для программистов.",
    "4hth-woPf": "Полная поддержка GPT",
    "5B9rXHCzi": "Недавно мы провели рефакторинг архитектуры LafTools на основе next.js, приведенные ниже шаги могут быть изменены по мере необходимости.",
    "65xgSMWmS": "ВКЛАД",
    "6yjO-9dyy": "Почему порт по умолчанию — 39899",
    "71DMQ0cOr": "Рефакторинг",
    "8Yv_neS0T": "запустить веб-сервис на терминале 1",
    "AKCG4Sy8U": "Нет автономного доступа.",
    "AOKa_f9CC": "Начиная",
    "Ed4z058Cr": "ФОСС навсегда",
    "Fuacz5atn": "Запустить модуль FrontEnd (перемещен в web2)",
    "GRsw21x8A": "Как профессиональный программист, вы можете внести свой вклад в этот проект и создать запрос на включение для этого проекта, после чего вы сможете получить бесплатное премиум-членство на три месяца.",
    "Gez25D19n": "Предварительный просмотр",
    "HIAvRJazO": "Доступные образы Docker и портативная версия",
    "I-Zaii3HZ": "Что с именем?",
    "Jh-LM4MG": "Легкая среда выполнения",
    "JjpQy-eIq": "Введение",
    "JseUpWpV6": "Но как автор LafTools, я предпочитаю пока не рассказывать эту историю, ха-ха.",
    "KFgTmafOWE4U": "Чтобы запустить службу Go в терминале, вы можете выполнить следующую команду:",
    "LM-o4Yk6h": "Нет продуктивного стиля пользовательского интерфейса.",
    "O3eQBXxwY": "После запуска службы Go вы сможете увидеть ссылку, распечатанную в терминале. Теперь скопируйте этот URL-адрес и вставьте его в свой браузер, чтобы начать разработку, поехали!",
    "OjKP47hFt": "Предварительный просмотр",
    "PLhTRM7EV": "Если вы используете ОС Windows, убедитесь, что все команды выполняются в git-bash. Дополнительную информацию см. в [ВКЛАД](./docs/CONTRIBUTION.md). Помимо этого, рекомендуется избегать использования пробелов или неанглийских символов в пути к файлу, где находится этот проект.",
    "QYPc87A2j": "Строить",
    "QzssXokGC": "Благодарности",
    "R1RzDLneG": "Этот проект защищен Генеральной общественной лицензией GNU Affero. Более подробную информацию см. в файле ЛИЦЕНЗИИ.",
    "RV6qQL8ox": "Запуск службы Go (рефакторинг)",
    "RXAzQfM2L": "Полная поддержка платформ (включая ARMv8)",
    "SSjHemio0": "Предварительный просмотр инсайдерской версии LafTools",
    "U6zkVUPTq": "Если ответ на любой из вышеперечисленных вопросов положительный, вам следует рассмотреть возможность использования нашего набора инструментов. Он предлагает следующие возможности:",
    "Wyi852ml4": "Часто задаваемые вопросы",
    "XHqxsRy9v": "запустить процессор CSS на терминале 2",
    "Y-TXjTruC": "Эта страница создается внутри LafTools.",
    "YCteaVxTx": "установить описания проекта",
    "Yay3_x9EV": "Чтобы отладить службу Go, мы настроили ее в VSCode, вы можете просто выполнить следующие шаги:",
    "YqgCZdzaS": "Сталкивались ли вы когда-нибудь с указанными ниже проблемами при использовании этих онлайн-инструментов?",
    "ZdiGcIi8j": "В частности, производительность **",
    "b3c7e3r77": "Надеемся, что LafTools облегчит ваши повседневные задачи, уменьшит необходимость в сверхурочной работе и поможет вам поддерживать здоровый баланс между работой и личной жизнью, давайте просто посмеяться над жизнью!",
    "bIE-DVqmU": "LafTools все еще находится в стадии разработки, его пользовательский интерфейс, зависимости или предварительные требования могут быть изменены по мере необходимости.",
    "ciP9qXH1I": "Действительно, большинство предоставленных нами инструментов можно легко найти в Интернете, например, кодек, форматтер, перевод, QR-код и т. д. Однако это не самый удобный и эффективный подход к использованию этих инструментов.",
    "dcOe3EU4U": "Для простоты предположим, что вы клонировали этот репозиторий либо в `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` в Windows, либо в `/Users/jerry/projects/laftools-repo` в Linux/MacOS, тогда вам следует объявить env и установить конфигурацию ниже в вашем файле **~/.bashrc** или просто выполнить их перед запуском любой команды.",
    "dwWA-7VQ3": "Подождите, на самом деле есть другой вариант вместо того, чтобы просто оплатить счет.",
    "eI8YT-N_a": "Мы будем признательны талантливым художникам, предоставившим ниже красивые иконки:",
    "eNQDoICED": "Пример",
    "fp-FSQcA-": "запустить дополнительные задания на терминале 3",
    "hO_WdaThV": "Обратите внимание, что вы можете использовать символ «&» для фонового выполнения, если вы не хотите альтернативно запускать эти команды в отдельных экземплярах терминала.",
    "i2fk8l8pB": "Ниже приведены дополнительные материалы, с которыми вы можете ознакомиться, если хотите узнать больше об этом проекте:",
    "iIq02l4vX": "Вы можете задаться вопросом, почему мы полны решимости разработать этот набор инструментов, поскольку в Интернете можно использовать множество инструментов.",
    "iQxHIHZIL": "Нет глобальной темной темы.",
    "iz4ROzL3": "Высокая интеграция с продуктивным пользовательским интерфейсом",
    "leVsK": "Это проект {0}, мне нравится {1}",
    "lmVW9z9oh": "Настройка системной среды",
    "lzYX0DiPc": "2 февраля 2023 г.",
    "m3wnIDvAF": "Вдохновение",
    "mfVQaqTiZ": "Начать разработку",
    "mpQMZfbv6": "Возмутительная реклама.",
    "oM2NCFSQ1": "Этот проект был бы невозможен без замечательных проектов с открытым исходным кодом, которым я хотел бы лично выразить глубочайшую благодарность:",
    "rR22PTMZc": "Проблема утечки данных.",
    "sR8yc": "Закрывать",
    "t5DDvnfna": "Этот проект в первую очередь вдохновлен следующими музыкантами:",
    "tYuR4PCbV": "Хотя мы стремимся предоставлять как можно больше услуг бесплатно, некоторые функции требуют оплаты. Это связано с тем, что мы несем расходы на серверы, обслуживание и другие эксплуатационные аспекты, необходимые для бесперебойной и надежной работы наших сервисов. Взимая плату за услуги премиум-класса, мы можем покрыть эти расходы и продолжать предлагать высококачественные и устойчивые услуги. Мы ценим ваше понимание и поддержку.",
    "uavuXKo4x": "Для китайских разработчиков",
    "uh8JUYWzH": "установить необходимую глобальную библиотеку",
    "vWi9Y_HJ6": "Конечно, есть и другие проекты с открытым исходным кодом, которые принесли пользу и облегчили этот проект, о которых я не мог подробно рассказать в этой части; Без этих проектов и усилий этих талантливых разработчиков создание LafTools было бы невозможно.",
    "vn8G5weVs": "Это магическое число, состоящее из 3+98+99.",
    "w5PSqC7jG": "Плохая производительность сети.",
    "wWRCQygDC": "Введите {0}",
    "wieewa7cq": "Другие материалы",
    "yVPMfvWhi": "Дополнительные помощники, такие как заметки, руководства и т. д."
}