{
    "0Guf1oGfh": "Det är endast för Windows, det kommer att stänga alla terminaler och tidigare processer.",
    "3fcXzYtfK": "Namnet på detta projekt är inspirerat av 'Laffin' At Life', en klassisk countrylåt från 1987 av Chet Atkins som också har en speciell plats i författarens hjärta.",
    "4BZFkrKZz": "Nästa generation av en mångsidig verktygslåda designad för programmerare",
    "4hth-woPf": "Fullständigt GPT-liknande stöd",
    "5B9rXHCzi": "Nyligen omarbetar vi arkitekturen för LafTools baserat på next.js, nedanstående steg kan ändras vid behov.",
    "65xgSMWmS": "BIDRAG",
    "71DMQ0cOr": "Refaktorering",
    "8Yv_neS0T": "kör webbtjänst på terminal 1",
    "AKCG4Sy8U": "Ingen offlinetillgänglighet.",
    "AOKa_f9CC": "Komma igång",
    "Dh60DyO0O": "Förhandsgranskning (engelska)",
    "Ed4z058Cr": "FOSS för alltid",
    "Fuacz5atn": "Starta FrontEnd-modul (Flyttad till web2)",
    "HIAvRJazO": "Tillgängliga Docker-bilder och Portable Edition",
    "I-Zaii3HZ": "Vad är det med namnet?",
    "Jh-LM4MG": "Lättvikts körtid",
    "JjpQy-eIq": "Introduktion",
    "KFgTmafOWE4U": "För att köra Go-tjänst i terminal kan du köra följande kommando:",
    "LM-o4Yk6h": "Ingen produktiv UI-stil.",
    "O3eQBXxwY": "När Go-tjänsten körs bör du kunna se en länk utskriven i terminalen. Nu, kopiera denna URL och klistra in den i din webbläsare för att börja utveckla, låt oss köra!",
    "OjKP47hFt": "Förhandsvisning",
    "PLhTRM7EV": "Om du använder Windows OS, se till att alla kommandon körs i git-bash, läs mer se [CONTRIBUTION](./docs/CONTRIBUTION.md). Bortsett från detta rekommenderas det att undvika att använda blanksteg eller icke-engelska tecken i filsökvägen där detta projekt finns.",
    "QYPc87A2j": "Bygga",
    "QzssXokGC": "Erkännanden",
    "R1RzDLneG": "Detta projekt är skyddat under GNU Affero General Public License, se LICENS-filen för mer information.",
    "RV6qQL8ox": "Starta Go Service (refaktorering)",
    "RXAzQfM2L": "Fullständigt plattformsstöd (inklusive ARMv8)",
    "SSjHemio0": "Förhandsgranska Insider-versionen av LafTools",
    "U6zkVUPTq": "Om svaret på något av ovanstående är ja, bör du överväga att prova vår verktygslåda. Den erbjuder följande funktioner:",
    "Wyi852ml4": "FAQ",
    "XHqxsRy9v": "kör CSS-processor på terminal 2",
    "YCteaVxTx": "installera projektdeps",
    "Yay3_x9EV": "För att felsöka Go-tjänsten har vi konfigurerat den i VSCode, du kan bara följa nedanstående steg:",
    "YqgCZdzaS": "Har du någonsin stött på problemen nedan när du använde dessa onlineverktyg?",
    "b3c7e3r77": "Förhoppningsvis kommer LafTools att göra dina dagliga sysslor enklare, minska behovet av övertid och hjälpa dig att upprätthålla en hälsosam balans mellan arbete och privatliv, låt oss bara njut av livet!",
    "bIE-DVqmU": "LafTools är fortfarande under utveckling, dess användargränssnitt, beroenden eller förutsättningar kan ändras vid behov.",
    "ciP9qXH1I": "De flesta verktyg vi har tillhandahållit kan faktiskt lätt hittas på Internet, såsom codec, formatterare, översättning, QR-kod, etc... Det är dock inte det mest bekväma och effektiva sättet att använda dessa verktyg.",
    "dcOe3EU4U": "För enkelhetens skull, låt oss säga att du har klonat det här arkivet till antingen `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` på Windows eller `/Users/jerry/projects/laftools-repo` på Linux/MacOS, då bör du deklarera env och ställa in config nedan i din fil **~/.bashrc**, eller helt enkelt köra dem innan du kör något kommando.",
    "eI8YT-N_a": "Vi skulle uppskatta talangartister som tillhandahåller nedanstående vackra ikoner:",
    "eNQDoICED": "Exempel",
    "fp-FSQcA-": "köra extrajobb på terminal 3",
    "hO_WdaThV": "Observera att du kan använda '&'-symbolen för bakgrundsexekvering om du inte vill köra dessa kommandon alternativt i separata terminalinstanser.",
    "i0bt7fhna": "Verktygen för Laffin' At Life",
    "i2fk8l8pB": "Nedan finns ytterligare material som du kan ta en titt på om du vill veta mer om detta projekt:",
    "iIq02l4vX": "Du kanske undrar varför vi är fast beslutna att utveckla denna verktygslåda eftersom det finns många verktyg som kan användas på Internet.",
    "iQxHIHZIL": "Inget globalt mörkt tema.",
    "iz4ROzL3": "Mycket integrerad med produktivt användargränssnitt",
    "leVsK": "Det här är ett {0}-projekt, jag gillar {1}",
    "lmVW9z9oh": "Konfigurera systemmiljön",
    "lzYX0DiPc": "2 februari 2023",
    "mfVQaqTiZ": "Börja utveckla",
    "mpQMZfbv6": "Upprörande reklam.",
    "oM2NCFSQ1": "Detta projekt hade inte varit möjligt utan fantastiska projekt med öppen källkod som jag personligen skulle vilja uttrycka min djupaste tacksamhet till:",
    "rR22PTMZc": "Problem med dataläckage.",
    "uavuXKo4x": "För utvecklare i Kina",
    "uh8JUYWzH": "installera det globala biblioteket",
    "vWi9Y_HJ6": "För visst finns det andra projekt med öppen källkod som har gynnat och underlättat detta projekt, som jag inte kunde beskriva i den här delen; Utan dessa projekt och dessa talangutvecklares insatser hade LafTools inte varit möjligt.",
    "w5PSqC7jG": "Dålig nätverksprestanda.",
    "wWRCQygDC": "Ange {0}",
    "wieewa7cq": "Andra material",
    "yVPMfvWhi": "Extra hjälpmedel såsom anteckningar, manualer, etc..."
}