{
    "-n\\_-_sIlP": "ใช่ มันเป็นซอฟต์แวร์โอเพ่นซอร์ส และคุณสามารถใช้งานได้ตามเงื่อนไขของใบอนุญาต อย่างไรก็ตาม โปรดทราบว่าการเป็นโอเพ่นซอร์สไม่ได้หมายความว่าจะไม่มีค่าใช้จ่ายทั้งหมดเสมอไป แม้ว่าเครื่องมือส่วนใหญ่จะสามารถใช้งานได้ฟรี แต่บางเครื่องมืออาจมีค่าใช้จ่ายที่เกี่ยวข้องกับการใช้งาน API และต้นทุนเซิร์ฟเวอร์",
    "0Guf1oGfh": "มีไว้สำหรับ Windows เท่านั้น โดยจะปิดเทอร์มินัลและกระบวนการก่อนหน้าทั้งหมด",
    "3cXzYtfK": "ชื่อของโปรเจ็กต์นี้ได้รับแรงบันดาลใจจาก {0} ซึ่งเป็นเพลงคันทรีคลาสสิกจากปี 1987 ของ Chet Atkins ซึ่งมีความพิเศษอยู่ในใจของผู้แต่งด้วย",
    "4BZFkrKZz": "กล่องเครื่องมืออเนกประสงค์เจเนอเรชันถัดไปที่ออกแบบมาสำหรับโปรแกรมเมอร์",
    "4hth-woPf": "รองรับ GPT เต็มรูปแบบ",
    "5B9rXHCzi": "ล่าสุด เรากำลังปรับโครงสร้างสถาปัตยกรรมของ LafTools ใหม่โดยใช้ next.js ขั้นตอนด้านล่างอาจมีการเปลี่ยนแปลงตามความจำเป็น",
    "65xgSMWmS": "ผลงาน",
    "6yjO-9dyy": "เหตุใดพอร์ตเริ่มต้นจึงเป็น 39899",
    "71DMQ0cOr": "การปรับโครงสร้างใหม่",
    "8Yv_neS0T": "เรียกใช้บริการเว็บบนเทอร์มินัล 1",
    "AKCG4Sy8U": "ไม่มีการเข้าถึงแบบออฟไลน์",
    "AOKa_f9CC": "เริ่มต้นใช้งาน",
    "Ed4z058Cr": "ฟอสส์ตลอดไป",
    "Fuacz5atn": "เปิดตัวโมดูล FrontEnd (ย้ายไปที่ web2)",
    "GRsw21x8A": "ในฐานะโปรแกรมเมอร์มืออาชีพ คุณสามารถมีส่วนร่วมในโปรเจ็กต์นี้และสร้างคำขอดึงสำหรับโปรเจ็กต์นี้ได้ จากนั้นคุณจะได้รับสิทธิ์เป็นสมาชิกระดับพรีเมียมฟรีเป็นเวลาสามเดือน",
    "Gez25D19n": "ดูตัวอย่าง",
    "HIAvRJazO": "มี Docker Images และ Portable Edition",
    "I-Zaii3HZ": "ชื่ออะไรคะ?",
    "Jh-LM4MG": "รันไทม์น้ำหนักเบา",
    "JjpQy-eIq": "การแนะนำ",
    "JseUpWpV6": "แต่ในฐานะผู้เขียน LafTools ตอนนี้ผมขอไม่เล่าเรื่องนี้ก่อนนะครับ 555",
    "KFgTmafOWE4U": "หากต้องการเรียกใช้บริการ Go ในเทอร์มินัล คุณสามารถดำเนินการคำสั่งด้านล่าง:",
    "LM-o4Yk6h": "ไม่มีสไตล์ UI ที่มีประสิทธิผล",
    "O3eQBXxwY": "เมื่อบริการ Go ทำงาน คุณควรจะเห็นลิงก์ที่พิมพ์ออกมาในเทอร์มินัล ตอนนี้ คัดลอก URL นี้และวางลงในเบราว์เซอร์ของคุณเพื่อเริ่มพัฒนา ลุยเลย!",
    "OjKP47hFt": "ดูตัวอย่าง",
    "PLhTRM7EV": "หากคุณใช้ Windows OS โปรดตรวจสอบให้แน่ใจว่าคำสั่งทั้งหมดดำเนินการใน git-bash เรียนรู้เพิ่มเติม โปรดดูที่ [CONTRIBUTION](./docs/CONTRIBUTION.md) นอกจากนี้ ขอแนะนำให้หลีกเลี่ยงการใช้ช่องว่างหรืออักขระที่ไม่ใช่ภาษาอังกฤษในเส้นทางไฟล์ที่เป็นที่ตั้งของโปรเจ็กต์นี้",
    "QYPc87A2j": "สร้าง",
    "QzssXokGC": "รับทราบ",
    "R1RzDLneG": "โครงการนี้ได้รับการคุ้มครองภายใต้สัญญาอนุญาตสาธารณะทั่วไปของ GNU โปรดดูไฟล์ใบอนุญาตสำหรับรายละเอียดเพิ่มเติม",
    "RV6qQL8ox": "เปิดตัวบริการ Go (การปรับโครงสร้างใหม่)",
    "RXAzQfM2L": "รองรับแพลตฟอร์มเต็มรูปแบบ (รวมถึง ARMv8)",
    "SSjHemio0": "ดูตัวอย่าง LafTools เวอร์ชัน Insider",
    "U6zkVUPTq": "หากคำตอบข้างต้นคือใช่ คุณควรลองใช้กล่องเครื่องมือของเรา มันมีคุณสมบัติดังต่อไปนี้:",
    "Wyi852ml4": "คำถามที่พบบ่อย",
    "XHqxsRy9v": "รันโปรเซสเซอร์ CSS บนเทอร์มินัล 2",
    "Y-TXjTruC": "หน้านี้สร้างขึ้นจาก LafTools ภายใน",
    "YCteaVxTx": "ติดตั้ง deps โครงการ",
    "Yay3_x9EV": "ในการแก้ไขข้อบกพร่องของบริการ Go เราได้กำหนดค่าไว้ใน VSCode คุณสามารถทำตามขั้นตอนด้านล่าง:",
    "YqgCZdzaS": "คุณเคยพบปัญหาด้านล่างขณะใช้เครื่องมือออนไลน์เหล่านั้นหรือไม่",
    "ZdiGcIi8j": "โดยเฉพาะผลการดำเนินงานของ **",
    "b3c7e3r77": "หวังว่า LafTools จะทำให้งานประจำวันของคุณง่ายขึ้น ลดความจำเป็นในการทำงานล่วงเวลา และช่วยให้คุณรักษาสมดุลระหว่างชีวิตและการทำงานที่ดี ให้เราละทิ้งชีวิตกันเถอะ!",
    "bIE-DVqmU": "LafTools ยังอยู่ระหว่างการพัฒนา UI การขึ้นต่อกัน หรือข้อกำหนดเบื้องต้นอาจเปลี่ยนแปลงได้ตามความจำเป็น",
    "ciP9qXH1I": "แท้จริงแล้ว เครื่องมือส่วนใหญ่ที่เราจัดเตรียมให้นั้นหาได้ง่ายบนอินเทอร์เน็ต เช่น โคเดก ฟอร์แมตเตอร์ การแปล รหัส QR ฯลฯ อย่างไรก็ตาม การใช้เครื่องมือเหล่านี้ไม่สะดวกสบายและมีประสิทธิภาพที่สุด",
    "dcOe3EU4U": "เพื่อความเรียบง่าย สมมติว่าคุณได้โคลนพื้นที่เก็บข้อมูลนี้ไปที่ `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` บน Windows หรือ `/Users/jerry/projects/laftools-repo` บน Linux/MacOS คุณควรประกาศ env และตั้งค่าการกำหนดค่าด้านล่างในไฟล์ของคุณ **~/.bashrc** หรือเพียงแค่ดำเนินการก่อนที่จะรันคำสั่งใดๆ",
    "dwWA-7VQ3": "เดี๋ยวก่อน จริงๆ แล้วมีทางเลือกอื่นแทนการจ่ายบิล",
    "eI8YT-N_a": "เราขอขอบคุณศิลปินที่มีพรสวรรค์ที่ให้ไอคอนที่สวยงามด้านล่าง:",
    "eNQDoICED": "ตัวอย่าง",
    "fp-FSQcA-": "รันงานพิเศษบนเทอร์มินัล 3",
    "hO_WdaThV": "โปรดทราบว่าคุณสามารถใช้สัญลักษณ์ '&' สำหรับการดำเนินการในเบื้องหลังได้ หากคุณไม่ต้องการเรียกใช้คำสั่งเหล่านี้ในอินสแตนซ์เทอร์มินัลที่แยกจากกัน",
    "i2fk8l8pB": "ด้านล่างนี้เป็นเอกสารเพิ่มเติมที่คุณสามารถดูได้หากต้องการเรียนรู้รายละเอียดเพิ่มเติมเกี่ยวกับโครงการนี้:",
    "iIq02l4vX": "คุณอาจสงสัยว่าเหตุใดเราจึงมุ่งมั่นที่จะพัฒนากล่องเครื่องมือนี้เนื่องจากมีเครื่องมือมากมายที่สามารถใช้งานบนอินเทอร์เน็ตได้",
    "iQxHIHZIL": "ไม่มีธีม Global Dark",
    "iz4ROzL3": "บูรณาการอย่างสูงกับ UI ที่มีประสิทธิผล",
    "leVsK": "นี่คือโครงการ {0} ฉันชอบ {1}",
    "lmVW9z9oh": "ตั้งค่าสภาพแวดล้อมระบบ",
    "lzYX0DiPc": "2 กุมภาพันธ์ 2023",
    "m3wnIDvAF": "แรงบันดาลใจ",
    "mfVQaqTiZ": "เริ่มการพัฒนา",
    "mpQMZfbv6": "โฆษณาที่ทำให้เสียอารมณ์",
    "oM2NCFSQ1": "โครงการนี้คงเป็นไปไม่ได้หากไม่มีโครงการโอเพ่นซอร์สที่ยอดเยี่ยม ซึ่งฉันอยากจะแสดงความขอบคุณอย่างสุดซึ้งเป็นการส่วนตัวต่อ:",
    "rR22PTMZc": "ปัญหาการรั่วไหลของข้อมูล",
    "sR8yc": "ปิด",
    "t5DDvnfna": "โปรเจ็กต์นี้ได้รับแรงบันดาลใจมาจากนักดนตรีดังต่อไปนี้:",
    "tYuR4PCbV": "แม้ว่าเรามุ่งมั่นที่จะให้บริการมากที่สุดเท่าที่จะเป็นไปได้ฟรี แต่คุณสมบัติบางอย่างจำเป็นต้องชำระเงิน เนื่องจากเราต้องเสียค่าใช้จ่ายสำหรับเซิร์ฟเวอร์ การบำรุงรักษา และการดำเนินการอื่นๆ ที่จำเป็นต่อการให้บริการของเราทำงานได้อย่างราบรื่นและเชื่อถือได้ ด้วยการเรียกเก็บค่าบริการระดับพรีเมียม เราสามารถครอบคลุมค่าใช้จ่ายเหล่านี้และนำเสนอบริการคุณภาพสูงและยั่งยืนต่อไปได้ ขอขอบคุณสำหรับความเข้าใจและการสนับสนุนของคุณ",
    "uavuXKo4x": "สำหรับนักพัฒนาชาวจีน",
    "uh8JUYWzH": "ติดตั้งไลบรารีส่วนกลางที่จำเป็น",
    "vWi9Y_HJ6": "แน่นอนว่ายังมีโครงการโอเพ่นซอร์สอื่น ๆ ที่เป็นประโยชน์และสนับสนุนโครงการนี้ ซึ่งฉันไม่สามารถให้รายละเอียดได้ในส่วนนี้ หากไม่มีโครงการเหล่านี้และความพยายามของนักพัฒนาที่มีความสามารถเหล่านี้ LafTools คงเป็นไปไม่ได้",
    "vn8G5weVs": "เป็นเลขมหัศจรรย์ที่ประกอบด้วย 3 + 98 + 99",
    "w5PSqC7jG": "ประสิทธิภาพของเครือข่ายแย่",
    "wWRCQygDC": "ป้อน {0}",
    "wieewa7cq": "วัสดุอื่นๆ",
    "yVPMfvWhi": "ตัวช่วยพิเศษ เช่น บันทึกย่อ คู่มือ ฯลฯ..."
}