{
    "4BZFkrKZz": "กล่องเครื่องมืออเนกประสงค์เจเนอเรชันถัดไปที่ออกแบบมาสำหรับโปรแกรมเมอร์",
    "4hth-woPf": "รองรับ GPT เต็มรูปแบบ",
    "5B9rXHCzi": "ล่าสุด เรากำลังปรับโครงสร้างสถาปัตยกรรมของ LafTools ใหม่โดยใช้ next.js ขั้นตอนด้านล่างอาจมีการเปลี่ยนแปลงตามความจำเป็น",
    "71DMQ0cOr": "การปรับโครงสร้างใหม่",
    "AKCG4Sy8U": "ไม่มีการเข้าถึงแบบออฟไลน์",
    "AOKa_f9CC": "เริ่มต้นใช้งาน",
    "Ed4z058Cr": "ฟอสส์ตลอดไป",
    "HIAvRJazO": "มี Docker Images และ Portable Edition",
    "Jh-LM4MG": "รันไทม์น้ำหนักเบา",
    "JjpQy-eIq": "การแนะนำ",
    "KFg*5OvU*": "หากต้องการเรียกใช้บริการ Go ในเทอร์มินัล คุณสามารถดำเนินการคำสั่งด้านล่าง:",
    "LM-o4Yk6h": "ไม่มีสไตล์ UI ที่มีประสิทธิผล",
    "OjKP47hFt": "ดูตัวอย่าง",
    "PLhTRM7EV": "หากคุณใช้ Windows OS โปรดตรวจสอบให้แน่ใจว่าคำสั่งทั้งหมดดำเนินการใน git-bash เรียนรู้เพิ่มเติม โปรดดูที่ [CONTRIBUTION](./docs/CONTRIBUTION.md) นอกจากนี้ ขอแนะนำให้หลีกเลี่ยงการใช้ช่องว่างหรืออักขระที่ไม่ใช่ภาษาอังกฤษในเส้นทางไฟล์ที่เป็นที่ตั้งของโปรเจ็กต์นี้",
    "RV6qQL8ox": "เปิดตัวบริการ Go (การปรับโครงสร้างใหม่)",
    "RXAzQfM2L": "รองรับแพลตฟอร์มเต็มรูปแบบ (รวมถึง ARMv8)",
    "SSjHemio0": "ดูตัวอย่าง LafTools เวอร์ชัน Insider",
    "U6zkVUPTq": "หากคำตอบข้างต้นคือใช่ คุณควรลองใช้กล่องเครื่องมือของเรา มันมีคุณสมบัติดังต่อไปนี้:",
    "Yay3_x9EV": "ในการแก้ไขข้อบกพร่องของบริการ Go เราได้กำหนดค่าไว้ใน VSCode คุณสามารถทำตามขั้นตอนด้านล่าง:",
    "YqgCZdzaS": "คุณเคยพบปัญหาด้านล่างขณะใช้เครื่องมือออนไลน์เหล่านั้นหรือไม่",
    "bIE-DVqmU": "LafTools ยังอยู่ระหว่างการพัฒนา UI การขึ้นต่อกัน หรือข้อกำหนดเบื้องต้นอาจเปลี่ยนแปลงได้ตามความจำเป็น",
    "ciP9qXH1I": "แท้จริงแล้ว เครื่องมือส่วนใหญ่ที่เราจัดเตรียมให้นั้นหาได้ง่ายบนอินเทอร์เน็ต เช่น โคเดก ฟอร์แมตเตอร์ การแปล รหัส QR ฯลฯ อย่างไรก็ตาม การใช้เครื่องมือเหล่านี้ไม่สะดวกสบายและมีประสิทธิภาพที่สุด",
    "dcOe3EU4U": "เพื่อความเรียบง่าย สมมติว่าคุณได้โคลนพื้นที่เก็บข้อมูลนี้ไปที่ `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` บน Windows หรือ `/Users/jerry/projects/laftools-repo` บน Linux/MacOS คุณควรประกาศ env และตั้งค่าการกำหนดค่าด้านล่างในไฟล์ของคุณ **~/.bashrc** หรือเพียงแค่ดำเนินการก่อนที่จะรันคำสั่งใดๆ",
    "iIq02l4vX": "คุณอาจสงสัยว่าเหตุใดเราจึงมุ่งมั่นที่จะพัฒนากล่องเครื่องมือนี้เนื่องจากมีเครื่องมือมากมายที่สามารถใช้งานบนอินเทอร์เน็ตได้",
    "iQxHIHZIL": "ไม่มีธีม Global Dark",
    "iz4ROzL3": "บูรณาการอย่างสูงกับ UI ที่มีประสิทธิผล",
    "k-s63C6zr": "ดูตัวอย่าง",
    "lmVW9z9oh": "ตั้งค่าสภาพแวดล้อมระบบ",
    "mpQMZfbv6": "โฆษณาที่ทำให้เสียอารมณ์",
    "rR22PTMZc": "ปัญหาการรั่วไหลของข้อมูล",
    "w5PSqC7jG": "ประสิทธิภาพของเครือข่ายแย่",
    "yVPMfvWhi": "ตัวช่วยพิเศษ เช่น บันทึกย่อ คู่มือ ฯลฯ..."
}