{
    "-n\\_-_sIlP": "Có, đây là phần mềm nguồn mở và bạn có thể sử dụng nó theo các điều khoản của giấy phép. Tuy nhiên, xin lưu ý rằng nguồn mở không nhất thiết có nghĩa là nó hoàn toàn miễn phí. Mặc dù hầu hết các công cụ đều có thể được sử dụng miễn phí nhưng một số công cụ có thể phải chịu phí liên quan đến việc sử dụng API và chi phí máy chủ.",
    "0Guf1oGfh": "Nó chỉ dành cho Windows, nó sẽ đóng tất cả các thiết bị đầu cuối và các quy trình trước đó.",
    "3cXzYtfK": "Tên của dự án này được lấy cảm hứng từ {0}, một bài hát đồng quê cổ điển từ năm 1987 của Chet Atkins cũng có một vị trí đặc biệt trong trái tim tác giả.",
    "4BZFkrKZz": "Thế hệ tiếp theo của hộp công cụ đa năng được thiết kế dành cho lập trình viên",
    "4hth-woPf": "Hỗ trợ đầy đủ tương tự GPT",
    "5B9rXHCzi": "Gần đây, chúng tôi đang tái cấu trúc kiến ​​trúc của LafTools dựa trên next.js, các bước bên dưới có thể thay đổi nếu cần.",
    "65xgSMWmS": "SỰ ĐÓNG GÓP",
    "6yjO-9dyy": "Tại sao cổng mặc định là 39899",
    "71DMQ0cOr": "Tái cấu trúc",
    "8Yv_neS0T": "chạy dịch vụ web trên terminal 1",
    "AKCG4Sy8U": "Không có khả năng truy cập ngoại tuyến.",
    "AOKa_f9CC": "Bắt đầu",
    "Ed4z058Cr": "FOSS mãi mãi",
    "Fuacz5atn": "Khởi chạy Mô-đun FrontEnd (Đã chuyển sang web2)",
    "GRsw21x8A": "Là một lập trình viên chuyên nghiệp, bạn có thể đóng góp cho dự án này và tạo một yêu cầu kéo cho dự án này, sau đó bạn có thể nhận được tư cách thành viên cao cấp miễn phí trong ba tháng.",
    "Gez25D19n": "Xem trước",
    "HIAvRJazO": "Hình ảnh Docker có sẵn và phiên bản di động",
    "I-Zaii3HZ": "Có chuyện gì với cái tên vậy?",
    "Jh-LM4MG": "Thời gian chạy nhẹ",
    "JjpQy-eIq": "Giới thiệu",
    "JseUpWpV6": "Nhưng với tư cách là tác giả của LafTools, tôi không muốn kể câu chuyện vào lúc này, haha.",
    "KFgTmafOWE4U": "Để chạy dịch vụ Go trong terminal, bạn có thể thực hiện lệnh bên dưới:",
    "LM-o4Yk6h": "Không có phong cách giao diện người dùng hiệu quả.",
    "O3eQBXxwY": "Khi dịch vụ Go đang chạy, bạn sẽ có thể thấy một liên kết được in ra trong thiết bị đầu cuối. Bây giờ, hãy sao chép URL này và dán vào trình duyệt của bạn để bắt đầu phát triển, bắt đầu nào!",
    "OjKP47hFt": "Xem trước",
    "PLhTRM7EV": "Nếu bạn đang sử dụng HĐH Windows, vui lòng đảm bảo rằng tất cả các lệnh được thực thi trong git-bash, tìm hiểu thêm vui lòng tham khảo [ĐÓNG GÓP](./docs/CONTRIBUTION.md). Ngoài ra, bạn nên tránh sử dụng bất kỳ khoảng trắng hoặc ký tự không phải tiếng Anh nào trong đường dẫn tệp chứa dự án này.",
    "QYPc87A2j": "Xây dựng",
    "QzssXokGC": "Sự nhìn nhận",
    "R1RzDLneG": "Dự án này được bảo vệ theo Giấy phép Công cộng GNU Affero, vui lòng xem tệp GIẤY PHÉP để biết thêm chi tiết.",
    "RV6qQL8ox": "Khởi chạy dịch vụ Go (Tái cấu trúc)",
    "RXAzQfM2L": "Hỗ trợ nền tảng đầy đủ (bao gồm ARMv8)",
    "SSjHemio0": "Xem trước phiên bản nội bộ của LafTools",
    "U6zkVUPTq": "Nếu câu trả lời cho bất kỳ câu hỏi nào ở trên là có thì bạn nên cân nhắc dùng thử hộp công cụ của chúng tôi. Nó cung cấp các tính năng sau:",
    "Wyi852ml4": "Câu hỏi thường gặp",
    "XHqxsRy9v": "chạy bộ xử lý CSS trên thiết bị đầu cuối 2",
    "Y-TXjTruC": "Trang này được tạo từ nội bộ LafTools.",
    "YCteaVxTx": "cài đặt dự án",
    "Yay3_x9EV": "Để gỡ lỗi dịch vụ Go, chúng tôi đã định cấu hình nó trong VSCode, bạn chỉ cần làm theo các bước dưới đây:",
    "YqgCZdzaS": "Bạn đã bao giờ gặp phải những vấn đề dưới đây khi sử dụng những công cụ trực tuyến đó chưa?",
    "ZdiGcIi8j": "Cụ thể, hiệu suất của **",
    "b3c7e3r77": "Hy vọng rằng LafTools sẽ giúp công việc hàng ngày của bạn trở nên dễ dàng hơn, giảm nhu cầu làm thêm giờ và giúp bạn duy trì sự cân bằng lành mạnh giữa công việc và cuộc sống, chúng ta hãy cùng tận hưởng cuộc sống!",
    "bIE-DVqmU": "LafTools vẫn đang được phát triển, giao diện người dùng, các phần phụ thuộc hoặc điều kiện tiên quyết của nó có thể thay đổi khi cần thiết.",
    "ciP9qXH1I": "Thật vậy, hầu hết các công cụ chúng tôi cung cấp đều có thể dễ dàng tìm thấy trên Internet, chẳng hạn như codec, bộ định dạng, dịch thuật, Mã QR, v.v… Tuy nhiên, đây không phải là cách tiếp cận thoải mái và hiệu quả nhất để sử dụng những công cụ này.",
    "dcOe3EU4U": "Để đơn giản, giả sử bạn đã sao chép kho lưu trữ này vào `C:\\\\Users\\jerry\\\\project\\\\laftools-repo` trên Windows hoặc `/Users/jerry/projects/laftools-repo` trên Linux/MacOS, thì bạn nên khai báo env và đặt cấu hình bên dưới trong tệp của mình **~/.bashrc** hoặc chỉ cần thực thi chúng trước khi chạy bất kỳ lệnh nào.",
    "dwWA-7VQ3": "Đợi đã, thực ra có một lựa chọn khác thay vì chỉ thanh toán hóa đơn.",
    "eI8YT-N_a": "Chúng tôi đánh giá cao những nghệ sĩ tài năng đã cung cấp các biểu tượng đẹp dưới đây:",
    "eNQDoICED": "Ví dụ",
    "fp-FSQcA-": "chạy thêm công việc trên terminal 3",
    "hO_WdaThV": "Lưu ý rằng bạn có thể sử dụng biểu tượng '&' để thực thi ở chế độ nền nếu bạn không muốn chạy các lệnh này trong các phiên bản đầu cuối riêng biệt.",
    "i2fk8l8pB": "Dưới đây là các tài liệu khác mà bạn có thể xem nếu muốn tìm hiểu thêm chi tiết về dự án này:",
    "iIq02l4vX": "Bạn có thể thắc mắc tại sao chúng tôi quyết tâm phát triển hộp công cụ này vì có rất nhiều công cụ có thể được sử dụng trên Internet.",
    "iQxHIHZIL": "Không có chủ đề tối toàn cầu.",
    "iz4ROzL3": "Tích hợp cao với giao diện người dùng hiệu quả",
    "leVsK": "Đây là dự án {0}, tôi thích {1}",
    "lmVW9z9oh": "Thiết lập môi trường hệ thống",
    "lzYX0DiPc": "Ngày 2 tháng 2 năm 2023",
    "m3wnIDvAF": "Cảm hứng",
    "mfVQaqTiZ": "Bắt đầu phát triển",
    "mpQMZfbv6": "Quảng cáo gây khó chịu.",
    "oM2NCFSQ1": "Dự án này sẽ không thể thực hiện được nếu không có các dự án nguồn mở tuyệt vời mà cá nhân tôi muốn bày tỏ lòng biết ơn sâu sắc nhất tới:",
    "rR22PTMZc": "Vấn đề rò rỉ dữ liệu.",
    "sR8yc": "Đóng",
    "t5DDvnfna": "Dự án này chủ yếu được lấy cảm hứng từ các nhạc sĩ sau:",
    "tYuR4PCbV": "Mặc dù chúng tôi cố gắng cung cấp miễn phí nhiều dịch vụ nhất có thể nhưng một số tính năng vẫn yêu cầu thanh toán. Điều này là do chúng tôi phải chịu chi phí cho máy chủ, bảo trì và các khía cạnh vận hành khác cần thiết để giữ cho dịch vụ của chúng tôi hoạt động trơn tru và đáng tin cậy. Bằng cách tính phí các dịch vụ cao cấp, chúng tôi có thể trang trải các chi phí này và tiếp tục cung cấp các dịch vụ bền vững, chất lượng cao. Chúng tôi đánh giá cao sự hiểu biết và hỗ trợ của bạn.",
    "uavuXKo4x": "Dành cho nhà phát triển Trung Quốc",
    "uh8JUYWzH": "cài đặt thư viện toàn cầu cần thiết",
    "vWi9Y_HJ6": "Chắc chắn, có những dự án nguồn mở khác đã mang lại lợi ích và tạo điều kiện thuận lợi cho dự án này, điều mà tôi không thể trình bày chi tiết trong phần này; Nếu không có những dự án này và nỗ lực của những nhà phát triển tài năng này, LafTools sẽ không thể tồn tại được.",
    "vn8G5weVs": "Đó là một con số kỳ diệu bao gồm 3 + 98 + 99.",
    "w5PSqC7jG": "Hiệu suất mạng kém.",
    "wWRCQygDC": "Nhập {0}",
    "wieewa7cq": "Vật liệu khác",
    "yVPMfvWhi": "Những trợ giúp bổ sung như ghi chú, hướng dẫn sử dụng, v.v..."
}